{
  "id": "arxiv_2502.21145v1",
  "text": "arXiv:2502.21145v1  [quant-ph]  28 Feb 2025\nHidden sl(2)−Symmetry of the Generalized Landau-Zener Vibronic\nModel\nL. M. Nieto1∗and S. Zarrinkamar1,2†\n1 Departamento de Física Teórica, Atómica y Óptica, and Laboratory for Disruptive Interdisciplinary\nScience (LaDIS), Universidad de Valladolid, 47011 Valladolid, Spain\n2 Departament of Basic Sciences, Garmsar Branch, Islamic Azad University, Garmsar, Iran\nMarch 3, 2025\nAbstract\nThe one-dimensional harmonic vibronic model, which is a generalization of the so-called linear\nLandau-Zener model and appears in the form of coupled Schrödinger equations, is revisited. After\ndecoupling the components, the resulting fourth-order equation is shown to have a hidden sl(2) al-\ngebra. The so-called exceptional part of the spectrum is then expressed in a rather simple way. For\ncompleteness, the eigenfunctions are obtained via the Bethe ansatz approach directly in position space.\nKeywords: Vibronic model, two-level system, exceptional energy, fourth-order diﬀerential equation,\nhidden sl(2) symmetry.\n1\nIntroduction\nThe tem vibronic, which is a combination of the words vibrational and electronic terms, includes spin\nand nuclear Hamiltonians as well as their interaction [1–6]. Vibronic models are present in many areas\nof physics and their interface with modern technologies, including quantum computing [7], quantum\noptics [8], quantum cellular automata [9], molecular dimers [10], chemical physics [11], Rydberg atoms [12],\nmolecule magnets [13], and quantum advantage [14].\nHowever, from the point of view of mathematical physics, this is a diﬃcult problem that cannot\nbe solved simply analytically, even in apparently simple cases.\nThis is because we have a system of\ncoupled spinor components. In particular, for the simple case of a one-dimensional problem in Cartesian\ncoordinates, which will be considered in the next section, the problem appears in the form of a fourth-\norder diﬀerential equation in position space. The classiﬁcation of fourth-order linear diﬀerential equations\nwith variable coeﬃcients, which may appear in quantum physics, is something that goes beyond the scope\nof this article and requires a rather exhaustive analysis. However, in summary, we can say that these\nproblems have not been considered in depth in the analytical ﬁeld due to the large number of technical\nproblems they present.\nIn this work we aim to use the powerful tool of Lie symmetries to partially address this problem. The\nmain thrust of our work comes from the novel idea of Zhang [15–17], which extends to the fourth-order\n∗luismiguel.nieto.calzada@uva.es, ORCID: 0000-0002-2849-2647\n†saber.zarrinkamar@uva.es, ORCID: 0000-0001-9128-4624\n1\n\n\ncase the standard idea of quasi-exact solvability in a class of second-order diﬀerential equations, originally\nproposed in the works of Turbiner, Ushveridze, Kamran, Gonzalez-Lopez and Olver [18–22].\nThe structure of the present work is as follows. In Section 2 we ﬁrst review the main equation of\nthe one-dimensional vibronic model which contains the harmonic oscillator plus a linear interaction [4]\nand which can be considered as a generalized Landau-Zener problem. Then, using some transformations,\nthe problem becomes a fourth-order diﬀerential equation after decoupling the components. In Section 3\nwe then review, in a fairly compact manner, the main idea of quasi-exact solvability for the unfamiliar\nreader and for the sake of continuity. It is then shown that the problem has a hidden structure by which\nthe exceptional part of the exceptional energy can be derived in a simple, conceptually brief manner and\nwithout lengthy calculations. In Section 4 we also derive the eigenfunctions of the problem using the\nBethe ansatz approach. The paper ends in Section 5 with ﬁnal comments and possible ideas for future\nresearch.\n2\nVibronic model\nIn their pioneering work [1] Fulton and Gouterman proved that the vibronic coupling in molecules and\nthe exciton coupling of dimers can be included in a 2 × 2 matrix Hamiltonian in the nuclear coordinates.\nThey started from the Hamiltonian\nbH = Tn + Te + V (q, Q),\n(1)\nwhere, as the indices indicate, Tn and Te represent the nuclear and electronic kinetic energy, respectively,\nand V (q, Q) stands for the potential energy which depends on the electronic and nuclear coordinates\nrespectively denoted by q and Q. In (1), some simpliﬁcations have been made including neglecting the\nuniform motion of the center of mass and the rotation of the molecule. It is also obvious that a spin-\ndependent term is not included. Working on the basis of the adiabatic approximation, the equations in a\ntwo-state linear curve crossing model appear in the form (see [1] for a detailed derivation)\n−ℏ2\n2m\nd2ψ1\ndx2 +\n\u0000V11(x) −E\n\u0001\nψ1 = −V12(x)ψ2,\n−ℏ2\n2m\nd2ψ2\ndx2 +\n\u0000V22(x) −E\n\u0001\nψ2 = −V21(x)ψ1,\n(2)\nwhere m is the particle mass, the coordinate x is deﬁned in the full line, E stands for the energy, and\nψ1 and ψ2 are the two components of the wave function. Here, we consider the frequently used model\nwhere the two diagonal components are considered to be linear plus harmonic, and the oﬀ-diagonal ones\nare considered to be constants (denoted below by V ). Therefore, we start from the main equations [4–6]\n−ℏ2\n2m\nd2ψ1\ndx2 +\n \nmΩ2x2\n2\n−F1x\n!\nψ1 + V ψ2 = Eψ1,\n−ℏ2\n2m\nd2ψ2\ndx2 +\n \nmΩ2x2\n2\n−F2x\n!\nψ2 + V ψ1 = Eψ2.\n(3)\n2\n\n\nThe latter, via x = X +\nF2\nmΩ2 , is rewritten as\n−ℏ2\n2m\nd2ψ1\ndX2 +\n \nmΩ2\n2\nX2 + (F2 −F1)X\n!\nψ1 + V ψ2 =\n \nE −\nF 2\n2\n2mΩ2 + F1F2\nmΩ2\n!\nψ1,\n−ℏ2\n2m\nd2ψ2\ndX2 +\n \nmΩ2\n2\nX2\n!\nψ2 + V ψ1 =\n \nE +\nF 2\n2\n2mΩ2\n!\nψ2.\n(4)\nApplying the change of variable\nX =\n\u0012 ℏ\nmΩ\n\u00131/2\nz,\n(5)\nthe two equations (4) become\n−1\n2\nd2ψ1\ndz2 +\n \n1\n2z2 + (F2 −F1)\n\u0012\n1\nℏmΩ3\n\u00131/2\nz\n!\nψ1 + V\nℏΩψ2 = 1\nℏΩ\n \nE −\nF 2\n2\n2mΩ2 + F1F2\nmΩ2\n!\nψ1,\n−1\n2\nd2ψ2\ndz2 + 1\n2z2ψ2 + V\nℏΩψ1 = 1\nℏΩ\n \nE +\nF 2\n2\n2mΩ2\n!\nψ2.\n(6)\nUsing the tranformations\nψ1,2(z) = e−z2/2 y1,2(z),\n(7)\nthe two equations (6) take the form\n1\n2\nd2y1\ndz2 −z dy1\ndz −V\nℏΩy2 +\n\n(F2 −F1)\n\u0012\n1\nℏmΩ3\n\u00131/2\nz + 1\nℏΩ\n \nE −\nF 2\n2\n2mΩ2 + F1F2\nmΩ2\n!\n−1\n2\n\ny1 = 0,\n1\n2\nd2y2\ndz2 −z dy2\ndz −V\nℏΩy1 +\n\n1\nℏΩ\n \nE +\nF 2\n2\n2mΩ2\n!\n−1\n2\n\ny2 = 0.\n(8)\nWe can decouple these two equations by solving for y2 in the ﬁrst one and replacing it in the second, so\nthat we arrive at\nbH4 y1 = 1\n4\nd4y1\ndz4 −z d3y1\ndz3 +\n\"\nz2 + F\n2 z +\n\u0012E1\n2 + E2\n2 −1\n\u0013#\nd2y1\ndz2\n+\nh\n−Fz2 + z(1 −E2 −E1)\ni dy1\ndz +\nh\nFE2z + (E1E2 −v2)\ni\ny1 = 0,\n(9)\nwhere the explicit form of the fourth-order diﬀerential operator bH4, which can be considered a kind of\n“Hamiltonian” for this problem, is clear, and where we have used the abbreviations\nF = (F2 −F1)\n\u0012\n1\nℏmΩ3\n\u00131/2\n,\nE1 = 1\nℏΩ\n \nE −\nF 2\n2\n2mΩ2 + F1F2\nmΩ2\n!\n−1\n2,\nE2 = 1\nℏΩ\n \nE +\nF 2\n2\n2mΩ2\n!\n−1\n2,\nv = V\nℏΩ.\n(10)\n3\n\n\nEq. (9) is an ordinary fourth-order diﬀerential equation with variable coeﬃcients. To our best knowledge,\nthis equation has not been reported as a generalized special function of mathematical physics, nor has\nbeen recognized as a named equation. It should be noted that papers on fourth-order diﬀerential equations\nin physics are really scarce, although there are important cases of such forms. One might think that the\nproblem can be solved simply by numerical techniques, but no one can deny the merits of analytical tech-\nniques, including their deep insight into the physics of the system as well as their pedagogical importance.\nWe can comment on the need for analytical approaches for a variety of other reasons, but this is beyond\nthe scope of the present paper and we hope to return to it in a subsequent study.\n3\nThe hidden sl(2) symmetry and the spectrum\nTo obtain the energy spectrum of the system, let us ﬁrst review the basic idea of the Lie algebraic approach,\nor quasi-exact solvability, in a summarized manner. The term quasi-exact solvability comes from the fact\nthat only part of the spectrum, and not all states, can be derived in this way. Let us ﬁrst review the idea\nas it is used for second-order diﬀerential equations and then generalize it to the fourth-order case.\n3.1\nLie algebraic approach for second-order diﬀerential equations\nThe most general form of the second-order quasi-exactly solvable diﬀerential operator which can be ex-\npressed as an sl(2) algebra is [18,19,21,22]\nbHQES = C++J+\nn J+\nn +C+0J+\nn J0\nn +C+−J+\nn J−\nn +C0−J0\nnJ−\nn +C−−J−\nn J−\nn +C+J+\nn +C0J0\nn +C−J−\nn +C, (11)\nin which\nJ+\nn = z2 d\ndz −n z,\nJ0\nn = z d\ndz −n\n2 ,\nJ−\nn = d\ndz ,\n(12)\nwhere the generators satisfy\n[J+\nn , J−\nn ] = −2J0\nn,\n[J±\nn , J0\nn] = ∓J±\nn .\n(13)\nAs a result, it can be shown that bHQES preserves the ﬁnite-dimensional space of polynomials of the form\nyn(z) =\nn\nX\nm=0\ncmzm.\n(14)\nUsing (12), the operator bHQES can be written as\nbHQES = P4(z) d2\ndz2 + P3(z) d\ndz + P2(z),\n(15)\nwith\nP4(z) =\n4\nX\nk=0\nakzk,\nP3(z) =\n3\nX\nk=0\nbkzk,\nP2(z) =\n2\nX\nk=0\nckzk,\n(16)\n4\n\n\nand more precisely\nP4(z) = C++z4 + C+0z3 + C+−z2 + C0−z + C−−,\nP3(z) = C++(2 −2n)z3 +\n \nC+ + C+0\n\u0012\n1 −3n\n2\n\u0013!\nz2 + (C0 −nC+−) z +\n\u0012\nC−−n\n2C0−\n\u0013\n,\nP2(z) = C++n(n −1)z2 +\n \nn2\n2 C+0 −nC+\n!\nz +\n\u0012\nC −n\n2C0\n\u0013\n.\n(17)\n3.2\nHidden sl(2) symmetry for fourth-order diﬀerential equations\nBased on the novel idea of Zhang [16,17], the problem has a hidden sl(2)-algebraization if and only if\nb3 = −2(n −1)a4,\nc2 = n(n −1)a4,\nc1 = −n\n\u0002\n(n −1)a3 + b2\n\u0003\n.\n(18)\nNow, following the identity [17]\nz d3\ndz3 = J0 \u0010\nJ−\u00112\n+ n\n2\nd2\ndz2 ,\n(19)\nthe “Hamiltonian” bH4 in (9) can be written in the form\nbH4 y1 =\n\u00141\n4(J−)4 −J0 \u0010\nJ−\u00112\u0015\ny1 +\n\"\nz2 + F\n2 z +\n\u0012\n−n\n2 + E1\n2 + E2\n2 −1\n\u0013#\nd2y1\ndz2\n+\nh\n−Fz2 + z (1 −E2 −E1)\ni dy1\ndz +\nh\nFE2z + (E1E2 −v2)\ni\ny1 = 0,\n(20)\nwhere we have intentionally kept the equivalent second order part of bH4 y1 in diﬀerential form to comment\non the hidden symmetry of the system. It is seen that the n-dependent term in (19) has aﬀected the second\norder part of the fourth-order diﬀerential equation. The energy relation from the third equation in (18),\ni.e. c1 = −n\n\u0002\n(n −1)a3 + b2\n\u0003\n= −nb2, is found as E2 = n, or, from (10), more explicitly in the form\n1\nℏΩ\n \nE +\nF 2\n2\n2mΩ2\n!\n−1\n2 = n.\n(21)\nTo make a comparison with [4], noting that in their notation\nb =\nF2\n(mℏΩ3)1/2 ,\nǫ = E\nℏΩ+ 1\n2,\n(22)\nEq. (21) can be written as\nE\nℏΩ+ 1\n2 = ǫ = (n + 1) −b2\n2 = k −b2\n2 ,\n(23)\nwhich is the same result obtained in [4] and possesses the familiar linear form of the harmonic oscillator\nin terms of the quantum number. Also, doing the shift transformation on the upper equation in (3), one\nmay obtain the other half of the quasi-exact spectrum with the same behavior of the other component.\n5\n\n\n4\nThe Bethe ansatz approach and eigenfunctions: a generalization to\nthe fourth-order case\nAlthough the main purpose of the present work was demonstrating the hidden sl(2)-symmetry of the\nvibronic model in its fourth-order form and directly in position space, by which the exceptional part of\nthe spectrum was reported, it is interesting to comment on the eigenfunctions as well. To this aim, we\nmake use of the Bethe ansatz method similar to what is done in [15,16]. The idea in a nutshell is that an\nansatz solution is proposed to the equation, and after manipulations, a meromorphic equation is obtained.\nBased on comparison of diﬀerent powers on both sides of the arising equation, required material to obtain\nthe spectrum and the eigenfunctions of the system is obtained. There are two main references which are\nstrongly recommended for the unfamiliar reader before starting this section. The ﬁrst is [15] in which\nthe idea is applied to second-order ordinary diﬀerential equations and the basic formalism is obtained.\nThe second is [16] which generalizes the primary idea to a fourth-order ordinary diﬀerential equation,\nthe two-photon and two-mode Rabi model in Bargmann space in this case. The generalization to the\nfourth-order case can be done, rather straightforwardly, using proper series identities and careful use of\nresidue calculus.\nLet us ﬁrst review the basic idea from [15] which works for Fuchsian-type equatios. If we propose a\nsolution of the form\ny(z) =\nn\nY\ni=1\n(z −zi),\nn = 1, 2, . . . ,\n(24)\nfor the second-order Hamiltonian (15), it can be found that [15]\n−c0 −\nn\nX\ni=1\nRes\n\" bHQES y\ny\n, z = zi\n#\n=\n\u0002\nn(n −1)a4 + nb3 + c2\n\u0003\nz2\n+\n\n\u00002(n −1)a4 + b3\n\u0001\nn\nX\ni=1\nzi + n(n −1)a3 + nb2 + c1\n\nz\n+\n\u00002(n −1)a4 + b3\n\u0001\nn\nX\ni=1\nz2\ni + 2a4\nn\nX\ni<j\nzizj +\n\u00002(n −1)a3 + b2\n\u0001\nn\nX\ni=1\nzi + n(n −1)a2 + nb1,\n(25)\nwhere Res[f(z), z = zi] indicates the residue of f(z) at z = zi. In fact, we have a constant term on the\nleft-hand side, and a meromorphic function on the right-hand side, from which the required data to report\nthe solution is provided. In more precise words, the residue term, which must be vanishing, gives the zi.\nThe coeﬃcients of z2 and z on the right-hand side normally determine the spectrum of the system and\nboth should vanish to assure that the equality holds. The remaining constant terms on both sides, can\nbe interpreted as a restriction among the parameters, which is the price ought to be paid to obtain an\nanalytical solution. Using [16], which has to be read to carefully to understand the details of calculations,\nthe idea is generalized to the fourth-order case.\nHaving reviewed the basic idea of the approach, we now propose a solution of the form (24) for y1(z)\n6\n\n\nin (9), which yields for the quotient\n1\ny1 bH4 y1:\n0 = E1E2 −v2 + 1\n4\nn\nX\ni=1\n1\nz −zi\nn\nX\np̸=l̸=j̸=i\n4\n(zi −zp)(zi −zl)(zi −zj) −z\nn\nX\ni=1\n1\nz −zi\nn\nX\nl̸=j̸=i\n3\n(zi −zl)(zi −zj)\n+\n\"\nz2 + F\n2 z +\n\u0012E1\n2 + E2\n2 −1\n\u0013#\nn\nX\ni=1\n1\nz −zi\nn\nX\nj̸=i\n2\n(zi −zj)\n+\nh\n−Fz2 + z (1 −E2 −E1)\ni\nn\nX\ni=1\n1\nz −zi\n+ FE2z.\n(26)\nFrom here we can easily evaluate the following residues\nRes\n\" bH4 y1\ny1\n, z = zi\n#\n= 1\n4\nn\nX\np̸=l̸=j̸=i\n4\n(zi −zp)(zi −zl)(zi −zj) −zi\nn\nX\nl̸=j̸=i\n3\n(zi −zl)(zi −zj)\n(27)\n+\n\"\nz2\ni + F\n2 zi +\n\u0012E1\n2 + E2\n2 −1\n\u0013#\nn\nX\nj̸=i\n2\n(zi −zj) +\nh\n−Fz2\ni + zi (1 −E2 −E1)\ni\n,\nwhich determines the zi in the ansatz proposed in (24). For example, for the ﬁrst state, i.e. zi = z1,\nwe have −Fz2\ni + zi (1 −E2 −E1) = 0 as all other terms vanish (here E1,2 are in fact linear functions\nof the exceptional energy En as indicated in (10) and thus vary for diﬀerent n). A systematic process\ncan be done for higher states. However, as can be seen, the higher the state, the more complicated the\ncalculations. Nevertheless, the approach is quite systematic and can be carried out.\nLet us now go back to the arising meromorphic equation (25). In fact, this equation can be used here\nin the fourth-order case recalling that the eﬀect of third- and fourth-order terms are already included in\nthe zi and the residue at each zi. As a result, we may conclude that in our case, i.e. for (9):\n• The ﬁrst term on the right-hand side of (25), i.e. the coeﬃcient of z2, yields nothing since a4 =\nb3 = c2 = 0 as follows by comparing (9) with (16).\n• The second term on the right-hand side of (25) gives nb2 + c1 = 0, i.e. the coeﬃcient of z, yields\nthe exceptional energy already obtained in (21). This is because a3 = 0 as follows by comparing (9)\nwith (16).\n• Taking into account that, comparing (9) with (16), we also get that a2 = 1, b1 = 1 −E2 −E1 and\nb2 = −F, the constant terms on both sides of of (25) yield\n−c0 = v2 −E1E2 = −F\nn\nX\ni=1\nzi + n(n −1) + n (1 −E2 −E1) ,\n(28)\nwhich can be considered as a restriction among the parameters. More explicit form of this restriction\ncan be easily obtained using the value of zi, from (27), and E1,2 from (10) and (21) for each\nlevel/state.\n7\n\n\n5\nConclusion\nA two-state vibronic model was considered in one spatial dimension with a harmonic plus linear interaction\nfor the diagonal scattering matrix element and constant terms for the oﬀ-diagonal ones. We worked directly\nin the position space instead of transforming the problem into other spaces or using integral transforms.\nIt was shown that the problem, via proper transformations and identities, has a hidden sl(2) symmetry\nwhich gives the exceptional part of the spectrum in a simple manner. This is of particular interest due\nto various complexities and challenges of the other approaches. In particular, the present problem, which\nof great importance from both research and pedagogical points of view, was solved by ﬁrst transforming\nthe equation into p−representation space and then working on the arising Heun-like equation in the\ntransformed space [4]. Here, however, the exceptional part of the spectrum was derived from quite basic\nideas of quasi-exactly solvable models and elements of group theory.\nAlthough the main purpose of this work was recognizing and introducing the hidden symmetry of the\nproblem, the eigenfunctions were also obtained via the Bethe ansatz approach in a systematic manner.\nThe latter has its own limitations and complexity and is certainly rather lengthy. Nevertheless, when\ncompared to the other parallel approaches, it might still look more economical.\nThe idea might be generalized to other classes of vibronic models, on which we are working. We hope\nthe present work renews the interest in the analytical structure of the other vibronic and two- and/or\nmulti-level models, which have not been extensively explored for many realistic terms mainly due to\ntheir higher-order structure. It is also an interesting survey to consider the idea in diﬀerent ﬁelds and in\nparticular within the so-called Generalized Uncertainty Principle (GUP) formalism where we have to deal\nwith higher-order wave equations, and in particular, the fourth and sixth order Schödinger equations for\na frequently used form of GUP originating from the interface of quantum physics and gravity. Work in\nthis direction is also in progress.\nAcknowledgements\nThis research was supported by the Q-CAYLE project, funded by the European Union-Next Generation\nUE/MICIU/Plan de Recuperacion, Transformacion y Resiliencia/Junta de Castilla y Leon (PRTRC17.11),\nand also by project PID2023-148409NB-I00, funded by MICIU/AEI/10.13039/501100011033. Financial\nsupport of the Department of Education of the Junta de Castilla y Leon and FEDER Funds is also\ngratefully acknowledged (Reference: CLU-2023-1-05).\nReferences\n[1] R. L. Fulton and M. Gouterman, Vibronic coupling. I. mathematical treatment for two electronic\nstates, J. Chem. Phys. 35 (1961) 1059.\n[2] A. F. Popkov, N. E. Kulagin and A. I. Mukhanova, Vibronic interactions and radiation absorption\nin the molecular nanocluster V15, Phys. Rev. B 72 (2005) 104410.\n[3] C. Zhu, H. Nakamura, N. Re, and V. Aquilanti, The two-state linear curve crossing problems revisited.\nI. analysis of Stokes phenomenon and expressions for scattering matrices, J. Chem. Phys. 97 (1992)\n1892.\n8\n\n\n[4] V. I. Osherov and V. G. Ushakov, The intersection of vibronic levels, J. Phys. A: Math. Theor. 42\n(2009) 285305.\n[5] V. I. Osherov and V. G. Ushakov, The Stokes multiplier for the Landau–Zener model, J. Phys. A:\nMath. Theor. 43 (2010) 145203.\n[6] S. P. Karkach, V. I. Osherov and V. G. Ushakov, Dynamic phase for the vibronic problem, J. Phys.\nA: Math. Theor. 45 (2012) 345302.\n[7] A. Aspuru-Guzik, A. D. Dutoi, P.J. Love, M. Head-Gordon, Simulated quantum computation of\nmolecular energies, Sci. 309 (2005) 1704.\n[8] J. Huh, G. G. Guerreschi, B.a Peropadre, J. R. McClean, and A. Aspuru-Guzik, Boson sampling for\nmolecular vibronic spectra, Nat. Photon. 9 (2015) 615.\n[9] B. Tsukerblat, A. Palii, J. M. Clemente-Juan, and E. Coronado, Mixed-valence molecular four-dot\nunit for quantum cellular automata: Vibronic self-trapping and cell-cell response, J. Chem. Phys.\n143 (2015) 134307.\n[10] A. Halpin, Two-dimensional spectroscopy of a molecular dimer unveils the eﬀects of vibronic coupling\non exciton coherences, Nat. Chem. 6 (2014) 196.\n[11] J. L. Paz, Stochastic optical Bloch equations in complex system with vibronic coupling: use of\nNovikov’s theorem, Chem. Phys. Lett. 760 (2020) 138000.\n[12] F. Hummel, P. Schmelcher and M. T. Eiles, Vibronic interactions in trilobite and butterﬂy Rydberg\nmolecules, Phys. Rev. Res. 5 (2023) 013114.\n[13] A. Mattioni, J. K. Staab, W. J. A. Blackmore, D. Reta, J. Iles-Smith, A. Nazir, and N. F. Chilton,\nVibronic eﬀects on the quantum tunnelling of magnetisation in Kramers single-molecule magnets,\nNat. Comm. 15 (2024) 485.\n[14] C. Oh, Y. Lim, Y.Wong, B. Feﬀerman, and L. Jiang, Quantum-inspired classical algorithms for\nmolecular vibronic spectra, Nat. Phys. 20 (2024) 225.\n[15] Y.-Z. Zhang, Exact polynomial solutions of second order diﬀerential equations and their applications,\nJ. Phys. A: Math. Theor. 45 (2012) 065206.\n[16] Y.-Z. Zhang, On the solvability of the quantum Rabi model and its 2-photon and two-mode general-\nizations, J. Math. Phys. 54 (2013) 102104.\n[17] Y.-Z. Zhang, Hidden sl(2)−algebraic structure in Rabi model and its 2-photon and two-mode gener-\nalizations, Ann. Phys. 375 (2016) 460.\n[18] A. V. Turbiner and A. G. Ushveridze, Spectral singularities and quasi-exactly solvable quantal prob-\nlem, Phys. Lett. A 126 (1987) 183.\n[19] A. Turbiner, Quasi-exactly-solvable problems and sl(2) algebra, Commun. Math. Phys. 118, (1988)\n467.\n9\n\n\n[20] N. Kamran and P. J. Olver, Lie algebras of diﬀerential operators and Lie-algebraic potentials, J.\nMath. Anal. Appl. 145 (1990) 342.\n[21] A. Gonzalez-Lopez, N. Kamran, and P. J. Olver, Quasi-exact solvability, Contemp. Math. 160, (1994)\n113.\n[22] A. V. Turbiner, One-dimensional quasi-exactly solvable Schrödinger equations, Phys. Rep. 642 (2016)\n1.\n10\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21145v1.pdf",
    "total_pages": 10,
    "title": "Hidden $sl(2)-$Symmetry of the Generalized Landau-Zener Vibronic Model",
    "authors": [
      "L. M. Nieto",
      "S. Zarrinkamar"
    ],
    "abstract": "The one-dimensional harmonic vibronic model, which is a generalization of the\nso-called linear Landau-Zener model and appears in the form of coupled\nSchr\\\"{o}dinger equations, is revisited. After decoupling the components, the\nresulting fourth-order equation is shown to have a hidden $sl(2)$ algebra. The\nso-called exceptional part of the spectrum is then expressed in a rather simple\nway. For completeness, the eigenfunctions are obtained via the Bethe ansatz\napproach directly in position space.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}