{
  "id": "arxiv_2502.21303v1",
  "text": "IEEE ROBOTICS AND AUTOMATION LETTERS. AUTHOR’S VERSION - DO NOT DISTRIBUTE. 10.1109/LRA.2025.3546079\nIEEE ROBOTICS AND AUTOMATION LETTERS. PREPRINT VERSION. ACCEPTED FEBRUARY, 2025\n1\nCurviTrack: Curvilinear Trajectory Tracking for High-speed Chase of\na USV\nParakh M. Gupta, Ondˇrej Proch´azka, Tiago Nascimento, Senior Member, IEEE, and Martin Saska Member, IEEE\nAbstract—Heterogeneous robot teams used in marine environ-\nments incur time-and-energy penalties when the marine vehicle\nhas to halt the mission to allow the autonomous aerial vehicle to\nland for recharging. In this paper, we present a solution for this\nproblem using a novel drag-aware model formulation which is\ncoupled with Model Predictive Control (MPC), and therefore,\nenables tracking and landing during high-speed curvilinear\ntrajectories of an Unmanned Surface Vehicle (USV) without any\ncommunication. Compared to the state-of-the-art, our approach\nyields 40 % decrease in prediction errors, and provides a 3-fold\nincrease in certainty of predictions. Consequently, this leads to a\n30 % improvement in tracking performance and 40 % higher\nsuccess in landing on a moving USV even during aggressive\nturns that are unfeasible for conventional marine missions. We\ntest our approach in two different real-world scenarios with\nmarine vessels of two different sizes and further solidify our\nresults through statistical analysis in simulation to demonstrate\nthe robustness of our method.\nIndex Terms—Aerial Systems: Mechanics and Control, UAV,\nMPC, Optimization and Optimal Control, Multi-Robot Systems,\nDynamics\nURL: https://mrs.fel.cvut.cz/curvitrack-boat-landing\nI. INTRODUCTION\nT\nHE increased demand for exploring, maintaining, and\nstudying the vast open-water habitats of our planet has\ncreated a pressing need for a cost-effective unmanned system\nthat can accomplish these tasks autonomously and efficiently.\nExploration requires a high vantage point and agility which\nare primary strengths of an Unmanned Aerial Vehicle (UAV),\nbut UAVs suffer from small payload capabilities and limited\nflight times. Conversely, USVs can carry higher payloads\nand conduct long-range missions due to their higher battery\ncapacity. They can also be equipped with more sensors for\nlocalisation, water and air sampling, and sea-floor mapping.\nTherefore, a heterogeneous team of aerial and marine vehicles\nManuscript received: October 9th, 2024; Revised January 7th, 2025; Ac-\ncepted February 15th, 2025.\nThis paper was recommended for publication by Editor Giuseppe Loianno\nupon evaluation of the Associate Editor and Reviewers’ comments.\nThis work has been supported by CTU grant no SGS23/177/OHK3/3T/13,\nby the Czech Science Foundation (GA ˇCR) under research project No. 23-\n06162M, by the Europen Union under the project Robotics and advanced\nindustrial production (reg. no. CZ.02.01.01/00/22 008/0004590), and by the\nNational Council for Scientific and Technological Development – CNPq from\nBrazil under research project No. 304551/2023-6 and 407334/2022-0.\nP. M. Gupta, O. Proch´azka, T. Nascimento, and M. Saska are with the De-\npartment of Cybernetics, Czech Technical University in Prague, Prague, Czech\nRepublic (e-mail: guptapar@fel.cvut.cz, see https://mrs.fel.cvut.cz/curvitrack-\nboat-landing)\nT. Nascimento is also with the Department of Computer Systems, Univer-\nsidade Federal da Para´ıba, Brazil\nDigital Object Identifier (DOI): see top of this page.\nFig. 1: A collage of various moments from the real-world\nexperiments.\ncan accomplish tasks pertaining to exploration, infrastructure\nmaintenance, port security, search-and-rescue, surveillance,\nand ocean cleanup with greater efficiency than each of the\nvehicles by itself. Murphy et al. [1] demonstrated how they\nused a UAV and a USV to assess structural damages caused\nby hurricane Wilma. Building on these insights, Lindemuth et\nal. [2] presented a UAV-USV team where the USV served as\nan interface between underwater and surface operations while\nthe UAV provided assistance through better localisation and by\nacting as a communication relay. As demonstrated by Ramirez\net al. [3], the UAV can also aid in open waters from its vantage\npoint by predicting the drift of a lost person using wind and sea\ncurrents, and by informing the USV so it can perform the final\nrescue. In these applications, current UAV designs are limited\nby their battery lives and hence, the capability to autonomously\nland and recharge on mobile platforms in marine environments\nemerges as a pivotal and essential technology for a seamless\nand completely autonomous operation.\nOne of the challenges during such a landing manoeuvre\nis that a tilted landing deck can result in the UAV rolling or\nsliding off the platform, which, in turn, can trigger unintended\nresponses from the controller of the UAV, and thus, lead to\ndisastrous consequences. Additionally, a vertically oscillating\ndeck can transfer significant impulse into the aircraft in case\nof vertical velocity mismatch and wreak havoc on its fuselage\nduring landing. Predicting such motion can alleviate these\nissues; Riola et al. [4] and K¨uchler et al. [5] demonstrated that\npast measurements of the periodic ship motion, resulting from\nwaves, can be used to forecast future behaviour with a fair de-\narXiv:2502.21303v1  [cs.RO]  28 Feb 2025\n\n\nIEEE ROBOTICS AND AUTOMATION LETTERS. AUTHOR’S VERSION - DO NOT DISTRIBUTE. 10.1109/LRA.2025.3546079\n2\nIEEE ROBOTICS AND AUTOMATION LETTERS. PREPRINT VERSION. ACCEPTED FEBRUARY, 2025\ngree of accuracy for short prediction horizons. Landing during\nthis wave-induced periodic motion was previously addressed\nin our work on landing a UAV in harsh winds and turbulent\nopen-waters [6]. However, as mentioned in [6], it was observed\nthat significant time was lost in the motion estimation, and\nthe USV had to be stationary for this duration instead of\nconducting the manoeuvres necessary for the completion of\nits mission. These missions usually require sweeping scans,\nin parallel track patterns [7], which requires constant turning\nof the USV; therefore, a landing solution limited to the scope\nof straight-line motion does not aid in the recovery of lost\nefficiency. Obtaining information about the USV is another\nchallenge in the open waters. Similarly to our previous work,\nour proposed approach is dedicated to constructing a versatile\ndecentralized solution independent of direct communication,\nas communication infrastructure in the open waters may not\nreliably fulfill the stringent localisation requirements such as\nhigh frame rates and low latency. Therefore, in this article,\nwe expand our previous work to focus on tracking and landing\nduring deliberate translational motion of the USV and propose\na new approach to predict the linear and curvilinear motion\nin x and y axis of the USV (figure 3) at high speeds; we\nrely on the prediction of periodic oscillation of the USV in\nz axis (heave) from our previous work [6] to ensure that the\ntouchdown velocity during landing is minimised, and the UAV\nlands with minimal impulse transfer.\nII. RELATED WORKS\nLanding on a slowly oscillating marine vessel has been a\nkeenly studied area of research in the recent past. One of the\npioneering efforts in this domain was undertaken by Polvara\net al. [8], who introduced a methodology employing a fiducial\nmarker positioned on the platform, and leveraged an Extended\nKalman Filter (EKF) to estimate the position of the USV.\nIn contrast, Abujoub et al. [9] adopted a different strategy\nby utilizing a Light Detection and Ranging (LiDAR) system\nonboard the UAV to ascertain the pose of the landing pad.\nSimilarly, Yang et al. [10] presented an approach for image-\nbased visual servoing (IBVS) tailored for a UAV aiming to\nexecute a successful landing onto a boat using a downward-\nfacing camera.\nHowever, fewer works are available that focus on landing\non a moving USV and the majority of these focus on straight-\nline paths for a general platform. Heriss´e et al. [11] presented\none of the first investigations for landing on a general moving\nplatform using optical flow to handle lateral velocities. How-\never, the authors do not consider any predictive model of the\nunderlying vehicle, and therefore, the success of the landing is\ncontingent on the constraints matching between the UAV and\nthe landing platform. Such an approach would be infeasible\nfor a rapidly turning USV. Cengiz et al. [12] present an\ninvestigation into the feasibility of implementing two optimal\ncontrol approaches to enable a quadrotor to autonomously\ntrack and follow a mobile platform, commencing from an\narbitrary initial position and ultimately executing a precision\nlanding on the said platform. The study demonstrated the\nsuperiority of the MPC but did not elaborate on the modelling\nof the USV. In contrast, Zhao et al. [13] proposed a visual\nservoing approach and validated their experiments using real\nrobots, but for a general moving target unlike a marine\nvessel, and without consideration of the model of the moving\nplatform. Falanga et al. [14] expanded the state-of-the-art by\nincreasing the velocity of the UAV up to 1.5 m s−1, but only in\nstraight lines and following a ground robot. The tracking speed\nrecord was presented in the work of Borowczyk et al. [15],\nwhere the authors successfully reached a speed of 13.8 m s−1\nin real-world experiments for straight-line motion and assumed\ncommunication between the two robots.\nThe work of Lee et al. [16] demonstrated a PID-based\napproach in a simulated environment that achieved high\ntracking speeds of up to 8 m s−1 in a straight line. Their\napproach does not consider the model of the platform and\ninstead relies on matching constraints between the UAV and\nthe landing platform. They also show S-curves of slow speed\nin simulation, but their real-world results are presented for\nslow linear motion. Baca et al. [17] presented one of the\nfirst modelling-based approaches with real-world experiments\nthat show the UAV landing on a moving ground vehicle\nfor a curved track without any communication. However, the\ntrajectory of the ground vehicle was known apriori, enabling\nthe authors to bias the predictions to the expected curved track.\nNov´ak et al. [18] presented the current state-of-the-art in\nmodelling and predicting the motion of a USV using a sophis-\nticated model that considers the hydrodynamic, hydro-static,\nand Coriolis forces acting on the USV. They also leverage\ncommunication between the vehicles to obtain information\nfrom the sensor stack onboard the USV to improve state-\nestimation of the UAV by localising in relation to the USV\nframe. This model is deployed inside an Unscented Kalman\nFilter (UKF), along with a simplified model deployed in a\nLinear Kalman Filter (LKF) for comparison, and both the\nmodels rely on multiple sensors and communicated states for\nstate estimation to obtain pose and velocities of the USV.\nHowever, the stated requirements of various states and their\nderivatives lead to poor convergence for challenging turns\nand curvilinear trajectories, especially when sufficient sen-\nsory information cannot be provided without communicating.\nProch´azka et al. [19] use the estimator presented in [18] to\ntrack and land on the marine vessel at low speeds through\ncurvilinear trajectories. However, after careful review, it was\nfound that none of the discussed approaches converge well\nfor high-speed curvilinear trajectories, and perform poorly\non communicated-denied scenarios due to model complexity.\nBoth of these drawbacks are detrimental in agile missions of\nclosely cooperating heterogeneous UAV-USV teams in real-\nworld conditions and are, therefore, the primary focus of our\npresented work in this paper. To this end, we propose a novel\ndecentralized modelling approach which converges reliably on\nlimited information from visual pose estimation, and predicts\nthe curvilinear motion of the USV for performing high-speed\ntracking and landing on the USV. Despite these drawbacks,\nwe found that [18] was most suited for the comparison and\ntherefore, we present a comparison through statistical analysis\nin simulation, and bolster our claims by testing our novel\napproach in several real-world scenarios. In summary, our\n\n\nIEEE ROBOTICS AND AUTOMATION LETTERS. AUTHOR’S VERSION - DO NOT DISTRIBUTE. 10.1109/LRA.2025.3546079\nGUPTA et al.: CURVITRACK: CURVILINEAR TRAJECTORY TRACKING FOR HIGH-SPEED CHASE OF A USV\n3\nMPC Solver\nFast Fourier\nTransform\nUSV\nMotion Prediction\nSetpoint\nGenerator\nUAV Model\nReference\nTracker\nPosition/Attitude\nController\nVision-based\nDetector\nAttitude rate\nController\nIMU\nUAV\nActuators\nOnboard\nSensors\nState\nEstimator\nOdometry &\nLocalisation\nˆx\n[bw]\nn = 1..Mp\n˙rd, ˙ηd\nˆ˙¨rd, ˆ˙¨ηd\nχd\n100 Hz\nωd\nTd\n100 Hz\nad\nτd\n≈1 kHz\nx\n100 Hz\ninitialisation\nonly\nx, R, ω\n100 Hz\nR, ω\nb\nUAV plant\nPixhawk autopilot\nMPC Architecture\nUSV Prediction Model\nUAV Prediction Model\nFig. 2: The entire UAV control architecture; the MPC landing controller (red block) is integrated into the MRS system [20]\n(grey blocks) and supplies the desired reference (velocity ˙rd =\n\u0002 ˙x\n˙y\n˙z\u0003T and heading rate ˙ηd). In the MRS system, the first\nlayer containing a Reference tracker processes the desired reference and gives a full-state reference χ to the attitude controller.\nThe feedback Position/Attitude controller produces the desired thrust and angular velocities (Td, ωd) for the Pixhawk flight\ncontroller (Attitude rate controller). The State estimator fuses data from Odometry & localisation methods to create an estimate\nof the UAV translation and rotation (x, R). The Vision-based Detector obtains the visual data from the camera and sends the\npose information b of the USV to the MPC. The individual states are sent to their respective prediction models, and using\nthese predictions, the MPC generates the desired control reference according to the cost function.\ncontributions are:\n• a novel drag-aware linear model inside an LKF to predict\nthe future curvilinear motion of a USV using only visual\npose estimation, and\n• an MPC based control approach for following a high-\nspeed USV during curvilinear trajectories, and for landing\nwith minimal impulse transfer.\nA\nsupplementary\nvideo\nof\nthe\nexperiments\nis\nattached\nto\nthis\npaper\nand\ncan\nalso\nbe\nfound\nat\nhttps://mrs.fel.cvut.cz/curvitrack-boat-landing.\nIII. HIGH-SPEED CHASE AND LANDING APPROACH\nIn this section, we propose our model-based method for\npredicting, tracking, and landing using two separate models for\nthe USV and the UAV. The UAV model is embedded inside\nthe MPC and is used to make predictions about the state of\nthe UAV for control. Similar to our previous work [6], our\nproposed controller receives the predicted states of the USV\nas an input reference and must produce a control reference at a\nminimum of 20 Hz, within the constraints of the mission (max\nvelocity, max acceleration, and max jerk). The MPC produces\ncontrol outputs, for desired linear velocities and the desired\nheading rate of the UAV, which are sent to the underlying\nMRS-system [20] framework as described in figure 2.\nFor the USV model, we formulate a linear Kalman estimator\nwith a point-mass model and include the velocity states as\nobserved variables while the pose of the USV remains a\nmeasured variable. This model, on its own, works sufficiently\nwell for straight-line motion with low-acceleration constraints,\nand does not require input generation. When this model is\ndeployed for curving paths, the predicted path is a straight\nline tangential to the current curvature of the path, as shown\nin figure 3. So, to perform predictions about the turning of\nthe USV, we introduce a method of generating the input to\nthe model using drag simulations that cause the predicted\npaths to curve due to centripetal acceleration. Compared to\nthe state-of-the-art, another important aspect of our novel\nmethod is the ability to account for the negative covariance\nbetween the velocity of the USV and its yaw rate. In summary,\nthis novel approach solves the limitations of our previous\nUSV model in [6] and, for the first time, enables tracking\nduring curvilinear motion, even at speeds of up to 5 m s−1.\nFinally, we highlight that the proposed model is specifically\ndemonstrated for systems that operate on information limited\nto pose and are required to make predictions about the future\nmotion of the USV with no communication. However, the\nproposed technique is not limited by the chosen perception\nand sensor setup, and direct access to velocity and acceleration\nstates of the USV (either through communication or a different\nsensor) can be used to improve the tracking performance,\nto decrease the filter convergence time, and to expand the\nmission operation envelope. For example, direct access to\nInertial Measurement Unit (IMU) information can help lift\nthe low-acceleration constraints and improve the angular and\ntranslational velocity estimation errors. Since this information\nis difficult to obtain in the real world, and relative localisation\ntechniques are well-developed and often chosen in missions,\nwe limit our scope to the use of pose information for the USV\nto demonstrate the robustness of our approach.\nA. USV Prediction Model\nFor a USV moving through a fluid, form drag (also called\npressure drag) is the primary factor affecting the curvilinear\nmotion. Therefore, we simulate the form drag experienced by\n\n\nIEEE ROBOTICS AND AUTOMATION LETTERS. AUTHOR’S VERSION - DO NOT DISTRIBUTE. 10.1109/LRA.2025.3546079\n4\nIEEE ROBOTICS AND AUTOMATION LETTERS. PREPRINT VERSION. ACCEPTED FEBRUARY, 2025\nVy\nVy\nVy\nVx\nVx'\nFD\nFD\nFD\nVx'\nVx'\nVx\nbx\nby\nVx\nVx\nWithout Drag Force\nWith Drag Force\nFig. 3: The red path represents the unchanged path taken by\nthe USV when no drag force is acting on it; whereas the blue\npath shows how the difference between Vx and Vx′ produces\na Vy vector and therefore, causes significant drag that leads to\nthe turning of the USV.\nthe vessel to generate inputs to a Kalman filter, which causes\nthe predictions to curve. Due to the significant difference\nbetween the surface area perpendicular (by) and parallel (bx)\nto the hull of a USV (see figure 3), we propose this approach\nbased on the assumption that the drag is significantly higher\nin the by axis of the USV compared to the bx axis and is not\ncompensated by the propulsion of the USV in the by axis (see\nfigure 3). As such, the velocity gained by the vessel in the\nbx axis before turning transforms into velocity perpendicular\nto the hull (in by axis), which causes the centripetal force\nrequired to turn the vehicle. Additionally, it was observed that\na significant negative correlation exists between the velocity\nof the USV and its yaw rate due to loss of momentum from\nthe vessel during a turn as the drag component overcomes the\nthrust provided by the propeller. Therefore, we introduce a\nnegative covariance between the velocity and yaw rate of the\nUSV to achieve sufficient dynamic performance by aiding the\nconvergence of the filter.\nFor this Kalman filter, we write the state vector of the USV\nas\nb =\n\u0002xb\nyb\nzb\nηb\n˙xb\n˙yb\n˙zb\n˙ηb\n\u0003T ,\n(1)\nwhere xb, yb, zb are the position co-ordinates of the USV in\nthe world frame, ηb is the heading of the USV, ˙xb, ˙yb, and ˙zb\nare the translational velocities in the world frame, and ˙ηb is\nthe heading rate. We then write the discrete state space model\nof the USV as\nb(k+1) = Ab(k) + Bub\n(k)\n(2)\nwhere A =\n\n\n1\n0\n0\n0\ndt\n0\n0\n0\n0\n1\n0\n0\n0\ndt\n0\n0\n0\n0\n1\n0\n0\n0\ndt\n0\n0\n0\n0\n1\n0\n0\n0\ndt\n0\n0\n0\n0\n1\n0\n0\n0\n0\n0\n0\n0\n0\n1\n0\n0\n0\n0\n0\n0\n0\n0\n1\n0\n0\n0\n0\n0\n0\n0\n0\n1\n\n\n,\nB =\n\u00140\n0\n0\n0\ndt\n0\n0\n0\n0\n0\n0\n0\n0\ndt\n0\n0\n\u0015T\n, and\nub =\n\u0014ax\nay\n\u0015\n.\n(3)\nHere, dt is the sampling time of the sensor, k is the\ndiscrete instance of time where t = k · dt, ax and ay are the\naccelerations produced by drag force acting on the USV in\nthe world frame. Since we do not have access to acceleration\nstates, we generate an artificial input, by writing the drag force\nof a body with an asymmetric projected area, in its own frame,\nas\nFd = m\n\u0014ax\nay\n\u0015\nb\n=\n−\n\u0014Kx\n0\n0\nKy\n\u0015 \u0014 ˙xb\n˙yb\n\u0015\nb\n(4)\nwhere m is the mass of the USV, [•]b denotes the vector in\nthe body frame, and Kx ≥0 and Ky ≥0 are the tunable drag\ncoefficients in the x and y axes of the USV frame respectively.\nFor the purpose of our model, we assume that the USV has\nsufficient propulsion to counteract the drag in the bx axis so\nas to maintain a constant velocity along its hull, and therefore,\nwe set Kx = 0. We also assume low pitch and roll angles on\nthe USV such that we can write a frame transform as\nbRw =\n\u0014 cos ηb\nsin ηb\n−sin ηb\ncos ηb\n\u0015\n, wRb =\nbRT\nw,\n(5)\nwhere\nwRb and\nbRw are rotation matrices for rotation\ntransformation from the body frame to the world frame and\nvice-versa. Hence, we write the input to the system as a\nfunction of the velocity of the USV such that\nm\n\u0014ax\nay\n\u0015\nw\n=\nwRb\n\u00140.0\n0.0\n0.0\n−Ky\n\u0015\nbRw\n\u0014 ˙x\n˙y\n\u0015\nw\n,\n(6)\nwhere [•]w denotes the vector in the world frame. We then\nwrite the covariance matrix to account for the covariance\nbetween velocity and heading rate of the USV such that\nQb =\n\n\nσx\n0\n0\n0\n0\n0\n0\n0\n0\nσy\n0\n0\n0\n0\n0\n0\n0\n0\nσz\n0\n0\n0\n0\n0\n0\n0\n0\nση\n0\n0\n0\n0\n0\n0\n0\n0\nσ ˙x\n0\n0\nσ ˙x ˙η\n0\n0\n0\n0\n0\nσ ˙y\n0\nσ ˙y ˙η\n0\n0\n0\n0\n0\n0\nσ ˙z\n0\n0\n0\n0\n0\nσ ˙η ˙x\nσ ˙η ˙y\n0\nσ ˙η\n\n\n.\n(7)\nSince a USV experiences a significant reduction in its lateral\nvelocity during a turn, we set σ ˙η ˙x, σ ˙η ˙y, σ ˙x ˙η, σ ˙y ˙η < 0 to reflect\nthis negative co-relation. These tunable parameters improve\nthe prediction performance in the turns, and depend on the\ndesign/dimensions of the USV (-0.3 for our setup).\n\n\nIEEE ROBOTICS AND AUTOMATION LETTERS. AUTHOR’S VERSION - DO NOT DISTRIBUTE. 10.1109/LRA.2025.3546079\nGUPTA et al.: CURVITRACK: CURVILINEAR TRAJECTORY TRACKING FOR HIGH-SPEED CHASE OF A USV\n5\nB. UAV Prediction and Control Model\nThe UAV prediction model used in the proposed MPC is\nbased on the Euler approximation of single particle kinematics\nin the world frame, and is identical to our previous work\n[6]. We employ the following discrete linear time-invariant\nsystem:\nx(k+1) = Dx(k) + Eud\n(k), where\n(8)\nx =\n\u0002xd\n˙xd\n¨xd\nyd\n˙yd\n¨yd\nzd\n˙zd\n¨zd\nψd\n˙ψd\n¨\nψd\n\u0003T\n,\n(9)\nand ud\n(k) =\nh\n˙¨xd\n˙¨yd\n˙¨zd\n˙¨\nψd\niT\n.\n(10)\nHere xd, yd, zd are the position co-ordinates of the UAV, ψd is\nthe heading of the UAV, and their subsequent derivatives form\nthe state vector x and the input vector ud. For this model (8),\nthe state matrix D and the input matrix E can be described\nthrough the Kronecker product (⊗), such that\nD\n12×12 = I\n4×4 ⊗D′\n3×3, where D′ =\n\n\n1\n∆tp\n∆t2\np\n2\n0\n1\n∆tp\n0\n0\n1\n\n,\n(11)\nE\n12×4 = I\n4×4 ⊗E′\n3×1, where\nE′ =\nh\n∆t3\np\n6\n∆t2\np\n2\n∆tp\niT\n, (12)\nwhere I is an identity matrix, and ∆tp = 0.01 seconds. We use\nthese UAV and USV prediction models inside a MPC-based\ncontrol approach similar to our previous work [6]. However,\nowing to the expanded prediction capability, we modify the\ncost function to include predicted translation velocities which\nleads to a decrease in average tracking error. The cost function\nis then defined as\nmin\nud1,...,udMc\nJ(x, ud) =\nMp\nX\nm=1\n˜xT\nmS˜xm + hT\nmThm\n|\n{z\n}\nJ1\n+\nMp\nX\nm=1\nαLf(˜zm)( ˙zb −˙zd)2\n|\n{z\n}\nJ2\n,\nsubject to :\n˜xm =\n∗xm −xm,\n˜zm =\n∗zm −zm,\nhm = udm −udm−1,\nxm+1 = Dxm + Eudm ∀m ≤Mc,\nxm+1 = Dxm + EudMc ∀m > Mc,\nudmin ≤udm ≤udmax,\nx0 = xinitial,\nud0 = udinitial,\n∀{m : m ∈N, 1 ≤m ≤Mp},\n(13)\nwhere\n∗xm is the desired state, ˜xm is the error vector, ˜zm is the\nerror in zm position, hm is the rate of control input change to\nensure smooth input to the UAV, Mp(= 100) is the prediction\nhorizon, and Mc(= 40) is the control horizon. S and T are the\ncorresponding penalty matrices with configurable weights for\nperformance tuning, while αL(= 1200) is the scalar for tuning\nJ2. The cost function is divided into two parts i.e. J1 and J2,\nand while J1 remains active at all times, J2 is activated by the\nsigmoid function in the vicinity of the landing deck to control\nthe relative velocity (as opposed to controlling relative tilt in\n[6]) between the UAV and the USV. The sigmoid function is\ndefined as\nf(˜zm) =\n\n\n\n\n\n\n\n\u0012\n1.0 + exp\n\u0012\n−˜zm −hd\n−0.15\n\u0013\u0013−1\n,\nif ˜zm ≥0.16\n\u0012\n1.0 + exp\n\u0012 ˜zm −0.1\n−0.01\n\u0013\u0013−1\n,\notherwise,\n(14)\nwhere hd(= 1.1) controls the waiting region during a landing\nattempt.\nIV. SIMULATION EXPERIMENTS\nWe present our results through comparison with the state-of-\nthe-art, presented in [18], to highlight the advantages of our\nproposed approach. For clarity, we present this comparison\nin two separate sections; first for trajectory predictions, and\nsecond for chasing and landing. For these comparisons, the\ntwo types of models presented in [18] will be labelled as ‘3D\nUKF‘ and ‘12D LKF‘. The former stands for the complex UKF\nmodel with hydrodynamic and hydrostatic forces, and the latter\nstands for the simplified point-mass kinematics model. For ‘3D\nUKF‘ and ‘12D LKF‘, we use four sensory inputs comprising\nof two visual pose estimation methods (UltraViolet Direction\nAnd Ranging (UVDAR) system [21] and AprilTag [22]) as\nwell as two communication-reliant sensors (Global Navigation\nSatellite System (GNSS) and IMU). It is of note that the state-\nof-the-art method can also run solely on visual pose estimation\nwith degraded performance, but we compare their best-case\nscenario of four sensory inputs to our bare-minimum scenario\nof a single input via AprilTag pose estimates. For these\nsimulation experiments, we use the Virtual RobotX (VRX)\nsimulation environment in Gazebo [23] to generate the motion\nof the USV and employ the MRS-system [20] to simulate\nand control the UAV. For our simulated UAV model, we use\na T650 quadrotor frame weighing 3.6 kg, carrying a Garmin\nLiDAR for altitude measurement above the landing deck, and\nan Intel RealSense D435 camera for live in-simulation video.\nThis setup closely resembles the setup used in the real-world\nexperiments conducted for this work.\nA. Trajectory Prediction Results\nThe USV follows an 8-figure trajectory which is specially\nselected such that the time spent in turning is longer than the\nchosen 2-second prediction window for these comparisons. For\nthis comparison, both ‘12D LKF‘ and ‘3D UKF‘ are compared\nwith our approach, which is marked as ‘CurviTrack‘. Figure 4\nshows the predicted paths against the ground truth measured in\nthe simulator. Table I shows the mean error, average error, and\nstandard deviation of the error for predictions in the xy-plane\nfor each technique. We highlight that, for 1-second predictions,\nour technique provides over 70 % reduction in error compared\nto ‘12D LKF‘ and 40 % reduction over the complex model\nemployed in ‘12D UKF‘. Similarly, our approach also offers\na 7-fold decrease in standard deviation (increase in certainty)\nover the ‘12 LKF‘ and a near 3-fold decrease in standard\ndeviation over the ‘3D UKF‘ method. We note that for our\nhigh-level MPC approach, we use a prediction horizon of 1 s.\nHowever, predictions up to t = 2.0 s become important for\n\n\nIEEE ROBOTICS AND AUTOMATION LETTERS. AUTHOR’S VERSION - DO NOT DISTRIBUTE. 10.1109/LRA.2025.3546079\n6\nIEEE ROBOTICS AND AUTOMATION LETTERS. PREPRINT VERSION. ACCEPTED FEBRUARY, 2025\nt\nMethod\nMean (m)\nMax (m)\nStd. Dev. (m)\n1.0 s\n12D LKF\n1.71\n4.01\n1.31\n3D UKF\n0.79\n2.03\n0.51\nCurviTrack\n0.48\n0.95\n0.18\n2.0 s\n12D LKF\n2.56\n5.92\n1.97\n3D UKF\n1.28\n3.35\n0.89\nCurviTrack\n0.90\n1.66\n0.34\nTABLE I: Mean error, maximum error, and standard deviation\nof the error for predictions in comparison to ‘12D LKF‘ and\n‘3D UKF‘ in [18].\n−20\n0\n20\n40\n60\nx / m\n−60\n−50\n−40\n−30\n−20\ny / m\nPredicted and actual path of USV\nGround Truth\n3D UKF\n12D LKF\nCurviTrack\n(a) Predictions — 1.0 s into the future\n−20\n0\n20\n40\n60\nx / m\n−60\n−50\n−40\n−30\n−20\ny / m\nPredicted and actual path of USV\nGround Truth\n3D UKF\n12D LKF\nCurviTrack\n(b) Predictions — 2.0 s into the future\nFig. 4: Comparison between predictions made by our proposed\napproach and the state-of-the-art approach by Nov´ak et. al.\n[18].\nmany high-level cascaded control policies, which are compute-\nlimited, and therefore, choose to run at a much slower rate\nthan low-level controllers. For those scenarios, our proposed\nmethod offers near 65 % reduction and near 30 % reduction in\nmean error compared to ‘12D LKF‘ and ‘3D UKF‘ as shown\nin Table I. Hence, for predictions, our efficient curvilinear\nmodel outperforms the state-of-the-art by a significant margin\nwithout using communication and, therefore, without multi-\nmodal sensory input.\nB. Chasing and Landing Results\nFor tracking and landing, we select ‘12D LKF‘ for our\ncomparison as a majority of aforementioned literature uses\nlinear predictions for landings performed on moving USVs,\nand so, we highlight the advantages of switching to our\ncurvilinear approach. We perform the comparison over a\nspecial triangular trajectory (figure 5), designed to push the\nlimits of the proposed approach by using harsh 120◦turns\nwhich are uncommon for real-missions for sweeping an area.\nThe trajectory is also specifically designed such that the USV\nspends an equal amount of time moving in a straight line and\nmoving in a curved path. The predictions for both estimators\nare sent to the MPC, which controls the UAV to follow the\nUSV around the trajectory.\nFor tracking, we present our results through figure 6 which\nsummarises the horizontal distance between the UAV and the\nUSV during the turns ( ˙ηb > 0.1 rad s−1), where, it can be\nseen that our proposed approach doubles the instances where\ntracking distance is within 0.5 m of the USV throughout the\ntrajectory. It is also to be noted that our approach allows\nthe UAV to be within 1.0 m of the USV in nearly 80 % of\nthe instances. The median follow distance of our proposed\napproach (0.67 m) is found to be 30 % lower than the com-\npared approach (0.97 m). It is important to note that not only\ndoes our approach yield a direct improvement in the tracking\nperformance compared to a linear approach, this improvement\nof performance in 0.5 m distance is approximately the width\nof our UAV which significantly increases the probability of a\nsuccessful landing, as highlighted in the next section.\nWe ran a statistical analysis of multiple attempted landings\non the USV deck in the simulation during the triangular\ntrajectory tracking. Once the UAV was following the USV,\nthe mission controller initiated landing at a randomly chosen\ntime, and a landing attempt was logged. A landing attempt\nwas considered successful if the UAV was within a radius of\n1.0 m from the centre of the landing deck and its altitude was\nwithin 0.15 m from the landing deck (such that the landing\ngear touched the deck). The experimental setup prevents\nlanding in low confidence and, thus, prevents either of the\napproaches from landing outside the deck. Instead, landings\nare aborted, and UAV regains altitude if the visual marker of\nthe USV cannot be seen for more than 0.5 s. We compare the\nsuccessful landings against the aborted landings to represent\nthe time saved from aborting and retrying landing during\ntime-constrained missions. When compared against the ‘12D\nLKF‘, our approach succeeded in landing 25 times out of\n50 attempts (50 %), whereas the linear approach succeeded\nonly 18 times out of 50 attempts (36.0 %). When compared\nagainst the ‘12D LKF‘, our approach showed 40 % increase\nin successful landing instances for all the simulated landing\nattempts, even for an aggressively curving trajectory shown.\nThis clearly highlights the aforementioned need to predict\ncurvilinear motion and save time for autonomous missions. We\nemphasise that while this particular triangular trajectory allots\nequal time to linear and curvilinear motion, for a trajectory\nwith a higher number of turns (as is common for search\npatterns in marine environments), we expect the performance\nof our approach to stand out significantly more than it does in\nthis comparison. We achieve this performance gain for a harsh\nand unrealistic turn angle in the trajectory, which pushes the\nlimits of the tracking methodology.\nV. REAL-WORLD EXPERIMENTS\nIn addition to the simulation environment, we present the\nresults of our approach in two real-world conditions which\n\n\nIEEE ROBOTICS AND AUTOMATION LETTERS. AUTHOR’S VERSION - DO NOT DISTRIBUTE. 10.1109/LRA.2025.3546079\nGUPTA et al.: CURVITRACK: CURVILINEAR TRAJECTORY TRACKING FOR HIGH-SPEED CHASE OF A USV\n7\n−20\n−10\n0\n10\n20\n30\nx / m\n−20\n−15\n−10\n−5\n0\n5\n10\n15\ny / m\nExample trajectory in simulation trial\nUAV 12D LKF\nUAV CurviTrack\nUSV\nFig. 5: A randomly picked example triangle trajectory for\ncomparative analysis. Visible deviations arise from the search\nphase performed after aborted landings.\n0.0 - 0.5\n0.5 - 1.0\n1.0 - 1.5\n1.5 - 2.0\n2.0 - 2.5\n2.5 - 3.0\nFollow distance in xy-plane / m\n0\n10\n20\n30\n40\nPercentage / (%)\nFollow distance when USV is turning at η > 0.1 rad/s\nCurviTrack\n12D LKF\nFig. 6: Statistical analysis on tracking error between our\n‘CurviTrack‘ and ‘12D LKF‘ model in simulation for a tri-\nangular trajectory when USV is turning at a ˙ηb > 0.1 rad s−1.\ncover both land and water to thoroughly test the robustness\nof our proposed method in adverse conditions. For our real-\nworld flights, we employed a 4.5 kg T650 quadrotor equipped\nwith vertical pontoons [24] for emergency landing over water\n(see figure 1). In addition, the sensor stack included a Garmin\nLiDAR for laser-ranging of altitude above the landing deck,\na Basler camera for the live video feed, and an Intel NUC\nfor onboard real-time processing of the algorithms, data,\nand video. To validate our approach, we rigorously test our\nmethod in two very different environments to push the limits\nof estimation and tracking capabilities, and to demonstrate\nrobustness.\nFor the first set of experiments, we test the predictions\nover land in a high-speed chase of up to 5 m s−1 (the USV\nmoves two body-lengths every second, and UAV moves five\nbody-lengths every second) where the algorithm is challenged\nby a rapidly curving path over land with unpredictable input\nfrom a human operator. For this experiment, we approximate\nthe moving USV using a wooden board with an AprilTag\n[22] affixed on top, and this board is dragged on the ground\nby the operator. These experiments present the robustness of\nour method as the operator can change the magnitude and\ndirection of velocity at their wish and produce turns that are\ninfeasible and unexpected in the marine environment for UAV-\nUSV missions. For example, the assumption of drag in the\ny-axis is deliberately broken by inducing a side slip in the\nplatform while dragging. For these land-based experiments,\nwe highlight our prediction and tracking performance.\nFor the second set of experiments, two different kinds of\nUSVs were tested in fresh-water environment to confirm the\nadaptability of the proposed approach to vessels of different\nsizes. For the first scenario, an inflatable dinghy is towed\nbehind a paddle-driven boat to represent a low-speed (up\nto 2 m s−1) high-drag marine vessel with a 2 m by 2 m\nlanding deck (figure 1). For the second scenario, a sub-5 m\nautonomous USV, capable of moving at speeds of up to\n3 m s−1, was used to represent a realistic watercraft deployed\nfor missions in fresh-water environments (figure 1). For these\nfresh-water experiments, we present our prediction, tracking,\nand landing capabilities.\nA. Trajectory Prediction Results\nAs seen through figure 7, the prediction method is robust to\nquick changes in direction and manages to accurately predict\nthe future for both land-based and water-based experiments.\nIn the land-based experiments, unlike the simulation envi-\nronment, rapid changes are made in the direction of motion\n−30\n−20\n−10\n0\n10\ny / m\n−20\n−15\n−10\n−5\n0\n5\nx / m\nLand : predicted and actual paths of UAV-USV team\nUSV Predicted : 1.0 s\nUSV Actual Position\nUAV Actual Position\n0\n25\n50\n75\n100\n125\n150\n175\n200\nTime / s\n0\n2\n4\n6\nRelative Distance / m\nLand : relative distance between UAV and USV in xy-plane\nUAV-USV follow distance\n30\n40\n50\n60\n70\n80\n90\n100\n110\ny / m\n0\n10\n20\n30\n40\nx / m\nWater : predicted and actual paths of UAV-USV team\nUSV Predicted : 1.0 s\nUSV Actual Position\nUAV Actual Position\nLanded\n0\n50\n100\n150\n200\n250\n300\nTime / s\n0.00\n0.25\n0.50\n0.75\n1.00\nRelative Distance / m\nWater : relative distance between UAV and USV in xy-plane\nUAV-USV follow distance\nFig. 7: Predictions and relative distance for chase during land-\nbased and water-based real-world experiments.\n\n\nIEEE ROBOTICS AND AUTOMATION LETTERS. AUTHOR’S VERSION - DO NOT DISTRIBUTE. 10.1109/LRA.2025.3546079\n8\nIEEE ROBOTICS AND AUTOMATION LETTERS. PREPRINT VERSION. ACCEPTED FEBRUARY, 2025\nby the operator. The only negative impact appears to be the\nirregularity of the predicted trajectory, which arises from a\ncontinuous side slip, causing the projected motion to curve\nmore aggressively than the ground-truth. However, as evident\nfrom the figure, the UAV is able to follow the predictions on\nthe curved paths without losing track. As seen in figure 7,\nwhen the operator crosses the maximum allowed horizontal\nacceleration/deceleration of the mission, the UAV lags behind\nbut quickly recovers without losing track of the USV.\nIn the fresh-water environment, the predictions are smoother\nthan in land-based experiments due to the uniform drag\nexperienced as per the internal model, and consequently, the\npredictions line up perfectly with the path taken by the marine\nvessel.\nThese experimental runs strongly support the ability of\nthe proposed approach to make reliable predictions about the\nfuture of the USV during curvilinear trajectories in real-world\nscenarios.\nB. Chasing and Landing Results\nAs shown in figure 7, the UAV is able to follow the landing\ntarget closely throughout the turns and is able to land on the\nUSV after tracking it through the curvilinear trajectory. These\nexperiments can also be seen in the media attached with the\npaper and further prove the robustness of our approach to the\nchanges in the environment as well as applicability to real\nUAVs and USVs of different sizes.\nVI. CONCLUSION\nIn this work, we presented a novel approach for the au-\ntonomous landing of UAVs onto various moving USV in\nmarine environments for following high-speed curvilinear tra-\njectories. Our proposed decentralized solution leverages visual\npose estimation and an efficient motion model for predicting\nand tracking the moving USV, enabling precise and robust\nlanding manoeuvres. Through statistical analysis in simulation\nexperiments and various real-world experiments, we have\ndemonstrated a decrease in prediction error and an increase\nin tracking and landing performance for our novel method\nin comparison to the state-of-the-art. This real-time onboard\nmodel can converge and predict for any sensor setup with\nrobust pose estimation without requiring communication.\nREFERENCES\n[1] R. R. Murphy, E. Steimle, C. Griffin, C. Cullins, M. Hall, and K. Pratt,\n“Cooperative use of unmanned sea surface and micro aerial vehicles at\nhurricane wilma,” Journal of Field Robotics, vol. 25, no. 3, pp. 164–180,\n2008.\n[2] M. Lindemuth, R. Murphy, E. Steimle, W. Armitage, K. Dreger, T. Elliot,\nM. Hall, D. Kalyadin, J. Kramer, M. Palankar, K. Pratt, and C. Griffin,\n“Sea robot-assisted inspection,” IEEE Robotics & Automation Magazine,\nvol. 18, no. 2, pp. 96–107, 2011.\n[3] F. F. Ram´ırez, D. S. Benitez, E. B. Portas, and J. A. L. Orozco,\n“Coordinated sea rescue system based on unmanned air vehicles and\nsurface vessels,” in OCEANS 2011 IEEE - Spain, 2011, pp. 1–10.\n[4] J. M. Riola, J. J. Diaz, and J. M. Giron-Sierra, “The prediction of calm\nopportunities for landing on a ship: Aspects of the problem,” in OCEANS\n2011 IEEE - Spain, 2011, pp. 1–8.\n[5] S. K¨uchler, T. Mahl, J. Neupert, K. Schneider, and O. Sawodny, “Active\ncontrol for an offshore crane using prediction of the vessel’s motion,”\nIEEE/ASME Transactions on Mechatronics, vol. 16, no. 2, pp. 297–309,\n2011.\n[6] P. M. Gupta, E. Pairet, T. Nascimento, and M. Saska, “Landing a uav in\nharsh winds and turbulent open waters,” IEEE Robotics and Automation\nLetters, vol. 8, no. 2, pp. 744–751, 2023.\n[7] J. Li, G. Zhang, C. Jiang, and W. Zhang, “A survey of maritime\nunmanned search system: Theory, applications and future directions,”\nOcean Engineering, vol. 285, p. 115359, 2023.\n[8] R. Polvara, S. Sharma, J. Wan, A. Manning, and R. Sutton, “Vision-\nbased autonomous landing of a quadrotor on the perturbed deck of an\nunmanned surface vehicle,” Drones, vol. 2, no. 2, 2018.\n[9] S. Abujoub, J. McPhee, C. Westin, and R. A. Irani, “Unmanned aerial\nvehicle landing on maritime vessels using signal prediction of the ship\nmotion,” in OCEANS 2018 MTS/IEEE Charleston, 2018, pp. 1–9.\n[10] L. Yang, Z. Liu, X. Wang, G. Wang, X. Hu, and Y. Xi, “Autonomous\nlanding of a rotor unmanned aerial vehicle on a boat using image-based\nvisual servoing,” in 2021 IEEE International Conference on Robotics\nand Biomimetics (ROBIO), 2021, pp. 1848–1854.\n[11] B. Heriss´e, T. Hamel, R. Mahony, and F.-X. Russotto, “Landing a vtol\nunmanned aerial vehicle on a moving platform using optical flow,” IEEE\nTransactions on Robotics, vol. 28, no. 1, pp. 77–89, 2012.\n[12] S. K. Cengiz and L. Ucun, “Optimal controller design for autonomous\nquadrotor landing on moving platform,” Simulation Modelling Practice\nand Theory, vol. 119, p. 102565, 2022.\n[13] Z. Zhao, P. Han, Y. Xu, W. Xie, W. Zhang, K. Liang, and Q. Zeng,\n“Vision-based autonomous landing control of a multi-rotor aerial ve-\nhicle on a moving platform with experimental validations,” IFAC-\nPapersOnLine, vol. 55, no. 3, pp. 1–6, 2022, 16th IFAC Symposium\non Large Scale Complex Systems: Theory and Applications LSS 2022.\n[14] D. Falanga, A. Zanchettin, A. Simovic, J. Delmerico, and D. Scara-\nmuzza, “Vision-based autonomous quadrotor landing on a moving\nplatform,” in 2017 IEEE International Symposium on Safety, Security\nand Rescue Robotics (SSRR), 2017, pp. 200–207.\n[15] A. Borowczyk, D.-T. Nguyen, A. P.-V. Nguyen, D. Q. Nguyen,\nD. Saussi´e, and J. Le Ny, “Autonomous landing of a quadcopter\non a high-speed ground vehicle,” Journal of Guidance, Control, and\nDynamics, vol. 40, no. 9, pp. 2378–2385, 2017.\n[16] B. Lee, V. Saj, M. Benedict, and D. Kalathil, “A vision-based control\nmethod for autonomous landing of vertical flight aircraft on a moving\nplatform without using gps,” 2020.\n[17] T. Baca, P. Stepan, and M. Saska, “Autonomous landing on a moving\ncar with unmanned aerial vehicle,” in 2017 European Conference on\nMobile Robots (ECMR), 2017, pp. 1–6.\n[18] F. Nov´ak, T. B´aˇca, O. Proch´azka, and M. Saska, “State estimation of\nmarine vessels affected by waves by unmanned aerial vehicles,” Ocean\nEngineering, vol. 323, p. 120606, 2025.\n[19] O. Proch´azka, F. Nov´ak, T. B´aˇca, P. M. Gupta, R. Pˇeniˇcka, and M. Saska,\n“Model predictive control-based trajectory generation for agile landing\nof unmanned aerial vehicle on a moving boat,” p. 119164, 2024.\n[20] T. Baca, M. Petrlik, M. Vrba, V. Spurny, R. Penicka, D. Hert, and\nM. Saska, “The MRS UAV System: Pushing the Frontiers of Repro-\nducible Research, Real-world Deployment, and Education with Au-\ntonomous Unmanned Aerial Vehicles,” Journal of Intelligent & Robotic\nSystems, vol. 102, no. 26, pp. 1–28, May 2021.\n[21] V. Walter, N. Staub, A. Franchi, and M. Saska, “Uvdar system for visual\nrelative localization with application to leader–follower formations of\nmultirotor uavs,” IEEE Robotics and Automation Letters, vol. 4, no. 3,\npp. 2637–2644, 2019.\n[22] J. Wang and E. Olson, “Apriltag 2: Efficient and robust fiducial detec-\ntion,” in 2016 IEEE/RSJ International Conference on Intelligent Robots\nand Systems (IROS), 2016, pp. 4193–4198.\n[23] B. Bingham, C. Ag¨uero, M. McCarrin, J. Klamo, J. Malia, K. Allen,\nT. Lum, M. Rawson, and R. Waqar, “Toward maritime robotic simulation\nin gazebo,” in OCEANS 2019 MTS/IEEE SEATTLE, 2019, pp. 1–10.\n[24] D. Hert, T. Baca, P. Petracek, V. Kratky, V. Spurny, M. Petrlik, M. Vrba,\nD. Zaitlik, P. Stoudek, V. Walter, P. Stepan, J. Horyna, V. Pritzl,\nG. Silano, D. Bonilla Licea, P. Stibinger, R. Penicka, T. Nascimento, and\nM. Saska, “Mrs modular uav hardware platforms for supporting research\nin real-world outdoor and indoor environments,” in 2022 International\nConference on Unmanned Aircraft Systems (ICUAS), 2022, pp. 1264–\n1273.\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21303v1.pdf",
    "total_pages": 8,
    "title": "CurviTrack: Curvilinear Trajectory Tracking for High-speed Chase of a USV",
    "authors": [
      "Parakh M. Gupta",
      "Ondřej Procházka",
      "Tiago Nascimento",
      "Martin Saska"
    ],
    "abstract": "Heterogeneous robot teams used in marine environments incur time-and-energy\npenalties when the marine vehicle has to halt the mission to allow the\nautonomous aerial vehicle to land for recharging. In this paper, we present a\nsolution for this problem using a novel drag-aware model formulation which is\ncoupled with MPC, and therefore, enables tracking and landing during high-speed\ncurvilinear trajectories of an USV without any communication. Compared to the\nstate-of-the-art, our approach yields 40% decrease in prediction errors, and\nprovides a 3-fold increase in certainty of predictions. Consequently, this\nleads to a 30% improvement in tracking performance and 40% higher success in\nlanding on a moving USV even during aggressive turns that are unfeasible for\nconventional marine missions. We test our approach in two different real-world\nscenarios with marine vessels of two different sizes and further solidify our\nresults through statistical analysis in simulation to demonstrate the\nrobustness of our method.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}