{
  "id": "arxiv_2502.21254v1",
  "text": " \n1\n \n \n \n \n \nCorrected values of turbulence generated \nby general geothermal convection in deep \nMediterranean waters \n \n \nHans van Haren \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nNIOZ Royal Netherlands Institute for Sea Research, P.O. Box 59, 1790 AB  Den Burg, \nthe Netherlands. \nhans.van.haren@nioz.nl \n \n \n\n\n \n2\nAbstract \nA correction by a reduction factor O(100) is proposed for previously calculated turbulence values \non unresolved convection-overturns induced by general geothermal heating in the deep Western \nMediterranean. The correction includes modified application of reordering method for calculating \nturbulence values in convection turbulence with and without stratification above or below. The \nresult is improved correspondence between geophysical determined heat flow through the seafloor \nand turbulence kinetic energy dissipation rate determined from high-resolution temperature sensors \nmoored over 109 m in the overlying waters, with an average mixing coefficient of 0.5.   \n \nKeywords Correction method for unresolved overturns; Convection turbulence; Deep Western \nMediterranean; Geothermal heating outside volcanic vents; Moored high-resolution temperature \nobservations \n \n1 Introduction \nThe direct observation using moored high-resolution temperature (T-)sensors of buoyancy-\ndriven convection turbulence attributed to general geothermal heating in the deep Western \nMediterranean (van Haren 2023) unfortunately contains erroneous calculation of turbulence values \nlike dissipation rate. The calculation uses the method of reordering instabilities to stable vertical \ndensity profiles (Thorpe 1977). The error in van Haren (2023) comprises a mix-up of heat- and \nbuoyancy-flux, an over-complicating comparison between vertically integrated dissipation rate \nwith geothermal heat flux and an incorrect transfer rate between density and temperature variations. \nIn this technical note, corrected calculations are presented that demonstrate turbulence values \nmatching average geothermal heating well to within error. An observed difference by one order of \nmagnitude in dissipation rate calculated for the case of geothermally induced unstable overturning \nexceeding the 109-m range of T-sensors and for that overlying by stable stratification is explained, \n\n\n \n3\nusing simple modelling, by the over-estimating effect of reordering for the former case. An \neffective correction is proposed for such unresolved overturns exceeding the T-sensor range. \n \n2 Moored T-sensor data \nAs detailed in van Haren (2023), a T-sensor mooring was deployed at 42° 47´N, 06° 09´E, \nseafloor at z = -2480 m, about 40 km south of Toulon, France. The average local seafloor slope is \nless than 1º, a relatively flat topography 12 km seaward of the steep continental slope. T-sensors \nprovided useful data through the winter of 2017/2018 when deep dense-water formation was not \nnoticed in the mooring area. For calibration purposes and to establish the local temperature-density \nrelationship, shipborne Conductivity-Temperature-Depth (CTD) profiles were obtained near the \nmooring site during deployment and recovery cruises.  \nThe local deep Mediterranean waters are very weakly stratified, with buoyancy frequency N ~ \n1f, f denoting the inertial frequency, so that typical temperature variations are 0.0001-0.001°C. \nThus, T-sensor data require high precision and stability, through elaborate post-processing. As \ndescribed in van Haren (2022) the common post-processing of calibration, long-term drift-\ncorrection and reference to nearby shipborne CTD-data are supplemented by reference to data from \na period of near-homogeneous, temperature variability <0.0003°C, waters over the entire mooring \nrange. Such near-homogeneity is found here on day 439. The data discussed in this note are from \nnear that day (Fig. 1), to take most advantage of this reference before instrumental drift, of typically \n0.001°C mo-1 after aging, becomes larger than the environmental signal. As in van Haren (2023), \nthe data are low-pass filtered at 1000 cycles per day in frequency to remove noise. In addition, \n‘short-term drift’, actually imperfect contact between sensor and environment through the glass \nwall, are reduced using low-pass (0.1 cycle per m) vertical filtering under near-homogeneous \nconditions with variations O(0.0001°C) when geothermal heating is observable in overlying waters. \n \n\n\n \n4\nFig. 1 Short periods of convection turbulence of varying intensity and varying duration observed \nin the deep Western Mediterranean. (a) Replot of Fig. 6d in van Haren (2023) with slightly \ndifferent colour and contour ranges. One day of the 109-m-vertical Conservative Temperature \nsampled at 2.0-m intervals, lpf at 1000 cpd and 0.1 cpm. The seafloor is at the horizontal axis. \nBlack contours and value increments are every 0.0001 C. The white dashed line indicates a \nsingle profile displayed in Fig. 3. (b) As a., but for 900 s of stratification over seafloor \nconvection. (c) Logarithm of vertically averaged turbulence kinetic energy dissipation rate \n(black) and, in cyan after correction retaining per profile only values below threshold of 6.610-\n10 m2s-3 of Fig. 4. (d) As c., but for data in b., without correction. \n \n3 Results \n \n3.0 Observing the problem \nDuring about 25% of the 4.5 months record, moored T-sensor data showed such weakly \nstratified waters over the deep seafloor that convection turbulence associated with general \n\n\n \n5\ngeothermal heating was apparent in time-depth plots (van Haren 2023). At the particular mooring \nsite during the particular autumn/winter, the convection turbulence often exceeded the h = 109 m \nrange of T-sensors above the seafloor albeit vertical plumes are generally broken and slanted (Fig. \n1a). Although convection plumes are accompanied by secondary shear (Li and Li 2006), average \nspectra showed significant deviation from the inertial subrange of shear-induced turbulence with a \ndominance of the buoyancy subrange of convection turbulence throughout the 109-m vertical range \n(van Haren 2023). It is noted that indeed all dynamics occurred within a temperature range of only \na few 0.0001°C.  \nOccasionally, the convection turbulence was underneath well-stratified waters (depressed) \nwithin the range of T-sensors (Fig. 1b). Whilst such a condition of stratification overlying deep \nconvection commonly occurs, except perhaps during rare brief moments of deep water formation \nin exceptional late winters, and considering that general geothermal heating has the same value \nwhen averaged over sufficient time, it is expected that the two data periods of Fig. 1 provide the \nsame value of convection turbulence induced above the seafloor. However, applying the method \nby Thorpe (1977) of reordering unstable density (temperature) profiles to calculate turbulence \nvalues (Appendix) results in considerably different, by one order of magnitude, time series of \nvertically averaged near-bottom ‘b’ turbulence kinetic energy dissipation rate [εb] equals in this \ncase [εh] = h-1εdh (compare the black graphs in Fig. 1c,d). Here, the vertical averaging is covering \nthe largest convective overturn when stable stratification is above the T-sensors, which is a \nprerequisite for quantitative use of Thorpe (1977)’s method. Near the sea surface, overturn scales \nare found useful to determine the depth of nighttime convective mixing (Brainerd and Gregg 1995; \nKumar et al. 2021). As a physical cause of stratification blocking the turbulence is unlikely \nexplaining the order of magnitude difference, a technical cause of overestimating turbulence by \nunresolved overturns under changing preconditioning is anticipated, and investigated below.  \n\n\n \n6\nFig. 2 Local deep Mediterranean CTD observations. (a) Conservative Temperature from about \nlower 400 m above the seafloor from two different years, with the black bar denoting the height \nof the mooring. (b) Plot of relationship between Conservative Temperature and density anomaly \nreferenced to pressure level of 2107 Pa from shipborne CTD observations in 2018 (blue) and \n2020 (green). Average slopes are determined in weakly stratified waters where buoyancy \nfrequency N = 2-2.5f, f the inertial frequency, over the indicated range about 350 m above the \nseafloor. Smooth data lines are 50-m lpf versions of the 1-m averaged data (dots). In black are \nthe straight best-fit slopes to the smooth data.  \n \n3.1 CTD-determined temperature-density consistency \nIn the lower 400 m above the seafloor, the shipborne CTD-profiles vary, not only on small 10-\nm vertical scales, but also on large 100-m vertical scales (van Haren 2023). Although commonly a \nlocal relationship is established between Conservative Temperature (IOC et al. 2010)  and density \nanomaly 2 referenced to a pressure level of 2107 N m-2 around the moored T-sensor range, this \n\n\n \n7\nresults in (too) large, >10%, errors in waters where N ~ 1f, such as occasionally found near the \nmooring site (Fig. 2a). Thus, one is obliged to establish a relationship from layers higher up where \nN = (2-3)f, and which regularly reach the moored T-sensors, from above or from the sides.  \nSmoothed over a 110-m vertical range between -2165 < z < -2055 m the -2 consistent \nrelationship amounts (Fig. 2b), \n2/ = -0.250.01 kg m-3 C-1. \n \n \n \n \n \n \n(1) \nThe relatively tight relationship (1) is a factor of 3.4 smaller than used in van Haren (2023) \nwhich results in calculated (Appendix) turbulence dissipation rate values reduced by a factor of 6.3. \n \n3.2 Geothermal buoyancy flux  \nThe average local general geothermal heat flux amounts Q = 0.110.03 W m-2 (Pasquale et al. \n2016; Ferron et al. 2017). This is the heat flux transferred from the sediment into the overlying \nwaters, presumably via conduction. For simplicity, it is considered a constant flux without \nvariations in time or space, ignoring complex geological and geophysical processes (e.g., Kunath \net al. 2021). It is expected that this heating from below will start convection turbulence in the \noverlying waters when the stable stratification supply from above is sufficiently weak, i.e. \n(pre)conditioning is near-neutral. We assume no other governing turbulence processes during such \nperiods.  \nAs the turbulence is buoyancy driven, the heat flux is transferred to buoyancy flux, \nJb = gQ/cp = 6×10-11 m2s-3,  \n \n \n \n \n \n \n(2) \nwhere g denotes the acceleration of gravity,  = 2.3×10-4 °C-1 the local thermal expansion \ncoefficient,  the density of overlying water and cp = 3950 J kg-1 °C-1 the local heat capacity. \nFor nighttime near-surface convection, Lombardo and Gregg (1989) established a relationship \nbetween ‘mixing layer’ turbulence dissipation rate εm and positive buoyancy flux cooling εm = \n(0.5±0.1)Jb,s. This ratio excluded the upper ‘surface layer’ (s) 20 m showing one to two orders of \n\n\n \n8\nmagnitude larger εs = (10-100)εm that included wave action besides convection. Since we do not \nhave microstructure profiler data from near the deep seafloor, the overturn-averaging (Appendix) \nwill include data from the entire relevant distance above the seafloor starting at h = 1 m.  \nThus, assuming a continuous buoyancy flux transferred from the solid seafloor into overlying \nwaters we expect a relationship of, \nJb = e[εb],  \n \n \n \n \n \n \n \n \n(3) \nwhere e = 0.2-1.0 represents the mixing coefficient with values between 0.2 for shear turbulence \nin the ocean (Gregg 2018), via 0.3-0.7 for convection induced by breaking internal waves over \nsloping topography (Alford et al. 2024), and 1.0, yielding a mixing efficiency of 0.5, for pure \nconvection as in Rayleigh-Bénard convection and Rayleigh-Taylor instabilities (Dalziel et al. 2008; \nGayen et al. 2013; Ng et al. 2016). Hence, an expected value for geothermal induced turbulence \ndissipation rate [εb] = εGH is calculated from (2) in (3) of, \nεGH = Jb/e = 0.6-3.0×10-10 m2s-3. \n \n \n \n \n \n \n(4) \nFor comparison, the values in (4) are three orders of magnitude lower than the outgoing radiative \nbuoyancy flux near the sea surface. \n \n3.3 Observing complete and incomplete overturns of convection turbulence \nThe time-mean turbulence dissipation rate value averaged over the lower 55 m above the \nseafloor from observations in Fig. 1b amounts,  \n[εb] = 1.20.7×10-10 m2s-3,  \ne = 0.50.3. \n \n \n \n \n \n(5) \nThis value is well within error corresponding with that of geophysical determined geothermal \nheating εGH in (4), and suggesting a mixing efficiency commensurate dominant convection \nturbulence.  \nA representative vertical temperature profile (Fig. 3a) shows general instability up to half the T-\nsensor range that results in ragged short vertical scale variations in displacements transferred in \n\n\n \n9\nterms of dissipation rate values (Fig. 3b). Because of the overlying stable stratification, the largest \noverturn of the lower-half instability is ‘complete’ and well resolved. Note that these individual \ndissipation rate values have no quantitative meaning, as averages should be taken over entire \noverturns, in the vertical or in time. However, the shape of the profile may be considered \nqualitatively. It is found rather homogeneous in the vertical, despite the short-scale variations. It is \nnot very different from the smoother 900-s time-mean profile. \nFig. 3 Time-mean (thick-dashed) and single (thin-solid) profiles for data in Fig. 1a,b (blue) and \nFig. 1c,d (red). (a) Conservative Temperature. (b) Turbulence kinetic energy dissipation rate.   \n \nIn contrast, a representative single profile from the data in Fig. 1a shows general instability over \nthe entire 109-m T-sensor range, albeit with similar rate over most of its lower half as the profile \nfrom data in Fig. 1b. However, the associated dissipation rate profile is distinctly different from \nthat of Fig. 1b data, with less small-scale variations, a large-scale minimum in the center and large-\n\n\n \n10\nscale maxima at the upper and lower edges for the data in Fig. 1a. The single profile is part of a \nless extreme and smoother 1-day mean profile that retains the center-minimum and edge-maxima. \nObviously, the largest overturns are ‘incomplete’ and not well resolved as they may exceed the T-\nsensor range. The profiles of displacement-determined dissipation rates qualify as artificial.   \n \n \n3.4 A simple model of (in)complete convection overturns  \nSimple modeling was performed for better understanding the effects of calculation of turbulence \nvalues from vertical density profiles using Thorpe (1977) reordering of unstable layers that are \nunbounded by stratification, such as in convection turbulence. An ‘unstable’ profile model of \nincomplete overturn is compared with two ‘stratified’ profile models of different levels of \nstratification overlying the unstable layer. The models represent geothermal heating observations \nof convection turbulence under different overlying stratification preconditioning in Fig. 1, 3, but \nthey can also be used for similar convection turbulence from above during (nighttime) cooling near \nthe surface. \nThe 1D-models use 2-m vertical distancing over 55 data points between h = 1-109 m above the \nseafloor, like a single profile in the moored T-sensor observations (Fig. 4). The models follow the \nsame temperature gradient as in observed single profiles of Fig. 3a, and are converted to density \nprofiles using the density-temperature relationship (1) observed in immediate overlying \nstratification. The blue unstable model has a monotonic temperature decrease with height. The \ngreen (g) stratified model just compensates the instability below, while the magenta (m) \nstratification is twice as large and corresponds with that of the observed stable profile in Fig. 3a. \nAs a result, it is expected that the two stratified models g,m result in turbulence dissipation rate of \nmodg,m  1.210-10 m2s-3 as in (5). \n\n\n \n11\nFig. 4 Model profiles to investigate overturning effects with and without stratification over-\ncapping an unstable layer above the seafloor, here at height h = 0. (a) Conservative Temperature \nanomaly for three models: unstable over the entire range (blue), unstable at the same rate over \nbottom-half overlying with stable stratification at the same rate (green), unstable at the same \nrate over bottom-half overlying with double-rated stratification (magenta). The dashed curves \nare their stably reordered profiles. In solid-black is the observed single profile from unstable \ndata in Fig. 1a. (b) Displacements after reordering the model profiles of a. (c) Logarithm of \nbuoyancy frequency from the reordered model profiles in a. (d) Logarithm of calculated \ndissipation rate profiles for the profiles in a. The mean values below threshold for the unstable \nblue and black profiles are similar to within error to the mean of values below threshold (red-\ndashed) of the lower half of the green and magenta profiles. The threshold equals the vertical \nmeans ratio of blue and green or magenta dissipation values times the observed mean value of \nFig. 1d (see text). \n \nAll the dynamics are comprised in a vertical relative temperature variation of 210-4 C (Fig. \n4a). Reordering of the model profiles demonstrates that none of the profiles becomes neutral, all \n\n\n \n12\nare weakly, but non-negligibly stratified. From the displacements (Fig. 4b) we learn that the fully \nunstable model yields a monotonic profile describing one large symmetric-around-zero overturn \nalbeit of unresolved extent, while both stratified models flip back and forth in displacement value \nover short vertical distances describing an asymmetric fully resolved large overturn.  \nTechnically, the inference is that, for the green stratified model, one displaced particle is \nadjacent to a non-reordered one. (Physically we miss the unknown erosion of stratification in the \nunstable model). The rms displacement values between unstable blue model and stratified green \nmodel differ by about a factor of 0.7 (Fig. 4b). The rms buoyancy frequency also differs by a factor \nof 0.7 between the unstable and the green stratified models, while being similar to the unstable \nvalue for the magenta stratified model (Fig. 4c). \nThe differences between the unstable and stratified models yield a theoretical difference in \nturbulent kinetic energy dissipation rate by a factor of 0.75 = 1/5.6 following (A1). Due to finite \nsampling and edges the practical factor between the models amounts about 1/5.5. \nThe profiles of turbulence dissipation rate (Fig. 4d) show a vertically symmetric and smooth \nshape for the unstable model with low values in the middle and high values at the edges. The \nstratified models result in vertically more distributed dissipation values, albeit with shorter scale \nvariations resulting in less smooth profiles. These two characteristic differences between unstable \nand stratified models is also seen in observed single profiles from the two periods in Fig. 3b, of \nwhich the unstable profile is replotted in Fig. 4d. Since there is no expected difference in (long-\nterm) average geothermal heat flux at a particular location affecting turbulence in waters with or \nwithout overlying stratification across the range of convection, a correction is sought for dissipation \nrate values of the unstable model. \nThe applied correction removes values larger than a proposed threshold of 5.5GH from the \nmean, where we use dissipation rate by geothermal heat flux (5). This corresponds to a mean \nturbulence dissipation rate from displacement values between approximately 30 < h < 75 m in Fig. \n4d, for the unstable profiles of both the model and the single observed profile. Applying this \n\n\n \n13\ncorrection to the data calculated from Fig. 1a gives the cyan time series of mean dissipation rate \nvalues in Fig. 1b. Its time mean value of 1.2510-10 m2s-3 is a reduction by a factor of 11 to the \nmean of black time series in Fig. 1a. It is close to that of Fig. 1d of 1.2310-10 m2s-3, well within \nerror bounds of 0.710-10 m2s-3.  \nThe above implies that unresolved overturns by too short profiling yield over- rather than under-\nestimates (van Haren, 2023) of turbulence dissipation rate values. The over-estimates can be \ncorrected using the proposed threshold. The comparison with geophysical determined geothermal \nheat flux confirms successful application of reordering method (Thorpe 1977) to establish \nconvection turbulence values in deep-sea waters, as has been demonstrated for near-surface waters \n(Kumar et al. 2021). \n \nAcknowledgments I thank captain and crew of R/V l’Atalante and NIOZ-NMF for their assistance \nduring deployment and recovery and for the construction of the mooring array. I thank M. Stastna \n(Univ. Waterloo, Canada) for providing the ‘darkjet’ colour-map suited for T-sensor data. \n \nFunding This research was supported in part by NWO, the Netherlands Organization for the \nadvancement of science. \n \nData availability Data that support the findings of this study are available from the corresponding \nauthor, upon reasonable request. \n \nConflict of interest The author declares no competing interests. \n\n\n \n14\nAppendix. Moored T-sensor turbulence values \nThe relatively tight relationship (1) implies the moored T-sensor data may be used as a proxy for \ndensity variations and in which salinity contributions are implicitly incorporated. The relationship \nis used to calculate turbulence values following the method of reordering unstable data-points to \nmonotonously stable vertical profiles (Thorpe, 1977). Turbulent overturns follow reordering every \n2 s the 109-m high potential density profile σ2(z) into a stable monotonic profile σ2(zs). \nDisplacements d = min(|z-zs|)sgn(z-zs) are calculated necessary for generating the reordered stable \nprofile. The turbulence kinetic energy dissipation rate reads,  \n = 0.64d2N3,                                                                                                                         (A1) \nwhere buoyancy frequency N is computed from each of the reordered, essentially statically stable, \nvertical density profiles.  \nThe numerical constant follows from empirically relating the root-mean-square (rms) \noverturning scale drms = (d2/n)0.5 over n samples with rms-Ozmidov scale \nLO = (/N3)rms  \n \n \n \n \n \n \n \n \n     \nof largest isotropic turbulence overturns in a stratified fluid as an average over many realizations \nvia the ratio: LO/drms = 0.8 (Dillon, 1982). This ratio reflects turbulence in any high Reynolds \nnumber stably stratified environment like the deep-sea, in which shear-driven and convection-\nturbulence intermingle at small and large scales and are difficult to separate. In all cases, the \nmechanical turbulence must work against the stratification that follows from the reordering. It has \nthus successfully been applied for mainly convection-turbulence (e.g., Chalamalla and Sarkar 2015; \nKumar et al. 2021) while first used for mainly shear-turbulence (Thorpe 1977). The method works \nfor convection-turbulence, provided sufficient stratification exists in the observed profile above \nand/or below, for complete reordering. As outlined in this note, incompletely reordered unstable \noverturns yield overestimates of turbulence values, for example in moored instrumentation of \nlimited vertical range. \n\n\n \n15\nIn (A1), individual d are used rather than taking their rms-value across a single overturn as \noriginally proposed by Thorpe (1977). The reason is that individual overturns cannot easily be \ndistinguished, first, because they are found at various scales with small ones overprinting larger \noverturns, and second, because some overturns exceed the range of T-sensors. For quantification \nof turbulence values, ‘sufficient’ averaging is required, also to include various turbulence types of \ndifferent scales and different age with potentially different LO/drms-ratio (Chalamalla and Sarkar, \n2015) during a turbulent overturn lifetime. While shipborne vertical profiling instruments limit to \nvertical data averaging, indicated by [.], the advantage of a densely instrumented mooring line is \nalso averaging data over time, indicated by <.>. \n \n \n\n\n \n16\nReferences \nAlford MH, Wynne-Cattanach B, Le Boyer A, Couto N, Voet G, Spingys CP, Fernandez Castro B, \nForryan A, Naveira Garabato AC, van Haren H (2024) Buoyancy flux and mixing efficiency \nfrom direct, near-bottom turbulence measurements in a submarine canyon. J Phys Oceanogr \naccepted \nBrainerd KE, Gregg MC (1995) Surface mixed and mixing layer depths. Deep-Sea Res I 42:1521-\n1543 \nChalamalla VK, Sarkar S (2015) Mixing, dissipation rate, and their overturn-based estimates in a \nnear-bottom turbulent flow driven by internal tides. J Phys Oceanogr 45:1969-1987 \nDalziel SB, Patterson MD, Caulfield CP, Coomaraswamy IA (2008) Mixing efficiency in high-\naspect-ratio Rayleigh-Taylor experiments. Phys Fl 20:065106 \nDillon TM (1982) Vertical overturns: a comparison of Thorpe and Ozmidov length scales. J \nGeophys Res 87:9601-9613 \nFerron B, Bouruet Aubertot P, Cuypers Y, Schroeder K, Borghini M (2017) How important are \ndiapycnal mixing and geothermal heating for the deep circulation of the Western \nMediterranean? Geophys Res Lett 44:7845-7854. doi:10.1002/2017GL074169 \nGayen B, Hughes GO, Griffiths RW (2013) Completing the mechanical energy pathways in \nturbulent Rayleigh-Bénard convection. Phys Rev Lett 111:124301 \nGregg MC, D’Asaro EA, Riley JJ, Kunze E (2018) Mixing efficiency in the ocean. Annu Rev Mar \nSci 10:443-473 \nIOC, SCOR, IAPSO (2010) The international thermodynamic equation of seawater – 2010: \nCalculation and use of thermodynamic properties. Intergovernmental Oceanographic \nCommission, Manuals and Guides No. 56, UNESCO, Paris \nKumar BP, D’Asaro E, Sureshkumar N, Rao EPR, Ravichandran N (2021) Thorpe turbulence \nscaling in nighttime convective surface layers in the North Indian Ocean. J Phys Oceanogr \n51:3203-3216 \n\n\n \n17\nKunath P, Chi W-C, Berndt C, Liu C-S (2021) A rapid numerical method to constrain 2D focused \nfluid flow rates along convergent margins using dense BSR-based temperature field data. J. \nGeophys. Res. Solid Earth 126:e2021JB021668. \nLi S, Li H (2006) Parallel AMR code for compressible MHD and HD equations. T-7, MS B284, \nTheoretical \ndivision, \nLos \nAlamos \nNational \nLaboratory. \nhttps://citeseerx.ist.psu.edu/pdf/03e1663486594ce991cc4bbdffa031dbbeb3ab33. Accessed 14 \nDecember 2024 \nLombardo CP, Gregg MC (1989) Similarity scaling of viscous and thermal dissipation in a \nconvecting surface boundary layer. J Geophys Res 94:6273-6284 \nNg CS, Ooi A, Chung D (2016) Potential energy in vertical natural convection. Proc 20th Australas \nFl Mech Conf, 727 (pp 1-4) \nPasquale V, Verdoya M, Chiozzi P (1996) Heat flux and timing of the drifting stage in the Ligurian–\nProvençal basin (northwestern Mediterranean). J Geodyn 21:205-222 \nThorpe SA (1977) Turbulence and mixing in a Scottish loch. Phil Trans Roy Soc Lond A 286:125-\n181 \nvan Haren H (2022) Thermistor string corrections in data from very weakly stratified deep-ocean \nwaters. Deep-Sea Res I 189:103870  \nvan Haren H (2023). Direct observations of general geothermal convection in deep Mediterranean \nwaters. Ocean Dyn 73:807-825. \n \n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21254v1.pdf",
    "total_pages": 17,
    "title": "Corrected values of turbulence generated by general geothermal convection in deep Mediterranean waters",
    "authors": [
      "Hans van Haren"
    ],
    "abstract": "A correction by a reduction factor O(100) is proposed for previously\ncalculated turbulence values on unresolved convection-overturns induced by\ngeneral geothermal heating in the deep Western Mediterranean. The correction\nincludes modified application of reordering method for calculating turbulence\nvalues in convection turbulence with and without stratification above or below.\nThe result is improved correspondence between geophysical determined heat flow\nthrough the seafloor and turbulence kinetic energy dissipation rate determined\nfrom high-resolution temperature sensors moored over 109 m in the overlying\nwaters, with an average mixing coefficient of 0.5.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}