{
  "id": "arxiv_2502.20553v1",
  "text": "Draft version March 3, 2025\nTypeset using LATEX default style in AASTeX631\nOrbital inclination of astrometric binaries and the dearth of face-on orbits in Gaia DR3 solutions\nValeri V. Makarov1\n1U.S. Naval Observatory, 3450 Massachusetts Ave NW, Washington, DC 20392-5420, USA\nABSTRACT\nThe orbital solutions for astrometric (unresolved) binary stars provided in the Gaia mission Data\nRelease 3 reveal an obvious deficit of face-on orbits with line-of-sight inclinations close to 0 or π.\nThis is shown to be an intrinsic mathematical feature of the orbit estimation technique involving the\nintermediate Thiele-Innes parameters, which are transformed to the Campbell geometric parameters.\nA direct condition equation defining the inclination angle via the Thiele-Innes values independently of\nthe other orbital elements is used to investigate the origin of this near-degeneracy for face-on orbits.\nThe emerging bias and correlation of inclination and semimajor axis are illustrated using Monte Carlo\nsimulations for two specific template configurations representing face-on and edge-on orbits.\nThe\nresults have significant impact on the interpretation and follow-up confirmation of Gaia-detected binary\nsystems, including candidate exoplanets and brown dwarf companions.\nKeywords: Astrometric binary stars (79), Orbit determination (1175), Orbital elements (1177), Sub-\nstellar companion stars (1648), Gaia (2360), Inclination (780)\n1. INTRODUCTION\nAstrometric binary stars are detected from their apparent nonlinear motion in the local sky plane, which combines\nwith the standard five-parameter astrometric model of stationary position, parallax, and proper motion of a chosen\nreference epoch.\nIn the pre-space era of astrometry, a massive effort has been spent to characterize the orbital\nelements of the nearest and sufficiently well-resolved binaries using position measurements in the imaging mode or\nspeckle interferometry (Hartkopf et al. 2001; Mason et al. 2001; Tokovinin 2024, and references therein). The observed\ntrajectories in the sky plane projection are ellipses, whose centers coincide with the direction to the orbit’s centers.\nThe foci, on the other hand, are displaced from the true positions, so the distribution of mass cannot be determined\nfrom the projected trajectory. Traditionally, orbit characterization employed the methods of differential astrometry\n(i.e., position measurements of one companion relative to the other), while the basic five parameters (including the\nimportant parallax) were separately estimated via absolute astrometry or by indirect means.\nThe advent of space astrometry dramatically broadened the scope of astrometric exploration of binary stars by\nincluding unresolved pairs, where only one of the components is visible or the optical photocenter of a closely separated\npair is observed. The orbit fitting becomes more complex involving all 12 unknowns (five astrometric parameters and\nseven orbital elements) within a single adjustment in the absolute astrometry regime (ESA 1997). This nonlinear orbit\nadjustment is only possible when the orbital period is not much longer than the time span of the astrometric mission.\nComplete orbit quantification is not possible for long-period binaries, and the range of estimable physical parameters\nis limited to general statistical probabilities (Chae 2024), rough statistical limits on the mass of invisible companions\n(Makarov & Kaplan 2005), and, in some cases, approximate mass ratios of nearby resolved systems (Makarov &\nFabricius 2021).\nOrbital inclination i has a special place in the set of orbital elements. It is needed to estimate the mass of the\noften invisible companion. The spectroscopic method using the radial velocity (RV) variations of the primary can\nonly yield the minimum or projected mass of the companion M2 sin i. The combination of the previously available\nCorresponding author: Valeri V. Makarov\nvaleri.makarov@gmail.com\narXiv:2502.20553v1  [astro-ph.SR]  27 Feb 2025\n\n\n2\nMakarov\nprecision RV series with the Gaia astrometric solutions is essential to pinpoint the secondary masses for numerous\nsubstellar candidates and separate real brown dwarfs from stellar systems with low-inclination orbits (Unger et al.\n2023).\nNearly face-on systems are of special significance because they are the main contaminants in RV-selected\nsamples of candidate low-mass companions. The aim of this Letter is to reveal the underlying mathematical origin\nof the bias in inclination and semimajor axis estimation for astrometric binaries arising in the most commonly used\ntechnique of orbit quantification from only astrometric measurements in the tangential plane. A condition equation\ndirectly linking the cosine of inclination to the intermediate Thiele-Innes values is spelled out in Section 2, and its\nsingularity for face-on orbits is discussed. In Section 3, a brief review of the Gaia orbital solutions is given, which is\nknown to show an anomalous distribution of estimated inclinations contradicting the expected isotropic distribution\nof orbital axes (Gaia Collaboration et al. 2023a). Two specific orbits from Gaia are analyzed in Sections 4 and 5,\nwith nominal parameters corresponding to nearly edge-on and nearly face-on orbits, respectively. Extensive Monte\nCarlo simulations reveal a catastrophic bias in the emerging estimates of inclination for the face-on configuration and\na relatively moderate bias in the apparent orbit size. Discussion of the implications for the ongoing efforts to confirm\nexoplanets, brown dwarfs, and other interesting objects in the vast collection of Gaia astrometric binaries is proposed\nin Section 6.\n2. ORBITAL INCLINATION FROM THIELE-INNES PARAMETERS\nThe equations for Thiele-Innes parameters are given in many textbooks and publications (e.g., Heintz 1978; Green\n1985). They correspond to the components of the orbital position vector rotated from the frame defined by the orbital\nplane and the orbital momentum vector to the local celestial frame defined by the line of sight and the tangent plane.\nThe specific functional form corresponds to the traditional for dynamical astronomy 3-1-3 sequence of Euler rotations\nby angles −Ω, −i, and −ω. The transformation is not completely unique, with known ambiguities emerging for zero\neccentricity and face-on orbits. Are there alternative methods of geometrical orbit presentation that are free of internal\ndegeneracies? The quaternion representation provides a healthy alternative minimizing the number of trigonometric\nfunctions and strongly nonlinear optimization loops (Makarov et al. 2022), but this option has hardly been explored\nin the astronomical literature.\nThe derivation of the orbital elements a, Ω, ω, and i in the Gaia DR3 solution is described by Halbwachs et al.\n(2023, Appendix A). It starts with the direct computation of a using the following equation from Binnendijk (1960):\na =\nq\nu/2 +\np\n(u/2 −v)(u/2 + v),\n(1)\nwhere\nu = A2 + B2 + F 2 + G2\nv = A G −B F\n(2)\nThe remaining parameters are computed in steps using rather complicated procedures, with i emerging at the end\nafter all the other parameters have been fixed. The formal uncertainties are estimated from the given formal errors\nof the along-scan position (abscissa) measurements via the rather involved approximate algorithm using the partial\nderivatives of the unknown values with respect to the abscissa (Goldin & Makarov 2006). We note that this computation\nis based on the first-order approximation of the Taylor expansion and is adequate only for relatively small measurement\ndispersion and unbiased estimators.\nHere, we note, for the first time to my knowledge, that the inclination value can be directly computed from the TI\nelements via the following equation:\ncos i + sec i ≡w = u\nv ,\n(3)\nindependently of other geometric angles and a. A related equation in a more complicated form is given by Emelyanov\n& Kondratyev (2022). For a new variable c ≡cos i, the explicit solution of this equation furnishes two roots, c1 =\n(w −\n√\nw2 −4)/2 and c2 = (w +\n√\nw2 −4)/2. Both roots are real because w can be positive and w ≥2 or negative and\nw ≤−2, which trivially follows from the pair of inequalities (A −G)2 + (B + F)2 ≥0 and (A + G)2 + (B −F)2 ≥0.\nValues of w between −2 and +2 are not possible for any combination of TI values. However, only one of the roots\nyields a real-valued inclination angle i. Specifically, c1 should be taken for a positive w (cos i > 0), and c2 should be\ntaken for a negative w (cos i < 0).\n\n\nOrbital inclination of astrometric binaries\n3\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\n-10\n-5\n0\n5\n10\nrad\n\nFigure 1. Dependence of w = cos i + sec i on the inclination angle i. Note the flatness of the curves around i ∼0 and i ∼π.\n0\n50\n100\n150\n0\n500\n1000\n1500\n2000\ni deg\nnumber per bin\nFigure 2. Histogram of estimated orbital inclination angles i for 1.35 million Gaia DR3 astrometric binaries (gray-shaded\narea). The orange curve shows the expected PDF for random isotropic orientation of obits.\nFig. 1 shows the functional dependence of w on i. The curves become steep in the vicinity of i = π/2, which\ncorresponds to an edge-on orbit, and quite flat toward the marginal values 0 and π (counterclockwise and clockwise\nface-on orbits). Since the w value is determined from observations with a certain dispersion of measurements, which is\none-sided at 0 and π, this feature has a profound effect on the bias and confidence intervals of the estimated inclination\nvalues. Its origin is in the nearly singular dependence of cos i on w:\ndc\ndw =\nc\n2 c −w.\n(4)\nThis derivative tends to infinity when |c| →1.\n3. ORBITAL INCLINATIONS IN GAIA DR3 SOLUTIONS\nThe third Gaia mission release (Gaia Collaboration et al. 2016, 2023b) included a dozen catalogs for various types\nof binary models under the common name non-single stars (NSS). In the Vizier database, this collection is available\nin the folder I/357. The largest catalog by far is I/357/tbooc, which includes 1.35 million objects. The entries have\nmeasured mean positions, proper motions, and parallaxes computed with the extended 12-parameter model. The Gaia\nsolution provided the period, eccentricity, periastron epoch, and three or all four TI elements. The derived quantities\ninclude the projected semimajor radius a0, inclination i, and the Euler angles Ωand ω. This collection of candidate\nastrometric binaries surpasses the previous samples in size by orders of magnitude.\nExamination of sample distributions reveals interesting facts about this collection. The histogram of the orbital\nperiods P is generally bell-shaped with large undulations of technical nature. If we account for the large deficit of\nperiods around 1 yr and a smaller deficit around 2 yr caused by the poor conditioning of the 12-parameter model\n\n\n4\nMakarov\n(essentially, a positive correlation between parallax and orbital excursion), the overall shape is well approximated\nby an Extreme Value distribution with location value 1.21 yr and scale parameter 0.6 yr.\nThe histogram of the\n“geometric” mass mgeom ≡(a0/ϖ)3/P 2, which is a substitute for the true total mass of the binary in M⊙, shows a\nflat peak between 0 and 0.05 and a significant pileup or secondary peak at ∼0.004 M⊙. The latter may be seen as\nthe presence of a large population of super-Jupiters orbiting Gaia stars with periods 1–3 yr. Objects with the largest\nmgeom are prime candidates for stellar mass black holes (StMBH), and the four candidates with mgeom > 2.8 M⊙\ninclude the three Gaia BH systems confirmed by follow-up observations. Objects with the smallest mgeom are in the\nfocus of the exoplanet research community. While the overall empirical distribution of eccentricity is a bell-shaped\nfunction peaking at 0.25, the subset with low mgeom < 0.001 M⊙has a modal value around 0.4.\nFor this study, of special interest is the distribution of orbital inclination angles, which is shown in Fig. 2. There\nis a striking difference between the empirical histogram (gray-shaded area) and the expected isotropic distribution\nof orbital axes (orange curve), which is proportional to sin i. This anomalous histogram was discussed and analyzed\nin (Gaia Collaboration et al. 2023a). The empirical PDF is concave with a shallow dip around 90◦, two symmetric\nbumps at 40◦and 140◦, and a deficit of objects with inclinations around 0 and 180◦. The authors, using simplified\nMonte Carlo simulations with a fixed orbit size, eccentricity, and periastron argument set to zero, conclude that “The\napparent dearth of face-on configurations for Orbital solutions (Fig. 11) is therefore the consequence of extracting the\nThiele-Innes parameters A, B, F, G from noisy data”. In this Letter, we will reveal the true origin of the feature,\nwhich is the singularity in the transformation of the Thiele-Innes parameters to the Campbell element i.\n4. AN EDGE-ON ORBIT\nWe investigate a specific case when the nominal TI values correspond to a nearly edge-on orbit. As a template case\nfor this option, we select a poorly investigated binary Gaia DR3 6422387644229686272 = WDJ201221.17−703642.44,\nwhich has been vetted as a white dwarf based on the results from Gaia DR2 (Gentile Fusillo et al. 2019; Torres\net al. 2019). The estimated (via stellar models for purely hydrogen and helium compositions) effective temperature is\napproximately 5800 K, and the mass with the updated photometry from Gaia DR3 is within 0.45 M⊙(Gentile Fusillo\net al. 2021; Vincent et al. 2024). The object evaded the searches of nearby white dwarfs because of its relatively low\ntemperature and reddish color, which probably indicate an old age. With the orbital solution values of 19.5 ± 0.1 mas\nfor parallax, a0 = 2.62 ± 0.07 mas for semimajor axis, and period P = 416 ± 2 d, the mass of the companion comes\nup to 0.081 M⊙. This suggests the companion to this white dwarf is a borderline brown dwarf. With the nominal\ni = 94.9◦±1.6◦, the expected semiamplitude of radial velocity wobble from the companion is 3.69 km s−1. This should\nbe detectable with modern-day spectrographs.\nFor verification, Eqs. 1 and 3 are used to compute a0 and i directly from the nominal TI values specified in the\nGaia catalog. The results are identical to the cataloged values: i = 94.904688◦and a = 2.6215323 mas. Instead of\nthe imprecise and elaborate procedure to estimate the errors (or confidence intervals) of these values used by the Gaia\nconsortium, we perform Monte Carlo simulations capitalizing on the fastness and accuracy of these equations. In all,\n25,000 random realizations of the TI set {A, B, F, G} are generated by normally distributed random numbers with the\nnominal values as the means and the specified formal errors as the standard deviations. For each realization, a pair\nof orbital elements {i, a} is computed. The resulting 2D sample distribution can be used to estimate the maximum\nlikelihood values of these elements and the robust estimates of their uncertainty. The histograms of Monte Carlo (MC)\nsamples are shown in Fig. 3. The bell-shaped histograms, which are in fact not Gaussian because of the enhanced tails,\nare fairly symmetric around their mean values imc = 94.38◦and amc = 2.77 mas. The means are not too different from\nthe nominal solution values in this case. A significant difference is found for the dispersion of the Monte Carlo sample\nin inclination, which comes up to 3.65◦against the estimate 1.6◦given in the Gaia solution. The MC estimate of the\nstandard deviation of a0 at 0.67 mas is even more discrepant with the Gaia value 0.07 mas. Thus, for a nominally\nedge-on configuration at a comfortably high signal-to-noise ratio, we find strongly underestimated uncertainties of\norbit size and inclination angle, but no evidence of a significant bias.\nThe published orbital solutions do not provide any information about correlations between the orbital parameters.\nReliable uncertainties and covariance of a and i are especially important for risk assessment and target selection in\nspectroscopic follow-up observation of candidate low-mass companions. The MC simulation of nominal high-inclination\nsolutions starting with the given TI values and their uncertainties can partially address this problem. Fig. 4 shows\nthe 2D distribution of 25,000 trial MC solutions as a cloud of orange points. Obviously, this distribution is not axially\nsymmetric, and the normally assumed bivariate Gaussian density is a bad hypothesis even for this high-SNR case.\n\n\nOrbital inclination of astrometric binaries\n5\n70\n80\n90\n100\n0\n500\n1000\n1500\ni deg\nnumber per bin\n1\n2\n3\n4\n5\n0\n200\n400\n600\n800\na mas\nnumber per bin\nFigure 3. Histograms of inclination angles imc (left plot) and amc for the nominal set of TI values from the Gaia DR3 solution\nfor Gaia DR3 6422387644229686272 = WDJ201221.17−703642.44, which corresponds to a nearly edge-on orbit (i = 94.9◦and\na = 2.62 mas). Each MC sample includes 25,000 simulations.\n80\n85\n90\n95\n100\n105\n1\n2\n3\n4\ni deg\na0 mas\nFigure 4. 2D distribution of 25,000 MC-simulated solutions for apparent orbital size a0 and inclination i obtained from the\nnominal Thiele-Innes values and their formal uncertainties in Gaia DR3 (orange dots). The median values of these parameters\nin bins of 100 trials sorted by i are shown with the solid stepwise black curve. The {0.16, 0.84} quantile values for the same bins\nare represented by the black dashed lines.\nThe solid black curve represents the binned median a0 versus median i, and the dashed lines show the {0.16, 0.84}\nquantile interval (the robust alternative to ±1σ interval). The mean value of i corresponds to the statistically highest\nestimates of a0, while possible solutions away from 94◦result in smaller orbit size estimates. Using the empirical MC\nresults, a user can accurately compute the probability that the nominal configuration corresponds to a radial velocity\nsignal above a certain threshold.\n5. A FACE-ON ORBIT\nThe deficit of face-on orbits is so pronounced in the Gaia DR3 solution that we find only four stars (out of 1.35\nmillion) in the general catalog with nominal i < 3◦. One of these stars is Gaia 1988288559178163840 with the cataloged\ni = 2.63◦, a = 0.467 mas. Using the given values of TI elements, we generate 25,000 MC simulations perturbing each\nelement by an independent random number from a Gaussian distribution with the specified standard deviation. Using\nEqs. 1 and 3, identical solutions are obtained for the “exact” values of TI elements. The output of MC simulations\npaints a drastically different picture from the previous example.\nFig. 5 shows the MC-generated distributions of inclination and semimajor axis. Although the sample distributions\nare still bell-shaped, the emerging values are heavily biased with respect to the nominal solution.\nThe empirical\nmean(std) values from the MC sample are 47.3◦(13.3◦) for inclination and 0.579(0.094) mas for semimajor axis. The\nbias in a is larger that 1σ, while all the 25,000 MC estimates miss the nominal i completely. This means that a binary\n\n\n6\nMakarov\n0\n20\n40\n60\n80\n100\n0\n200\n400\n600\n800\n1000\n1200\n1400\ni deg\nnumber per bin\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1.0\n0\n500\n1000\n1500\na mas\nnumber per bin\nFigure 5. Histograms of inclination angles imc (left plot) and amc for the nominal set of TI values from the Gaia DR3 solution\nfor star 1988288559178163840, which corresponds to a nearly face-on orbit (i = 2.63◦, a = 0.467 mas). Each MC sample includes\n25,000 simulations.\nwith the true inclination and TI values as given, corresponding to a nearly face-on orientation, would almost certainly\nend up with a high estimate of inclination around 45◦, and a significantly larger a than the correct value. A 2D plot\nof the MC {a, i} estimates reveals that these parameters are also statistically correlated, so that a higher inclination\nis associated with a longer a. The Spearman’s correlation is computed at 0.4.\n6. CONCLUSIONS AND DISCUSSION\nA more direct and simple method of computing the orbital inclination angle i from a given set of four TI values\nis proposed via Eq. 3. The mathematical problem in question involves four condition equations and four unknowns\nand is almost everywhere exactly determined (except for the well-known degeneracy between ω and Ωat e = 0).\nHowever, the new method is quite useful for performing massive Monte Carlo or MCMC simulations of the nonlinear\ntransformation of TI values to the corresponding orbital elements, which reveal the hidden biases, correlations between\nthe solution results, and robustly estimated uncertainties.\nEq. 3 is sufficient to compute a unique value of i between 0 and π, which is identical to the results obtained with other\nalgorithms, including the one used by the Gaia processing team. Being independent of the other orbital parameters,\nit contains complete information about the distribution of estimated i. To reveal this information, a Monte Carlo\nsimulation can be performed for each set of TI values. The character of the characteristic function w = cos i + sec i\n(Fig. 2) explains the shape of the sample distribution of Gaia-estimated inclinations with a pronounced dearth of\nvalues close to 0 and π, i.e., of face-on orbits. In this domain, w is nearly constant for a wide range of i. This makes\nthe gradient d cos i/dw practically singular, which, combined with the one-sided dispersion of w due to measurement\nerrors, results in a catastrophic bias.\nThe numerical experiments presented in (Gaia Collaboration et al. 2023a) have shown that the magnitude of the\nbias in cos i depends on the SNR of the intermediary TI estimates. These results did not reveal the cause of the face-on\ndeficit, nor the related bias in the estimated orbit size and the intrinsic correlation of i and a. The problem facing\nthe specialists and users of astrometric binary solutions is therefore of more immediate mathematical kind than to\njust collect more measurements and improve the SNR of the TI elements. We have to look for viable alternatives to\nthe TI method of orbit quantification. The practical convenience of linear equations linking TI parameters with star\nabscissae should perhaps be sacrificed to avoid the singularity of the inclination solutions.\nThe conclusions of this study are relevant for the ongoing effort to verify and confirm the most interesting Gaia-\ndetected binaries. The two analyzed cases represent the range of geometric configurations with nominally near-face-on\nand edge-on orbits. Gaia DR3 6422387644229686272 = WDJ201221.17−703642.44 is a recently detected field white\ndwarf at the bottom of the cooling sequence with possibly a brown dwarf companion. It is used in this study as a\nfavorable template case of nearly edge-on solution with high SNR. MC simulations were used to probe for the actual\ndispersion and bias at the TI to {i, a} transformation step. These simulations reveal a relatively small bias in i and a\nbut a critically underestimated uncertainty of a0 listed in the catalog (0.67 mas against 0.07 mas). The distribution of\nMC trials demonstrates a complex, asymmetric structure and a pronounced correlation between the estimated orbit\n\n\nOrbital inclination of astrometric binaries\n7\nsize and inclination (Fig. 4). It shows that the expected radial velocity amplitude for this object is more likely to be\nsmaller than the estimated value from the nominal solution.\nTo investigate the empirical deficit of low inclination angles, similar MC simulations were performed for one of the\nfew stars with a nominal face-on orbit. The available TI values were used as the true means, and the TI values were\nperturbed by a Gaussian random number according to the given standard deviations. The emerging sample distribution\nof i is catastrophically biased, so the assumed true value is practically never realized. The simulated sample mean\ninclination is 47.3◦, which matches very well with one of the symmetric peaks in the histogram of estimated i (Fig.\n2). Therefore, this enhancement of intermediate inclination angles includes biased face-on configurations. The bias\nis not an error in the Gaia processing of astrometric binaries but a mathematical feature intrinsic to the TI method.\nIt is caused by the singularity of the explicit equation representing the transformation of the TI parameters to i.\nUnfortunately, it is not possible to back-engineer the maximum likelihood {i, a} parameters given a set of TI values\nand estimated bias. The users of the astrometric binary catalog should keep in mind the possibility of a large error in\nthe estimated i and a positively correlated, but relatively smaller, bias in a.\nThe intrinsic poor condition of inclination reconstructed from TI values for face-on configurations is a complicating\nfactor for the efforts to verify the trove of new astrometric binaries detected by Gaia. Marcussen & Albrecht (2023)\ninvestigated a sample of six candidate exoplanet systems from the vast Gaia DR3 collection. While three systems\nturned out to be double-lined spectroscopic binaries (an anticipated source of false positives due to the photocenter\neffect), two other objects were confirmed, albeit with greatly smaller RV amplitudes than the Gaia prediction. In\ntotal, half of the systems with available RV data revealed inconsistencies between the magnitude of RV signals and\nthe Gaia-estimated inclinations. These cases are manifestations of the bias in inclinations revealed by our analysis.\nThe same feature fully explains the inverted S shapes in the comparison of inclinations derived from Campbell and TI\nparameters for astrometric-spectroscopic binaries (Jancart et al. 2005, their Figs. 7 and 10).\nACKNOWLEDGEMENTS\nThis work has made use of data from the European Space Agency (ESA) mission Gaia (https://www.cosmos.esa.\nint/gaia), processed by the Gaia Data Processing and Analysis Consortium (DPAC, https://www.cosmos.esa.int/web/\ngaia/dpac/consortium). Funding for DPAC has been provided by national institutions, in particular the institutions\nparticipating in the Gaia Multilateral Agreement. This research has made use of the VizieR catalogue access tool, CDS,\nStrasbourg, France (Ochsenbein 1996). The original description of the VizieR service was published in Ochsenbein\net al. (2000).\nREFERENCES\nBinnendijk, L. 1960, Properties of Double Stars\n(Philadelphia: University of Pennsylvania Press),\ndoi: doi:10.9783/9781512800364\nChae, K.-H. 2024, ApJ, 972, 186,\ndoi: 10.3847/1538-4357/ad61e9\nEmelyanov, N. V., & Kondratyev, B. P. 2022, Icarus, 383,\n115060, doi: 10.1016/j.icarus.2022.115060\nESA, ed. 1997, ESA Special Publication, Vol. 1200, The\nHIPPARCOS and TYCHO catalogues. Astrometric and\nphotometric star catalogues derived from the ESA\nHIPPARCOS Space Astrometry Mission\nGaia Collaboration, Prusti, T., de Bruijne, J. H. J., et al.\n2016, A&A, 595, A1, doi: 10.1051/0004-6361/201629272\nGaia Collaboration, Arenou, F., Babusiaux, C., et al. 2023a,\nA&A, 674, A34, doi: 10.1051/0004-6361/202243782\nGaia Collaboration, Vallenari, A., Brown, A. G. A., et al.\n2023b, A&A, 674, A1, doi: 10.1051/0004-6361/202243940\nGentile Fusillo, N. P., Tremblay, P.-E., G¨ansicke, B. T.,\net al. 2019, MNRAS, 482, 4570,\ndoi: 10.1093/mnras/sty3016\nGentile Fusillo, N. P., Tremblay, P. E., Cukanovaite, E.,\net al. 2021, MNRAS, 508, 3877,\ndoi: 10.1093/mnras/stab2672\nGoldin, A., & Makarov, V. V. 2006, ApJS, 166, 341,\ndoi: 10.1086/505939\nGreen, R. M. 1985, Spherical Astronomy\nHalbwachs, J.-L., Pourbaix, D., Arenou, F., et al. 2023,\nA&A, 674, A9, doi: 10.1051/0004-6361/202243969\nHartkopf, W. I., Mason, B. D., & Worley, C. E. 2001, AJ,\n122, 3472, doi: 10.1086/323921\nHeintz, W. D. 1978, In: Geophysics and Astrophysics\nMonographs, Vol. 15, Double stars (Springer, Dordrecht),\ndoi: https://doi.org/10.1007/978-94-009-9836-0\nJancart, S., Jorissen, A., Babusiaux, C., & Pourbaix, D.\n2005, A&A, 442, 365, doi: 10.1051/0004-6361:20053003\n\n\n8\nMakarov\nMakarov, V. V., & Fabricius, C. 2021, AJ, 162, 260,\ndoi: 10.3847/1538-3881/ac2ee0\nMakarov, V. V., Goldin, A., Tkachenko, A. V., Veras, D., &\nNoyelles, B. 2022, MNRAS, 513, 2076,\ndoi: 10.1093/mnras/stac962\nMakarov, V. V., & Kaplan, G. H. 2005, AJ, 129, 2420,\ndoi: 10.1086/429590\nMarcussen, M. L., & Albrecht, S. H. 2023, AJ, 165, 266,\ndoi: 10.3847/1538-3881/acd53d\nMason, B. D., Wycoff, G. L., Hartkopf, W. I., Douglass,\nG. G., & Worley, C. E. 2001, AJ, 122, 3466,\ndoi: 10.1086/323920\nOchsenbein, F. 1996, The VizieR database of astronomical\ncatalogues, CDS, Centre de Donn˜A©es astronomiques\nde Strasbourg, doi: 10.26093/CDS/VIZIER\nOchsenbein, F., Bauer, P., & Marcout, J. 2000, A&AS, 143,\n23, doi: 10.1051/aas:2000169\nTokovinin, A. 2024, AJ, 168, 190,\ndoi: 10.3847/1538-3881/ad72e5\nTorres, S., Cantero, C., Rebassa-Mansergas, A., et al. 2019,\nMNRAS, 485, 5573, doi: 10.1093/mnras/stz814\nUnger, N., S´egransan, D., Barbato, D., et al. 2023, A&A,\n680, A16, doi: 10.1051/0004-6361/202347578\nVincent, O., Barstow, M. A., Jordan, S., et al. 2024, A&A,\n682, A5, doi: 10.1051/0004-6361/202347694\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20553v1.pdf",
    "total_pages": 8,
    "title": "Orbital inclination of astrometric binaries and the dearth of face-on orbits in Gaia DR3 solutions",
    "authors": [
      "Valeri V. Makarov"
    ],
    "abstract": "The orbital solutions for astrometric (unresolved) binary stars provided in\nthe Gaia mission Data Release 3 reveal an obvious deficit of face-on orbits\nwith line-of-sight inclinations close to 0 or $\\pi$. This is shown to be an\nintrinsic mathematical feature of the orbit estimation technique involving the\nintermediate Thiele-Innes parameters, which are transformed to the Campbell\ngeometric parameters. A direct condition equation defining the inclination\nangle via the Thiele-Innes values independently of the other orbital elements\nis used to investigate the origin of this near-degeneracy for face-on orbits.\nThe emerging bias and correlation of inclination and semimajor axis are\nillustrated using Monte Carlo simulations for two specific template\nconfigurations representing face-on and edge-on orbits. The results have\nsignificant impact on the interpretation and follow-up confirmation of\nGaia-detected binary systems, including candidate exoplanets and brown dwarf\ncompanions.",
    "published_date": "2025-02-27",
    "source": "arxiv"
  }
}