{
  "id": "arxiv_2502.20982v1",
  "text": "Motion ReTouch: Motion Modification\nUsing Four-Channel Bilateral Control\nKoki Inami\nIntelligent and Mechanical Interaction Systems\nUniversity of Tsukuba\nTsukuba, Japan\ninami.koki.qy@alumni.tsukuba.ac.jp\nSho Sakaino\nSystems and Information Engineering\nUniversity of Tsukuba\nTsukuba, Japan\nsakaino@iit.tsukuba.ac.jp\nToshiaki Tsuji\nScience and Engineering\nSaitama University\nSaitama, Japan\ntsuji@ees.saitama-u.ac.jp\nAbstract—Recent research has demonstrated the usefulness of\nimitation learning in autonomous robot operation. In particular,\nteaching using four-channel bilateral control, which can obtain\nposition and force information, has been proven effective. How-\never, control performance that can easily execute high-speed,\ncomplex tasks in one go has not yet been achieved. We propose\na method called Motion ReTouch, which retroactively modifies\nmotion data obtained using four-channel bilateral control. The\nproposed method enables modification of not only position but\nalso force information. This was achieved by the combination of\nmultilateral control and motion-copying system. The proposed\nmethod was verified in experiments with a real robot, and\nthe success rate of the test tube transfer task was improved,\ndemonstrating the possibility of modification force information.\nIndex Terms—four-channel bilateral control, multilateral con-\ntrol, interactive imitation learning\nI. INTRODUCTION\nIn recent years, imitation learning [1] [2] [3], a learning-\nbased approach that enables robots to imitate human behavior,\nhas been attracting attention. Collecting human motions is\ncalled teaching. Some teaching methods have been proposed.\nThe most simple method is kinesthetic teaching [4]. Kines-\nthetic teaching is a method in which a person holds a robot,\ndirectly controls it, and has the robot carry out a task to convey\nthe trajectory of the robot’s movements. On the other hand, to\nobtain command values in addition to the robot’s trajectory,\nimitation learning with teleoperation has been proposed [5]\n[6]. Imitation learning using four-channel bilateral control has\nalso been proposed as a method for teaching not only position\ninformation but also force infomation [7] [8].\nFour-channel bilateral control [9] is a method of synchro-\nnizing position and force. This method makes it easy to\ncollect human tactile motion data and human operation policy.\nFurthermore, imitation learning with four-channel bilateral\ncontrol can cooperate with humans and handle soft and rigid\nobjects with autonomous operation [10] [11] [12].\nImitation learning needs robot motion data without mis-\ntakes. This is because incorrect motion data will result in\nfailure motion being learned. However, it is difficult to get\nThis work was supported by JSPS KAKENHI Grant Number 24K00905,\nJST, PRESTO Grant Number JPMJPR24T3 Japan and JST ALCA-Next Japan,\nGrant Number JPMJAN24F1. This study was also based on the results\nobtained from the JPNP20004 project subsidized by the New Energy and\nIndustrial Technology Development Organization (NEDO).\na fast or complicated motion using four-channel bilateral con-\ntrol. Although four-channel bilateral control-based imitation\nlearning succeeded in contact-rich tasks, the complexity of\nthe tasks is limited.\nIn order to solve this problem, post-editing of failed data\nis required. This is because it is difficult to achieve fast and\ncomplex movements in one attempt, but if we can correct\nfailures as necessary, we can generate correct motion data.\nIncidentally, multilateral control [13] has been proposed as\na technology to synchronize the positions and forces of three\nor more robots. In addition, a motion-copying system [14]\n[15] [16] has been proposed as a technology to reproduce the\nmotion with four-channel bilateral control.\nIn this paper, we propose a post-editing technology using\na four-channel bilateral control called Motion ReTouch which\ncombines multilateral control and a motion-copying system.\nSpecifically, by incorporating pre-correction data into the\nbilateral control and using multilateral control of three units,\nthe system reflects both past and current operations.\nWe conducted experiment in the real world using a seven-\ndegree-of-freedom (DoF) robot and compared the success rate\nof the motion-copying at 3x speed and the motion-copying\nat 3x speed with Motion ReTouch. We also compared the\nposition and reaction force responses of the two methods. As\na result, the success rate of the test tube transfer task was\nimproved by Motion ReTouch. It was also confirmed that the\nforce information had changed.\nII. RELATED WORK\nA large number of methods to teach human skills have been\nproposed. The most simple method is kinesthetic teaching.\nIt collects the trajectory of the robot as it performs a task.\nTo acquire command values for robots, in addition to the\nresponse, methods acquiring motion data by teleoperation have\nbeen proposed [5] [6]. In addition, teleoperation enables the\ncollection of visual information. This is because it avoids an\nocclusion of the operator and the environment. A teaching\nmethod using virtual reality has also been proposed to make\noperations more intuitive [17]. These methods allow for the\ncollection of position and visual information but do not include\nforce information. Force information can also be obtained by\narXiv:2502.20982v1  [cs.RO]  28 Feb 2025\n\n\nLeader Robot\nFollower Robot\nForce Controller\nPosition Controller\n \n(a) 4-CH Bilateral Control\n \nLeader Robot\nFollower Robot\nCo-Leader Robot\n(b) Multilateral Control\nFollower Robot\nLeader Robot\n(Past Motion Data)\n(c) Motion Copying System\nEditor Robot\nFollower Robot\n(Past Motion Data)\nLeader Robot\n \n(d) Motion ReTouch\nFig. 1: Illustration of Controller\ncollecting motion data using four-channel bilateral control [10]\n[11] [12].\nIn all imitation learning processes, including four-channel\nbilateral control-based imitation learning, it is important to\nobtain correct motion data without errors. However, it is\ndifficult to obtain correct motion data for fast and complex\ntasks.\nShared autonomy control [18] [19] [20] is an approach\nto obtain better motion. Shared autonomy control allows a\ntask to be accomplished with the assistance of a controller.\nIn 4ch bilateral control, it becomes necessary to correct not\nonly position information but also force information. Methods\nfor incorporating shared control into bilateral control have\nbeen proposed [21]. However, these methods need explicit pro-\ngramming, which spoils the advantage of model-free imitation\nlearning\nIn addition, interactive imitation learning [22] [23] has been\nproposed. It is a method of intervening in the behavior of\nimitation learning. A method for interactive imitation learning\nusing multilateral control has also been proposed [24]. In this\nmethod, force control and acceleration control are removed.\nAlthough it is mentioned that training data for the initial model\ncould be obtained through bilateral control, this is not done in\npractice. In the first place, interactive imitation learning cannot\nbe used without data to train the initial model.\nWe believe that changing force information is also im-\nportant, thus in this paper, we propose a method to modify\nmotion data using four-channel bilateral control. This approach\nallowed for the acquisition of fast and complex motion data,\nwhich is difficult to create an initial model.\nIncorporating a virtual leader into multilateral control for\ndistance training has also been proposed [25]. We propose to\napply this system as a means of data editing.\nIII. METHOD\nIn this study, we propose Motion ReTouch, a post-editing\nmethod using four-channel bilateral control.\nFour-channel bilateral control has a position controller and\na force controller. The position controller is called the differ-\nential mode, and the force controller is called the common\nmode. They are used to synchronize the positions and forces\nof the two robots. In the differential mode, the position gap\nbetween two robots approaches zero. In the common mode, the\nforce sum of two robots approaches zero. By making the force\nsum zero, two robots satisfy the law of action and reaction.\nThe illustration of four-channel bilateral control is shown in\nFig. 1(a).\nMultilateral control [13] synchronizes the positions and\nforces of multiple robots. Multilateral control has various\ncombinations of differential mode and common mode. A\ntypical multilateral control system uses the differential mode\nfor every pair of units and the common mode for every unit.\nThe illustration of multilateral control is shown in Fig. 1(b).\nMotion-copying system [14] [15] [16] is a method which\nreproduces the motion data of four-channel bilateral control.\nWhen executing four-channel bilateral control, the position and\nforce command values of the follower robot (i.e. the response\nvalues of the leader robot) are recorded, and the movement\nis reproduced by moving the follower robot according to\nthe recorded command values. The illustration of a motion-\ncopying system is shown in Fig. 1(c).\nWe used multilateral control and a motion-copying system\nto achieve post-editing technology using four-channel bilateral\ncontrol. We prepared the position and force response values of\nthe leader robot, which needed to be corrected and collected\nby four-channel bilateral control. We used a follower robot\nwhich did tasks. In addition, we incorporated another robot to\nreflect the motion changes. We called it “editor robot.” The\nillustration of Motion ReTouch is shown in Fig. 1(d).\nDifferential mode and common mode in Motion ReTouch\nwere defined as follows;\nθres\nl\n= θres\nf\n= θres\ne\n,\n(1)\nτ res\nl\n+ τ res\nf\n+ τ res\ne\n= 0\n(2)\nwhere θres and τ res represent angle and reaction force\nresponse vectors, respectively. The subscripts ⃝l, ⃝f, and\n⃝e represent the leader robot, the follower robot, and the\neditor robot, respectively.\nBecause the goal of the differential mode was to make the\nposition deviation zero, it could also be expressed as follows:\n\n\n＋－\n＋\n＋\n－\n＋\n＋\n－\nFollower Robot\nLeader Robot\n(Past Motion Data)\nEditor Robot\nPosition Controller\nPosition Controller\nPosition Controller\nForce Controller\n＋\n＋\n＋\n－\n－\n＋\n－\n＋\n1-α\n1-α\nα\n＋\nα\nFig. 2: Block Diagram of Motion ReTouch\nθres\nl\n−θres\nf\n= 0,\nθres\nf\n−θres\ne\n= 0,\nθres −θres\nl\n= 0.\n(3)\nThe block diagram of Motion ReTouch is shown in Fig. 2.\n˙θres represents the angler velocity vector. The follower robot\nand the editor robot were robots that actually moved, thus\nthey had inputs and outputs. On the other hand, the leader\nrobot only had outputs, because its values were obtained\nfrom a record of past motion. All robots were assumed to\nbe acceleration-controlled. The leader robot in four-channel\nbilateral control and the editor robot in Motion ReTouch\nshould not touch anything other than the hand that was trying\nto operate it.\nFirst, we considered when no change in motion was nec-\nessary. When the editor robot was not subjected to external\nforces, F res\ne\n= 0 led to F res\nl\n+ F res\nf\n= 0. The follower\nrobot behaved in a way that satisfied the law of action and\nreaction with the leader robot. Furthermore, the position of\nthe editor robot operated based on the internal division point\nbetween the positions of the leader robot and the follower\nrobot. When the positions of the leader robot and the follower\nrobot were synchronized, the positions of the three robots were\nsynchronized. Ideally, the behavior of the follower robot was\nnot affected by the editor robot and was expected to be similar\nto the motion-copying.\nSecond, we considered when motion changes were made.\nWhen human changes were made to the editor robot, the force\nof the follower robot approaches −F res\nl\n−F res\ne\n, according to\n(2). Furthermore, the position of the follower robot approaches\nboth the leader and editor robots according to (3). As a result,\nthe position of the follower robot approaches the internal\ndivision point between the positions of the leader and editor\nrobots. The ratio of internal division is determined by the\nparameter α in Fig. 2. Basically, it takes values between zero\nand one. The closer it is to zero, the higher the rate at which\npast behavior is reproduced. The closer it is to one, the more\nsusceptible it is to changes.\nThe difference between a typical multilateral control and\nMotion ReTouch is that the leader robot is the past motion\ndata. In a typical multilateral control, the positions of all robots\nFig. 3: CRANE-X7 (RT)\nare always synchronized. On the other hand, the position of\nthe leader robot is unaffected in Motion ReTouch while the\npositions of the follower and editor robots change.\nIV. EXPERIMENTAL DESIGN\nA. ROBOT SYSTEM\nFig. 3 illustrates a manipulator, called CRANE-X7, used in\nthe experiments. CRANE-X7 consists of an arm with seven-\nDoF and a gripper with one-DoF. This robot has torque control\nand angle sensors on all joints and the gripper. We adopted\nthe cross-type hand [11] for the gripper. In the following, joint\nnumbers are assigned in order from the base of the robot.\nThe gripper is marked as the eighth joint. The controller and\nhardware parameters are shown in Table I\nWe assumed the dynamics of the manipulator as follows:\nJ ¨θres = τ ref −τ res −D ˙θres −g\n(4)\nwhere J is the inertia matrix, ¨θres is the response vector of the\nangular acceleration, τ ref is the control input vector, τ res is\nthe reaction force vector, D is the viscous friction coefficient\nmatrix, and g is the gravity vector.\nThe inertia matrix J and the viscous friction coefficient\nmatrix D were diagonal matrices and are expressed as follows:\nJ = diag\n\u0002J1, J2, · · · , J8\n\u0003\n,\n(5)\nD = diag\n\u0002\nD1, D2, · · · , D8\n\u0003\n.\n(6)\nThe inertias of the first three joints J1, J2, and J3 are expressed\nas follows:\nJ1 = c2\n2m2 sin2 θ2 + c2\n3m3 sin2 θ2 + 2c3l2m3 sin2 θ2\n−1\n8c2\n4m4{cos(−2θ2 + θ3 + 2θ4) −cos(2θ2 −θ3 + 2θ4)\n+ cos(2θ2 + θ3 −2θ4) −cos(2θ2 + θ3 + 2θ4)}\n+ c2\n4m4 sin2 θ2 sin2 θ3 sin2 θ4 −2c2\n4m4 sin2 θ2 sin2 θ4\n+ c2\n4m4 sin2 θ2 + c2\n4m4 sin2 θ4 −2c4l2m4 sin2 θ2 cos θ4\n+ 2c4l2m4 sin θ2 sin θ4 cos θ2 cos θ3 + Ix,2 sin2 θ2\n+ Ix,3 sin2 θ2 −Iy,2 sin2 θ2 + Iy,2 + l2\n2m3 sin2 θ2\n+ l2\n2m4 sin2 θ2,\nJ2 = c2\n2m2 + c2\n3m3 + 2c3l2m3 −c2\n4m4 sin2 θ3 sin2 θ4\n+ c2\n4m4 −2c4l2m4 cos θ4 + Ix,2 + Ix,3 + l2\n2m3 + l2\n2m4,\nJ3 = c2\n4m4 sin2 θ4\n(7)\nwhere m⃝is the weight of the link, c⃝is the distance from\nthe joint to the center of mass of the link, l2,4 is the distance\n\n\nTABLE I: Controller and Hardware Parameters\nParameter\nValue\nUnit\nKp\nPosition P gain of all joints\n256\nKd\nPosition D gain of all joints\n32.0\nKf\nForce P gain of all joints\n0.7\nm2\nMass of 2nd link\n0.0128\nkg\nm3\nMass of 3rd link\n0.0000\nkg\nm4\nMass of 4th link\n0.4505\nkg\nc2\nCenter of mass of 2nd link\n0.0002\nm\nc3\nCenter of mass of 3rd link\n0.0262\nm\nc4\nCenter of mass of 4th link\n0.2865\nm\nl2,4\nLength between the 2nd and 4th joints\n0.2500\nm\nIx,2\nInertia of 2nd link around x-axis\n0.0197\nkg m2\nIx,3\nInertia of 3rd link around x-axis\n0.0197\nkg m2\nIy,2\nInertia of 2nd link around y-axis\n0.0008\nkg m2\nJ4\nInertia of 4th joint\n0.0370\nkg m2\nJ5\nInertia of 5th joint\n0.0054\nkg m2\nJ6\nInertia of 6th joint\n0.0066\nkg m2\nJ7\nInertia of 7th joint\n0.0049\nkg m2\nJ8\nInertia of 8th joint\n0.0055\nkg m2\nD1\nViscous friction coefficient of 1st joint\n0.0443\nN m s/rad\nD2\nViscous friction coefficient of 2nd joint\n0.2343\nN m s/rad\nD3\nViscous friction coefficient of 3rd joint\n0.0501\nN m s/rad\nD4\nViscous friction coefficient of 4th joint\n0.1820\nN m s/rad\nD5\nViscous friction coefficient of 5th joint\n0.0122\nN m s/rad\nD6\nViscous friction coefficient of 6th joint\n0.0196\nN m s/rad\nD7\nViscous friction coefficient of 7th joint\n0.0170\nN m s/rad\nD8\nViscous friction coefficient of 8th joint\n0.0105\nN m s/rad\nfC1\nCutoff frequency of 1st joint\n10.0\nrad/s\nfC2\nCutoff frequency of 2nd joint\n15.0\nrad/s\nfC3\nCutoff frequency of 3rd joint\n10.0\nrad/s\nfC4\nCutoff frequency of 4th joint\n15.0\nrad/s\nfC5\nCutoff frequency of 5th joint\n90.0\nrad/s\nfC6\nCutoff frequency of 6th joint\n90.0\nrad/s\nfC7\nCutoff frequency of 7th joint\n90.0\nrad/s\nfC8\nCutoff frequency of 8th joint\n90.0\nrad/s\nthe second joint to the fourth joint, and I⃝,⃝is the inertia of\nthe link.\nThe response vector of the angular acceleration ¨θres is\n\u0002¨θres\n1\n, ¨θres\n2\n, · · · , ¨θres\n8\n\u0003T where the second subscript indicates\nthe joint number. Much the same is true of the angle, the\nangler velocity, and reaction torque.\nThe gravity vector is expressed as follows:\ng =\n\u00020, g2, g3, g4, 0, 0, 0, 0,\u0003T\n(8)\nwhere\ng2 = g[c2m2 sin θ2 + m3(c3 + l2) sin θ2\n+ m4{c4 sin θ4 cos θ2 cos θ3\n+ (−c4 cos θ4 + l2 + l3) sin θ2}],\ng3 = −c4gm4 sin θ2 sin θ3 sin θ4,\ng4 = c4gm4(sin θ2 cos θ3 cos θ4 −sin θ4 cos θ2).\n(9)\nThe block diagram of the controller is shown in Fig. 4.\nThe disturbance is represented by τ dis. We used a disturbance\nobserver (DOB) [26] [27] and a reaction force observer\n(RFOB) [28]. We explicitly compensated friction and gravity.\nIn addition, we suppressed other unknown disturbances by\nusing the DOB. The sum of friction compensation, gravity\ncompensation, and output of DOB is represented by ˆτ dis. The\nreaction force was estimated by the RFOB. The estimated\nreaction force is represented by ˆτ res. Moreover, angular\n＋\n＋\n－\n＋\nForce Controller\nPosition Controller\nRobot\nDisturbance Observer\nReaction Force Observer\nFric. & Grav. Comp.\n＋＋\n－\nFig. 4: Block Diagram of Controller\nvelocities were calculated by pseudo-differentiation using the\nvalues obtained from the angle sensor. The command values,\nθcmd, ˙θcmd, and τ cmd, which were input to the position\ncontroller and force controller, were the editor response values\nfor the follower robot controller or the follower response value\nfor the editor robot controller.\nIn the position controller, we used a proportional-derivative\n(PD) controller of position. In the force controller, we used a\nproportional (P) controller of force. The gain of the PD and\nthe P controller, Kp, Kd, and Kf, were determined manually.\nTo estimate the inertia, the viscous friction, and the gravity,\nwe used unilateral control to collect data and calculate inverse\ndynamics, based on the method [29]. This method allowed sys-\ntem identification at frequencies and operating ranges closer\nto practical use. Finally, we performed manual adjustments.\nIn Motion ReTouch, the control inputs τ ref of the follower\nand editor robots were given by the following equations:\nτ ref\nf\n=J\n2 (Kp + sKd){αθres\ne\n+ (1 −α)θres\nl\n−θres\nf\n)}\n−1\n3Kf(τ res\nl\n+ τ res\ne\n+ τ res\nf\n) + ˆτ dis\nf\n,\n(10)\nτ ref\ne\n=J\n2 (Kp + sKd){αθres\nf\n+ (1 −α)θres\nl\n−θres\ne\n)}\n−1\n3Kf(τ res\nl\n+ τ res\nf\n+ τ res\ne\n) + ˆτ dis\ne\n(11)\nwhere s is the Laplace operator.\nWe set the parameter α to 0.5. The control cycle was set to\n500Hz, which was the fastest control cycle of this manipulator.\nThe cutoff frequencies of the low-pass filters of the DOB, the\nRFOB, and the pseudo-differential were the same, and their\nvalues are fC1, fC2, · · · , fC8. We used the same parameters in\nfour-channel bilateral control, Motion ReTouch, and motion-\ncopying.\nB. TASK\nIn this paper, we evaluated the proposed method by moving\ntest tubes from one test tube rack to another. The snapshot\nof the motion is shown in Fig. 5. This task involved some\ncontact when removing and inserting test tubes. The test tube\nused was made of polypropylene and had a diameter of 18\nmm and a length of 180 mm. The test tube rack used had a\nhole diameter of 19 mm and a height of 94 mm. The test tube\nracks were fixed to the desk.\n\n\n(a) Picking Test Tube\n(b) Moving Test Tube\n(c) Inserting Test Tube\nFig. 5: Snapshots of Motion\n0\n1\n2\n3\n4\n5\n6\n7\n8\nTime [s]\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\nAngle [rad]\nw/o Motion ReTouch\nw/  Motion ReTouch\nFig. 6: Angle of 4th Joint\n0\n1\n2\n3\n4\n5\n6\n7\n8\nTime [s]\n−0.9\n−0.6\n−0.3\n0.0\n0.3\n0.6\n0.9\nReaction Torque [Nm]\nw/o Motion ReTouch\nw/  Motion ReTouch\nFig. 7: Reaction Torque of 4th Joint\nWe defined failure as missing or dropping the test tube,\nfailing to insert the test tube, or inserting the test tube at an\nangle.\nC. EXPERIMENTAL STEPS\nFirst, we collected motion data through four-channel bilat-\neral control. In this step, the robot which humans operated was\ncalled a leader robot, the other robot which followed the leader\nrobot was called a follower robot. At this time, the command\nvalues of the follower robot were recorded.\nTo make the movements more difficult, the motion data was\nsped up by three times. This was achieved by skipping every\ntwo lines of the time series data and tripling only the angular\nvelocity command values of the follower robot.\nSecond, we executed Motion ReTouch with the leader robot\n(motion data), the follower robot, and the editor robot. The\ncommand values of the follower robot were recorded.\nFinally, we evaluated the task success rate and the robot’s\nbehavior with and without Motion ReTouch. We performed\nmotion-copying 10 times with and without Motion ReTouch.\nWe also recorded the response value of the follower robot at\nthat time.\nV. RESULT\nIt took 24 seconds to transfer the tubes using four-channel\nbilateral control. We sped up the data by 3x, hence the data\nwas about 8 seconds.\nThe success rate of the experiment is shown in Table II.\nThe success rate of original speed data was 100%. However,\nbecause we sped up the data by 3x, the success rate fell to\n0%. By using Motion ReTouch to correct the 3x speed data,\nTABLE II: Success Rate of Traspoting Test Tube\nOriginal Speed\nMotion\n3x Speed\nw/o Motion\nReTouch\n3x Speed\nw/ Motion\nReTouch\nSuccess Rate\n10/10\n0/10\n10/10\nwe were able to increase the success rate to 100%. It is noted\nthat all of the mistakes were caused by putting the test tubes\nin the wrong position.\nThe response values of position and reaction torque of the\nfourth joint in motion copying are shown in Fig. 6 and Fig. 7,\nrespectively. The mean values obtained from 10 samples\nare shown. The motion data which was sped up by 3x is\nrepresented by the dashed blue line and The motion data which\nwas sped up by 3x and was modified with Motion ReTouch is\nrepresented by the orange line. The variance of the 10 samples\nfor both position and force was small.\nThe position response values did not differ significantly\nbetween the two models. This is because they were based\non the same motion data, and the position information was\nnot significantly rewritten in Motion ReTouch. Although the\nposition trajectory had become slightly smoother with Motion\nReTouch. This may be due to the addition of the editor robot\nand the human operating it, which may have difficulty tracking\nhigh-frequency movements.\nOn the other hand, the reaction torque values were dras-\ntically changed in some places with Motion ReTouch. In\nparticular, we can see that the reaction force of the model with\nMotion ReTouch is stable between 5 and 7 seconds. This was\nthe time when the robot was searching for a place to insert the\n\n\ntest tube. According to the reaction torque values, stabilizing\nthe reaction force when inserting the test may contribute to the\nimproved success rate. On the other hand, there were times\nwhen the force information did not change. This is because\nthe force data was not changed from the original data when\nthe editor robot was not touched.\nVI. CONCLUSION AND LIMITATION\nIn this paper, we proposed Motion ReTouch to modify the\ndata earned with four-channel bilateral control. Motion Re-\nTouch was a combination of multilateral control and a motion-\ncopying system. We realized Motion ReTouch by combining\nthree robots: a virtual leader robot which reproduces motion\ndata obtained by past bilateral control, a follower robot which\nperforms tasks, and an editor robot which makes changes.\nMotion ReTouch made it possible to change not only position\ninformation but also force information. We could improve the\nsuccess rate in the test tube transfer task by Motion ReTouch.\nHowever, Motion ReTouch has several limitations. First,\nMotion ReTouch is unable to make any major changes to the\nposition of the follower robot. This is because one differential\nmode was independent of the others, and there was always a\nforce pulling it back to the original trajectory, and the force\nincreased as the change became larger. As proposed in [24],\nchanging the leader robot to a learned policy can avoid this\nproblem. Second, the operators need to remember the original\ndata of the position and force to modify them. The position\nis relatively easy to remember, but the force information is\ndifficult to remember because it is not visible. Finally, we\nare not yet able to make corrections in the time domain, and\nif the corrections are not made at the right time, there is a\npossibility that the data will be worse. In our future research,\nimprovements are needed to allow for correction in the time\ndirection. Modifications will be easier when only complex\nmovements are performed slowly.\nREFERENCES\n[1] A. Hussein, M. M. Gaber, E. Elyan, and C. Jayne, “Imitation learning: A\nsurvey of learning methods,” ACM Computing Surveys (CSUR), vol. 50,\nno. 2, pp. 1–35, 2017.\n[2] B. Fang, S. Jia, D. Guo, M. Xu, S. Wen, and F. Sun, “Survey of imitation\nlearning for robotic manipulation,” International Journal of Intelligent\nRobotics and Applications, vol. 3, pp. 362–369, 2019.\n[3] A. Attia and S. Dayan, “Global overview of imitation learning,” arXiv\npreprint arXiv:1801.06503, 2018.\n[4] T. Gaˇspar, B. Nemec, J. Morimoto, and A. Ude, “Skill learning and ac-\ntion recognition by arc-length dynamic movement primitives,” Robotics\nand autonomous systems, vol. 100, pp. 225–235, 2018.\n[5] T. Z. Zhao, V. Kumar, S. Levine, and C. Finn, “Learning fine-\ngrained bimanual manipulation with low-cost hardware,” arXiv preprint\narXiv:2304.13705, 2023.\n[6] Z. Fu, T. Z. Zhao, and C. Finn, “Mobile aloha: Learning bimanual\nmobile manipulation with low-cost whole-body teleoperation,” arXiv\npreprint arXiv:2401.02117, 2024.\n[7] T. Adachi, K. Fujimoto, S. Sakaino, and T. Tsuji, “Imitation learning for\nobject manipulation based on position/force information using bilateral\ncontrol,” in 2018 IEEE/RSJ International Conference on Intelligent\nRobots and Systems (IROS), 2018, pp. 3648–3653.\n[8] T. Buamanee, M. Kobayashi, Y. Uranishi, and H. Takemura, “Bi-\nact: Bilateral control-based imitation learning via action chunking with\ntransformer,” in 2024 IEEE International Conference on Advanced\nIntelligent Mechatronics (AIM), 2024, pp. 410–415.\n[9] S. Sakaino, T. Sato, and K. Ohnishi, “Multi-dof micro-macro bilateral\ncontroller using oblique coordinate control,” IEEE Transactions on\nIndustrial Informatics, vol. 7, no. 3, pp. 446–454, 2011.\n[10] A. Sasagawa, K. Fujimoto, S. Sakaino, and T. Tsuji, “Imitation learning\nbased on bilateral control for human–robot cooperation,” IEEE Robotics\nand Automation Letters, vol. 5, no. 4, pp. 6169–6176, 2020.\n[11] K. Yamane, Y. Saigusa, S. Sakaino, and T. Tsuji, “Soft and rigid object\ngrasping with cross-structure hand using bilateral control-based imitation\nlearning,” IEEE Robotics and Automation Letters, vol. 9, no. 2, pp.\n1198–1205, 2024.\n[12] T. Akagawa and S. Sakaino, “Autoregressive model considering low\nfrequency errors in command for bilateral control-based imitation learn-\ning,” IEEJ Journal of Industry Applications, vol. 12, no. 1, pp. 26–32,\n2023.\n[13] S. Katsura, Y. Matsumoto, and K. Ohnishi, “Realization of ”law of action\nand reaction” by multilateral control,” IEEE Transactions on Industrial\nElectronics, vol. 52, no. 5, pp. 1196–1205, 2005.\n[14] Y. Yokokura, S. Katsura, and K. Ohishi, “Stability analysis and exper-\nimental validation of a motion-copying system,” IEEE Transactions on\nIndustrial Electronics, vol. 56, no. 10, pp. 3906–3913, 2009.\n[15] K. Igarashi and S. Katsura, “Motion-data processing and reproduction\nbased on motion-copying system,” IEEJ Journal of Industry Applica-\ntions, vol. 4, no. 5, pp. 543–549, 2015.\n[16] K. Fujisaki and S. Katsura, “Motion-copying system with in-tool sens-\ning,” IEEJ Journal of Industry Applications, vol. 12, no. 4, pp. 793–799,\n2023.\n[17] T. Zhang, Z. McCarthy, O. Jow, D. Lee, X. Chen, K. Goldberg, and\nP. Abbeel, “Deep imitation learning for complex manipulation tasks from\nvirtual reality teleoperation,” in 2018 IEEE international conference on\nrobotics and automation (ICRA).\nIEEE, 2018, pp. 5628–5635.\n[18] R. Nishimura, T. Wada, and S. Sugiyama, “Haptic shared control in\nsteering operation based on cooperative status between a driver and\na driver assistance system,” J. Hum.-Robot Interact., vol. 4, no. 3, p.\n19–37, Dec. 2015.\n[19] A. D. Dragan and S. S. Srinivasa, “A policy-blending formalism for\nshared control,” The International Journal of Robotics Research, vol. 32,\nno. 7, pp. 790–805, 2013.\n[20] K. Muelling, A. Venkatraman, J.-S. Valois, J. Downey, J. Weiss, S. Jav-\ndani, M. Hebert, A. B. Schwartz, J. L. Collinger, and J. A. Bagnell,\n“Autonomy infused teleoperation with application to bci manipulation,”\narXiv preprint arXiv:1503.05451, 2015.\n[21] D. Sun and Q. Liao, “Asymmetric bilateral telerobotic system with\nshared autonomy control,” IEEE Transactions on Control Systems Tech-\nnology, vol. 29, no. 5, pp. 1863–1876, 2020.\n[22] S. Ross and D. Bagnell, “Efficient reductions for imitation learning,” in\nProceedings of the thirteenth international conference on artificial intel-\nligence and statistics.\nJMLR Workshop and Conference Proceedings,\n2010, pp. 661–668.\n[23] M. Kelly, C. Sidrane, K. Driggs-Campbell, and M. J. Kochenderfer,\n“Hg-dagger: Interactive imitation learning with human experts,” in 2019\nInternational Conference on Robotics and Automation (ICRA).\nIEEE,\n2019, pp. 8077–8083.\n[24] T. Takahashi, “Chg-dagger: Interactive imitation learning with human-\npolicy cooperative control,” in CoRL 2024 Workshop CoRoboLearn:\nAdvancing Learning for Human-Centered Collaborative Robots, 2024.\n[25] S. Katsura, T. Suzuyama, and K. Ohishi, “Force transmission control\nin multilateral system for teletraining,” IEEJ Transactions on Industry\nApplications, vol. 128, no. 6, pp. 826–832, 2008.\n[26] K. Ohnishi, M. Shibata, and T. Murakami, “Motion control for advanced\nmechatronics,” IEEE/ASME Transactions on Mechatronics, vol. 1, no. 1,\npp. 56–67, 1996.\n[27] E. Sariyildiz, R. Oboe, and K. Ohnishi, “Disturbance observer-based\nrobust control and its applications: 35th anniversary overview,” IEEE\nTransactions on Industrial Electronics, vol. 67, no. 3, pp. 2042–2053,\n2020.\n[28] T. Murakami, F. Yu, and K. Ohnishi, “Torque sensorless control in\nmultidegree-of-freedom manipulator,” IEEE Transactions on Industrial\nElectronics, vol. 40, no. 2, pp. 259–265, 1993.\n[29] K. Inami, K. Yamane, and S. Sakaino, “Loss function considering dead\nzone for neural networks,” in 2024 IEEE 18th International Conference\non Advanced Motion Control (AMC), 2024, pp. 1–6.\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20982v1.pdf",
    "total_pages": 6,
    "title": "Motion ReTouch: Motion Modification Using Four-Channel Bilateral Control",
    "authors": [
      "Koki Inami",
      "Sho Sakaino",
      "Toshiaki Tsuji"
    ],
    "abstract": "Recent research has demonstrated the usefulness of imitation learning in\nautonomous robot operation. In particular, teaching using four-channel\nbilateral control, which can obtain position and force information, has been\nproven effective. However, control performance that can easily execute\nhigh-speed, complex tasks in one go has not yet been achieved. We propose a\nmethod called Motion ReTouch, which retroactively modifies motion data obtained\nusing four-channel bilateral control. The proposed method enables modification\nof not only position but also force information. This was achieved by the\ncombination of multilateral control and motion-copying system. The proposed\nmethod was verified in experiments with a real robot, and the success rate of\nthe test tube transfer task was improved, demonstrating the possibility of\nmodification force information.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}