{
  "id": "arxiv_2502.19974v1",
  "text": "Beyond costs: Mapping Norwegian youth preferences for a more \ninclusive energy transition  \nMuhammad Shahzad Javed1,*, Karin Fossheim2, Paola Velasco-Herrejón1, Nikolai Elias \nKoop3, Matylda N. Guzik1, Charles Dana Samuelson2, Beate Seibt2, Marianne Zeyringer1 \n1Department of Technology Systems, University of Oslo, Norway. \n2Department of Psychology, University of Oslo, Oslo, Norway. \n3Department of Mathematics, University of Oslo, Oslo, Norway. \n*Corresponding author(s). E-mail(s): m.s.javed@its.uio.no  \nAbstract \nEnvironmental movements and climate strikes have made it apparent that youth feel excluded \nfrom the ongoing energy transformation process, highlighting the crucial need for their \nengagement to achieve a socially accepted transition. This interdisciplinary study focuses on \nthe Norwegian electricity system and involves conducting educational workshops with high \nschool students aged 15 to 16 to ascertain their perspectives and socio-techno-economic \npreferences towards a net-zero energy system. The workshops were structured into three \nsegments, starting with the dissemination of common knowledge about energy and climate, \nfollowed by segments of interactive activities designed to explore and develop a shared \nunderstanding of various aspects of energy transition. Three rounds of questionnaires, \nadministered at distinct time intervals, assessed changes in students’ attitudes and \nsocio-techno-economic preferences. Our findings show that 33% of pupils favored \nexclusively offshore wind as a main energy source, while 35% opted to combine it with solar \nenergy, indicating that over 68% of participants viewed offshore wind as a favorable solution. \nAlthough 32% supported some form of land-based wind turbines, there was strong \n1 \n\n\ndisagreement about having wind parks in agricultural, forested, and residential areas. \nPreferences also exhibited considerable regional variation; solar installations were favored in \nsouthern and southeastern Norway, while wind farms were suggested for central and northern \nregions. Pupils emphasized energy independence, showed reluctance towards demand \nresponse (i.e., adjusting energy use), prioritized reducing carbon emissions and preserving \nbiodiversity over minimizing electricity costs. Despite cost-minimization being at the core of \nmost existing and broadly utilized energy system models, youth deemed it the least important \nfactor, highlighting a disconnect between traditional modeling priorities and their \nperspectives. Thus, integrating the perspectives of young people opens space for energy \nmodelers to explore uncertainties related to technological adoption by generating socially \nrelevant scenarios.  \nKeywords:  Climate change, Renewable energy, Youth participation, Social acceptance,  \nEnergy system models \n1. Introduction  \nEnergy system models are widely used to advise policymakers and planners on the best \nstrategies for decarbonizing the energy system. Designing possible future scenarios is a \ncommon approach to outline the different pathways of how the energy system could be \ndeveloped, based on varying assumptions about technology and economics. Subsequently, \nthese scenarios shape the energy system analysis conducted by researchers and energy system \nmodelers, influencing the related policy implications. Nevertheless, despite the employment \nof various methodological approaches, the challenge of inherent subjectivity in \nscenario-based analysis persists. Most of the studies also fail to engage relevant stakeholders \nin the process of envisioning net-zero energy systems [1–3].  \n2 \n\n\nWhile efforts are underway to engage the various stakeholders under the umbrella of \nparticipatory energy system modeling (ESM), there are little to no studies that engage the \nvulnerable and marginalized groups, such as young people, who are likely to be impacted \nmost by climate change [3–5]. Moreover, the growing body of participatory ESM literature \nhighlights discrepancies between stakeholders' perceptions and perspectives and those \nreflected in traditional techno-economic modeling scenarios [6–11]. Although participatory \nmodeling is gaining attention, and policies emerging based on the participatory practices are \nmore likely to be implementable, challenges remain. These challenges include the need to \nprovide information that is both understandable and relevant to participants, design effective \nstakeholders engagement methodologies, and involve stakeholders from diverse background \nto ensure comprehensive input. Knowledge gaps among participants can hinder effective \ncommunication and understanding, potentially compromising the quality of the insights \ngathered. Addressing these challenges is crucial to maximise the effectiveness of \nparticipatory processes [12]. Additionally,  participatory studies that meaningfully engage the \npublic, especially youth—by enhancing climate change knowledge, empowering participants, \nand collecting socio-techno-economic preferences to facilitate a more inclusive energy \ntransition—remain rare [13]. Furthermore, most participatory modeling studies rely on social \nscience or online survey data to incorporate stakeholders’ perspectives. This reliance raises \nconcerns about the validity of the obtained data, primarily due to the lack of prior knowledge \nnecessary to accurately respond to these surveys [14].  \nEvidence suggests psychological distress about climate change is broadly present among \nyoung people, there remains a gap in participatory research regarding the direct inclusion of \nyouth and account their informed choices about green energy transition, i.e., renewable \nenergy technology deployment scenarios. Though participatory research exploring ways to \nintegrate emerging social aspects such as acceptance [15], preference [16], ownership \n3 \n\n\n[17,18], and willingness-to-pay [19], the often considered stakeholders are experts from fields \nlike energy/environment [20], health [21], finance [22], tourism [23], education [24], and \nconstruction [25]. Moreover, the average number of stakeholders in such studies ranges from \n20 to 25, which does not necessarily reflect the opinions of general public [3,20,26]. While \nthe general public featured in less than 20% of reported participatory studies [3], the \nparticipants' average age tends to be around forty years [26–28]. Notable exceptions include \nHolzer et al., who conducted educational workshops with school students (aged 10 to 18) to \ncreate Swiss electricity supply scenarios for 2035 [6]. The results revealed that while pupils \nopted for high shares of renewable energy technologies (RET), their views did not necessarily \nalign with ambitious scenarios proposed by energy experts, who are often the stakeholders \nreflected in participatory studies. To the best of the author's knowledge, no study has engaged \nthe Norwegian youth in the energy transformation debate to enhance their understanding and \nassess their choices for future energy systems.     \nSince 2019, young people have been actively involved in matters related to the green energy \ntransition, as demonstrated by their social media engagement [19,29,30], participation in \nclimate strikes [31], and involvement in national and local climate adoption planning [32,33]. \nA survey of young people across continents showed that 84% of them are concerned about \nclimate change, and 83% think that people do not take care of the planet [34]. Though young \npeople tend to be less engaged in policy-making, the benefits of their involvement are widely \nacknowledged. Moreover, youth are generally more progressive than the broader society and \nactively participate in social movements [35,36]. Studies have also shown that young people \nare highly receptive to information, and their increased interaction with social media for \nsearching and obtaining detailed information can impact the green transition both positively \nand negatively [37,38]. Therefore, ensuring their meaningful participation in an inclusive \n4 \n\n\nenergy transition requires enhancing environmental literacy, and eventually, incorporating \ntheir perspectives into energy transition planning [39,40]. \nTo help bridge the gap in exploring youth engagement in energy transition planning, we hold \neducational workshops with Norwegian high school students (15-16-year-olds). Evidence \nsuggests that information through environmental education can enhance students’ knowledge, \nbehavior, and attitudes towards the environment [41]. These workshops allow students to: 1) \nengage in local, national, and international debates surrounding energy transition, 2) learn \nabout Norway's electricity grid through various interactive activities, and 3) express their \npreferences regarding social, technical, and economic facets of ESM. The Norwegian \nelectricity system presents an interesting case study for several reasons. Due to increased \nelectrification, Norway's electricity demand is projected to increase by approximately 30% by \n2050 [42]. Moreover, the country has the potential to play an essential role in expediting and \nachieving European net-zero targets, with many studies and reports highlighting its role as a \n\"green battery\" for countries like Great Britain, Germany, and the Netherlands [43–45]. \nHowever, it remains uncertain whether this potential will be realised, as public discourse in \nNorway has focused on limiting future electricity exports. Further, Norway is exploring ways \nto reduce its dependence on oil and gas exports by developing new industries (e.g., battery \nproduction), which will require increasing electricity production [46]. Without new \nproduction capacities, these new industries will not be developed. It is thus important to \nunderstand pupils' views on energy futures in Norway as they will be the ones living in a \n2050 decarbonized energy system and will soon be the decision-makers.  \nWhile it is possible to engage the youth, caution is necessary as insufficient encouragement to \nenvision the future may provide only a snapshot of their current views. Furthermore, pupils \nmay struggle to provide meaningful inputs without understanding the attributes, constraints, \npotentials, and environmental implications of RET. Therefore, we divide the workshops into \n5 \n\n\nthree blocks, beginning with general knowledge about the green energy transformation, \nclimate change, and Norway's current energy system. The complexity increases in subsequent \nsessions by exploring conflicts of interest related to new RET installations, through \ninteractive activities and an energy justice game. \nThis study aims to document the engagement process with pupils, and explore how they \nperceive the information and interactive activities provided during the workshops. \nSpecifically, this work seeks to address two main questions: first, how can young people be \neffectively engaged in climate change discussions and debates to facilitate a more inclusive \nenergy transition? Second, what characteristics do pupils envisage for a future net-zero \nenergy system or in other words, what possible normative scenarios arise from their \nperspectives and socio-techno-economic preferences? \nThe article is structured as follows. Section 2 describes the methods, including a description \nof workshop materials, the questionnaire, and how the workshops are conducted. In Section \n3, the results are presented. Section 4 discusses our findings and summarizes the relevance of  \nusing an educational workshop approach to engage youth in a just and inclusive energy \ntransition. Finally, we outline the studys’ shortcomings and present our conclusions in \nSection 5 and Section 6, respectively. \n2. Methods  \nThis section outlines the methodology for designing and conducting the workshops, detailing \nthe process for gathering information and analyzing the data collected. Our aim was to \nengage Norwegian school youth (15-16 year-old), introduce them to a structurally designed \neducational workshop about climate change, green transition, and renewable energy, and \nunderstand their perspectives regarding 1) the choice of renewable energy technologies, 2) \ntheir spatial allocation, 3) landscape choices for installing RETs, and 4) ESM \n6 \n\n\ntechno-economic preferences for reaching net zero energy goals. Designing workshop \nactivities is an effective and valuable method for eliciting participants' preferred pathways in \nthe energy transition [47]. Recognizing the importance of details — such as choice of \nactivities, how to conduct, and when to schedule them — we engaged in discussions over the \ncourse of one year within our interdisciplinary team and advisory board and sought feedback \nfrom social science experts, including those in educational sciences, as well as teachers, \nhigh-school and bachelor students. The workshop activities and designed materials are \ndiscussed in the following sections. \n2.1 Workshop description \nThis study is part of the interdisciplinary research project “Energy for Future”, which aims to \nassess youth perspectives about Norwegian future net-zero energy systems. The participants \nwere upper secondary school students, and the workshops were conducted as a compulsory \ncomponent of the social science and geography subjects. Studies have indicated that these \nreal-life workshop settings enhance the validity of obtained data, and the learning process can \nmeaningfully impact the attitudes, behaviour, intentions, and knowledge [41,48]. The \nworkshops were conducted during the spring and winter of 2024 in five schools located in \nEastern and South-Eastern Norway. A total of 286 students from 12 classes, with class sizes \nranging from 12 to 32 students, participated in workshops. Among these participants, 220 \nstudents agreed to participate in the modeling questionnaire (discussed below), resulting in a \nresponse rate of 77%. The main reasons for some students not responding to the \nquestionnaire were fatigue from workshop activities and desire to take a break, as a break was \nscheduled immediately after the completion of the modeling questionnaire completion.  The \nTable A1 provides further details about the schools, classes, and participants.     \n7 \n\n\nWe conducted three blocks of interactive sessions, each lasting 90 minutes, across all schools \nselected for this study. Three rounds of questionnaires were conducted at intervals during \nthese sessions, with timing determined in the workshop material design phase, to ensure that \nstudents had the necessary information to respond effectively. These three blocks were \ncompleted within the same day or spread over three weeks, with one weekly information \nsession. Each session's themes, topics covered, and interactive activities are detailed below. \nThe workshops held with the pupils were designed with the following key considerations: \n●​ Presenting relevant information about the energy transition/transformation process, \nincluding socio-economic, technological, and global aspects. \n●​ Highlighting the goals of mitigating the climate crisis and involved trade-offs.  \n●​ Giving pupils the space to engage with the presented material by asking questions, \ndiscussing, presenting their own ideas, giving feedback and challenging assumptions.  \n●​ Designing activities for collective learning, such as roleplays, educational games, \nquizzes, and discussions, to enable informed future energy choices based on a shared \nunderstanding. \n●​ Adhering to best practices for engaging stakeholders set out in the literature [4]. \n●​ Encouraging youth participation in the climate debate and understanding their \nattitudes towards energy transition by combining social science with ESM.   \nThe final structure of the executed workshops consisted of following components (Fig. 1): \nBlock-1: This block commenced after administering the pre-questionnaire (social \nscience-focused questionnaire). The session provided general knowledge about the green \nenergy transition, climate change, near-zero carbon technologies, and Norway's current and \nfuture energy demand and supply. The aim was to establish a common knowledge base \namong students.  \nBlock-2: This session is built on the information presented in the first block. Students \nexplored conflicts of interest, particularly land-use issues related to the installation of RET. \n8 \n\n\nThis was achieved through role-playing a town hall meeting, similar to a model UN setting,  \nwhere groups of students represented different stakeholders, including the mayor, citizens, \nenvironmental organizations, industry representatives, high school students, and citizens \nemployed in the local industry. This interactive activity, centred around  the decision on the \nwind farm installations, allowed students to debate, nuance, and discuss diverse viewpoints \non the green energy transition. The block concluded with the administration of the modeling \nquestionnaire. \nBlock-3: This part concentrated on climate justice, including the north-south perspective, and \ninvolved a climate-justice game (international climate negotiations) [49]. Students acted as \nyouth representatives of different countries with the goal of achieving international carbon \nreduction targets, allocating funds from their given budgets for national and international \nmitigation measures. Students engaged with aspects related to distributive, recognitional, and \nprocedural justice. The workshop concluded with the post-social science-focused \nquestionnaire. \nBefore conducting the workshops, we conducted a series of four-day pilot sessions with \npupils in Oslo to determine the appropriate material and topics to focus on. This process \nhelped us refine the teaching material and choose the activities for the final workshop design \nbased on students’ engagement, comprehension of the materials, and learning outcomes. \n \nFig. 1. An optimal participatory approach captures insights from social scientists and energy \nmodelers in designing the knowledge component and the questionnaire/survey segment of the \nengagement activity. This interdisciplinary study incorporates an iterative feedback process \n9 \n\n\ninvolving continuous discussions. Qualitative and quantitative insights gathered from these \nsessions would later be employed with a high spatiotemporal resolution energy system model \nto capture the trajectories of student preference-based energy systems. \n2.2 Questionnaire design \nTwo questionnaires were developed for the students. One was specifically designed to \ncapture students' socio-techno-economic preferences for energy modeling, hereafter referred \nto as the modeling questionnaire. The other one was a social science-focused questionnaire, \nmeasuring students’ knowledge, empowerment, and attitudes towards renewable energy and \nclimate change before and after the workshop. In this study, we focus on discussing the \ndesign and findings of modeling questionnaire only. The findings related to social-science \naspects will be reported in another publication.   \nThe modeling questionnaire was developed in alignment with the structure and quantitative \ndata requirements of an electricity system model that optimises both the investments and \ndispatch to design a future net-zero electricity system [50,51]. In future work, we aim to \nsimulate the developed  scenarios and disseminate insights into how pupils envision the \nNorwegian net-zero energy system. Considering the substantial time investment required to \nbuild energy models, we selected the highRES energy model during the workshop materials \ndesign stage [51]. This approach allows us to account not only for model limitations but also \nfor the assumptions necessary to translate the questionnaire output, overcoming the challenge \nof “institutional inertia” described by McGookin et al. [4]. The modeling questionnaire \nbroadly focused on the specifics of RET: ‘what’ types of RETs pupils prefer, ‘where’ they \nbelieve these should be installed geographically, ‘how’ these installations should be managed, \nand the potential impacts of these relatively unfamiliar technologies on people. The rationale \nfor including socially constructed aspects is supported by several studies, which argue that \npublic engagement should consider not just the physical or technical attributes of a given \n10 \n\n\ntechnology but also the affective and symbolic social aspects, such as visual disruption as \nwell as the feelings and values that people associate with a technology [52–54]. Additionally, \nESM modeling attributes such as power generation technology preferences [55], type of \npower transmission lines [56], and local economy [57] were also considered in the \nquestionnaire. \nThe modeling questionnaire begins with an open-ended question asking students to identify \nthe most important factors, which, according to them, need to be considered when installing \nRET. This question helped us gather their initial thoughts, which might be influenced by \nsubsequent information and questions, as noted by Demski et al. in a UK-based public \npreference study [7]. Demski et al. observed that people's energy preferences could be \nswayed, when the example scenario or reference point of the scenario-building tool changed. \nFollowing the open question, a series of discrete choice questions probe students' technology \npreferences. Discrete choice is a commonly used interactive method in participatory studies \n[15]. We employed a variety of question types in our form — including multiple, discrete, \nsingle, and scale-based choices — to minimize potential biases in the representation of \nstudents' preferences. Fig. 2 illustrates an example of an offshore and onshore choice card. \nThe technology attributes used were selected based on their frequent application in \nparticipatory literature (see supplemental file for questionnaire) [12,15,18,32,35,56,64]. \nElectricity cost-related savings were calculated based on the current average electricity price, \nyearly average Norwegian household electricity consumption, and wind and solar electricity \nproduction costs [60–62]. The visual impact of technologies was considered based on expert \nviews about height and frequency of daily observations, while area calculations were \nperformed using the average electricity consumption of Norwegian households and \ntechnology’s area efficiency (Wp/m²). Power transmission lines, a major portion of new solar \nand wind farms' costs, were considered based on how far the given technology is typically \n11 \n\n\ninstalled from demand centers. Although students discussed wind turbine colors (leading to a \nconversation about artist jobs), we avoided including such physical attributes (i.e., color and \norientation) to maintain a broad representation of socially constructed aspects. \n \nFig. 2 Exemplar discrete choice card. The full questionnaire is provided in the supplemental \nfile. \nFollowing the technology choices, we added a series of landscape preferences for installing \nwind turbines, utilizing the Likert scale ranging from 1 to 9, where 1 represents “strongly \ndisagree,” and 9 represents “strongly agree.” We considered nine landscape types based on \nthe prevalent landscape types in Norway. Using Norwegian national map data and CORINE \nland cover data, we performed spatial analysis to determine how much these landscapes are \ndistributed across Norwegian counties and in relation to Norways’ total area, which we \ndiscussed in the results section [63]. Additionally, students were asked to choose their \npreferred Norwegian counties for solar and wind energy installations by referring to the map \nof Norway. Subsequently, there were single and multiple-choice questions addressing \n12 \n\n\nstrategies for overcoming the variability of RET, electricity trading with neighboring \ncountries, and preferred transmission type. \nQuestionnaire drafts were consistently shared and discussed with social psychology \nscientists, political scientists, sociologists, RET scientists, and energy system modelers who \nassisted in shaping the form to minimize technical jargon and make it accessible to school \nstudents. This interdisciplinary approach helped to ensure a good fit between the aspects \nassessed and the energy system model while considering multiple dimensions of the energy \ntransformation process. Brief modeling knowledge and the importance of the questionnaire \nfrom a modeling perspective were shared with students before distributing the modeling \nquestionnaire (Block-2). For example, topics such as the cost reduction in RET over time, the \nland occupied by RET installations, and the consequences of installing RET in remote areas \n(e.g., high transmission costs) were discussed. \n2.3 Facilitation of workshops with students \nThe workshops were facilitated by master students and researchers with a background in \nsocial or natural sciences, who were also involved in designing the workshop materials. All \nworkshops’ instructors were trained before the activities. The authors of this study also \nparticipated in moderating sessions. We discussed with students how energy system modeling \noutcomes might be visualized on a map of Norway, and how they could be used as guidance \nfor policy-level decisions. The concise teaching/information sessions ensured that students \nhad the knowledge to provide informed and least-biased qualitative and quantitative \nresponses. We noted their observations to build guiding principles for designing and \nmodeling emerging scenarios for use in ESM. Additionally, we explained how the \nquestionnaire results could influence modeling outcomes. Sharing our plan to integrate \nstudents’ responses into ESM served two key purposes: first, it illustrated how students could \n13 \n\n\ncontribute to envisioning a future zero-carbon energy system; second, it encouraged them to \nrespond to the questionnaire thoughtfully [64].  \nOur approach to the workshop design is based on a functional dynamic approach, which \nallocates different levels of control to stakeholders depending on the objectives [62, 71]. \nTrutnevyte et al. delineated three modes of information flow during stakeholder involvement: \ncommunicating, consulting, and collaborating [72]. In our workshops, teaching sessions \nserved as a mode of communication, while the questionnaire activity fell under the \nconsultation and collaboration category. Additionally, during the collaboration phase, we aim \nto share model outcomes derived from scenarios shaped by student feedback, fostering a \nmore meaningful integration of stakeholders’ preferences into ESM.      \n3. Results   \nThe following sections discuss the pupils’ perspectives, socio-techno-economic preferences, \nand emerging energy scenarios derived based on the data obtained during the executed \nworkshops. One of the key challenges of participatory modeling is the need to make \nassumptions when designing energy scenarios based on stakeholders' qualitative and \nquantitative data [65]. Acknowledging these limitations, our aim here is to present students' \npreferences, which will later be integrated into the spatially explicit electricity system model \nhighRES for Norway to design future electricity systems based on  student-driven scenarios \n[51]. \nThe \nanalysis \nfiles \nare \navailable \non \nGitHub \n[https://github.com/JavedMS/Mapping_Workshops_EFF], allowing readers to understand the \nresults better.    \n14 \n\n\n3.1 Technology preferences   \nAlthough we did not consider all renewable energy generation technologies, Norwegian \nyouth are divided not only on which technologies to install and to what extent but also on the \nlocations for these installations. As shown in Fig. 3, pupils' choices between location of \noffshore and onshore wind turbines, with or without the coexistence of solar photovoltaic \n(PV) panels indicate a strong preference for offshore wind-based solutions. Independent of \nthe solar technology choice, offshore wind emerged as the preferred option to meet Norway's \nincreasing electricity needs in the future. Approximately 35% of pupils selected the \ncombination of solar and offshore wind installations, making it the most preferred choice, \nwhile around 33% favored exclusively the offshore wind technology. This indicates that over \n68% of the students favored some form of offshore wind as a future electricity source. Given \nthat the Norwegian government aims to install at least 30 GW of offshore wind capacity by \n2040, these results suggest that large-scale offshore projects could gain support from youth, \ngiven that they are engaged [66]. The discussions with students during interactive activities \nrevealed several reasons for not prioritising onshore wind farms over offshore ones. These \ninclude a desire to protect the natural landscapes, minimize environmental impacts, and \naddress visual concerns. For example, during interactive sessions, pupils often discussed \nissues such as bird collisions, painting wind turbines in different colors to enhance the \naesthetic appeal or to create jobs for artists, and avoiding placing wind turbines in forested \nareas. \nAlthough, approximately 32% of the respondents favored some form of onshore wind-based \nsolutions, there were concerns about installations near residential areas, within forests, and in \nagricultural areas. These concerns are evident from their landscape preferences and location \nchoices (Fig. 4). We noticed that many pupils' objections stemmed from limited knowledge or \nmisconceptions about RETs. For instance, during an interactive activity, some students \n15 \n\n\ndiscussed issues about the toxicity of wind blade coatings and the belief that wind turbines \ncould only be white. Such concerns mirror the misunderstanding spread by vocal Norwegian \nanti-wind power movements [67]. While a clear preference for offshore wind emerged, pupils \nwere much more evenly divided regarding the addition of solar power to the energy mix (Fig. \n3).  \n \nFig. 3 Representation of pupils' technology choices based on five attributes (savings, visual \nimpact, height/size, required area, power lines [see Methods]), indicating a high preference \nfor offshore wind, with or without solar. \nPupils have the potential to raise awareness among the general public about the \ncharacteristics of different technologies and their potential impacts, leveraging their active \nuse of social media [19]. Rejection of wind energy in local municipalities have recently been \nobserved in Norway. Youth from these areas could clarify doubts and provide updated \ninformation if the group is meaningfully engaged in decision-making processes about new \nRET installations. \n16 \n\n\n \n3.2 Spatial and regional technology preferences  \nFig. 4 provides an overview of pupils’ landscape preferences, while Fig. 5 details the spatial \ndistribution of their preferences concerning landscapes and regional choices for the \ninstallation of  solar and wind farms across Norway. The results indicate a strong preference \n(median > 6) for installing wind turbines in the sea area as well as mountainous and vegetated \nregions. Pupils also showed moderate agreement (median = 5) for placing wind turbines in \nnatural grasslands, nearshore locations, and industrial areas. Conversely, there was apparent \ndisagreement (median < 4) regarding installing wind farms in forests, agricultural lands, and \nresidential areas. Beyond legal obligations, Norwegian culture and politics may influence \npupils' inclination to conserve natural landscapes, such as forests, with a focus on prioritizing \nbiodiversity and nature preservation for future generations.  However, research indicates that \nonly 1.7% of Norwegian forests remain untouched by forestry activities, with the remainder \nhaving undergone at least one cycle of clear-cutting [68]. This process involves \nsystematically removing all or most trees from an area to enable forest regeneration or the \nestablishment of new plantations.  This underscores the need to effectively communicate the \ncurrent state and ecological role of these landscapes in biodiversity and nature preservation to \nthe public, aligning perceptions with the actual state of landscapes and potentially reducing \nopposition to the installation of the land-based wind turbines. \nAs depicted in Fig. 5, there is a higher tendency among pupils to install more onshore wind in \nthe Northern, Central, and Western regions of Norway, compared to the Southern and \nSoutheastern areas, where solar technology is preferred (Fig. A1). It is noteworthy that \nNorway's most suitable wind energy sites, including existing wind farms, are also located in \ncentral and western Norway. Similarly, most of Norway's solar potential is concentrated in \n17 \n\n\nthe Southeast and East, aligning with the pupils' preferences for solar installations. Given that \nover 55% of Norway's population resides in the Southern and Eastern parts of the country, \nsignificant solar energy potential could be harnessed through rooftop-installed PV panels. In \nthe future, pupils could be a key in promoting acceptance for this RET by representing their \ncommunities in local municipalities. These results underscore the importance of engaging \nlocal pupils in policy-shaping, ensuring they are not left behind. For instance, 93% of pupils, \nwho selected Oslo expressed a preference for solar PV installations, while 70% of those, who \nchoose Nordland (Northern Norway) believed that wind turbine installations would be more \nsuitable for this county (Fig. 5). However, as the workshops were conducted in schools in \nEastern and South-Eastern Norway, these results cannot be generalized to reflect students’ \npreferences nationwide.  \n \nFig. 4 Pupils' agreement with placing wind turbines in different landscape types, rated from 1 \n(strongly disagree) to 9 (strongly agree). The boxes represent the distribution of responses, \n18 \n\n\nwith the central read line indicating the mean, while the whiskers illustrate the range and \nvariability of responses. Pupils' landscape preferences regarding wind-based technology \nreveal that, on average, they are positive towards placing wind turbines in the sea and on \nrocky mountains, but they disagree with having them in forests or near residential areas. \nOpinions are more divided regarding the other landscape types, with higher variance and a \nmean towards the scale's midpoint.  \n \nFig. 5 Spatial distribution of pupils’ landscape and RET preferences. Fig. (a) shows the \npercentage of each county’s area with unpreferred landscapes (see Fig. 4), while Fig. (b) \nillustrates the percentage with preferred landscapes. Pupils preferred wind energy \ninstallations in counties with a higher concentration of preferred landscapes, whereas PV \ntechnology in densely populated areas with the predominance of unpreferred landscapes (i.e., \nsouth and southeast Norway). See also Fig A1.  \nThe spatial distribution of pupils' technology preferences aligns with the likely location of \nwind and solar farm in Norway. In general, pupils’ responses to statements about area \npreferences align with their responses to map-based questions about landscapes and counties. \nHowever, some differences are noteworthy (Fig. 4, Fig.5, Fig. 6). Fig. 6 shows that for each \n19 \n\n\nstatement-based question, at least 33% of respondents neither agree nor disagree with placing \nwind turbines in the specified areas. For instance, ~40% neither favored nor disfavoured the \nplacing of wind turbines in remote areas. Yet, when it came to map-based location choice \nquestions (Fig. A1), Northern and Central Norway counties (with only ~16% of the \nNorwegian population) were the most selected for the installation of onshore wind turbines \n(i.e., remote areas). Western Norway emerged as pupils' second most popular choice for the \nonshore wind technology. The difficulty to make a decision reflected in the ‘neither agree or \ndisagree’ response might stem from using various terminologies, such as ‘remote areas’ in \nstatement questions compared to county names in location-based questions. This might lead \npupils to consider the vast availability of land in Northern Norway or to associate the specific \ncounty names known for wind turbine placements or specific counties known for good wind \nconditions. Similarly, ~43% of students were uncertain about ‘areas where people’ in \nstatement-based questions, yet they clearly expressed their opinions in map-based landscape \nquestions (i.e., industrial area and residential area), especially strongly opposing the presence \nof wind turbines in residential areas.  \nDespite significant efforts involving interactive activities, discussions, and systematically \ndesigned questionnaires, this high percentage of indecisive responses may arise from various \nunderlying factors. Firstly, pupils might have found it irrelevant to respond to the same topic \ntwice and therefore choose neither agree nor disagree, as they have responded to it in \npicture-based landscape and map-based location preference questions. Secondly, viewing \nimages tends to be more engaging, potentially leading to more immediate and informed \nresponses regarding landscape preferences [69]. In contrast, textual statements rely on \nindividual imagination and interpretation, which can vary widely and may result in varied \nunderstandings of the same question. Finally, while a lack of question understanding or \nrelevant knowledge might also have contributed to answers obtained, it was not the case for \n20 \n\n\neveryone, as at least more than 57% of pupils responded to each statement-based questions \nwith either agreeing or disagreeing (Fig. 6). While most pupils selected neither agree nor \ndisagree in statement-based area preference questions, those who agreed or disagreed \nexhibited preferences that aligned well with their landscape, location, and technology \npreferences. For instance, pupils agreed with the idea of not placing wind turbines in nature \nreserves and people living areas, which correlates with their opposition to the utilization of \nthe residential and forest landscapes (Fig. 5, Fig. 6). Similarly, the sea, as the most \nagreed-upon location, aligns well with their strong offshore wind turbine preference.  \n \nFig. 6 Pupils' choices about placing wind turbines in different area types, ranging from \nexisting infrastructure and developed areas to remote and nature reserve areas. Most pupils \nchoose neither agree nor disagree, illustrating either pupils are indeed unsure or lack interest. \nAbstract terms are used in this figure to summarize the statements used in the questionnaire. \n3.3 Techno-economic choices  \nFig. 7 depicts the pupils' preferences regarding techno-economic parameters often only \nassumed in ESM. Pupils appear reluctant to adopt a demand-side management approach to \nmitigate the variability of RET, as it may directly impact their lifestyle. Instead, they \n21 \n\n\npreferred more expensive options such as installations of renewable energy storage solutions \nand electricity trading with neighboring countries. The International Energy Agency has \nprojected that 500 GW of power demand response capacity will be brought to the markets by \n2030. However, it’s crucial to proceed cautiously, as people may hesitate to change their \nelectricity consumption patterns unless they are fully engaged and adequately compensated \n[70]. Additionally, pupils aim to ensure energy independence (i.e., self-sufficiency) with \npreferences for electricity trading and energy storage. Approximately 42% favored a balanced \napproach to electricity import and export, suggesting that imports should be equal to exports. \nThis was followed by 32% and 26% saying “Import same as today” and “Import more than \ntoday”. These preferences align with the open-ended question responses (Fig. 8b), where \nterms such as “environment”, “nature”, and “protection” were frequently used, highlighting \nthat sustainability is the most preferred priority. Regarding power transmission lines, pupils \nwere divided between overhead and underground options. Despite this division, there is \nminimal opposition (<4%) to installing new power lines. \n \nFig. 7 Pupils' choices for technical parameters are often considered energy model \nassumptions. Pupils are aware of renewable energy's intermittency and prefer its \n22 \n\n\nstorage/trading while ensuring energy independence (middle bar). Additionally, there is no \nstrong opposition to installing new transmission power lines. \nFig. 8a illustrates pupils' choices concerning the important factors in electricity production. It \nis evident that self-sufficiency, or energy independence, is their top priority, followed by \nzero-carbon emissions and environmental protection. Fig. 8b complements these priorities by \npresenting pupils' responses to an open-ended question about the three most important factors \nto be considered when installing renewable energy technologies. All these factors are \nessential parts of ESMs. ESMs typically aim to minimize total energy system costs while \nhaving several constraints, such as emission reductions, trading with other countries \n(self-sufficiency), and limiting the capacity potential of RET due to, e.g., biodiversity \nprotection. However, interestingly, cost-minimization, which is at the core of most models, is \ndeemed the least important factor by young people. To ensure an inclusive energy transition, \nenergy models need to also consider public preferences across all model decision variables, \nimplementing constrained or multi-objective optimization. For instance, regardless of \nsolar/wind capacity factors, locations concerning biodiversity can be excluded with high \nspatial resolution to optimize viable locations. Similarly, preferences for areas can be \nmodeled by constraining the model to prioritize preferred locations before considering others. \n \n23 \n\n\nFig. 8 (a) Energy models that often prioritize the least-cost objective for optimization are \nlabeled the least prioritized by pupils. (b) The open-question results reflect their primary \nconcerns, which are nature and economy.   \n4. Discussions  \nAlthough participatory research in ESM has gained researchers' attention, McGookin et al. \nobserve that \"it is a poorly developed practice...\" and emphasize adhering to good \nparticipatory practices [3,71]. In this study, We followed the experiential guidance for \nengaging stakeholders and collecting qualitative and quantitative data as outlined in the \nliterature, which is based on the insights from experts in the fields of ESM and participatory \nresearch [4]. Table 1 below highlights how these practices are perceived in this study.   \nTable 1. Good transdisciplinary practices were adopted for conducting workshops [4].  \nPractice  \nExplanation  \nAction  \nStakeholder mapping  \nWho engaged?  \nWhy engaged?  \nWhat is their role?   \nYoung school students  \nInformed energy transition \npreferences  \nNon-expert stakeholder  \nFlexible/adaptive approach  \nRespond to stakeholder \nneeds.  \nConducted pilot school \nworkshops to refine the \nquestionnaires.  \nAcknowledge model \nlimitation  \nWhat model can and cannot \nmodel/optimize/predict?  \nWhat social aspects can be \nmodeled? \nHow and which type of \nconstraints can be \nimplemented? \nhighRES model capabilities \nand limitations were \nconsidered during the \nworkshop material design.   \n24 \n\n\nInclusion of divergent views  Respect conflicting views  \nDebate and roleplay based \non a real case in workshops   \nBe critical of the whole \nprocess   \nAvoid box-ticking exercise  \nBoth transdisciplinary and \ninterdisciplinary approaches \nare used, engaging in several \nrounds of constructive \nfeedback. The pupils were \naware of their role in the \nresearch process \n \nTo engage the youth in green transition debate, this study illustrates the preferences of \nteenagers in Norway. The results obtained in this work demonstrate that pupils showed a \npreference for offshore wind over onshore wind technology, with approximately 68% of them \nchoosing offshore wind parks, with or without additional solar technology installations (Fig. \n3). The pupils' strong preference for offshore wind aligns with recent studies in Norway, \nwhere people preferred nearshore and offshore wind installations, given that ownership of the \nprojects should remain at local and national levels [18]. This could support the Norwegian \ngovernment's 30by40 offshore wind development goal of hosting 30 GW offshore wind \npower capacity by 2040 [72]. However, the potential challenge of offshore areas would be \npublic opposition due to their use for commercial fishing activities and the presence of \necological valuables such as spawning grounds, nearby bird nesting sites, and protected areas, \nas well as high costs [66]. \nPupils’ preference for offshore wind can be understood in the context of protests by \nNorwegian people since April 2019, when the Norwegian Water Resources and Energy \nDirectorate (NVE) proposed a map indicating the most suitable onshore wind park locations \namounting to 29,000 km2, or roughly 9% of total Norway land area, corresponding to \napproximately 290 GW of the onshore wind generation capacity [73]. The proposed plan was \n25 \n\n\nscrapped due to the strong opposition from environmental associations, ministries, and \nmunicipalities. Additional reasons for favouring offshore wind may include knowledge of \nfavourable sea wind conditions and concerns about noise and visual impact. Further studies \nacross national levels are essential to gain a deeper understanding of the underlying \nmotivations for wind energy preferences.  \nGenerally, international opinion polls highlight positive public perceptions about renewable \nenergy. Still, at the local levels, people oppose different technologies across various social \nand cultural contexts [52]. The workshops with students reflected their choices about \ntechnologies for given municipalities. To avoid biased opinions, we didn't specifically present \ncountry-wise solar or wind energy availability (i.e., capacity factors) in Norway, but we \ndiscussed the importance of wind speed or sun availability with students during sessions. By \ncoinciding technology choices with location and landscape choices, some patterns emerge, \nsuch as strong disagreement with installing wind turbines in forests and residential areas, \nconcentrated mostly in the south and east of the country. The result that students preferred \nwind power in central and northern Norway might be due to the students coming from \nsouthern Norway, reflecting some NIMBYism. However, it is important to note that recent \nstudies have shown that NIMBYism is overly simplistic, and public responses about RETs are \nmuch more complex [52,74]. Alluding to selfishness may miss important insights for no \nacceptance at the local level. The pupil spatial choices are interesting given that the \nworkshops were held just a few months after the agreement between the government and the \nSámi people in the Fosen case was widely discussed in Norwegian media. This case \nhighlighted the area conflicts over central and Northern Norway between reindeer herding \nSámi people and wind installation development. \nPupils expressed eagerness to have wind turbines installed in areas with little economic \nactivity to boost local business growth (Fig. 6). However, results from an interactive activity \n26 \n\n\nasking about localized consequences of the green energy transition revealed concerns about \npotential reduced economic growth. These seemingly conflicting perspectives show that \nwhile the young generation wants to support the growth of local economies by installing new \nwind farms, they also fear local economic stagnation due to these installations. This concern \nmay stem from perceptions that the economies based on RETs might not generate a \nsignificant number of local jobs or that the presence of large-scale infrastructure could detract \nfrom other types of economic activities. For instance, a common discussion during \nworkshops was whether RET installations would result in local job creation, with concerns \nthat they might not create new opportunities. This suggests students foresee that place-based \neconomies may not necessarily be part of a sustainable transition. Discussions with students \nindicated that while climate change is a realistic concern, solutions should not come at the \ncost of destroying nature or local economies. \nA valuable outcome from this exchange with pupils is an insight into their understanding, \nthoughts, views, and apparent contradictions in their choices and visions about the energy \ntransformation process. For instance, most students think nature preservation is important, but \nthey desire a self-sufficient, zero-carbon, and cost-effective electricity system in Norway. The \nlandscape choices highlight this apparent contradiction, as most types received \nbelow-average or average consideration for wind turbine installations (see Fig. 4). This leads \nto two recurring challenges. Firstly, landscape types and counties selected by pupils for \nwind/solar technology installations do not necessarily have high wind/solar capacity factors, \nrequiring more capacity installations to meet the same energy demand. Secondly, such less \nefficient RET installations would require high energy storage capacities or increased \ninterconnection with neighboring countries, potentially compromising the energy \nindependence criteria. \n27 \n\n\nThis divergence in pupil choices highlights an area for energy modelers to explore trade-offs \nand address uncertainty, ensuring a socially just transition. This can be achieved through \nvarious modeling techniques discussed in the literature, which involve coupling spatial, \ntechnological, and economic modeling elements with stakeholders’ choices [75,76]. This may \nhelp assess the cost implications of an inclusive energy transformation and address \nstakeholders’ preferences, such as who would be the primary users of locally generated wind \nenergy—either national or international. In future work, we will simulate the scenarios \nemerging from pupils’ choices to design Norways’ future electricity system using highRES \nelectricity system model [51]. To ensure meaningful stakeholders’ engagement, we aim to \ngather students’ feedback on the model results, and assess the likelihood that pupils might \nreconsider their RET and landscape preferences based on the modeling outcomes. The \nexample scenarios emerging from the workshops are illustrated in Table A2.  \nHaving seen the increased discussion in social media about wind energy in Norway, pupils \ncan contribute to understanding the social dilemmas related to wind energy and local \nopposition to wind technology installations [19]. Pupils' participation in projecting future \nnet-zero energy systems may not guarantee its public acceptance. Still, it can empower the \nyoung generation and increase not only their trust in the transformation process but also the \nownership of decisions. Psychological ownership increases public willingness to accept wind \nenergy impacts on the local communities, as Dugstad et al. found that people's willingness to \naccept wind energy depends on their degree of psychological ownership [17]. The ownership \nof RET plants could be defined as who maintains the control or uses the produced electricity \n[17,18]. The ownership in our study can be interpreted as self-sufficiency (i.e., the intended \nuser), where 76% pupils either favor a balanced approach between the import and export of \nelectricity or no change in the current status (Fig. 8a). This preference for limiting net \nelectricity imports aligns with the findings of Xexakis et al., who identified a similar \n28 \n\n\nconsensus among young people from various European countries [77]. The observed pupils' \nreaction towards RETs can be linked to the pupils' association that comes into their minds \nwhen they think about wind power. During the workshops, the response to the question \n“What comes into their mind when they hear about wind turbines?” was mostly negative, i.e., \nnoise, nature, big, etc. Decision-making theories suggest that complex interactions exist \nbetween the cognitive and affective components of the human brain [69]. Pupils likely used \naffective reactions rather than cognition ones about onshore wind, as discussed by Holzer et \nal. in the study of making scenarios with pupils about waste incineration [6].    \nInteractive discussions with students and analysis of their questionnaire responses reveal that \nwhile concerns about climate change are valid, efforts to address it should not compromise \nnature, biodiversity, local economies, or people's trust. The situation calls for a broader \nunderstanding of the sustainable energy transformation that addresses all economic, social, \nand environmental issues. The presented results could help us understand how to align \nclimate actions well with the views of young people who would face the outcomes of current \npolicy planning. Although results highlight the importance of engaged decision-making for \nfair and just changes, it is and will remain a challenge to effectively bring young generations' \ndiverse and contradictory views into policy making. \n5. Shortcomings  \nThis study has several limitations that will inform our future research. First, responses to the \nquestionnaire can be swayed by how information and questions are conveyed and formulated. \nDespite interdisciplinary efforts to minimize bias in the workshop materials, future work may \ninvolve designing a more comprehensive educational process where students may revisit \nconcepts multiple times and deepen their understanding of the risks and benefits related to \neach technology implementation before expressing their preferences. Ideally, this would be \n29 \n\n\nbased on workshops that extend over several days; however, the student’s curriculum \nconstraints may limit the time available for such activities. Second, their existing \ngeographical knowledge might influence pupils' responses about selecting landscapes and \ncounties for wind or solar technology installation. This could lead to biased selections based \non known locations rather than objective assessments. Although participants were instructed \nto respond based on their understanding and preferences rather than biases, we recognize that \nthis is challenging to achieve. \nThird, limited time restricted our ability to address all aspects of a socially just energy \ntransition raised by experts or pupils during workshop discussions. For example, there is no \nstraightforward answer to questions like \"Does Norway's electricity price increase when \nelectricity is sold to neighboring countries?\" as this depends on various factors, such as \nenergy market prices and demand. Finally, our study focused solely on solar and wind \ntechnologies. This focus was due to the Norwegian government’s plans for wind and solar \npower, their potentially lower costs, and limited time to explore other technologies, such as \nnuclear and geothermal, for achieving net-zero targets. This focus was adequate for our study, \nwhich aimed to document Norwegian pupils' preferences for the first time and to broadly \nunderstand their perspectives and socio-techno-economic choices, often part of energy \nexperts' assumptions.  \n6. Conclusions \nDespite the active participation of youth in climate change issues and their vested interests, \nyoung people are often overlooked in participatory processes. To address this gap, we \nengaged Norwegian high school students, revealing that young participants are not only \ninterested in energy-related and environmental topics but are also capable of meaningful \nengagement in the participatory process.  \n30 \n\n\nWe demonstrated that youth prioritize energy independence and environmental preservation, \nsuch as biodiversity, over energy system costs—traditionally central to energy system \nmodels. While about 15% of respondents favored exclusively onshore wind installations, \nthere was strong apprehension about the location of wind farms near agricultural, forested, \nand residential areas. Independent of solar technology, offshore wind emerged as the \npreferred option to meet Norway's increasing electricity needs, with almost 68% opting for it. \nAlthough pupil's preferences were divided between overhead and underground power lines, \nthere was minimal opposition (<4%) to installing new ones. \nTo achieve a more inclusive and equitable transition, modelers and decision-makers should \nincorporate scenarios based on pupils' socio-techno-economic preferences. This study \nprovides an educational workshop-based framework to bring youth perspectives into general \ndebates and accounting them for optimizing and simulating future energy systems,which in \nturn, will strengthen the net-zero projections. Policy-makers can utilize the presented \nworkshop-based approach to engage youth during school hours to understand and reflect on \ntheir perspectives on the evolving energy systems. The benefits of these participatory \npractices with youth are twofold: firstly, these meaningful engagements offer an opportunity \nto address young people’s growing distrust and help build trust, and secondly, repeatedly \nengaging youth can cultivate a mutual understanding of the challenges and foster shared \nownership of decisions across all aspects of the energy system, thereby promoting inclusive \nand swift energy transition. \nCRediT authorship contribution statement \nMuhammad Shahzad Javed: conceptualisation, methodology, data curation, analysis, \nvisualisation, writing—original draft; Karin Fossheim: conceptualisation, methodology, data \ncuration, \nwriting—review \n& \nediting; \nPaola \nVelasco-Herrejón: \nconceptualisation, \n31 \n\n\nmethodology, writing—review & editing; Nikolai Elias Koop: data curation, analysis; \nMatylda N. Guzik: conceptualisation, methodology, writing—review & editing, funding \nacquisition; Charles Dana Samuelson: conceptualisation, methodology; Beate Seibt: \nconceptualisation, methodology, data curation, writing—review & editing, project \nadministration, funding acquisition; Marianne Zeyringer: conceptualisation, methodology, \ndata curation, visualisation, writing—review & editing, supervision, project administration, \nfunding acquisition.  \nDeclaration of competing interest \nThe authors declare that they have no known competing financial interests or personal \nrelationships that could have appeared to influence the work reported in this paper. \nSupplementary data \nThe complete modeling questionnaire is provided in the supplemental file. The code used to \nanalyze and plot the workshop data is available on GitHub. \n[https://github.com/JavedMS/Mapping_Workshops_EFF].    \nData availability \nWorkshop materials, including presentations and interactive activities, can be provided on \nrequest. \nAcknowledgments \nThis study is part of the Energy for Future project, funded by UiO: Energy & Environment. \nThe funding institution was not involved in conducting the workshops. We thank all the \nschools for organizing them and the students for their contributions. Additionally, we extend \nour gratitude to the workshop instructors who facilitated the workshops and to all individuals \n32 \n\n\nwho contributed to designing the workshop materials and providing support throughout the \nproject. \nAppendix \nTable A1. Students and schools overview.  \nSchool  \nNumber of \nclasses  \nNumber of \nparticipants \nWorkshop format  \nLocation  \nStudy program  \n1  \n1  \n21  \nSpread out  \nUrban area  \nGeneral  \n2  \n1  \n12  \nThematic day  \nRural area  \nVocational  \n3  \n3  \n60  \nThematic day  \nRural area  \nGeneral  \n4  \n1  \n31  \nThematic day  \nUrban area  \nGeneral  \n5  \n6  \n162  \nThematic day  \nRural area  \nGeneral  \n \nTable A2. Representative scenarios of pupils' choice. \n \nTotal technology capacity \n(percent of new capacity \nadditions) \nLandscape \npreference \nLocation-based \ntechnology \npreference \n(Total=11 counties) \nPower lines \nImport\n/export  \n \nSolar \nOnshore \nOffshor\ne \n \nSolar \nWind \nOH \nUG \n \nBase \nscenario \nOPT \nOPT \nOPT \nOPT \nOPT \nOPT \nOPT \nOPT \nOPT \nScenario\n#01 \n25.8\n% \n23.5% \n50.7% \nOPT \nOPT \nOPT \nOPT \nOPT \nNo \nchange \nScenario\n#02 \n25.8\n% \n23.5% \n50.7% \nExclude \ndisagreed \nOPT \nOPT \nOPT \nOPT \nNo \nchange \nScenario\n#03 \n25.8\n% \n23.5% \n50.7% \nPreferred \nlandscapes \nOPT \nOPT \nOPT \nOPT \nNo \nchange \nScenario\n#04 \n25.8\n% \n23.5% \n50.7% \nPreferred \nlandscapes \nPupil \nchoice \nPupil \nchoice \nOPT \nOPT \nNo \nchange \nScenario\n#05 \n25.8\n% \n23.5% \n50.7% \nPreferred \nlandscapes \nPupil \nchoice \nPupil \nchoice \n41% 55.3% \nNo \nchange \n… \n… \n… \n… \n… \n… \n… \n… \n… \n… \n33 \n\n\nTechnology preference: The given technology preference is translated as a percentage of total new \ncapacities, set as the upper bound for the specified technology.  \nCounty preference: The same principle applies to location preferences, where the technology \npreference for a particular county is set as an upper cap. For instance, if the model opts to include \nonshore wind capacity in Oslo, it should not exceed 10% [Fig 5]. \nPower lines: As pupils seem divided between overhead or underground options, new transmission \ntypes and capacities will be optimized accordingly. \nOPT: optimal; OH: overhead; UG: underground; No change: same as today   \n \n \nFig. A1 Pupils’ regional preferences for (a) wind (b) solar installations across Norway. \nNearly 50% of participants selected Agder county for solar installations, while approximately \nthe same percentage preferred Trøndelag county for onshore wind installations (Related to \nFig. 5). \nReferences  \n[1]​ Neumann F. Costs of regional equity and autarky in a renewable European power \nsystem. Energy Strategy Rev 2021;35:100652. \nhttps://doi.org/10.1016/j.esr.2021.100652. \n[2]​ Perlaviciute G, Squintani L. Public Participation in Climate Policy Making: Toward \nReconciling Public Preferences and Legal Frameworks. One Earth 2020;2:341–8. \nhttps://doi.org/10.1016/j.oneear.2020.03.009. \n[3]​ McGookin C, Ó Gallachóir B, Byrne E. Participatory methods in energy system \nmodelling and planning – A review. Renew Sustain Energy Rev 2021;151:111504. \nhttps://doi.org/10.1016/j.rser.2021.111504. \n34 \n\n\n[4]​ McGookin C, Süsser D, Xexakis G, Trutnevyte E, McDowall W, Nikas A, et al. \nAdvancing participatory energy systems modelling. Energy Strategy Rev \n2024;52:101319. https://doi.org/10.1016/j.esr.2024.101319. \n[5]​ Hirt LF, Schell G, Sahakian M, Trutnevyte E. A review of linking models and \nsocio-technical transitions theories for energy and climate solutions. Environ Innov Soc \nTransit 2020;35:162–79. https://doi.org/10.1016/j.eist.2020.03.002. \n[6]​ Holzer S, Dubois A, Cousse J, Xexakis G, Trutnevyte E. Swiss electricity supply \nscenarios: Perspectives from the young generation. Energy Clim Change \n2023;4:100109. https://doi.org/10.1016/j.egycc.2023.100109. \n[7]​ Demski C, Spence A, Pidgeon N. Effects of exemplar scenarios on public preferences \nfor energy futures using the my2050 scenario-building tool. Nat Energy 2017;2:17027. \nhttps://doi.org/10.1038/nenergy.2017.27. \n[8]​ Goforth T, Levin T, Nock D. Incorporating energy justice and equity objectives in \npower system models. Renew Sustain Energy Rev 2025;210:115155. \nhttps://doi.org/10.1016/j.rser.2024.115155. \n[9]​ Vågerö O, Jackson Inderberg TH, Zeyringer M. The effects of fair allocation principles \non energy system model designs. Environ Res Energy 2024. \nhttps://doi.org/10.1088/2753-3751/ad8e6a. \n[10]​ Xexakis G, Hansmann R, Volken SP, Trutnevyte E. Models on the wrong track: \nModel-based electricity supply scenarios in Switzerland are not aligned with the \nperspectives of energy experts and the public. Renew Sustain Energy Rev \n2020;134:110297. https://doi.org/10.1016/j.rser.2020.110297. \n[11]​ Xexakis G, Trutnevyte E. Model-based scenarios of EU27 electricity supply are not \naligned with the perspectives of French, German, and Polish citizens. Renew Sustain \nEnergy Transit 2022;2:100031. https://doi.org/10.1016/j.rset.2022.100031. \n[12]​ Wong-Parodi G, Krishnamurti T, Davis A, Schwartz D, Fischhoff B. A decision science \napproach for integrating social science in climate and energy solutions. Nat Clim \nChange 2016;6:563–9. https://doi.org/10.1038/nclimate2917. \n[13]​ Ravikumar AP, Baker E, Bates A, Nock D, Venkataraman D, Johnson T, et al. Enabling \nan equitable energy transition through inclusive research. Nat Energy 2023;8:1–4. \nhttps://doi.org/10.1038/s41560-022-01145-z. \n[14]​ Elsawah S, Hamilton SH, Jakeman AJ, Rothman D, Schweizer V, Trutnevyte E, et al. \nScenario processes for socio-environmental systems analysis of futures: A review of \nrecent efforts and a salient research agenda for supporting decision making. Sci Total \nEnviron 2020;729:138393. https://doi.org/10.1016/j.scitotenv.2020.138393. \n[15]​ Dugstad A, Grimsrud K, Kipperberg G, Lindhjem H, Navrud S. Acceptance of wind \npower development and exposure – Not-in-anybody’s-backyard. Energy Policy \n2020;147:111780. https://doi.org/10.1016/j.enpol.2020.111780. \n[16]​ Nytte S, Alfnes F, Korhonen-Sande S. Public support and opposition toward floating \noffshore wind power development in Norway. Electr J 2024;37:107336. \nhttps://doi.org/10.1016/j.tej.2023.107336. \n[17]​ Dugstad A, Brouwer R, Grimsrud K, Kipperberg G, Lindhjem H, Navrud S. Nature is \nours! – Psychological ownership and preferences for wind energy. Energy Econ \n2024;129:107239. https://doi.org/10.1016/j.eneco.2023.107239. \n[18]​ Linnerud K, Dugstad A, Rygg BJ. Do people prefer offshore to onshore wind energy? \nThe role of ownership and intended use. Renew Sustain Energy Rev 2022;168:112732. \nhttps://doi.org/10.1016/j.rser.2022.112732. \n[19]​ Vågerö O, Bråte A, Wittemann A, Robinson JY, Zeyringer M, Sirotko‐Sibirskaya N. \nMachine learning of public sentiments towards wind energy in Norway. Wind Energy \n2024:we.2902. https://doi.org/10.1002/we.2902. \n35 \n\n\n[20]​ Höltinger S, Salak B, Schauppenlehner T, Scherhaufer P, Schmidt J. Austria’s wind \nenergy potential – A participatory modeling approach to assess socio-political and \nmarket acceptance. Energy Policy 2016;98:49–61. \nhttps://doi.org/10.1016/j.enpol.2016.08.010. \n[21]​ Olabisi LKS, Kapuscinski AR, Johnson KA, Reich PB, Stenquist B, Draeger KJ. Using \nscenario visioning and participatory system dynamics modeling to investigate the \nfuture: Lessons from Minnesota 2050. Sustainability 2010;2:2686–706. \nhttps://doi.org/10.3390/su2082686. \n[22]​ Droste-Franke B, Voge M, Kanngießer A. Achieving transparency and robustness of \nregional energy scenarios by using morphological fields in inter- and transdisciplinary \nproject groups. Energy Strategy Rev 2020;27:100430. \nhttps://doi.org/10.1016/j.esr.2019.100430. \n[23]​ den Herder M, Kurttila M, Leskinen P, Lindner M, Haatanen A, Sironen S, et al. Is \nenhanced biodiversity protection conflicting with ambitious bioenergy targets in eastern \nFinland? J Environ Manage 2017;187:54–62. \nhttps://doi.org/10.1016/j.jenvman.2016.10.065. \n[24]​ Marinakis V, Doukas H, Xidonas P, Zopounidis C. Multicriteria decision support in \nlocal energy planning: An evaluation of alternative scenarios for the Sustainable Energy \nAction Plan. Omega 2017;69:1–16. https://doi.org/10.1016/j.omega.2016.07.005. \n[25]​ Giannouli I, Tourkolias C, Zuidema C, Tasopoulou A, Blathra S, Salemink K, et al. A \nmethodological approach for holistic energy planning using the living lab concept: The \ncase of the prefecture of karditsa. Eur J Environ Sci 2018;8:14–22. \nhttps://doi.org/10.14712/23361964.2018.3. \n[26]​ Krumm A, Süsser D, Blechinger P. Modelling social aspects of the energy transition: \nWhat is the current representation of social factors in energy models? Energy \n2022;239:121706. https://doi.org/10.1016/j.energy.2021.121706. \n[27]​ Stober D, Suškevičs M, Eiter S, Müller S, Martinát S, Buchecker M. What is the quality \nof participatory renewable energy planning in Europe? A comparative analysis of \ninnovative practices in 25 projects. Energy Res Soc Sci 2021;71:101804. \nhttps://doi.org/10.1016/j.erss.2020.101804. \n[28]​ Uwasu M, Kishita Y, Hara K, Nomaguchi Y. Citizen-Participatory Scenario Design \nMethodology with Future Design Approach: A Case Study of Visioning of a \nLow-Carbon Society in Suita City, Japan. Sustainability 2020;12:4746. \nhttps://doi.org/10.3390/su12114746. \n[29]​ Sloam J, Henn M. How young people can shape environmental policy in urban spaces. \nPolicy Polit 2024;1:1–22. https://doi.org/10.1332/03055736Y2024D000000039. \n[30]​ Pickard S. Young Environmental Activists are Doing it Themselves. Polit Insight \n2019;10:4–7. https://doi.org/10.1177/2041905819891364. \n[31]​ The Politics of Youth Representation at Climate Change Conferences: Who Speaks, \nWho Is Spoken of, and Who Listens? | Global Environmental Politics | MIT Press n.d. \nhttps://direct.mit.edu/glep/article/24/2/19/117856/The-Politics-of-Youth-Representation-\nat-Climate (accessed February 3, 2025). \n[32]​ Vogel C, Nkrumah B, Kosciulek D, Lebea D, Booth T, Brown M. ‘Empowering youth \nas change agents for climate change in South Africa’: challenges, caveats and course \ncorrections. J Youth Stud 2022;25:812–32. \nhttps://doi.org/10.1080/13676261.2022.2046259. \n[33]​ Byskov MF, Hyams K. Who Should Represent Future Generations in Climate Planning? \nEthics Int Aff 2022;36:199–214. https://doi.org/10.1017/S0892679422000168. \n[34]​ Hickman C, Marks E, Pihkala P, Clayton S, Lewandowski RE, Mayall EE, et al. Climate \nanxiety in children and young people and their beliefs about government responses to \n36 \n\n\nclimate change: a global survey. Lancet Planet Health 2021;5:e863–73. \nhttps://doi.org/10.1016/S2542-5196(21)00278-3. \n[35]​ Lorenzini J, Monsch G-A, Rosset J. Challenging Climate Strikers’ Youthfulness: The \nEvolution of the Generational Gap in Environmental Attitudes Since 1999. Front Polit \nSci 2021;3. https://doi.org/10.3389/fpos.2021.633563. \n[36]​ Milkman R. A New Political Generation: Millennials and the Post-2008 Wave of \nProtest. Am Sociol Rev 2017;82:1–31. https://doi.org/10.1177/0003122416681031. \n[37]​ Knoll LJ, Leung JT, Foulkes L, Blakemore S-J. Age-related differences in social \ninfluence on risk perception depend on the direction of influence. J Adolesc \n2017;60:53–63. https://doi.org/10.1016/j.adolescence.2017.07.002. \n[38]​ The Quality of Representative Claims: Uncovering a Weakness in the Defense of the \nLiberal World Order - Pieter de Wilde, 2020 n.d. \nhttps://journals.sagepub.com/doi/10.1177/0032321719845199 (accessed February 3, \n2025). \n[39]​ Çakirlar Altuntaş E, Turan SL. Awareness of secondary school students about renewable \nenergy sources∗. Renew Energy 2018;116:741–8. \nhttps://doi.org/10.1016/j.renene.2017.09.034. \n[40]​ Halder P, Pietarinen J, Havu-Nuutinen S, Pelkonen P. Young citizens’ knowledge and \nperceptions of bioenergy and future policy implications. Energy Policy \n2010;38:3058–66. https://doi.org/10.1016/j.enpol.2010.01.046. \n[41]​ van de Wetering J, Leijten P, Spitzer J, Thomaes S. Does environmental education \nbenefit environmental outcomes in children and adolescents? A meta-analysis. J \nEnviron Psychol 2022;81:101782. https://doi.org/10.1016/j.jenvp.2022.101782. \n[42]​ Gunnerød JL. Forbruksutvikling i Norge 2022-2050 - delrapport til Langsiktig \nMarkedsanalyse 2022. \n[43]​ Internationale Energieagentur, editor. World energy outlook 2011. Paris: 2011. \n[44]​ Inderberg THJ, Rognstad H, Saglie I-L, Gulbrandsen LH. Who influences windpower \nlicensing decisions in Norway? Formal requirements and informal practices. Energy Res \nSoc Sci 2019;52:181–91. https://doi.org/10.1016/j.erss.2019.02.004. \n[45]​ Energy Policies of IEA Countries: Norway 2005 – Analysis. IEA 2005. \nhttps://www.iea.org/reports/energy-policies-of-iea-countries-norway-2005 (accessed \nJuly 5, 2024). \n[46]​ An overview of battery research and industry in Norway. \nhttps://www.sintef.no/globalassets/sintef-industri/nyheter/battery-research-and-industy.p\ndf. SINTEF 2024. \n[47]​ Mourik RM, Sonetti G, Robison RAV. The same old story – or not? How storytelling \ncan support inclusive local energy policy. Energy Res Soc Sci 2021;73:101940. \nhttps://doi.org/10.1016/j.erss.2021.101940. \n[48]​ Druckman JN, Green DP, Kuklinski JH, Lupia A. Experiments: An Introduction to Core \nConcepts. In: Lupia A, Greene DP, Kuklinski JH, Druckman JN, editors. Camb. Handb. \nExp. Polit. Sci., Cambridge: Cambridge University Press; 2011, p. 15–26. \nhttps://doi.org/10.1017/CBO9780511921452.002. \n[49]​ Copestake J, Ellum T. The Global Climate Change Game. Bristol, UK: The Economics \nNetwork; 2010. https://doi.org/10.53593/n1143a. \n[50]​ Price J, Mainzer K, Petrovic S, Zeyringer M, McKenna R. The Implications of \nLandscape Visual Impact on Future Highly Renewable Power Systems: A Case Study \nfor Great Britain. IEEE Trans Power Syst 2022;37:3311–20. \nhttps://doi.org/10.1109/TPWRS.2020.2992061. \n[51]​ Price J, Zeyringer M. highRES-Europe: The high spatial and temporal Resolution \nElectricity System model for Europe. SoftwareX 2022;17:101003. \n37 \n\n\nhttps://doi.org/10.1016/j.softx.2022.101003. \n[52]​ Devine-Wright P. Beyond NIMBYism: towards an integrated framework for \nunderstanding public perceptions of wind energy. Wind Energy 2005;8:125–39. \nhttps://doi.org/10.1002/we.124. \n[53]​ Krohn S, Damborg S. On public attitudes towards wind power. Renew Energy \n1999;16:954–60. https://doi.org/10.1016/S0960-1481(98)00339-5. \n[54]​ Grafakos S, Flamos A, Enseñado EM. Preferences Matter: A Constructive Approach to \nIncorporating Local Stakeholders’ Preferences in the Sustainability Evaluation of \nEnergy Technologies. Sustainability 2015;7:10922–60. \nhttps://doi.org/10.3390/su70810922. \n[55]​ Fortes P, Alvarenga A, Seixas J, Rodrigues S. Long-term energy scenarios: Bridging the \ngap between socio-economic storylines and energy modeling. Technol Forecast Soc \nChange 2015;91:161–78. https://doi.org/10.1016/j.techfore.2014.02.006. \n[56]​ Koecklin MT, Longoria G, Fitiwi DZ, DeCarolis JF, Curtis J. Public acceptance of \nrenewable electricity generation and transmission network developments: Insights from \nIreland. Energy Policy 2021;151:112185. https://doi.org/10.1016/j.enpol.2021.112185. \n[57]​ McGookin C, Mac Uidhir T, Ó Gallachóir B, Byrne E. Doing things differently: \nBridging community concerns and energy system modelling with a transdisciplinary \napproach in rural Ireland. Energy Res Soc Sci 2022;89:102658. \nhttps://doi.org/10.1016/j.erss.2022.102658. \n[58]​ Li P-H, Keppo I, Strachan N. Incorporating homeowners’ preferences of heating \ntechnologies in the UK TIMES model. Energy 2018;148:716–27. \nhttps://doi.org/10.1016/j.energy.2018.01.150. \n[59]​ Tvinnereim E, Lægreid OM, Fløttum K. Who cares about Norway’s energy transition? \nA survey experiment about citizen associations and petroleum. Energy Res Soc Sci \n2020;62:101357. https://doi.org/10.1016/j.erss.2019.101357. \n[60]​ Zeyringer M, Price J, Fais B, Li P-H, Sharp E. Designing low-carbon power systems for \nGreat Britain in 2050 that are robust to the spatiotemporal and inter-annual variability of \nweather. Nat Energy 2018;3:395–403. https://doi.org/10.1038/s41560-018-0128-x. \n[61]​ Price J, Keppo I, Dodds PE. The role of new nuclear power in the UK’s net-zero \nemissions energy system. Energy 2023;262:125450. \nhttps://doi.org/10.1016/j.energy.2022.125450. \n[62]​ 2023 Levelized Cost Of Energy+. Https://WwwLazardCom 2024. \nhttps://www.lazard.com/research-insights/2023-levelized-cost-of-energyplus/ (accessed \nJanuary 24, 2024). \n[63]​ GeoNorge 2023. https://www.geonorge.no/en/about/ (accessed December 15, 2023). \n[64]​ Clark T. `We’re Over-Researched Here!’: Exploring Accounts of Research Fatigue \nwithin Qualitative Research Engagements. Sociology 2008;42:953–70. \nhttps://doi.org/10.1177/0038038508094573. \n[65]​ Li P-H, Keppo I, Xenitidou M, Kamargianni M. Investigating UK consumers’ \nheterogeneous engagement in demand-side response. Energy Effic 2020;13:621–48. \nhttps://doi.org/10.1007/s12053-020-09847-7. \n[66]​ Solbrekke IM, Sorteberg A. Norwegian offshore wind power—Spatial planning using \nmulti-criteria decision analysis. Wind Energy 2024;27:5–32. \nhttps://doi.org/10.1002/we.2871. \n[67]​ Danopoulos E, Jenner LC, Twiddy M, Rotchell JM. Microplastic Contamination of \nSeafood Intended for Human Consumption: A Systematic Review and Meta-Analysis. \nEnviron Health Perspect 2020;128:126002. https://doi.org/10.1289/EHP7171. \n[68]​ Asplund J, Nordén J, Kjønaas OJ, Madsen RL, Lunde LF, Birkemoe T, et al. Long term \neffects of forest management on forest structure and dead wood in mature boreal forests. \n38 \n\n\nFor Ecol Manag 2024;572:122315. https://doi.org/10.1016/j.foreco.2024.122315. \n[69]​ MLA. Kahneman, Daniel, 1934-2024, author. Thinking, Fast and Slow. New \nYork :Farrar, Straus and Giroux. 2011. \n[70]​ IEA (2023), Tracking Clean Energy Progress 2023, IEA, Paris. IEA 2023. \nhttps://www.iea.org/energy-system/energy-efficiency-and-demand/demand-response \n(accessed August 5, 2024). \n[71]​ DeCarolis J, Daly H, Dodds P, Keppo I, Li F, McDowall W, et al. Formalizing best \npractice for energy system optimization modelling. Appl Energy 2017;194:184–98. \nhttps://doi.org/10.1016/j.apenergy.2017.03.001. \n[72]​ kontor S. Storstilt satsing på havvind. Regjeringa.no 2022. \nhttps://www.regjeringen.no/no/aktuelt/storstilt-satsing-pa-havvind/id2900436/ (accessed \nNovember 24, 2024). \n[73]​ energidepartementet O. Norwegian Ministry of Petroleum and Energy. Meld. St. 28 \n(2019-2020) Vindkraft På Land - Endringer i Konsesjonsbehandlingen. Meldinger Til \nStortinget 28, 2020. Regjeringen.no 2020. \nhttps://www.regjeringen.no/no/dokumenter/meld.-st.-28-20192020/id2714775/ \n(accessed August 6, 2024). \n[74]​ Rand J, Hoen B. Thirty years of North American wind energy acceptance research: \nWhat have we learned? Energy Res Soc Sci 2017;29:135–48. \nhttps://doi.org/10.1016/j.erss.2017.05.019. \n[75]​ Neumann F, Brown T. The near-optimal feasible space of a renewable power system \nmodel. Electr Power Syst Res 2021;190:106690. \nhttps://doi.org/10.1016/j.epsr.2020.106690. \n[76]​ Grochowicz A, Van Greevenbroek K, Benth FE, Zeyringer M. Intersecting near-optimal \nspaces: European power systems with more resilience to weather variability. Energy \nEcon 2023;118:106496. https://doi.org/10.1016/j.eneco.2022.106496. \n[77]​ Xexakis G, Trutnevyte E. Consensus on future EU electricity supply among citizens of \nFrance, Germany, and Poland: Implications for modeling. Energy Strategy Rev \n2021;38:100742. https://doi.org/10.1016/j.esr.2021.100742. \n \n39 \n\n\n \nBeyond costs: Mapping Norwegian youth perspectives for inclusive energy transition \n \nModelling Questionnaire \n \n \n \n \n \n \n \nSupplemental file \n \nMuhammad Shahzad Javed1,*, Karin Fossheim2, Paola Velasco-Herrejón1, Nikolai Elias Koop3, Matylda N. Guzik1, Charles Dana Samuelson2, \nBeate Seibt2, Marianne Zeyringer1 \n1Department of Technology Systems, University of Oslo, Norway. \n2Department of Psychology, University of Oslo, Oslo, Norway. \n3Department of Mathematics, University of Oslo, Oslo, Norway. \n*Corresponding author(s). E-mail(s): m.s.javed@its.uio.no \n \n \n \n \n \n\n\nQuestion for all: \n \nAccording to you, what is the most important to you that should be considered when installing renewable energy technologies? Rank them 1 as the most \nimportant and 3 as the least important (i.e., cost, nature reserves). \n1 \n2 \n3 \n \n \n \n \n \n \n \n\n\n \nTable attributes explanation \nHousehold electricity savings: Spending less on home energy because wind and solar power are cheaper now. This can also lead to more local municipality \nbenefits, i.e., sports facilities of people's choice. \n \nVisual impact: How often the installed wind/solar farms will be exposed/seen by local people. There are three categories of visual impact: High (seen by \nmany people); Medium (seen only by a few people); Low (barely seen by anyone). \n \nHeight: Height of Wind Turbines/Solar Panels. This can influence how they look in the landscape. \n \nArea needed to provide electricity to a house: It is the area (in square meters) needed to install wind/solar technology to meet the electricity consumption of \none Norwegian house. \n \nPower lines requirement: Transmission lines are needed to connect renewable energy farms with the electricity grid. Here three categories are introduced: \nHigh (long-distance transmission lines); Medium (short-distance transmission lines); Low (near-to-zero transmission expansion needed).      \n \n \n\n\nQ1: Ask ALL  \n  \n  \n \nseen often \n(high) \n60 \nLow \n High \n850 NOK per \nmonth (high) \nOff-shore \nwind \nOn-shore \nwind \nHousehold electricity savings \nArea needed to provide electricity to \na house (m2) \nAbove 200 meters \nBelow 200 meters \n200 to 600 \nMedium to high \n 0 NOK per month \nVisual impact \nHeight \nPower lines requirement \n850 NOK per month \nMedium to high \n\n\nQ2: If off-shore=1  \n  \n  \n \nOff-shore \nwind \nSolar + Off-shore wind \nVisual impact \nHeight \nArea needed to provide \nelectricity to a house (m2) \nPower lines requirement \n 0 NOK per month \n60 \nAbove 200 meters \nLow \n High \n328 NOK per month \nMedium to Low \nLow (solar) + high \n(off-shore wind) \n120 to150 \nMedium to high \n+ \nHousehold electricity savings \n\n\nQ3: if on-shore=1  \n  \n  \n \nHousehold electricity savings \nVisual impact \nHeight \nArea needed to provide \nelectricity to a house (m2) \nPower lines requirement \nMedium \nOn-shore \nwind large \nOn-shore \nwind small \n 850 NOK per month \n270 \n150-200 meters \n Medium to high \n1050 NOK per month \nhigh \n100-150 meters \n670  \nLow to Medium \n\n\nQ4: if on-shore large=1  \n  \n  \n \nArea needed to provide electricity \nto a house (m2) \nPower lines requirement \nMedium \nMedium (PV), \nhigh (wind) \nOn-shore \nwind large \nSolar + On-shore wind large \nHousehold electricity savings \nVisual impact \nHeight \n 847 NOK per month \n270 \n150-200 meters \n Medium to high \n766 NOK per month \nLow (solar) + high \n(on-shore wind) \n310 \nMedium to high \nMedium \n+ \n\n\nQ5: if on-shore small=1  \n  \n  \n \nVisual impact \nArea needed to provide \nelectricity to a house (m2) \nPower lines requirement \nhigh \nMedium (PV), \nvery high (wind) \nOn-shore \nwind small \nSolar + On-shore wind small \nHousehold electricity savings \nHeight \n 847 NOK per month \n670 \n100-150 meters \n Low to Medium \n766 NOK per month \nLow (PV) + High \n(on-shore wind) \n410 \nLow to Medium \nMedium to high \n+ \n\n\nQuestions for all: \nPower lines help connect new electric power stations to the local electricity grid. As Norway's electricity needs grow, we'll add more clean-energy power \nstations. There are two main ways to build these power lines: \n                        \n \n     Above ground power lines                                   \n                                Below ground power lines \n \n \n \n \n \n \n \n \n              (almost 20 times more expensive) \n \nHow would you like new power lines to be built? \n• \nNo new power lines should be built \n• \nPower lines above the ground \n• \nPower lines below the ground (cost 20 times more than above-ground lines) \n• \nPower lines below the ground in remote areas, above the ground in cities \n• \nPower lines above the ground in remote areas, below the ground in cities \n \n \nThe weather is the main driver for how much renewable energy (solar/wind) we can produce, meaning we might generate too much energy when we \ndo not need it or not enough when we do need it. Which option do you think is best to ensure we have the right amount of energy at all times? \n\n\n• \nShare extra electricity with nearby countries and get extra electricity from these countries when we need it \n• \nKeep extra electricity from renewable energy saved locally, for example, in batteries, to use later \n• \nUse a mix approach and save of electricity locally, while also share it with nearby countries \n• \nTry to use electricity when we make a lot of it (changing habitual patterns) \n \n \nCurrently, Norway is a net electricity exporter; what do you think about the country's future energy supply? \n• \nExport more than it does today \n• \nExport same as today \n• \nProduce enough for its use (net-zero) \n• \nOnly import from other countries  \n \n \nBelow are some features of an energy system. Please rank them based on how important they are to you. 1 = most important \no Zero carbon emissions \no Being able to produce all electricity locally from renewable energy (self-sufficiency) \no Keeping the cost of electricity low \no Protecting plants, animals, and birds (biodiversity) \n \n \n \n \nTo what extent do you agree with the following statement? \n\n\n \nStrongly disagree Disagree \nNeither agree nor \ndisagree \nAgree \nStrongly \nagree \nRenewable energy (wind/solar) should be prioritized to meet future energy \ndemand, even if it leads to higher electricity bills for Norwegian people.  \n☐ \n☐ \n☐ \n☐ \n☐ \nFuture demand can be met by buying electricity from other countries instead \nof installing more power stations locally. \n☐ \n☐ \n☐ \n☐ \n☐ \nNature reserves (animal/bird protection) must be taken care of in deciding \nthe wind turbine installations. \n☐ \n☐ \n☐ \n☐ \n☐ \n \n \nWhich Norwegian regions do you think are most appropriate to install wind farms (you may select more than one region): \n \no Agder \no Innlandet \no Møre og Romsdal \no Nordland \no Oslo \no Rogaland \no Vestfold og Telemark \no Troms og Finmark \no Trøndelag \no Vestland \no Viken \n \nWhich Norwegian regions do you think are most appropriate to install solar farms (you may select more than one region): \n\n\n \no Agder \no Innlandet \no Møre og Romsdal \no Nordland \no Oslo \no Rogaland \no Vestfold og Telemark \no Troms og Finmark \no Trøndelag \no Vestland \no Viken \n \n \nTo what extent do you agree to place wind installations in the following locations: \n  \nStrongly \ndisagree \nDisagree \nNeither agree nor \ndisagree \nAgree \nStrongly \nagree \nIn areas where there is little economic activity to attract new industry. ☐ \n☐ \n☐ \n☐ \n☐ \nNear electricity consumption places where most people live, i.e., \ncounties/municipalities? \n☐ \n☐ \n☐ \n☐ \n☐ \nIn remote areas with not much electricity consumption (high \ntransmission cost).  \n☐ \n☐ \n☐ \n☐ \n☐ \nIn areas where much of the natural landscapes are changed by human \nactivities (cities/towns). \n☐ \n☐ \n☐ \n☐ \n☐ \n\n\nIn areas where much of the natural landscape is unaffected by human \nactivities (forests/remote areas). \n☐ \n☐ \n☐ \n☐ \n☐ \nBuild renewable energy power stations near existing roads and power \nlines to minimize the need for new ones.  \n☐ \n☐ \n☐ \n☐ \n☐ \n \n \n \n \nTake a look at the pictures of different types of landscapes with and without wind turbines. To what extent do you agree or disagree to install wind \nfarms in the following locations. Remember, there are no correct or incorrect answers. Your opinion is what counts the most. \n \nBare rock mountains: Tall and steep landscapes with exposed rock \n \n   \n \n\n\n(without wind turbine installation) \n \n \n \n \n \n \n(With wind turbine installation) \n \n1: I strongly disagree, 9: strongly agree \nScale \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \nBare rock \nmountains \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n \n \nResidential/Urban: Part of a town/city where people live. \n   \n \n \n(without wind turbine installation) \n \n \n \n \n  (With wind turbine installation) \n \n1: I strongly disagree, 9: strongly agree \n\n\nScale \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \nResidential/urban \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n \n \n \n \nCommercial/industrial zones: area often filled with factories/warehouses where products are made/stored \n \n      \n \n(without wind turbine installation) \n \n \n \n \n  (With wind turbine installation) \n \n1: I strongly disagree, 9: strongly agree \n\n\nScale \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \nCommercial/industrial \nzones \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n \n \n \n \nNatural grassland/animal grazing land: wide open space often covered with grasses and some trees \n  \n \n(without wind turbine installation) \n \n \n \n \n  (With wind turbine installation) \n \n \n\n\n1: I strongly disagree, 9: strongly agree \nscale \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \nNatural grassland \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n \n \n \n \nNearshore areas (Beaches/dunes/coastal): Areas near to the sea \n \n \n   \n \n        (without wind turbine installation)  \n \n \n \n            (With wind turbine installation) \n \n\n\n1: I strongly disagree, 9: strongly agree \nscale \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \nNearshore areas \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n \n \n \nSparsely vegetated areas: Places with not many plants but patches of grass \n \n   \n \n  \n \n    (without wind turbine installation) \n \n \n \n \n        (With wind turbine installation) \n \n\n\n \n1: I strongly disagree, 9: strongly agree \nscale \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \nSparsely vegetated \nareas \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n \n \nOffshore areas: a part of the ocean and far from the land (wind can be installed within a certain distance from the land, depending on how deep the water is)   \n \n \n    (without wind turbine installation) \n \n \n \n \n        (With wind turbine installation) \n \n1: I strongly disagree, 9: strongly agree \nscale \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \noffshore areas \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n\n\n \n \n \n \nArable land (agriculture): areas suitable for farming \n          \n \n    (without wind turbine installation) \n \n \n \n \n        (With wind turbine installation) \n \n \n1: I strongly disagree, 9: strongly agree \nscale \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \narable land \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n \n\n\n \nForests (Mixed type): large areas covered with different types of trees but also have patches of land \n \n  \n       \n \n \n    (without wind turbine installation) \n \n \n \n \n        (With wind turbine installation) \n \n1: I strongly disagree, 9: strongly agree \nscale \n1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \nForests (Mixed \ntype) \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n☐ \n \n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.19974v1.pdf",
    "total_pages": 60,
    "title": "Beyond costs: Mapping Norwegian youth preferences for a more inclusive energy transition",
    "authors": [
      "Muhammad Shahzad Javed",
      "Karin Fossheim",
      "Paola Velasco-Herrejón",
      "Nikolai Elias Koop",
      "Matylda N. Guzik",
      "Charles Dana Samuelson",
      "Beate Seibt",
      "Marianne Zeyringer"
    ],
    "abstract": "Environmental movements and climate strikes have made it apparent that youth\nfeel excluded from the ongoing energy transformation process, highlighting the\ncrucial need for their engagement to achieve a socially accepted transition.\nThis interdisciplinary study focuses on the Norwegian electricity system and\ninvolves conducting educational workshops with high school students aged 15 to\n16 to ascertain their perspectives towards a net-zero energy system. The\nworkshops were structured into three segments, starting with the dissemination\nof common knowledge about energy and climate, followed by interactive\nactivities designed to explore and develop an understanding of various aspects\nof energy transition. Three rounds of questionnaires, administered at distinct\ntime intervals, assessed changes in students' attitudes and\nsocio-techno-economic preferences. Our findings show that 33\\% of pupils\nfavored exclusively offshore wind as a main energy source, while 35\\% opted to\ncombine it with solar energy, indicating that over 68\\% viewed offshore wind as\nfavorable. Although 32\\% supported some form of land-based wind turbines, there\nwas strong disagreement about wind parks in agricultural, forested, and\nresidential areas. Preferences also exhibited considerable regional variation;\nsolar installations were favored in southern and southeastern Norway, while\nwind farms were suggested for central and northern regions. Pupils emphasized\nenergy independence, showed reluctance towards demand response, prioritized\nreducing emissions and preserving biodiversity over minimizing electricity\ncosts. Despite cost-minimization being core to most energy system models, youth\ndeemed it the least important factor, highlighting a disconnect between\nmodeling priorities and their perspectives.",
    "published_date": "2025-02-27",
    "source": "arxiv"
  }
}