{
  "id": "arxiv_2502.21225v1",
  "text": "Large Seebeck coefficient driven by “pudding mold” flat band in hole-doped CuRhO2\nAmitayush Jha Thakur,1, 2 Maximilian Thees,1 Franck Fortuna,1\nEmmanouil Frantzeskakis,1 Daisuke Shiga,3, 4 Hiromichi Kuriyama,5 Minoru Nohara,6\nHidenori Takagi,7, 8 Hiroshi Kumigashira,3, 4 and Andr´es F. Santander-Syro1, ∗\n1Universit´e Paris-Saclay, CNRS, Institut des Sciences Mol´eculaires d’Orsay, 91405, Orsay, France\n2Donostia International Physics Center, 20018 Donostia-San Sebasti´an, Spain\n3Institute of Multidisciplinary Research for Advanced Materials (IMRAM), Tohoku University, Sendai, 980-8577, Japan\n4Photon Factory, Institute of Materials Structure Science,\nHigh Energy Accelerator Research Organization (KEK), 1-1 Oho, Tsukuba 305-0801, Japan\n5Department of Advanced Materials Science, The University of Tokyo, Kashiwa 277-8561, Japan\n6Department of Quantum Matter, Hiroshima University, Higashi-Hiroshima 739-8530, Japan\n7Department of Physics, The University of Tokyo, Tokyo 113-0033, Japan\n8Max Planck Institute for Solid State Research, 70569 Stuttgart, Germany\nWe report the measurement, using angle-resolved photoemission spectroscopy, of the metallic\nelectronic structure of the hole-doped thermoelectric oxide CuRh0.9Mg0.1O2. The material is found\nto have a “pudding mold” type band structure, with a nearly flat band edge located near the Fermi\nlevel, which is thought to be the origin of the thermoelectric behavior of this material. The experi-\nmental data match the density functional theory of the undoped parent compound, simply corrected\nby a rigid shift of the bands. Transport calculations based on the observed band structure yield a\nSeebeck coefficient of ∼200 µV/K for the undoped parent material, consistent with experimental\nmeasurements. Our results show that CuRhO2 is a textbook example of how pure band-structural\neffects can result in a large thermoelectric figure of merit, demonstrating that flat band edges in\noxides are a realistic route for the efficient conversion of thermal energy.\nINTRODUCTION\nMaterials that can efficiently convert thermal energy\ninto electricity and vice versa, i.e. good thermoelectric\nmaterials, are desirable for solid-state cooling applica-\ntions and waste heat conversion to usable energy [1].\nAmong many classes of materials under consideration\nfor thermoelectric device applications, such as bismuth\nchalcogenides [2] or lead telluride [3], oxides possess the\nadvantages of thermal stability (hence operability at high\ntemperatures), low toxicity and high oxidation resis-\ntance [4].\nThe thermoelectric performance of a material is char-\nacterized by the thermoelectric figure of merit ZT =\nS2σT/κ, where S is the Seebeck coefficient, σ is the elec-\ntrical conductivity, T is the temperature, and κ is the\nthermal conductivity. A high Seebeck coefficient, along\nwith good electrical conductivity and low thermal con-\nductivity, is therefore critical for potential applications.\nHowever, materials with large carrier concentration, and\nhence a good electrical conductivity like most metals,\nusually have a low Seebeck coefficient and large thermal\nconductivity [5]. Doping to introduce carriers increases\nboth the electrical and electronic thermal conductivity,\ndue to the Wiedemann-Franz law [6], so this strategy to\nincrease the figure of merit requires efforts to reduce the\nlattice thermal conductivity.\nRecent theoretical works have shown that materials\nwith a nearly flat band within kBT of Fermi level (µ)\nhave both a large Seebeck coefficient and an increased\nelectronic conductivity, suggesting an alternative route\nto achieve a large figure or merit. As demonstrated in [7],\nunder the reasonable assumption that the quasiparticle\nlifetime τ(k) is momentum-independent, and considering\nonly the diagonal part of the Seebeck coefficient tensor\nas S, one can approximately write\nS = kB\ne\nP′\nk v2\nB −v2\nA\nP′\nk v2\nB + v2\nA\n,\n(1)\nwhere kB is the Boltzmann constant, e < 0 is the elec-\ntron charge, ε(k) is the momentum-dependent energy of\nthe conduction band, P′\nk is a sum over k states with\n|ε(k) −µ| < kBT, and vA, vB are respectively the group\nvelocities of states just above and below the chemical\npotential µ. The presence of a flat band just above (be-\nlow) µ which changes to a highly dispersive band below\n(above) µ, i.e v2\nA ≪v2\nB (v2\nA ≫v2\nB), results in a large\nvalue of |S| ∼O(kB/|e|) ∼O(100)µV/K along with rel-\natively low resistivity coming from the conducting band,\nwhich results in a strong enhancement in the thermoelec-\ntric figure of merit ZT. This type of band structure is re-\nferred to as the “pudding mold” type band, and has been\ntheoretically investigated in oxides such as NaxCoO2 [7],\nLaRhO3 and CuRhO2 [8] and other materials like FeAs2\nand PtSe2 [9].\nTransition-metal oxides, some of which are both con-\nductive and thermoelectric materials, are in principle\ngood candidates for realizing such “pudding mold” band\nscenario, thanks to the narrow d-orbitals constituting\ntheir conduction band and the natural occurrence of lay-\nered structure which promotes in-plane electrical conduc-\ntivity and minimizes the out-of-plane thermal conductiv-\narXiv:2502.21225v1  [cond-mat.str-el]  28 Feb 2025\n\n\n2\nFigure 1.\n(a) The conventional hexagonal unit cell of CuRhO2,\nwith atoms colored red (O), blue (Cu), and gray (Rh). (b) Brillouin\nzone (BZ) of CuRhO2, showing high-symmetry points (Γ, K, M)\nand the path used for band structure calculations.\nity [10].\nIn particular, the layered oxide CuRhO2 has\nraised interest as thermoelectric material [8, 11, 12]. It\nbelongs to the 166 −R3m space group with the typical\ndelafossite structure, with RhO2 layers stacked between\nthe the triangular Cu layers (see Fig. 1), a semiconduct-\ning band gap of 1.9 eV [13], and a high Seebeck coefficient\nof ∼200 µV/K at 300 K [12]. Mg substitution of Rh sites\nleads to the introduction of hole carriers in the material,\nresulting in a transition to a metallic state.\nThe See-\nbeck coefficient decreases systematically with doping in\nsingle-crystalline samples, but the 10% Mg-substituted\ncompound CuRh0.9Mg0.1O2 (CRMO) still exhibits a rel-\natively large Seebeck coefficient of ∼100 µV/K at 300\nK [12].\nOn the other hand, as narrow d-bands might also re-\nsult in strong electron correlations, another mechanism\nfor the enhancement of the Seebeck coefficient has been\nproposed in transition-metal oxides, namely correlation-\ninduced spin degeneracy, as demonstrated e.g. in the case\nof NaCo2O4 [14].\nTherefore, accessing the experimen-\ntal electronic structure of thermoelectric transition-metal\noxides is essential to disentangle the effects of strong cor-\nrelations from those of pure band-structural origin, and\nto verify the mechanism driving the enhanced Seebeck\ncoefficient. More generally, an experimental demonstra-\ntion of a “pudding mold” band in a good thermoelectric\nmaterial, together with a proof that such band structure\nis at the origin of the material’s large Seebeck coefficient,\nhas been so-far missing.\nIn this paper we report the direct observation, through\nangle-resolved photoemission spectroscopy (ARPES), of\na “pudding mold” electronic structure of metallic 10%\nMg doped CuRhO2 (CRMO). We compare our results\nwith density functional theory (DFT) calculations, which\nconfirm the presence of a nearly flat band edge near the\nFermi level and yield a theoretical estimate of the See-\nbeck coefficient that agrees well with the experimental\nmeasurements.\nSingle crystals of CuRh0.9Mg0.1O2 were synthesized\nusing the self-flux method.\nFirst, polycrystalline sam-\nples were prepared by reacting a stoichiometric mixture\nof CuO, Rh2O3, and MgO at 1050 °C for 24 hours with\nintermediate grinding. The resulting powder was then\nmixed with CuO at a ratio of CuO:CuRh0.9Mg0.1O2 =\n10:1 in a platinum crucible. The mixture was heated to\n1200 °C for 5 hours, then slowly cooled to 1050 °C at a\nrate of 0.5 °C per hour, followed by rapid cooling to room\ntemperature at a rate of 300 °C per hour. Finally, the\nresidual flux was removed using an aqueous solution of 1\nM HNO3.\nARPES measurements were performed using syn-\nchrotron radiation at the BL2-A (Mushashi) beamline\nin Photon Factory, KEK. The electron analyzer in the\nsetup was Scienta-Omicron SES-2002. Soft X-rays (SX)\nphotons with linear horizontal (LH) polarization—that\nis, p-polarized with respect to the measurement geome-\ntry—in the energy range of 500–620 eV, and vacuum ul-\ntraviolet (V-UV) photons at 182 eV with LH polarization\nwere used. The CRMO samples were cleaved along [001]\nand measured in UHV conditions with pressure main-\ntained around 5 × 10−11mbar at a temperature of 20 K.\nThe Fermi level was set by fitting a Fermi function convo-\nluted with a linear function to the momentum integrated\nenergy slices of the energy-momentum measurements.\nDFT calculations of CuRhO2 electronic structure were\nperformed with the QUANTUM ESPRESSO [15] code\nwith a plane wave basis, using a polarized general gra-\ndient approximation (GGA) exchange-correlation func-\ntional of Perdew-Burke-Ernzerhof (PBE) from the Stan-\ndard solid-state pseudopotentials (SSSP) efficiency li-\nbrary [16, 17]. The plane wave kinetic energy cutoff is\nset to 55 Ry and the charge density kinetic energy cutoff\nis 440 Ry.\nTo simulate 10% Mg-doped CuRhO2, we performed\nelectronic structure calculations on undoped CuRhO2\nwith a small modification to its crystal structure. The\nlattice parameters were set to a = 3.068 ˚A and c =\n17.09 ˚A (with respect to the conventional hexagonal lat-\ntice). To simulate the doped material, the lattice param-\neter a was set to be approximately 0.2% smaller than\nthe value reported for undoped CuRhO2 in Ref. [18].\nThis adjustment accounts for the reduction in the average\nionic radius at the Rh site due to Mg doping, as described\nin Ref. [12]. The parameter c remains the same as that for\nthe undoped material. The unit cell was then relaxed by\nallowing the atomic positions to adjust while keeping the\ncell dimensions fixed. Finally, the calculated bands were\naligned with the band measured in the Mg-doped com-\npound by applying a rigid band shift of -0.06 eV from the\ntop of the valence band maximum. This shift provides\na first approximation of the electronic structure changes\ninduced by hole doping via Mg substitution. The value\n\n\n3\n(\n(\nFigure 2.\nConstant energy maps of CuRhO2 measured at\nhν = 182 eV (Maps at SX energy of hν = 542 eV are presented in\nSupplementary Material, Section S4). Maps are shown at energies\nof (a) 0 eV, (b) −0.1 eV, (c) −0.3 eV, and (d)−0.4 eV relative to\nthe Fermi level. The hexagonal BZ is overlaid in red in (a).\nof 0.06 eV was determined by observing the shift in the\nFermi level in the DOS obtained from a supercell (SC)\ncalculation consisting of 10 Rh sites, in which one Rh\natom was replaced by a Mg atom that corresponds to\n10% Mg doping (Supplementary Material, Section S1).\nThe BoltzTrap package [19] utilizing semi-classical\ntransport equations was used to calculate the Seebeck co-\nefficient based on the DFT band structure of the doped\nmaterial.\nThe calculation of Seebeck coefficient of the\nundoped material was also done for comparison, based\non the DFT calculations of pristine CuRhO2 structure\n(a = 3.075 ˚A and c = 17.09 ˚A ) without any band shifts.\nAs shown in Fig. 2(a), the Fermi surface of CRMO\nat the bulk Γ plane is composed of six symmetrical tri-\nangular hole-like pockets centered at the high-symmetry\nK-points. Figs. 2(b-d) show the evolution of the constant\nenergy surface at different energies.\nFig. 3(a) shows the second derivative intensity plots of\nthe ARPES dispersion, calculated along the energy axis.\nThe ARPES data, measured along the high-symmetry\npaths K–M–Γ–K at 542 eV and K′–M ′–Z–K′ at 590\neV, are overlaid with the corresponding DFT calcula-\ntions. For reference, the unprocessed (raw) ARPES dis-\npersions can be found in Section S3 of the Supplementary\nMaterial. Fig. 3(b) shows the out-of-plane Fermi surface\nmap, spanning the Γ11 (referring to Γ<0 0 11>) and Z11\n(referring to Z<0 0 11>) high symmetry points in recipro-\ncal space. The corresponding ARPES energy-momentum\nFigure 3.\n(a) Left:\nARPES in-plane band dispersion along\nK–M–Γ–K at 542 eV and K′–M′–Z–K′ at 590 eV. Right: Angle-\nintegrated energy dispersion for raw ARPES data (black curves),\nsecond derivative intensity (dashed blue curves) and calculated\nDOS (red curves). (b) Out-of-plane Fermi surface along kz −kx\nplane, spanning the high symmetry points Γ11 (hν = 538 eV)\nand Z11 (hν = 590 eV). (c) Energy-momentum dispersion along\nkz (normal emission) with kx along M–Γ–M direction. Red solid\ncurves represent theoretical bands, while dotted red curves show\nexperimental fits.\nIn panels (b) and (c), the data was obtained\nusing photons in the range of 500 −620 eV energy. Γ11 is calcu-\nlated to lie at 538 eV by fitting with the kz measurement and using\nan inner potential of 23.5 eV in the three step model approxima-\ntion [20].\ndispersion along kz (momenta along out-of-plane z direc-\ntion), shown in Fig. 3(c), reveals a cosine-like band dis-\npersion with an electron-like minimum around kz = Γ\nand a hole-like maximum at kz = Z. The experimental\nbandwidth along kz is smaller than the calculated one by\na factor of about 0.65. This can be due to unaccounted\ncorrelations of the Rh 4d t2g orbitals in the calculations.\nThis discrepancy in band dispersion along kz is also seen\nin the in-plane dispersion at kz = Z (Fig. 3(a)), where\nthe valence band maxima around Z is shifted ∼-0.2 eV\ncompared to the calculations.\nWe also compare the calculated DOS with the angle-\nintegrated ARPES intensity in Fig. 3(a). The raw angle-\nintegrated intensity exhibits broad peaks centered around\n–0.7 eV and –1.7 eV that align with the main features of\nthe calculated DOS, but it does not capture the finer\npeak structures or the precise bandwidths. In contrast,\nthe angle-integrated intensity of the second derivative re-\nsolves the finer double-peak feature near the Fermi level,\nas well as the bandwidths of the bands around –0.7 eV\nand –1.7 eV. From the ARPES measurements of the dis-\npersion and the angle-integrated intensities, the conduc-\ntion band bandwidth is determined to be ∼0.8 eV, which\nmatches the calculations. Overall, the DFT calculations\naccurately reproduce the experimentally observed elec-\n\n\n4\nFigure 4. Left: Orbital-projected bands of CRMO (with the Fermi\nlevel set shifted to -0.06 eV from the top of the valence band) with\norbital weights indicated by the size of coloured circles.\nRight:\nOrbital-projected DOS. Inset: A closer view of the DOS near the\nFermi level shows the density of Rh t2g orbitals and Cu dz2 or-\nbitals are similar at the Fermi level. Cu drest refers to the com-\nbined weight of the Cu d orbitals excluding the Cu dz2 orbital.\nVertical black line indicates gap between conduction band minima\nand valence band maxima.\ntronic structure.\nAs shown in Fig. 4, the calculated gap between the\nvalence band maxima and the conduction band minima\nis ∼0.8 eV, which is smaller than the experimental value\nof ∼1.9 eV for the undoped material. This discrepancy\ncan be attributed to the underestimation of the insulat-\ning band gap by DFT [21]. Although DFT+U calcula-\ntions match the experimental gap more closely, the over-\nall dispersion from standard DFT is in closer agreement\nwith experimental band structure data (see Supplemen-\ntary Material, Section S2). The calculations indicate that\nthe conduction band edge of CRMO exhibits distinct or-\nbital characters depending on momentum. At the K and\nK′ points, the conduction band comprises Cu 3dz2 states\nhybridized with Rh 4d t2g orbitals, whereas at the Γ and\nZ points it is composed entirely of Rh t2g orbitals.\nFrom the calculated bands, the in-plane group ve-\nlocities near K (i.e.\ntop of the conduction band) are\nvA = 0.57 eV˚A and vB = 1.00 eV˚A, while the group ve-\nlocities near K′ are vA = 0.49 eV˚A and vB = 1.36 eV˚A\naveraged within an energy window of kBT ≈1000 K\naround the Fermi level. Assuming that the in-plane See-\nbeck coefficient in CRMO comes essentially from elec-\ntronic states around K′, and using the above values of\ngroup velocities above and below EF around K′, one ob-\ntains from Eq. 1, an estimated value of S ∼66 µV/K\nwhich is of the same order as the experimental value of\n∼100 µV/K in CRMO measured at 300 K [12].\nTo better illustrate the “pudding mold” nature of the\nbands, the in-plane bands along Γ–K–M–Γ and the out-\nof-plane bands along Γ–K–K′–Z for CRMO are plotted\nin Fig. 5. For the in-plane bands, we observe that the con-\nFigure 5.\nBand structure plots along (a) Γ–K–M–Γ and (b)\nΓ–K–K′–Z high-symmetry points. The plane in which these high-\nsymmetry points lie, located within the Brillouin zone, is illustrated\nin the inset.\nduction band maximum lies just above the Fermi level at\nthe K point. This feature results in an enhancement of\nthe Seebeck coefficient as vA < vB in the small region\naround K. However, the out-of-plane conduction band\nhas a large flat region between the K and K′ points and\nis a model example of the “pudding mold” band struc-\nture. This “pudding mold” feature leads to a greater en-\nhancement of the Seebeck coefficient in the out-of-plane\ndirection.\nFig. 6 shows the calculated Seebeck coefficients for\nthe undoped and the 10% doped material.\nUndoped\nCuRhO2 has a Seebeck coefficient of ∼200 µV/K at 300\nK, and the 10% doped sample CRMO has a Seebeck co-\nefficient of ∼70 µV/K at 300 K. These values closely\nmatch the values measured for polycrystalline samples\n[22]. However, they are slightly smaller than the values\nmeasured for single crystals [12]. This discrepancy might\nbe due to the effects of electron-phonon interactions ob-\nserved in CuRhO2 single crystals [12]. Furthermore, the\ncomparisons between the in-plane (Sxx) and out-of-plane\n(Szz) Seebeck coefficient show that, above 300 K, the out-\nof-plane component of the Seebeck coefficient increases\nfaster than the in-plane component. This is ascribed to\nthe flatter dispersion in the K–K′ direction. The high\n\n\n5\nvalue of Szz ∼256 µV/K at 1000 K for the doped sample\nis very close to the experimental value of ∼260 µV/K\nreported in Ref. [11].\nIn conclusion, our ARPES observations of the elec-\ntronic structure near the Fermi level for CRMO fit well\nwith the calculated band structure and its description\nin terms of the “pudding mold” band model. Our work\nprovides an experimental basis for the realization of ma-\nterials with large Seebeck coefficients and thermoelectric\nfigure of merit, originating from a flat conduction band\nwith the band edge lying close to the Fermi level.\nACKNOWLEDGEMENTS\nWork at ISMO was supported by public grants from\nthe Agence Nationale de la Recherche (ANR), project\nFermi-NESt No. ANR-16-CE92-0018, by the “Labora-\ntoire d’Excellence Physique Atomes Lumi`ere Mati`ere”\n(LabEx PALM ) projects ELECTROX, 2DEG2USE and\n2DTROX, overseen by the ANR as part of the “In-\nvestissements d’Avenir” program ANR-10-LABX-0039,\nand by the CNRS International Research Project EX-\nCELSIOR. Work at Tohoku University was supported\nby Grants-in-Aid for Scientific Research (Nos. 16H02115\nand 16KK0107) from the Japan Society for the Promo-\ntion of Science. Experiments at KEK-PF were performed\nunder the approval of the Program Advisory Commit-\ntee (Proposals 2016G621 and 2018S2-004) at the Insti-\ntute of Materials Structure Science at KEK. This work\nwas performed using HPC resources from the M´esocentre\ncomputing center of CentraleSup´elec and ´Ecole Normale\nSup´erieure Paris-Saclay supported by CNRS and R´egion\nˆIle-de-France (http://mesocentre.centralesupelec.fr/).\n0\n200\n400\n600\n800\n1000\n1200\n0\n100\n200\n300\n400\nSxx undoped\nSzz undoped\nSxx 10% doped\nSzz 10% doped\nExp. data [11]\nExp. data [12]\nT (K)\nS (μV/K)\nFigure 6. The Sxx and Szz components of the calculated Seebeck\ncoefficient versus temperature level for the undoped sample and\nthe 10% doped sample. Experimental data from [11] and [12] are\ncompared to the calculations of the doped Seebeck coefficient.\n∗andres.santander-syro@universite-paris-saclay.fr\n[1] G. D. Mahan and J. O. Sofo, The best thermoelectric.,\nProceedings of the National Academy of Sciences 93,\n7436 (1996).\n[2] I. T. Witting, T. C. Chasapis, F. Ricci, M. Peters, N. A.\nHeinz, G. Hautier, and G. J. Snyder, The Thermoelectric\nProperties of Bismuth Telluride, Advanced Electronic\nMaterials 5, 1800904 (2019).\n[3] A. D. LaLonde, Y. Pei, H. Wang, and G. Jeffrey Snyder,\nLead telluride alloy thermoelectrics, Materials Today 14,\n526 (2011).\n[4] Y. S. Malakhov and G. V. Samsonov, Regularities gov-\nerning the thermal stability of oxides of the transition\nmetals, Soviet Powder Metallurgy and Metal Ceramics\n5, 981–986 (1966).\n[5] F. J. Blatt, P. A. Schroeder, C. L. Foiles, and D. Greig,\nIntroduction, in Thermoelectric Power of Metals, edited\nby F. J. Blatt, P. A. Schroeder, C. L. Foiles, and D. Greig\n(Springer US, Boston, MA, 1976).\n[6] W. Jones and N. H. March, Theoretical solid state physics\n(Dover Publications, New York, 1985).\n[7] K. Kuroki and R. Arita, “pudding mold” Band Drives\nLarge Thermopower in NaxCoO2, Journal of the Physical\nSociety of Japan 76, 083707 (2007).\n[8] H. Usui, R. Arita, and K. Kuroki, First-principles study\non the origin of large thermopower in hole-doped LaRhO3\nand CuRhO2, Journal of Physics: Condensed Matter 21,\n064223 (2009).\n[9] H. Usui, K. Kuroki, S. Nakano, K. Kudo, and M. Nohara,\nPudding-Mold-Type Band as an Origin of the Large See-\nbeck Coefficient Coexisting with Metallic Conductivity\nin Carrier-Doped FeAs2 and PtSe2, Journal of Electronic\nMaterials 43, 1656 (2014).\n[10] A. I. Romanenko, G. E. Chebanova, T. Chen, W. Su,\nand H. Wang, Review of the thermoelectric properties of\nlayered oxides and chalcogenides, Journal of Physics D:\nApplied Physics 55, 143001 (2022).\n[11] H. Kuriyama, M. Nohara, T. Sasagawa, K. Takubo,\nT.\nMizokawa,\nK.\nKimura,\nand\nH.\nTakagi,\nHigh-\ntemperature thermoelectric properties of delafossite ox-\nide CuRh1−xMgxO2, in 2006 25th International Confer-\nence on Thermoelectrics (2006) pp. 97–98.\n[12] K. Kurita, H. Sakabayashi, and R. Okazaki, Correlation\nin transport coefficients of hole-doped CuRhO2 single\ncrystals, Physical Review B 99, 115103 (2019).\n[13] J. Gu, Y. Yan, J. W. Krizan, Q. D. Gibson, Z. M. De-\ntweiler, R. J. Cava, and A. B. Bocarsly, p-Type CuRhO2\nas a Self-Healing Photoelectrode for Water Reduction un-\nder Visible Light, Journal of the American Chemical So-\nciety 136, 830 (2014).\n[14] W. Koshibae, K. Tsutsui, and S. Maekawa, Thermopower\nin cobalt oxides, Physical Review B 62, 6869 (2000).\n[15] P. Giannozzi, S. Baroni, N. Bonini, M. Calandra, R. Car,\nC. Cavazzoni, D. Ceresoli, G. L. Chiarotti, M. Cococ-\ncioni, I. Dabo, A. Dal Corso, S. de Gironcoli, S. Fabris,\nG. Fratesi, R. Gebauer, U. Gerstmann, C. Gougoussis,\nA. Kokalj, M. Lazzeri, L. Martin-Samos, N. Marzari,\nF. Mauri, R. Mazzarello, S. Paolini, A. Pasquarello,\nL. Paulatto, C. Sbraccia, S. Scandolo, G. Sclauzero, A. P.\nSeitsonen, A. Smogunov, P. Umari, and R. M. Wentz-\ncovitch, QUANTUM ESPRESSO: a modular and open-\n\n\n6\nsource software project for quantum simulations of mate-\nrials, Journal of Physics: Condensed Matter 21, 395502\n(2009).\n[16] G. Prandini, A. Marrazzo, I. E. Castelli, N. Mounet, and\nN. Marzari, Precision and efficiency in solid-state pseu-\ndopotential calculations, npj Computational Materials 4,\n1 (2018).\n[17] K. Lejaeghere, G. Bihlmayer, T. Bj¨orkman, P. Blaha,\nS. Bl¨ugel, V. Blum, D. Caliste, I. E. Castelli, S. J.\nClark, A. Dal Corso, S. de Gironcoli, T. Deutsch,\nJ. K. Dewhurst, I. Di Marco, C. Draxl, M. Du lak,\nO. Eriksson, J. A. Flores-Livas, K. F. Garrity, L. Gen-\novese, P. Giannozzi, M. Giantomassi, S. Goedecker,\nX. Gonze, O. Gr˚an¨as, E. K. U. Gross, A. Gulans, F. Gygi,\nD. R. Hamann, P. J. Hasnip, N. A. W. Holzwarth,\nD. Iu¸san, D. B. Jochym, F. Jollet, D. Jones, G. Kresse,\nK. Koepernik, E. K¨u¸c¨ukbenli, Y. O. Kvashnin, I. L. M.\nLocht, S. Lubeck, M. Marsman, N. Marzari, U. Nitzsche,\nL. Nordstr¨om, T. Ozaki, L. Paulatto, C. J. Pickard,\nW. Poelmans, M. I. J. Probert, K. Refson, M. Richter,\nG.-M. Rignanese, S. Saha, M. Scheffler, M. Schlipf,\nK. Schwarz, S. Sharma, F. Tavazza, P. Thunstr¨om,\nA. Tkatchenko, M. Torrent, D. Vanderbilt, M. J. van Set-\nten, V. Van Speybroeck, J. M. Wills, J. R. Yates, G.-X.\nZhang, and S. Cottenier, Reproducibility in density func-\ntional theory calculations of solids, Science 351, aad3000\n(2016).\n[18] E. Bertaut and J. Dulac, Sur l’isomorphisme d’oxydes\nternaires de chrome et de rhodium trivalents, Journal of\nPhysics and Chemistry of Solids 21, 118 (1961).\n[19] G. K. Madsen and D. J. Singh, BoltzTraP. A code for cal-\nculating band-structure dependent quantities, Computer\nPhysics Communications 175, 67 (2006).\n[20] S. H¨ufner, Photoelectron spectroscopy:\nprinciples and\napplications (Springer-Verlag, Berlin; New York, 1995)\noCLC: 680387137.\n[21] J. P. Perdew, Density functional theory and the band gap\nproblem, International Journal of Quantum Chemistry\n28, 497 (1985).\n[22] S.\nShibasaki,\nW.\nKobayashi,\nand\nI.\nTerasaki,\nTransport\nproperties\nof\nthe\ndelafossite\nRh\noxide\nCu1−xAgxRh1−yMgyO2:\nEffect of Mg substitution on\nthe resistivity and Hall coefficient, Physical Review B\n74, 235110 (2006).\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21225v1.pdf",
    "total_pages": 6,
    "title": "Large Seebeck coefficient driven by \"pudding mold\" flat band in hole-doped CuRhO$_2$",
    "authors": [
      "Amitayush Jha Thakur",
      "Maximilian Thees",
      "Franck Fortuna",
      "Emmanouil Frantzeskakis",
      "Daisuke Shiga",
      "Hiromichi Kuriyama",
      "Minoru Nohara",
      "Hidenori Takagi",
      "Hiroshi Kumigashira",
      "Andrés F. Santander-Syro"
    ],
    "abstract": "We report the measurement, using angle-resolved photoemission spectroscopy,\nof the metallic electronic structure of the hole-doped thermoelectric oxide\nCuRh$_{0.9}$Mg$_{0.1}$O$_2$. The material is found to have a ``pudding mold''\ntype band structure, with a nearly flat band edge located near the Fermi level,\nwhich is thought to be the origin of the thermoelectric behavior of this\nmaterial. The experimental data match the density functional theory of the\nundoped parent compound, simply corrected by a rigid shift of the bands.\nTransport calculations based on the observed band structure yield a Seebeck\ncoefficient of $\\sim 200 \\,\\mu$V/K for the undoped parent material, consistent\nwith experimental measurements. Our results show that CuRhO$_2$ is a textbook\nexample of how pure band-structural effects can result in a large\nthermoelectric figure of merit, demonstrating that flat band edges in oxides\nare a realistic route for the efficient conversion of thermal energy.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}