{
  "id": "arxiv_2502.21230v1",
  "text": "Bulk-edge correspondence at the spin-to-integer quantum Hall effect crossover in\ntopological superconductors\nM. V. Parfenov1, 2 and I. S. Burmistrov1, 2\n1L. D. Landau Institute for Theoretical Physics, Semenova 1-a, 142432, Chernogolovka, Russia\n2Laboratory for Condensed Matter Physics, HSE University, 101000 Moscow, Russia\n(Dated: version 5, March 3, 2025)\nThe spin and integer quantum Hall effects are two cousins of topological phase transitions in\ntwo-dimensional electronic systems. Their close relationship makes it possible to convert spin to\ninteger quantum Hall effect by continuous increase in a symmetry breaking Zeeman magnetic field.\nWe study peculiarities of bulk-edge correspondence and a fate of massless edge and bulk topological\n(instantons) excitations at such the crossover in topological superconductors.\nTopological phase transitions (TPT) are at a constant\nfocus of physics research. Discovery of topological insula-\ntors and superconductors [1–4] gave a boost to research\non TPT in disordered electronic systems [5–19].\nPer-\nhaps, the most famous example of the TPT is the integer\nquantum Hall effect (iqHe) in which different topological\nphases are labeled by Z (the set of the integer numbers).\nThe iqHe reflects an existence of the Z-valued topological\ncharge in two-dimensional (2D) realization of class A in\nAltland-Zirnbauer symmetry classification of disordered\nHamiltonians [20–25].\nThe iqHe has two close cousins\nin 2D topological superconductors which distinct topo-\nlogical phases are labeled by integers: the spin (class C)\n[26–28] and thermal (class D) [29] quantum Hall effects.\nThe iqHe has been investigated extensively in exper-\niments [30–39] as opposed to the spin quantum Hall ef-\nfect (sqHe). However, the latter has an advantage since\nits criticality is analytically tractable [40]. In particular,\nthe position of the critical point [41, 42], the correlation\nlength exponent, and the infinite subset of generalized\nmultifractal exponents are known exactly through the\nmapping to percolation [43]. The class C can be thought\nas a parent class for the classes A and D due to the fol-\nlowing crossovers: C→A with breaking of the SU(2) spin\nrotation symmetry down to U(1) [44] and C→D which\ncorresponds to the complete breaking of SU(2) symmetry\nwhile preserving superconductivity [27, 28, 43, 45–47].\nAlthough the crossover phenomena in the context\nof phase transitions are thoroughly studied [48], the\ncrossovers between topologically non-trivial phases are\nmuch less investigated. An immediate difficulty can be\nreadily appreciated from the observation that the topo-\nlogical phases of the sqHe are enumerated by even inte-\ngers while the topological phases of the iqHe are labeled\nby all integers. Thus the transformation 2Z→Z should\noccur during the C→A crossover. The understanding of\ncrossovers between topological phases is complicated by\nthe presence of topological excitations (instantons) in the\nbulk and massless edge excitations which are related by\nthe bulk-boundary correspondence. From practical point\nof view, interest to the crossovers lies in their potential\nexperimental applications. For instance, does the iqHe\nrealized in a topological superconductor due to the C→A\ncrossover differ from the ordinary iqHe experimentally?\nThe goal of this Letter is to study the sqHe-to-iqHe\ncrossover and answer the following physical questions: (i)\nIs it possible to describe the crossover in terms of the edge\ntheory only? (ii) How do physical observables depend on\na bare spin Hall conductance after the crossover? (iii)\nWhat is the structure of the emergent iqHe staircase?\nEdge modes for sqHe. Both sqHe and iqHe possess non-\ndissipative gapless edge modes. We start from discussion\nof their transformation across the crossover. We begin\nwith a reminder of the edge theory for the sqHe [28].\nWe consider chiral fermion quasiparticles at the edge of\na (2D) disordered dx2−y2+idxy superconductor. To be\nable to average over quenched disorder we will use the\nreplica trick. The imaginary time replica action for the\nsqHe edge can be written in terms of Nr-copies of spin\n1/2 chiral fermions [28]:\nSe=\nβ\nZ\n0\ndτ\nZ\ndy\nh\n¯ψ(iv∂y−∂τ−η3)ψ+η−¯ψΣ+ ¯ψT+η+ψTΣ−ψ\ni\n.\n(1)\nHere ¯ψ={ ¯ψ↑,1, . . ., ¯ψ↓,Nr} and ψ={ψ↑,1, . . ., ψ↓,Nr}T are\nGrassmann variables corresponding to fermion creation\nand annihilation operators, Σ±=σ±⊗1r with 1r being the\nidentity matrix in the replica space and σ±=(σ1±iσ2)/2\nwhere σj are standard Pauli matrices acting in the spin\nspace. A quasiparticle edge velocity is denoted as v, and\nβ stands for the inverse temperature. The random Gaus-\nsian fields η±=η1±iη2 and η3 mimic fluctuations of a su-\nperconducting order parameter and scattering off impuri-\nties, respectively. They have the zero mean and are delta-\ncorrelated in space: ⟨ηj(y)ηk(y′)⟩=κδjkδ(y−y′). The ac-\ntion (1) does not conserve the number of ψ-fermions but\nhas SU(2) symmetry corresponding to spin conservation.\nTo elucidate symmetries of action (1) inherent in the\nclass C, we introduce new fields: ¯χ↑,α= ¯ψ↑,α, χ↑,α=ψ↑,α,\n¯χ↓,α=ψ↓,α, and χ↓,α= ¯ψ↓,α, where α=1, . . . , Nr [28]. In\nthis representation the edge action (1) becomes\nSe=\nZ β\n0\ndτ\nZ\ndy ¯χ(−∂τ−H⊗1r)χ,\nH=−iv∂y+ησ. (2)\narXiv:2502.21230v1  [cond-mat.mes-hall]  28 Feb 2025\n\n\n2\nThe above action conserves the number of χ fermions\nwhich coincides with the z-projection of the spin of ψ-\nfermions. Thus, χ/ψ-fermions are spin/charge carriers.\nHamiltonian (2) manifests anti-unitary Bogoliubov-de\nGennes (BdG) symmetry, H=−σ2HT σ2, as expected for\nthe class C. The action (2) describes two spin-degenerate\nhybridized electron-hole edge modes that propagate in\nthe same direction and transfer a quantum of the trans-\nverse spin conductivity each [28]. Therefore, in the case\nof a clean system, (for which ηj≡0 and Nr=1), applying a\ngeneralized TKNN formula [49], we obtain that the spin\nHall conductance is quantized in units of 2e2/h [26, 28]\ngH=2k(e2/h).\n(3)\nHere k is the number of edge modes (k=1 for Eq. (2)).\nEdge theory for sqHe. As expected, the 2Z quantization\nof gH, Eq. (3), holds in the presence of the disorder.\nAveraging action (1) over disorder and employing the\nnon-Abelian bosonisation [50–56], we derive the nonlin-\near sigma model (NLσM) action for the soft diffusive edge\nmodes (see Supplemental Materials [57]):\nSe=k\n2 Tr ΛT∂yT −1+πkνe Tr ˆϵQ−kv2\n16κ Tr (∂yQ)2 .\n(4)\nHere νe=1/(2πv) is the density of edge states. Q=T −1ΛT\nis Hermitian traceless matrix acting in Nr×Nr replica,\n2Nm×2Nm Matsubara frequencies, and 2×2 Nambu\nspaces. The matrix Q satisfies the following relations\nQ2 = 1,\nQ = Q† = −L0s2QT s2L0.\n(5)\nHere and below s0,1,2,3 stand for the standard Pauli ma-\ntrices in the Nambu space, (L0)α1α2\nnm =δεn,−εmδα1α2s0,\nΛα1α2\nnm =sgn(εn)δnmδα1α2s0, ˆϵα1α2\nnm =εnδnmδα1α2s0, where\nεn=π(2n+1)/β denotes the fermionic Matsubara fre-\nquency. Symbol ‘Tr’ includes spatial integration as well\nas the trace over replica, Matsubara, and Nambu spaces.\nAs the consequence of SU(2) symmetry, the spin space\nis not present in action (4). The relations (5) determine\nthe NLσM target manifold of class C, Q∈Sp(2N)/U(N),\nwhere N=2NrNm, whereas T∈Sp(2N).\nThe information about the quantization of gH is en-\ncoded in the first term of the NLσM (4), which is nothing\nbut the edge form of the Pruisken’s θ-term [58]. The fac-\ntor k/2 is responsible for the exactly same result for gH as\nin the clean case, Eq. (3). It is expected since the gauge\ntransformation ˜χ(y)=Ty exp[i\nR y dy′η(y′)σ/ve]χ(y) (Ty\nis spatial ordering) [28] excludes disorder from Eq. (2).\nThe sqHe-to-iqHe crossover at the edge. In order to re-\nmove the spin degeneracy of the chiral edge states, we\nintroduce the Zeeman magnetic field Bz by adding the\nterm µBBz\nR\ndτdy ¯ψ(σ3⊗1r)ψ to the action (1). Here µB\nis the Bohr magneton. In Eq. (2), it works as the shift\nH→H+µBBzσ0, that explicitly breaks the BdG symme-\ntry. Thus the resulting Hamiltonian becomes just an Her-\nmitian operator belonging to the class A.\nFIG. 1.\nThe quasiparticle spectrum in the toy-model: 2D\nfermions on a stripe in the presence of a perpendicular mag-\nnetic field, constant superconducting pairing amplitude, and\nZeeman splitting (see [57] and Ref. [59–61] for details).\nIn the clean case, the spectrum of ψ-fermions re-\nmains linear in momentum py but modes with different\nspin projections are split by the momentum difference\n∆py=µBBz/v (see Fig. 1 for the energy level ε2). Since\nin the presence of orbital magnetic field the real space\ncoordinate is proportional to the quasimomentum in the\nperpendicular direction, the Zeeman field results in split-\nting of the chiral edge modes with different spin pro-\njections in a real space. However ∆py can be absorbed\ninto the phase of ψ-fermions, thus the magnitude of gH\nremains insensitive to the presence of Bz, see Eq. (3).\nTherefore, in the case of the Zeeman field acting at the\nedge only, the 2Z quantization of gH survives.\nThe edge modes have the curvature due to merging\nwith the bulk states. Then the spectrum of spin-↑(spin-\n↓) ψ-fermion floats up (down) in energy with increase\nof Bz. Hence there are energy levels (e.g. energy ε1 in\nFig. 1) for which a single edge mode remains only. Thus\nthe spin Hall conductance becomes gH=(2k−1)e2/h in\nagreement with the Z quantization for the iqHe.\nNow let us turn on disorder at the edge again. The\nZeeman splitting emerges in the NLσM action as [57]\nS(Z)\ne\n= iπµBBzνe Tr s3Q.\n(6)\nWe emphasize that the physical magnetic field Bz en-\nters the NLσM as the Zeeman splitting acting in the\nNambu space. Though S(Z)\ne\nis consistent with the sym-\nmetry (5), it breaks rotation symmetry in the Nambu\nspace from SU(2) down to U(1). The term (6) acts as\nthe mass term for otherwise massless theory (4).\nAt\nlong distances, |y|≫1/∆py, the rotations T commut-\ning with the matrix s3 survive only, enforcing diagonal\nform for the matrix Q in the Nambu space. Substitut-\ning Q= diag{Qu, Qd} into Eq. (4) and using the relation\nQd=−L0QT\nu L0, we find that Se is given by Eq. (4) with\nT, Q, and k substituted by Tu, Qu, and 2k respectively.\nSince the Hermitian matrix Qu has no additional con-\nstraints except the nonlinear one, Q2\nu=1, at long distances\n\n\n3\nthe NLσM edge action in the presence of Zeeman split-\nting, Eqs. (4) and (6), becomes the iqHe edge action with\nQu∈U(N)/[U(N/2)×U(N/2)]. That action describes 2k\nchiral edge channels and leads to Eq. (3) for gH. As in\nthe clean case, we see that within the edge theory only\nthe Zeeman field does not change the 2Z quantization of\ngH. Thus to get the 2Z→Z transformation of gH’s quan-\ntization, we have to study the bulk theory.\nBulk theory for sqHe. Now we remind NLσM describing\n2D bulk of the system with the class C symmetry [62–65]\nSb=−¯g\n16 Tr (∇Q)2 +iπ¯gHC+π¯ν Tr[ˆϵ+iµBBzs3]Q.\n(7)\nHere ¯ν denotes the bare bulk density of states and ¯g and\n¯gH stand for the bare dimensional spin longitudinal and\nHall conductances (in units e2/h). The topology of the\nclass C is encoded in the Z quantized topological charge\nC[Q] = Tr (εjkQ∇jQ∇kQ) /(16πi),\n(8)\nwhere εjk is the Levi-Civita symbol with εxy=−εyx=1.\nFor ¯gH=2k the term proportional to C[Q] in Eq.\n(7)\ncoincides with the first term in the edge theory (4). The\nterm in Eq. (7) proportional to Bz describes breaking\nthe SU(2) symmetry in the Nambu space. As expected,\nits form is the same as for the edge theory, Eq. (6) [57].\nThe crossover in the bulk. The NLσM action (7) is renor-\nmalized such that the parameters g, gH, and ν become\nlength-scale (L) dependent. Their renormalization group\n(RG) equations are well-known [63–68]. The class C→A\ncrossover can be seen already at the level of the NLσM ac-\ntion. At long distances, L≫LB=\np\ng(LB)/[ν(LB)µBBz],\nthe Zeeman term in Eq. (7) enforces Q to become a diag-\nonal matrix in the Nambu space. As a result, the NLσM\naction of the class A arises. It is given by Eq. (7) with Q,\n¯g, ¯gH, ¯ν substituted by Qu, 2¯¯g=2g(LB), 2¯¯gH=2gH(LB),\n2¯¯ν=2ν(LB), respectively, and with Bz=0.\nThus, the\nsqHe-to-iqHe crossover can be thought roughly as fol-\nlows. At ℓ⩽L⩽LB the system is described by the RG\nequations for the class C with initial conditions g(ℓ)=¯g\nand gH(ℓ)=¯gH. At L=LB the conductivities reach magni-\ntudes, ¯¯g and ¯¯gH, respectively. Then at L>LB the system\nis governed by the RG equations for the class A with ini-\ntial conditions g(LB)=¯¯g and gH(LB)=¯¯gH. Consequently,\na physical observable O at L>LB depends on ¯¯g and ¯¯gH.\nThe above picture of the crossover with the length-\nscale LB lies in universality for some relevant in the RG\nsense symmetry breaking parameter (Zeeman splitting in\nour case [43, 46]) and, thus, applicable to both topolog-\nically trivial and topological non-trivial systems.\nIt is\neasy to check that on the perturbative level the presence\nof Bz results in the mass of diffusive modes of NLσM (7)\nwhich do not belong to the class A [57].\nThis is ex-\nactly the mechanism that converts the perturbative part\nof the RG equations for the class C to the ones for the\nclass A. However, the topological nontrivial systems have\ntopological excitations (instanton configurations QW in\nour case) with integer quantized value of the topologi-\ncal charge C[QW ]=W. It is these topological excitations\nthat are responsible for the non-perturbative part of the\nRG equations and for the periodicity of the physical ob-\nservables with the bare Hall conductance in the cases of\niqHe [69–73] and sqHe [65]. The 2Z (Z) quantization in\nthe case of sqHe (iqHe) implies the periodicity of physi-\ncal observables with respect to ¯gH (¯¯gH) with period 2 (1).\nConsequently, at the sqHe-to-iqHe crossover the follow-\ning transformation of a physical observable should occur\nO=\nX\nW ∈Z\nO(C)\nW eiπ¯gHW\n|\n{z\n}\nL≪LB\n−→O=\nX\nW ∈Z\nO(A)\nW ei2π¯¯gHW\n|\n{z\n}\nL≫LB\n,\n(9)\nwhere O(C)\nW ∝exp(−π¯g|W|) and O(A)\nW ∝exp(−2π¯¯g|W|).\nThe only consistent possibility to realize Eq. (9) is the\nfollowing picture of the crossover in the non-perturbative\ncontributions to the RG equations. At L≫LB the non-\nperturbative class C contributions with odd W have to be\nsuppressed, while contributions with even W transforms\nsmoothly into the class A contributions.\nTopological excitations at the crossover.\nTo argue the\nabove scenario, we consider the class C instantons with\nW=1, 2.\nFor simplicity, we present expressions for in-\nstanton solutions for Nr=Nm=1. The W=1 instanton is\ngiven as Q1=T −1Λ1(x)T, where T represents a spatially\nuniform rotational matrix that defines orientation of the\ninstanton within the NLσM manifold and [65]\nΛ1=\n \ns0 cos2 θ−s1 sin2 θ\n(is2−s3)\n2\neiϕ sin 2θ\n−(is2+s3)\n2\ne−iϕ sin 2θ −s0 cos2 θ−s1 sin2 θ\n!\n. (10)\nHere θ= arctan(λ/|z−z0|), ϕ= arg(z−z0), z=x+iy is the\ncomplex coordinate, λ is the instanton scale size, and z0 is\nthe position of instanton. In the absence of the last term\nin Eq. (7), we find Sb[Q1]=−π¯g+iπ¯gH, such that the pa-\nrameters λ, z0, and the generators of the T-rotations\nconstitute the zero mode manifold of the W=1 instan-\nton. Due to the Zeeman term, rotational zero modes with\n[T, s3]̸=0 acquire a mass ∝Bz ln(L/λ), i.e. modification\nof the zero mode manifold from T∈Sp(2N) (class C) to\nT∈U(N)/[U(N/2)×U(N/2)] (class A) occurs. However,\nλ and z0 remain zero modes, i.e. W=1 instanton is not\nfully suppressed by Bz at the classical level.\nAccounting for fluctuations around the W=1 instan-\nton leads to logarithmically divergent renormalizations\nin physical observables.\nThese divergences can be re-\nsummed within the RG framework.\nWithout the Zee-\nman splitting, the resummation process continues until\nthe RG flow reaches a scale where the instanton size be-\ncomes comparable to the dynamically generated localiza-\ntion length in the class C, λ∼ξ(C)≃ℓexp(π¯g) [65]. In the\npresence of a non-zero Bz, the RG procedure for W=1\ninstantons halts at λ∼LB, because all instantons with\nsizes λ>LB fail to contribute logarithmic corrections to\n\n\n4\nFIG. 2. Sketch of the crossover RG flow for strong (a) and weak (b) Zeeman splitting. For bare values ¯g≫1, the RG flows in\nblue (orange) regions are governed by the RG equations for the class C (A). Blue lines correspond to separatrices that define\nthe width of the iqHe plateaus. (c) The quantization of the spin Hall conductance at L→∞as a function of its bare value ¯gH\nfor the sqHe (blue solid line), the ordinary iqHe (orange solid line), and a finite Bz (dashed black line). Inset shows the phase\ndiagram in {¯gH, Bz} plane. The black dashed line indicates the Zeeman splitting for which the main panel is plotted.\nphysical observables [57]. It leads to suppression of con-\ntributions from the W=1 instantons to the RG equations\nbeyond the lengthscale LB.\nThe W=2 instanton solution can be expressed as\nQ2= ˜T −1Λ2(x) ˜T, where the matrix ˜T contains rotational\nzero modes and (for Nr=Nm=1 as above)\nΛ2(x) =\n\u0012ˆ1\n0\n0 −ˆ1\n\u0013\nK−1\n\u0012 cos 2ˆθ\nsin 2ˆθ\n−sin 2ˆθ cos 2ˆθ\n\u0013\nK.\n(11)\nHere K=diag{U, U∗} with an arbitrary U(2) matrix U\nand a matrix ˆθ=diag{θ1, θ2}.\nThe instanton angles θj\nare defined similarly to those of the W=1 instanton and\ninvolve two sets of zero modes z(j)\n0\nand λj. The result-\ning classical bulk action for this solution can be divided\ninto two parts:\nthe classical action for W=2 instan-\nton, S(cl)\nb\n=−2π¯g+2πi¯gH, and the Zeeman contribution,\nS(Z)\nb ∝Bz\nR\nd2x[cos 2θ1(x)−cos 2θ2(x)], with a coefficient\ndepending on the matrices ˜T and U (see End Matter and\n[57] for details). The Zeeman term forces the synchro-\nnization of instanton scale sizes, λ1=λ2, and positions,\nz(1)\n0 =z(2)\n0 . Then the W=2 instanton becomes diagonal\nmatrix in the Nambu space, which can be interpreted as\nthe two independent class A W=1 instantons. Thus the\nZeeman splitting forces the class C W=2 instanton to\ntransform into the class A W=1 instanton already at the\nlevel of the classical action (see End Matter).\nPhysical predictions.\nThe above picture of the sqHe-\nto-iqHe crossover has implications for the length-scale\ndependence of physical observables.\nFor example, the\ndependence of g and gH on L can be visualized as a\ntwo-parameter scaling diagram shown in Fig. 2.\nWe\nassume that RG flow starts from a weak coupling re-\ngion, ¯g≫1. At strong Zeeman splitting, LB≪ξ(C), [74]\nthe crossover occurs in weak coupling region, ¯¯g≫1, see\nFig. 2a.\nIn contrast, at weak Bz such that LB≲ξ(C),\nthe crossover occurs in the strong coupling regime close\nto the class C unstable fixed point g(C)\n∗\n=\n√\n3/2 [41, 42]\n(for class A g(A)\n∗\n≃0.5÷0.6 [75–77]), see Fig. 2b. In both\ncases of strong and weak Bz, the flow lines starting at\n|¯gH−1|⩽∆(odd)\nB\n/2 approach the stable fixed point at g=0\nand gH=1 as L→∞. Thus for Bz̸=0 the RG flow in Fig. 2\nshows the Z quantization of gH as L→∞. The RG flow\nin Fig. 2 looks similar to the crossover RG flow due to\nbreaking of spin degeneracy in an ordinary iqHe [78] and\nmixing of valleys for the iqHe in graphene [79]. However,\nthose crossovers occur within the same class A.\nFor |¯gH−1|⩽∆(odd)\nB\n/2 the dependence of gH on L is\nnon-monotonous with the extremum at L∼LB. Plateaus\nat odd integer values in dependence of gH on ¯gH start to\ndevelop as L grows beyond LB. In the limit L→∞the\ndependence of gH on ¯gH becomes a step-like with plateaus\nat Z, see Fig. 2c. However, the widths of the odd, ∆(odd)\nB\n,\nand even, ∆(even)\nB\n=2−∆(odd)\nB\n, plateaus are different. This\nfact reflects periodic dependence of physical observables\non ¯gH with period 2e2/h as follows from Eq. (9).\nAt Bz→0, the width of the odd plateaus can be\nestimated as ∆(odd)\nB\n∼|Bz|3/7 [80].\nAt strong Zeeman\nsplitting, LB≪ξ(C), the odd-plateau width approach 1\nas 1−∆(odd)\nB\n∼[(LB−ℓ)/ξ(C)] ln3(ξ(C)/LB) [57]. We note\nthat the staircase with ∆(odd)\nB\n̸=∆(even)\nB\ndistinguishes the\niqHe obtained in a result of crossover from the sqHe in a\ntopological superconductor, and the ordinary iqHe.\nSummary.\nWe developed the coherent physical picture\nof the spin-to-integer quantum Hall effect crossover in\nthe bulk and at the edge of the topological superconduc-\ntors. We demonstrated that it is not possible to describe\n\n\n5\nthe crossover in terms of the edge theory only. The cor-\nrect description of the crossover involves the bulk the-\nory, in particular, topological excitations (instantons).\nWe found that although the spin Hall conductance be-\ncomes quantized in units e2/h as a result of the crossover,\nthe periodic dependence of the physical observables on\nthe bare spin Hall conductance has the period 2e2/h as\nfor the sqHe. We obtained that after the crossover the\nwidths of the odd and even iqHe plateaus are different in\ncontrast to the conventional iqHe staircase. Although we\nstudy sqHe-to-iqHe crossover in the absence of electron-\nelectron interaction, we expect that it does not alter the\ndeveloped physical picture.\nFinally, we mention that twisted Bi2Sr2CaCu2O8+x bi-\nlayers have been recently shown to spontaneously break\ntime-reversal symmetry [81], in agreement with theoreti-\ncal predictions for emergent dx2−y2+idxy topological su-\nperconducting state [82, 83]. Results of our work suggest\nthat a magnetic field parallel to bilayers is an efficient\ntool to control and manipulate the edge spin-current-\ncarrying states in such topological superconductors in a\nway similar to manipulation of edge current channels in\nthe conventional iqHe [84–87].\nAcknowledgements. We thank D. Antonenko, I. Gornyi,\nI. Gruzberg, A. Mirlin, and P. Ostrovsky for useful dis-\ncussions and comments. The work was funded in part\nby Russian Ministry of Science and Higher Education\n(Project No. FFWR-2024-0017) as well as by Basic re-\nsearch program of HSE. The authors acknowledge the\nhospitality during the “Nor-Amberd School in Theoreti-\ncal Physics 2024” where part of this work has been per-\nformed. M.V.P. and I.S.B. acknowledge personal support\nfrom the Foundation for the Advancement of Theoretical\nPhysics and Mathematics “BASIS”. I.S.B. is grateful to\nInstitute for Theoretical and Mathematical Physics MSU\nfor hospitality.\n[1] A. P. Schnyder, S. Ryu, A. Furusaki, and A. W. W. Lud-\nwig, Classification of topological insulators and super-\nconductors in three spatial dimensions, Phys. Rev. B 78,\n195125 (2008).\n[2] A. P. Schnyder, S. Ryu, A. Furusaki, and A. W. W. Lud-\nwig, Classification of topological insulators and supercon-\nductors, AIP Conf. Proc. 1134, 10 (2009).\n[3] A. Y. Kitaev, Periodic table for topological insulators\nand superconductors, AIP Conf. Proc. 1134, 22 (2009).\n[4] C.-K. Chiu, J. C. Y. Teo, A. P. Schnyder, and S. Ryu,\nClassification of topological quantum matter with sym-\nmetries, Rev. Mod. Phys. 88, 035005 (2016).\n[5] A. Altland, D. Bagrets, and A. Kamenev, Topology ver-\nsus anderson localization: Nonperturbative solutions in\none dimension, Phys. Rev. B 91, 085429 (2015).\n[6] T. Morimoto, A. Furusaki, and C. Mudry, Anderson lo-\ncalization and the topology of classifying spaces, Phys.\nRev. B 91, 235111 (2015).\n[7] E. J. Meier,\nF. A. An,\nA. Dauphin,\nM. Maffei,\nP. Massignan, T. L. Hughes, and B. Gadway, Ob-\nservation\nof\nthe\ntopological\nAnderson\ninsulator\nin\ndisordered\natomic\nwires,\nScience\n362,\n929\n(2018),\nhttps://www.science.org/doi/pdf/10.1126/science.aat3406.\n[8] J. F. Karcher, M. Sonner, and A. D. Mirlin, Disorder and\ninteraction in chiral chains: Majoranas versus complex\nfermions, Phys. Rev. B 100, 134207 (2019).\n[9] D. S. Antonenko, E. Khalaf, P. M. Ostrovsky, and\nM. A. Skvortsov, Mesoscopic conductance fluctuations\nand noise in disordered Majorana wires, Phys. Rev. B\n102, 195152 (2020).\n[10] A. Haller, P. Massignan, and M. Rizzi, Detecting topol-\nogy through dynamics in interacting fermionic wires,\nPhys. Rev. Res. 2, 033200 (2020).\n[11] D. Bagrets, K. W. Kim, S. Barkhofen, S. De, J. Sper-\nling, C. Silberhorn, A. Altland, and T. Micklitz, Probing\nthe topological Anderson transition with quantum walks,\nPhys. Rev. Res. 3, 023183 (2021).\n[12] D. S. Shapiro, S. V. Remizov, A. V. Lebedev, D. V.\nBabukhin, R. S. Akzyanov, A. A. Zhukov, and L. V.\nBork, Critical phase boundary and finite-size fluctuations\nin the Su-Schrieffer-Heeger model with random intercell\ncouplings, Phys. Rev. A 105, 023321 (2022).\n[13] S. Kasturirangan, A. Kamenev, and F. J. Burnell, Two\nparameter scaling in the crossover from symmetry class\nBDI to AI, Phys. Rev. B 105, 174204 (2022).\n[14] P. Matveeva, T. Hewitt, D. Liu, K. Reddy, D. Gutman,\nand S. T. Carr, One-dimensional noninteracting topolog-\nical insulators with chiral symmetry, Phys. Rev. B 107,\n075422 (2023).\n[15] D. S. Antonenko, E. Khalaf, P. M. Ostrovsky, and M. A.\nSkvortsov, Anderson localization at the boundary of a\ntwo-dimensional topological superconductor, Phys. Rev.\nB 107, 075417 (2023).\n[16] H. Zhang and A. Kamenev, Anatomy of topological an-\nderson transitions, Phys. Rev. B 108, 224201 (2023).\n[17] A. Altland, P. W. Brouwer, J. Dieplinger, M. S. Foster,\nM. Moreno-Gonzalez, and L. Trifunovic, Fragility of sur-\nface states in Non-Wigner-Dyson topological insulators,\nPhys. Rev. X 14, 011057 (2024).\n[18] P. Zhao, Z. Xiao, Y. Zhang, and R. Shindou, Topologi-\ncal effect on the Anderson transition in chiral symmetry\nclasses, Phys. Rev. Lett. 133, 226601 (2024).\n[19] S. Barkhofen, S. De, J. Sperling, C. Silberhorn, A. Alt-\nland, D. Bagrets, K. W. Kim, and T. Micklitz, Exper-\nimental observation of topological quantum criticality,\nPhys. Rev. Res. 6, 033194 (2024).\n[20] E. P. Wigner, On a class of analytic functions from the\nquantum theory of collisions, Ann. Math. 53, 36 (1951).\n[21] F. J. Dyson, Statistical theory of the energy levels of\ncomplex systems. I, J. Math. Phys. 3, 140 (1962).\n[22] F. J. Dyson, The threefold way. algebraic structure of\nsymmetry groups and ensembles in quantum mechanics,\nJ. Math. Phys. 3, 2299 (1962).\n[23] M. R. Zirnbauer, Riemannian symmetric superspaces and\ntheir origin in random-matrix theory, J. Math. Phys. 37,\n4986 (1996).\n[24] A. Altland and M. R. Zirnbauer, Nonstandard symme-\ntry classes in mesoscopic normal-superconducting hybrid\nstructures, Phys. Rev. B 55, 1142 (1997).\n[25] P. Heinzner, A. Huckleberry, and M. R. Zirnbauer, Sym-\nmetry classes of disordered fermions, Commun. Math.\nPhys. 257, 725 (2005).\n\n\n6\n[26] G. Volovik, On edge states in superconductors with time\ninversion symmetry breaking, JETP Lett. 66, 522 (1997).\n[27] V. Kagalovsky, B. Horovitz, Y. Avishai, and J. T.\nChalker, Quantum Hall plateau transitions in disordered\nsuperconductors, Phys. Rev. Lett. 82, 3516 (1999).\n[28] T. Senthil, J. B. Marston, and M. P. A. Fisher, Spin\nquantum Hall effect in unconventional superconductors,\nPhys. Rev. B 60, 4245 (1999).\n[29] T. Senthil and M. P. A. Fisher, Quasiparticle localization\nin superconductors with spin-orbit scattering, Phys. Rev.\nB 61, 9690 (2000).\n[30] H. P. Wei, D. C. Tsui, M. A. Paalanen, and A. M. M.\nPruisken, Experiments on delocalization and university\nin the integral quantum Hall effect, Phys. Rev. Lett. 61,\n1294 (1988).\n[31] S. Koch, R. J. Haug, K. v. Klitzing, and K. Ploog, Size-\ndependent analysis of the metal-insulator transition in\nthe integral quantum Hall effect, Phys. Rev. Lett. 67,\n883 (1991).\n[32] R. T. F. van Schaijk, A. de Visser, S. M. Olsthoorn,\nH. P. Wei, and A. M. M. Pruisken, Probing the plateau-\ninsulator quantum phase transition in the quantum Hall\nregime, Phys. Rev. Lett. 84, 1567 (2000).\n[33] W. Li, G. A. Cs´athy, D. C. Tsui, L. N. Pfeiffer, and\nK. W. West, Scaling and universality of integer quantum\nHall plateau-to-plateau transitions, Phys. Rev. Lett. 94,\n206807 (2005).\n[34] A. Pruisken, D. de Lang, L. Ponomarenko, and A. de\nVisser, Universal scaling results for the plateau–insulator\ntransition in the quantum Hall regime, Solid State Com-\nmunications 137, 540 (2006).\n[35] W. Li, C. L. Vicente, J. S. Xia, W. Pan, D. C. Tsui, L. N.\nPfeiffer, and K. W. West, Scaling in plateau-to-plateau\ntransition: A direct connection of quantum Hall systems\nwith the Anderson localization model, Phys. Rev. Lett.\n102, 216801 (2009).\n[36] W. Li, J. S. Xia, C. Vicente, N. S. Sullivan, W. Pan, D. C.\nTsui, L. N. Pfeiffer, and K. W. West, Crossover from\nthe nonuniversal scaling regime to the universal scaling\nregime in quantum Hall plateau transitions, Phys. Rev.\nB 81, 033305 (2010).\n[37] P. T. Madathil, K. A. Villegas Rosales, C. T. Tai, Y. J.\nChung, L. N. Pfeiffer, K. W. West, K. W. Baldwin,\nand M. Shayegan, Delocalization and universality of the\nfractional quantum Hall plateau-to-plateau transitions,\nPhys. Rev. Lett. 130, 226503 (2023).\n[38] S. Kaur, T. Chanda, K. R. Amin, D. Sahani, K. Watan-\nabe, T. Taniguchi, U. Ghorai, Y. Gefen, G. J. Sreejith,\nand A. Bid, Universality of quantum phase transitions in\nthe integer and fractional quantum Hall regimes, Nature\nCommunications 15, 8535 (2024).\n[39] C.-C. Yeh, P.-C. Liao, Y. Yang, W.-C. Lin, A. R. Panna,\nA. F. Rigosi, R. E. Elmquist, and C.-T. Liang, Confor-\nmity experiment on inelastic scattering exponent of elec-\ntrons in two dimensions, Phys. Rev. Lett. 133, 096302\n(2024).\n[40] F. Evers and A. D. Mirlin, Anderson transitions, Rev.\nMod. Phys. 80, 1355 (2008).\n[41] F. Evers, Relaxation on critical percolation clusters, self-\navoiding random walks, and the quantum Hall effect,\nPhys. Rev. E 55, 2321 (1997).\n[42] J. Cardy, Linking numbers for self-avoiding loops and\npercolation: Application to the spin quantum Hall tran-\nsition, Phys. Rev. Lett. 84, 3507 (2000).\n[43] I. A. Gruzberg, A. W. W. Ludwig, and N. Read, Exact\nexponents for the spin quantum Hall transition, Phys.\nRev. Lett. 82, 4524 (1999).\n[44] Notably, there exists a reverse crossover from the class A\nto the class C controlled by the superconducting pairing\n[88].\n[45] N. Read and D. Green, Paired states of fermions in\ntwo dimensions with breaking of parity and time-reversal\nsymmetries and the fractional quantum Hall effect, Phys.\nRev. B 61, 10267 (2000).\n[46] S. Bhardwaj, I. A. Gruzberg, and V. Kagalovsky, Rele-\nvant perturbations at the spin quantum Hall transition,\nPhys. Rev. B 91, 035435 (2015).\n[47] V. Kagalovsky and D. Nemirovsky, Phase diagram of the\nspin quantum Hall transition, Low Temperature Physics\n44, 1219 (2018).\n[48] D. J. Amit, Field Theory, the Renormalization Group,\nand Critical Phenomena (World Scientific, Singapore,\n1993).\n[49] D. J. Thouless, M. Kohmoto, M. P. Nightingale, and\nM. den Nijs, Quantized Hall conductance in a two-\ndimensional periodic potential, Phys. Rev. Lett. 49, 405\n(1982).\n[50] E. Witten, Non-abelian bosonization in two dimen-\nsions, Communications in Mathematical Physics 92, 455\n(1984).\n[51] A. A. Nersesyan, A. M. Tsvelik, and F. Wenger, Disorder\neffects in two-dimensional d-wave superconductors, Phys.\nRev. Lett. 72, 2628 (1994).\n[52] A. Nersesyan, A. Tsvelik, and F. Wenger, Disorder effects\nin two-dimensional Fermi systems with conical spectrum:\nexact results for the density of states, Nuclear Physics B\n438, 561 (1995).\n[53] A. Altland, B. Simons, and M. Zirnbauer, Theories of\nlow-energy quasi-particle states in disordered d-wave su-\nperconductors, Physics Reports 359, 283 (2002).\n[54] A. Altland, Low-energy theory of disordered graphene,\nPhys. Rev. Lett. 97, 236802 (2006).\n[55] E. J. K¨onig, P. M. Ostrovsky, I. V. Protopopov, I. V.\nGornyi, I. S. Burmistrov, and A. D. Mirlin, Interaction\nand disorder effects in three-dimensional topological in-\nsulator thin films, Phys. Rev. B 88, 035106 (2013).\n[56] E. J. K¨onig, P. M. Ostrovsky, I. V. Protopopov, I. V.\nGornyi, I. S. Burmistrov, and A. D. Mirlin, Half-integer\nquantum Hall effect of disordered dirac fermions at a\ntopological insulator surface, Phys. Rev. B 90, 165435\n(2014).\n[57] see Supplemental Material.\n[58] A. M. M. Pruisken, On localization in the theory of the\nquantized Hall effect: A two-dimensional realization of\nthe θ-vacuum, Nucl. Phys. B 235, 277 (1984).\n[59] D. S. Antonenko, L. Fu, and L. I. Glazman, Making\ns-wave superconductors topological with magnetic field\n(2024), arXiv:2409.15266 [cond-mat.supr-con].\n[60] K. Yasui and T. Kita, Theory of the de Haas–van\nAlphen effect in type-II superconductors, Phys. Rev. B\n66, 184516 (2002).\n[61] L. Zhao, T. F. Q. Larson, Z. Iftikhar, J. Chiles, K. Watan-\nabe, T. Taniguchi, F. m. c. Amet, and G. Finkelstein,\nThermal properties of the superconductor–quantum Hall\ninterface, Phys. Rev. Lett. 134, 066001 (2025).\n[62] L. Dell’Anna, Enhancement of critical temperatures in\ndisordered bipartite lattices, Phys. Rev. B 88, 195139\n(2013).\n\n\n7\n[63] L. Dell’Anna, Disordered d-wave superconductors with\ninteractions, Nucl. Phys. B 758, 255 (2006).\n[64] S. S. Babkin and I. S. Burmistrov, Generalized multi-\nfractality in the spin quantum Hall symmetry class with\ninteraction, Phys. Rev. B 106, 125424 (2022).\n[65] M. V. Parfenov and I. S. Burmistrov, Instanton analysis\nfor the spin quantum Hall symmetry class: Nonperturba-\ntive corrections to physical observables and generalized\nmultifractal spectrum, Phys. Rev. B 110, 165431 (2024).\n[66] M. Jeng, A. W. W. Ludwig, T. Senthil, and C. Cha-\nmon, Interaction effects on quasiparticle localization\nin dirty superconductors, https://doi.org/10.48550/\narXiv.cond-mat/0112044 (2001).\n[67] M. Jeng, A. W. W. Ludwig, T. Senthil, and C. Chamon,\nInteraction effects on quasiparticle localization in dirty\nsuperconductors, Bull. Am. Phys. Soc. 46, 231 (2001).\n[68] Y. Liao, A. Levchenko, and M. S. Foster, Response the-\nory of the ergodic many-body delocalized phase: Keldysh\nFinkel’stein sigma models and the 10-fold way, Ann.\nPhys. (N.Y.) 386, 97 (2017).\n[69] A. M. M. Pruisken, Quasiparticles in the theory of the\nintegral quantum Hall effect (I), Nucl. Phys. B 285, 719\n(1987).\n[70] A. M. M. Pruisken, Quasiparticles in the theory of the\nintegral quantum Hall effect (II). Renormalization of the\nHall conductance or instanton angle theta, Nucl. Phys.\nB 290, 61 (1987).\n[71] A. M. M. Pruisken and M. A. Baranov, Cracking\nCoulomb interactions in the quantum Hall regime, Eu-\nrophysics Lett. 31, 543 (1995).\n[72] A. M. M. Pruisken and I. S. Burmistrov, The instanton\nvacuum of generalized CPN−1 models, Ann. Phys. (N.Y.)\n316, 285 (2005).\n[73] A. M. M. Pruisken and I. S. Burmistrov, θ renormaliza-\ntion, electron–electron interactions and super universal-\nity in the quantum Hall regime, Ann. Phys. (N.Y.) 322,\n1265 (2007).\n[74] We note that the strongest magnetic field Bz we consider\ncorresponds to the condition LB∼ℓ. For stronger fields\nthe crossover occurs at the ballistic length scales. Also\nwe assume that the Zeeman field corresponding to LB∼ℓ\nis not enough to destroy the superconducting state.\n[75] Y. Huo, R. E. Hetzel, and R. N. Bhatt, Universal con-\nductance in the lowest Landau level, Phys. Rev. Lett. 70,\n481 (1993).\n[76] B. M. Gammel and W. Brenig, Scaling of the static con-\nductivity in the quantum Hall effect, Phys. Rev. Lett.\n73, 3286 (1994).\n[77] L. Schweitzer and P. Markoˇs, Universal conductance and\nconductivity at critical points in integer quantum Hall\nsystems, Phys. Rev. Lett. 95, 256805 (2005).\n[78] S. W. Hwang, H. P. Wei, L. W. Engel, D. C. Tsui, and\nA. M. M. Pruisken, Scaling in spin-degenerate Landau\nlevels in the integer quantum Hall effect, Phys. Rev. B\n48, 11416 (1993).\n[79] P. M. Ostrovsky, I. V. Gornyi, and A. D. Mirlin, Theory\nof anomalous quantum Hall effects in graphene, Phys.\nRev. B 77, 195430 (2008).\n[80] I. A. Gruzberg, A. W. W. Ludwig, and N. Read, Exact\nexponents for the spin quantum Hall transition, Phys.\nRev. Lett. 82, 4524 (1999).\n[81] S. Y. F. Zhao, X. Cui, P. A. Volkov, H. Yoo, S. Lee, J. A.\nGardener, A. J. Akey, R. Engelke, Y. Ronen, R. Zhong,\nG. Gu, S. Plugge, T. Tummuru, M. Kim, M. Franz,\nJ. H. Pixley, N. Poccia, and P. Kim, Time-reversal\nsymmetry breaking superconductivity between twisted\ncuprate superconductors, Science 382, 1422 (2023),\nhttps://www.science.org/doi/pdf/10.1126/science.abl8371.\n[82] V. Pathak, O. Can, and M. Franz, Edge currents as probe\nof topology in twisted cuprate bilayers, Phys. Rev. B 110,\n014506 (2024).\n[83] P. A. Volkov, J. H. Wilson, K. P. Lucht, and J. H. Pix-\nley, Current- and field-induced topology in twisted nodal\nsuperconductors, Phys. Rev. Lett. 130, 186001 (2023).\n[84] H. le Sueur, C. Altimiras, U. Gennser, A. Cavanna,\nD. Mailly, and F. Pierre, Energy relaxation in the inte-\nger quantum Hall regime, Phys. Rev. Lett. 105, 056803\n(2010).\n[85] C. Altimiras, H. le Sueur, U. Gennser, A. Cavanna,\nD. Mailly, and F. Pierre, Tuning energy relaxation along\nquantum Hall channels, Phys. Rev. Lett. 105, 226804\n(2010).\n[86] E. Weisz, H. K. Choi, M. Heiblum, Y. Gefen, V. Uman-\nsky, and D. Mahalu, Controlled dephasing of an electron\ninterferometer with a path detector at equilibrium, Phys.\nRev. Lett. 109, 250401 (2012).\n[87] M. Carrega, L. Chirolli, S. Heun, and L. Sorba, Anyons\nin quantum Hall interferometry, Nature Reviews Physics\n3, 698 (2021).\n[88] V. Koziy and M. A. Skvortsov, Crossovers between su-\nperconducting symmetry classes, JETP letters 94, 222\n(2011).\n[89] S. Hikami, Three-loop β-functions of non-linear σ-models\non symmetric spaces, Phys. Lett. B 98, 208 (1981).\n[90] In Ref. [72] the 4 times larger result for DA has been\nreported erroneously.\nEnd Matter\nAppendix\nA.\nThe\nW=2\ninstanton\nand\nthe\nZeeman\nterm. The W=2 instanton can be expressed as follows\nQ2(x)= ˜T −1Λ2(x) ˜T, where Λ2(x) is given by Eq. (11).\nWe stress that there exist two independent sets of scale\nsizes λ1,2 and instanton positions z(1,2)\n0\n. This can be in-\nterpreted as two independent instanton solutions with\nmixing in Nambu space, introduced by the matrix K.\nWe decompose the spatially uniform rotation ˜T into two\nparts: ˜T = U −1T, where U is a non-unitary rotation de-\nrived in [65] to simplify the solution of the self-duality\n(Belavin-Polyakov) equation:\n∇xQ2 ± iQ2∇yQ2 = 0, U =\n1\n√\n2\n\n\n\n\n1\n0\n1\n0\n1\n0\n−1 0\n0 −1\n0\n1\n0\n1\n0\n1\n\n\n\n(A1)\nand T is the unitary component, representing the rota-\ntional zero modes.\nThe exact parametrization of the U(2) matrix U (in-\nvolved in the definition of K), which satisfies the self-\n\n\n8\nduality equation, is given by:\nU = eiφ/2\n\u0012\neiα cos χ\neiβ sin χ\n−e−iβ sin χ e−iα cos χ\n\u0013\n,\n(A2)\nwhere α=β=δ−(z) and φ=2δ+(z) are spatially dependent\nangles with δ±=[arg(z−z(1)\n0 )± arg(z−z(2)\n0 )]/4. We note\nthat the mixing angle χ is a zero mode of this solution,\nalong with z(i)\n0\nand λi. Substituting this solution into the\nsymmetry-breaking part of action SB, we obtain:\nS(Z)\nb\n= −4iπ¯νµBBz sin 2χ\n×\nZ (λ2\n1|z −z(2)\n0 |2 −λ2\n2|z −z(1)\n0 |2)dxdy\n(|z −z(1)\n0 |2 + λ2\n1)(|z −z(2)\n0 |2 + λ2\n2)\n.\n(A3)\nThis integral exhibits a logarithmic divergence at large\nscales.\nUsing a regularization scheme with infra-red\nlength scale being the system size L, we compute the\nintegral and obtain\nS(Z)\nb\n= −8iπ2¯νµBBz sin 2χ\nh\nλ2\n1 ln L\nλ1\n−λ2\n2 ln L\nλ2\n−1\n2L2\n\u0010\nλ4\n2 −λ4\n1 + λ2\n1|z(1)\n0 −z(2)\n0 |2\u0011i\n,\n(A4)\nWe take into account the leading non-logarithmic cor-\nrection to demonstrate that both the instanton positions\nand instanton scales cease to be zero modes. We point\ntwo possibilities for disappearing of S(Z)\nb : synchroniza-\ntion of instanton scale sizes, λ1=λ2, and instanton posi-\ntions, z(1)\n0 =z(2)\n0 , or vanishing the factor sin 2χ. In order\nto resolve this we employ variational principle that indic-\ntates that the former is more preferable, i.e. λ1=λ2 and\nz(1)\n0 =z(2)\n0\n(for details see [57]).\nThen the two-instanton solution reduces to two inde-\npendent W=1 instantons of the class A:\n˜Λ2(x) =\n \nΛ(A)\n1\n(x, λ, z0)\n0\n0\nΛ(A)\n1\n(x, λ, z0)\n!\n,\n(A5)\nwith λ=λ1=λ2. Here we define the instanton for class A,\nΛ(A)\n1\n(x, λ, z0), in the following form:\nΛ(A)\n1\n(x, λ, z0) =\n\u0012\ncos 2θ\neiϕ sin 2θ\ne−iϕ sin 2θ\n−cos 2θ\n\u0013\n,\n(A6)\nwhere θ= arctan λ/(z−z0) and ϕ= arg(z−z0).\nAppendix B. The crossover RG flow and the plateaus’\nwidths. In the weak coupling regime, ¯g ≫1, we analyze\nthe crossover using the RG framework. The correspond-\ning RG equations for spin conductivities can be combined\nfrom the known non-perturbative RG equations for the\nclass C and the class A:\ndg\nd ln L = −β(C)\ng\n(1 −fX) −β(A)\ng\nfX,\ndgH\nd ln L = −β(C)\ngH (1 −fX) −β(A)\ngH fX.\n(B1)\nHere the beta-functions for the classes C and A are given\nas [65, 72, 89]\nβ(C)\ng\n≃1\nπ +DC(πg)3e−πg cos πgH,\nβ(C)\ngH ≃DC(πg)3e−πg sin πgH,\nβ(A)\ng\n≃\n1\n2π2g +DA(πg)2e−2πg cos 2πgH,\nβ(A)\ngH ≃DA(πg)2e−2πg sin 2πgH\n(B2)\nHere DC=8e−2−γ/π and DA=4π/e are numerical con-\nstants derived within the Pauli-Villars regularization\nscheme [90].\nIn comparison with perturbative weak-\nlocalization corrections the instanton corrections in\nβ(C,A)\ng\ncan be neglected. The sharpness of the crossover\ntransition allows us to approximate the crossover func-\ntion as Heaviside step-function: fX=θ(L−LB) (for a de-\ntailed explanation, see [57]). The RG flow corresponding\nto these equations is presented in Fig.2 in the main text.\nSolutions for Eqs. (B1) is presented in [57].\nThe widths of the plateaus can be estimated by an-\nalyzing the RG flow’s critical trajectories (depicted as\nblue lines in Fig.2a and Fig.2b). The starting point of a\ncritical trajectory corresponds to the minimal deviation\nin the bare value of ¯gH from 1 that leads to a departure\nfrom class C behavior in the infrared limit (L→∞). By\nsolving Eq. (B1), we obtain this deviation [57]:\n¯gH = 2\nπ tan−1 \u0010\ne−πDCf(¯¯g,¯g)\u0011\n.\n(B3)\nThe limiting cases of this expression are discussed in the\nmain text.\n\n\nONLINE SUPPORTING INFORMATION\nBulk-edge correspondence at the spin-to-integer quantum Hall effect crossover\nM. V. Parfenov1, 2 and I. S. Burmistrov1, 2\n1L. D. Landau Institute for Theoretical Physics, Semenova 1-a, 142432, Chernogolovka, Russia\n2Laboratory for Condensed Matter Physics, HSE University, 101000 Moscow, Russia\nIn this notes we present details of (i) derivation of the NLσM at the edge, (ii) spectrum of the toy\nmodel, (iii) suppression of the diffusive modes by the Zeeman splitting in the perturbation theory,\n(iv) suppression of the W = 1 class C instanton due to the quantum fluctuations, (v) variational\nanzats for the W = 2 instanton, and (vi) estimates for the plateau width.\nS.I.\nDERIVATION OF THE EDGE NLσM\nIn this section, we demonstrate the derivation of the NLσM for quasiparticles at the edge of dx2−y2 + idxy super-\nconductor. We begin with the action eq. (1) in the main text. Using a bivector representation (with the aid of an\nadditional Nambu-type space), this action can be rewritten in a more transparent form:\nS =\nβ\nZ\n0\ndτ\nZ\ndyΨ (−∂τ −H0 −V ) Ψ, Ψ =\n1\n√\n2\n\n\n\n\nψ↑\nψ↓\nψ↑\nψ\n†\n↓\n\n\n\n,\n(S.1)\nin this equation Hamiltonian has the form (in 4 × 4 matrix space):\nH =\n\n\n\nvˆpy + η3\n0\n0\nη1 −iη2\n0\nvˆpy + η3\n−η1 + iη2\n0\n0\n−η1 −iη2\nvˆpy −η3\n0\nη1 + iη2\n0\n0\nvˆpy −η3\n\n\n.\n(S.2)\nThis Hamiltonian has both SU(2) and particle-hole symmetries: s1 (H)T s1 = −H, σ2Hσ2 = H. Using a represen-\ntation in terms of spin fermions χ , we can rotate the Hamiltonian in Nambu space to simplify its structure. Let us\nwrite:\n\u0000χ χT \u0001 \u0012\nH\n0\n0\nσ2Hσ2\n\u0013 \u0012 χ\nχT\n\u0013\n=\n\u0000χ χT σ2\n\u0001\nHs0\n\u0012\nχ\nσ2χT\n\u0013\n,\nΦ =\n1\n√\n2\n\u0012\nχ\nσ2χT\n\u0013\n,\nH = −ivσ0∂y + ησ,\n(S.3)\nhere si is Pauli matrices in Nambu-type space. This Hamiltonian exhibits a standart class C symmetry property:\nH = −σ2HT σ2. One can check charge conjugation relation for bivector Φ:\nΦ = [CΦ]T ,\nC = σ2 ⊗(is2),\nC2 = −1.\n(S.4)\nTherefore, resulting action has the form:\nS =\nβ\nZ\n0\ndτ\nZ\ndyΦ (−∂τs0 −Hs0) Φ.\n(S.5)\nAfter that we should introduce Matsubara space for fermionic fields ψ with frequences εn = πT (2n + 1):\nψi =\nX\nm\nψm,ie−iεmτ,\nψi =\nX\nn\nψn,ie+iεnτ.\n(S.6)\nIn terms of Φ bivector:\nΦ\nα →\nX\nn\nΦ\nα\nneiσ3εnτs0,\nΦα →\nX\nm\ne−iσ3εmτs0Φα\nm.\n(S.7)\n\n\n2\nAfter integrating over imaginary time for the part of the action that commutes with s3, we obtain:\nS(0) = β\nZ\ndy\nX\nn\nΦ\nα\nn (iεns0σ3 + ivσ0s0∂y) Φα\nn.\n(S.8)\nOne can observe the emergence of a nontrivial structure in spin space for the energy term. Due to the noncommu-\ntative nature of the random potential contribution, integration over imaginary time leads to a nontrivial structure in\nMatsubara space:\nS(dis) = −β\nZ\ndy\nX\nn,m\nΦ\nα\nns0 (η1σ1 + η2σ2) δm,−n−1Φα\nm −β\nZ\ndy\nX\nn\nΦ\nα\nns0η3σ3Φα\nn.\n(S.9)\nFor simplicity, we define new matrix in Matsubara space l0 = δm,−n−1 = δεm,−εn. To simplify further computations,\nwe perform a matrix rotation in the combined Matsubara and spin spaces:\nΞα\nm = UξΦα\nm,\nUξ =\n\u0012\n1 0\n0 l0\n\u0013\ns\n,\nΞ = ΞT CT ,\nC = (is2)l0σ2 = CT .\n(S.10)\nAfter this rotation, we rewrite each part of the action in terms of the fermion fields Ξ, defined above:\nS(0) = β\nZ\ndy\nX\nn\nΞ\nα\nn (iεnσ0s0 + ivs0σ0∂y) Ξα\nn,\n(S.11)\nS(dis) = −β\nZ\ndy\nX\nn\nΞ\nα\nnσ0 (η1σ1 + η2σ2 + η3σ3) Ξα\nn = −β\nZ\ndy\nX\nn\nΞ\nα\nns0V Ξα\nn,\n(S.12)\nwhere correlator of random potential has the following form:\n⟨Vαβ(y)Vγδ(y′)⟩= κ (2δαδδβγ −δαβδγδ) ,\n(S.13)\nusing Wick theorem we average disorder part of action over random potential:\n\u001c1\n2\n\u0010\nS(dis)\u00112\u001d\n= κβ2\n2\nZ\ndy\n\u0010\n2Ξ\nj\nαΞj\nβΞ\nj′\nβ Ξj′\nα −Ξ\nj\nαΞj\nαΞ\nj′\nβ Ξj′\nβ\n\u0011\n,\n(S.14)\nwhere j and j′ are collective indices for Nambu, Matsubara, and replica spaces, while α and α′ denote spin indices.\nThe second term in the brackets vanishes by definition of Ξ. It is convenient to rewrite the above expression in terms\nof the trace over Nambu, Matsubara, and replica spaces:\nD\nS(dis)E\n= −κβ2\nZ\ndyTr\n\u0002\nΞβΞβΞαΞα\n\u0003\n.\n(S.15)\nAs a consequence of spin invariance of the initial Hamiltonian, ΞβΞβ becomes trivial in spin space. The next step\nis to decouple four-fermion term using the Hubbard-Stratonovich transformation. Introducing hermitian matrix field\nQ, we obtain:\nSQ = −1\n4κ\nZ\ndyTrQ2 + iβ\nZ\ndyΞQσ0Ξ.\n(S.16)\nFrom this form of action and eq. (S.9) we can obtain BdG symmetry for Q-field:\nQ = −s2l0QT l0s2.\n(S.17)\nAfter integration over Grassmanian fields Ξ, we obtain resulting action for matrix field Q:\nSQ = −1\n4κ\nZ\ndy Tr Q2 +\nZ\ndy Tr log [is0ˆεn + ivs01M∂y + iQ] .\n(S.18)\n\n\n3\nIn the absence of symmetry-breaking terms and at zero temperature (εn →0) we can write down the saddle-point\nequation:\n−1\n2κ Q + i [iv∂y + iQ]−1 = 0.\n(S.19)\nThe solution of this equation takes the following form:\n(Qsp)αβ = 1\n2τ Λαβ,\nΛαβ = τ3s0δαβ,\n(S.20)\nwhere τ3 is the third Pauli matrix in retarded-advanced space and τ denotes mean free time, which can be self-\nconsistently expressed in terms of the random potential correlator and edge velocity: 1/τ = 2κ/v.\nTo obtain the diffusive NLσM for edge quasiparticles, we expand around the metallic saddle point. For this purpose,\nwe parametrize the sigma-model manifold in terms of non-uniform unitary rotations around the saddle point:\nQ = 1\n2τ T −1ΛT,\n(S.21)\nwhere T are massless modes, which define target manifold of class C: Sp(2n)/U(n).\nLogarithmic part of action,\ntherefore, can be rewritten in the following form:\nSlog\nQ = Tr log\n\u0002\nB[T] + G−1\n0\n\u0003\n,\nG−1\n0\n= −H0 + iΛ/2τ,\nB[T] = ivT∂yT −1 + iϵTτ3T −1,\n(S.22)\nfor simplicity here we switch from Matsubara representation to retarded-advanced. Making a gradient expansion in\nT we can obtain:\nSlog\nQ ≈Tr B[T]G0 −1\n2 Tr B[T]G0B[T]G0.\n(S.23)\nThe first term gives rise to a topological term in its edge form, along with a source term:\nStop = 1\n2\nZ\ndy Tr\n\u0000T∂yT −1Λ\n\u0001\n,\nSΛ = ϵ\n2v\nZ\ndy Tr ΛQ,\n(S.24)\nhere we use definition of Green function for edge fermions:\nG0(y, y′) =\nZ dp\n2π\neip(y−y′)\n−vp + iΛ/2τ = −ie−|y−y′|/2vτ\n2v\n(sgn(y −y′) + Λ) ,\n(S.25)\nand here we define edge Q-matrix: Q = T −1ΛT with constraint Q2 = 1. Second order term leads to kinetic part of\nNLσM action:\nv2\n2\nZ\ny,y′\ndpdp′\n(2π)2 Tr\n\"\nU[T]\neip(y−y′)\n−vp + iΛ/2τ U[T]\ne−ip′(y−y′)\n−vp′ + iΛ/2τ\n#\n,\n(S.26)\nhere U[t] = T∂yT −1. In diffusive regime elastic scattering length l = vτ is small, therefore we can put both U[T] at\nthe same point. After that we can integrate this expression and obtain:\nSq = −l\n8\nZ\ndy Tr (∂yQ)2 = −v2\n16κ\nZ\ndy Tr (∂yQ)2 .\n(S.27)\nResulting expression for action at the edge can be written in the following form:\nSe = −v2\n16κ\nZ\ndy Tr (∂yQ)2 + 1\n2\nZ\ndy Tr\n\u0000T∂yT −1Λ\n\u0001\n+ ϵ\n2v\nZ\ndy Tr ΛQ.\n(S.28)\nIntroducing of Zeeman field can be done in the following way:\nS(Z)\ne\n= µBBz\nNr\nX\nα=1\nβ\nZ\n0\ndτ\nZ\ndyψ\nασ3ψα.\n(S.29)\n\n\n4\nFIG. 1. Left panel: Spectrum of Landau levels in the presence of a constant pairing potential ∆0 in an infinite system. A\nnonzero ∆0 induces a dispersion of the Landau bands. Right panel: Diagonal matrix element of the pairing potential at the\nlowest Landau level within a stripe of width W.\nAfter all basis changes, described above, one can write this term in Ξ fermion representation:\nS(Z)\ne\n= −βµBBz\nZ\ndyΞ\nα\nns3Ξα\nn.\n(S.30)\nIntegration over Grassmanian fields leads to appearance of term under Tr log:\nSlog\nQ =\nZ\ndy Tr log [is0ˆεn + ivs01M∂y −µBBzs3 + iQ] .\n(S.31)\nBy following the same steps as for the density of state contribution and using equation (S.23), we obtain:\nS(Z)\ne\n= iµBBz\n2v\nZ\ndy Tr s3Q.\n(S.32)\nS.II.\nLANDAU LEVELS FOR UNIFORM PAIRING ∆0\nWe consider a toy model for the Bogoliubov–de Gennes (BdG) Hamiltonian describing quasiparticles in a sufficiently\nstrong magnetic field with a nonzero induced order parameter ∆. For simplicity, we assume a uniform amplitude of\nthe order parameter. In a real system, however, the self-consistency equation for ∆must be taken into account [1].\nUnder this approximation, the single-particle BdG Hamiltonian takes the form:\nH =\n\u0012H0\n∆0\n∆0 −HT\n0\n\u0013\n,\nH0 =\n1\n2m (−i∇−eA)2 .\n(S.33)\nWe first analyze the case of an infinite system. In the Landau gauge (Ax = 0, Ay = −Hzx), the electron eigenfunctions\ntake the well-known form:\nψn,k(x, y) =\n1\n√\nL\neikyϕn (x −xk) ,\nϕn(x) =\n\u0012\n1\n2nn!lH\n√π\n\u00131/2\nexp\n\u0012\n−x2\n2l2\nH\n\u0013\nHn\n\u0012 x\nlH\n\u0013\n,\n(S.34)\nwhere Hn(x) – Hermitian polynomials. Applying time-reversal symmetry, we obtain the eigenfunctions for holes:\nψ∗\nn,−k(x, y) =\n1\n√\nL\neikyϕn (x + xk) .\n(S.35)\nWithout superconducting pairing ∆0 = 0, the energy spectrum consists of doubly degenerate Landau levels: E =\n±ωc(n+1/2). To diagonalize Eq. (S.34), we compute the matrix elements of ∆0, which can be determined analytically:\n⟨ψ∗\nm,−k|∆0|ψn,k′⟩= ∆0δk,k′\nr\n2m−nn!\nm!\ne−ξ2ξm−nLm−n\nn\n(2ξ2),\nm > n,\n(S.36)\n\n\n5\n⟨ψ∗\nm,−k|∆0|ψn,k′⟩= ∆0δk,k′\nr\n2n−mm!\nn!\ne−ξ2(−ξ)n−mLn−m\nm\n(2ξ2),\nm < n,\n(S.37)\nwhere Lk\nn(x) are generalized Laguerre polynomials, and ξ = xk/lH = klH. By numerically diagonalizing Eq. (S.34)\nfor four Landau levels, we obtain the quasiparticle spectrum as a function of the wave vector k. A key feature of\nthis spectrum is the dispersion of Landau levels at small wave vectors klH ≪1, where the matrix elements of ∆0 are\nmaximal (see left panel Fig. 1).\nNext, we analyze a system confined within a strip of width W, following the approach of B. Halperin [2]. We impose\nboundary conditions such that both electron and hole wavefunctions vanish at the edges of the strip: ψn,k(−W/2, y) =\nψn,k(W/2, y) = 0. A convenient representation for the electron wavefunctions is:\nψs,k(x, y) = Ns,keiky\n√\nL\n\n\nDs\n\u0010\nx−xk\nlH/\n√\n2\n\u0011\nDs\n\u0010\n−W/2+xk\nlH/\n√\n2\n\u0011 −\nDs\n\u0010\n−x−xk\nlH/\n√\n2\n\u0011\nDs\n\u0010\nW/2+xk\nlH/\n√\n2\n\u0011\n\n,\n(S.38)\nwhere Ds(x) is the parabolic cylinder function with a continuous index s, , determined self-consistently, and Ns,k is a\nnormalization constant. The boundary condition at ψn,k(−W/2, y) = 0 is automatically satisfied, while the condition\nat x = W/2 leads to the transcendental equation for s:\nDs\n\u0010\nW/2−xk\nlH/\n√\n2\n\u0011\nDs\n\u0010\n−W/2+xk\nlH/\n√\n2\n\u0011 =\nDs\n\u0010\n−W/2−xk\nlH/\n√\n2\n\u0011\nDs\n\u0010\nW/2+xk\nlH/\n√\n2\n\u0011 .\n(S.39)\nSolving Eq. (S.39) determines s(k). The spectrum in the absence of superconducting pairing follows a Landau-like\nform: E = ±ωc(s(k) + 1/2). For a nonzero pairing potential, we employ perturbation theory under the assumption\n∆0 ≪ωc. This allows us to restrict the Hamiltonian to the first Landau level (the lowest root of Eq. (S.39)). The\neffective Hamiltonian is:\nH =\n\u0012 ωc(s(k) + 1/2)\n⟨ψ∗\n0,−k|∆0|ψ0,k′⟩\n⟨ψ0,k|∆0|ψ∗\n0,−k′⟩−ωc(s(−k) + 1/2)\n\u0013\n.\n(S.40)\nTo diagonalize this Hamiltonian, we first solve Eq.(S.39) numerically and then compute the matrix element\n⟨ψ∗\n0,−k|∆0|ψ0,k′⟩numerically as well (see Fig.1). The resulting quasiparticle spectrum is shown in Fig.1 from main\ntext.\nS.III.\nSTRUCTURE OF THE FLUCTUATION PROPAGATORS WITH ZEEMAN FIELD.\nIn this section, we compute diffusive propagators in the presence of a non-zero Zeeman field Bz, considering only the\nRA block of Matsubara space. For this purpose, we consider the NLσM action for class C with a symmetry-breaking\nterm:\nSb = −g\n16\nZ\nx\nTr (∇Q)2 + iπνµBBZ\nZ\nd2x Tr s3Q.\n(S.41)\nHere, we omit the topological term because there are no perturbative corrections to it. It is convenient to parametrize\nthe Q-matrix in terms of fluctuation matrices W, using the root parametrization:\nQ = W + Λ\np\n1 −W 2,\nW =\n\u0012 0\nw\nw† 0\n\u0013\n,\n(S.42)\nFrom the BdG symmetry relation, one can obtain restrictions on the Nambu components of matrices w = wisi:\nwαβ\ni\n= viwβα\ni\n,\nvi = {−1, 1, 1, 1}.\n(S.43)\nTherefore, the singlet (i = 0) part of w is a skew-symmetric matrix, while the triplet (i ̸= 0) parts are symmetric.\nExpanding the action (S.41) to second order in W, we obtain the quadratic action for fluctuations:\nS(2) =\nZ\nx\nwαβ\ni\n\u0010g\n4δij∇2 −iπµBνBzMij\n\u0011\nw†βα\nj\n.\n(S.44)\n\n\n6\nHere, Mij = trN (s3[si, sj]) = 4i(δi1δj2 −δi2δj1) and summation over coinciding indices is implied. Transforming to\nFourier space:\nS(2) = −\nZ\nq\nwαβ\ni\n(q)\n\u0010g\n4δijq2 + iπµBνBzMij\n\u0011\nw†βα\nj\n(−q).\n(S.45)\nTo invert this matrix, we use the symmetry relations for w matrices (S.43). We split the action into two parts:\ndiagonal and non-diagonal in replica space:\nwαβ\ni\nδijw†βα\nj\n= 1\n2\nNr\nX\nα=1\nwαα\ni\nδij(1 + vj)w†αα\nj\n+ 2\nNr\nX\n1≤α<β\nwαβ\ni\nδijvjw†αβ\nj\n,\n(S.46)\nwαβ\ni\nMijw†βα\nj\n=\nNr\nX\nα=1\nwαα\ni\nMijw†αα\nj\n+ 2\nNr\nX\n1≤α<β\nwαβ\ni\nMijw†αβ\nj\n.\n(S.47)\nThis form of matrices leads to diffusive propagators:\nD\nwαα\ni\n(q)w†αα\nj\n(−q)\nE\n=\n\n\n\n0\n0\n0\n0\n0\nDBz\nPBz\n0\n0 −PBz DBz\n0\n0\n0\n0\nD0\n\n\n\nij\n,\nD\nwαβ\ni\n(q)w†µν\nj\n(−q)\nE\n= 1\n2\n\n\n\n−D0\n0\n0\n0\n0\nDBz\nPBz\n0\n0\n−PBz DBz\n0\n0\n0\n0\nD0\n\n\n\nij\nδαµδβν,\n(S.48)\nwhere we define:\nDBz =\n4gq2\ng2q4 + 256(πµBνBz)2 ,\nPBz =\n64πµBνBz\ng2q4 + 256(πνµBBz)2 .\n(S.49)\nThis form of Gaussian propagators indicates that presence of Zeeman field leads to the generation of mass (finite\ncorrelation length) in order of LB ∼\np\ng/νµBBz for triplet modes w1 and w2. Consequently, in the limit of an infinite\nZeeman field Bz →∞, we should extract these fluctuation fields from the NLσM manifold of massless modes. The\ndimension of the corresponding manifold after such an extraction is:\nn(n −1)\n|\n{z\n}\nsinglet non-instanton\n+ 3n(n + 1)\n|\n{z\n}\ntriplet\n−2n(n + 1)\n|\n{z\n}\nmassive triplet\n=\n4n2 + 2n\n|\n{z\n}\nclass C non-instanton\n−2n(n + 1)\n|\n{z\n}\nmassive triplet\n= 2n2,\n(S.50)\nwhere n = N/2. Consequently, number of real parameters equal to 2n2 corresponds to class A: Q ∈U(2n)/U(n)×U(n).\nWe conclude that switching-on of infinite Zeeman field split class C (Q ∈Sp(4n)/U(2n)) action into class A action.\nS.IV.\nSUPPRESSION OF W = 1 INSTANTON IN LDOS\nIn this section, we demonstrate the suppression of W = 1 instantons with scale sizes λ > LB. From a straightforward\ninstanton calculation (for details, see Ref. [3]), one can obtain the renormalization of the average LDoS (for brevity\nwe put number of replicas Nr = 1):\nδνinst ∝\nL\nZ\nℓ\ndλ\nλ νge−πg cos(πgH)\n∞\nZ\n0\ndr0\nr0\nr2\n0 + λ2 .\n(S.51)\nHere, ν(λ) and g(λ) are renormalized through perturbation theory in the Pauli-Villars regularization scheme. The\nintegral over r0 exhibits a logarithmic divergence at large scales. To handle this, we use a cutoff scheme since we\ncalculate quantity up to numerical constant. In the presence of a Zeeman field, we assume that the instanton-induced\nmeasure does not influence physical observables on scales larger than LB. This allows us to explicitly calculate the\nr0 integral:\nδνinst ∝\nL\nZ\nℓ\ndλ\nλ νge−πg cos(πgH) log\n\u0012\n1 + L2\nB\nλ2\n\u0013\n.\n(S.52)\n\n\n7\nFrom this integral, we derive a condition on LB that defines the presence of the crossover regime: LB < ξ(C)\nl\n∝ℓeπg.\nWe note, that in the limiting case LB →ℓeπg, the term log\n\u0010\n1 + L2\nB\nλ2\n\u0011\n∼g , and we recover the result from the original\npaper. The appearance of the crossover induced instanton measure leads to three distinct cases based on characteristic\nscales:\nlog\n\u0012\n1 + L2\nB\nλ2\n\u0013\n≈\n\n\n\n\n\n2| log LB\nλ |,\nλ ≪LB,\nconst,\nλ ∼LB,\nL2\nB\nλ2 ,\nλ ≫LB.\n(S.53)\nWe observe that for λ ≫LB, the logarithmic divergence in the integral over λ disappears.\nThis indicates that\ninstantons with scales λ > LB do not contribute to the renormalization of LDoS.\nS.V.\nVARIATIONAL PRINCIPLE FOR W = 2 SOLUTION\nThe expression for the Zeeman term in the classical action (equation (A4) in End Matter) suggests that the zero\nmodes of the two-instanton solution transform across the crossover [4]. For brevity, we put z(1)\n0\n= z(2)\n0\n= 0. We\nidentify two possible mechanisms for this transformation: (1) synchronization of the instanton scale sizes, λ1 = λ2,\nor (2) the disappearance of the mixing angle χ. At the classical level, we cannot determine which possibility is more\nfavorable based on the least action principle alone.\nTo resolve this, we adopt a variational ansatz for the zero modes in the following form:\nλi(r) = λi\n\u0012\n1 + λ∗\ni −λi\nλi\ntanh r2\nρ2\n\u0013\n,\nχ(r) = χ0 + χ1 tanh r2\nρ2 ,\n(S.54)\nwhere the free parameters are λ∗\ni (the final instanton scale), ρ (the characteristic scale of zero-mode evolution), and\nχ1 (the final value of the mixing angle). By substituting this ansatz into the action Sb (Equation (7) in the main\ntext) and performing numerical minimization, we find that the synchronization of instanton scale sizes is the correct\nmechanism for instanton zero-mode transformation. The final values for the free parameters are λ∗\n1 = λ∗\n2 ≈(λ1+λ2)/2\nand χ1 does not vanish χ1 ≈const ̸= −χ0.\nS.VI.\nPLATEAU WIDTH IN THE LIMIT OF STRONG ZEEMAN FIELD.\nIn this section, we compute the critical shift δgH of the transverse spin conductivity microscopic value, necessary\nto reach the gH = 0 phase in the infrared limit (L →∞). To achieve this, we consider the RG equations for class\nC, including non-perturbative corrections, as obtained in Ref. [3] and which were discussed in End Matter. These\nequations are given as:\ndg\nd ln L = −1\nπ −\n2\nπ2g −DC(πg)3e−πg cos πgH,\ndgH\nd ln L = −DC(πg)3e−πg sin πgH,\n(S.55)\nwhere we focus only on the weak-coupling limit ¯g ≫1.\nIn this limit, we retain only the one-loop correction in\nthe g-equation. Consequently, the system reduces to a trajectory-type dimensionless equation with initial conditions\ng(ℓ) = ¯g and gH(ℓ) = ¯gH:\ndx\ndy = πDCy3e−y sin x,\n(S.56)\nwhere x = πgH and y = πg. This equation can be solved to yield:\ngH(L) = 2\nπ arctan\nh\ntan\n\u0010π¯gH\n2\n\u0011\neπDCf(g(L),¯g)i\n,\n(S.57)\nwhere we define:\nf(g(L), ¯g) =\nπg\nZ\nπ¯g\ny3e−ydy,\ng(L) = ¯g −1\nπ log L\nℓ.\n(S.58)\n\n\n8\nThe condition defining the critical trajectory can be expressed as:\n1\n2 = 2\nπ arctan\nh\ntan\n\u0010π¯gH\n2\n\u0011\neπDCf(g(LB),¯g)i\n.\n(S.59)\nFrom this equation, the corresponding starting point ¯gH can be found:\n¯gH = 2\nπ tan−1 \u0010\ne−πDCf(g(LB),¯g)\u0011\n.\n(S.60)\nS.VII.\nSOLUTION OF CROSSOVER RG EQUATIONS IN WEAK COUPLING LIMIT g ≫1 .\nIn this section, we solve crossover RG equation. As the crossover occurs sharply, we can approximate the crossover\nfunction as a Heaviside step-function (see End Matter):\ndg\nd ln L = −1\nπ θ(LB −L) −\n1\n2π2g θ(L −LB),\n(S.61)\ndgH\nd ln L = −θ(LB −L)DC(πg)3e−πg sin πgH −θ(L −LB)DA(πg)2e−2πg sin 2πgH,\n(S.62)\nwhere we neglect non-perturbative corrections in the first equation. Using this, we can solve these equations in a\nmanner similar to the previous section. The solution can be expressed as:\ngH(L) = 1\nπ\n(\n2 arctan (tan (π¯gH/2) exp [πDCf(gC(L), ¯g)]) , L ≤LB\narctan (tan (π¯¯gH) exp [πDAf(2gA(L), 2¯¯g)]) , L > LB\n(S.63)\nwhere the function f is defined in Eq. (S.58), and the terms gC(L), gA(L) are longitudinal spin conductivities with\none(two)-loop corrections in symmetry class C (A):\ngC(L) = ¯g −log L\nℓ,\ngA(L) =\n\u0012\n¯¯g2 −1\nπ log L\nLB\n\u00131/2\n.\n(S.64)\nTo determine the period of gH(L) as a function of ¯gH, we simplify the trigonometric terms in the solution, yielding:\ngH(L) = 1\nπ arctan\n \n2 sin(π¯gH)\n1 + cos(π¯gH) exp 2FC+1\n1−exp 2FC\nexp (FC + FA)\n1 −exp 2FC\n!\n,\n(S.65)\nwhere we define Fi = πDif(g(L), g(L0). From this expression, it follows that when LB > Cξ(C)\nl\n, with numerical\nconstant C ≈1.67 × 10−3, the trigonometric part simplifies to tan π¯gH , leading to quantization of transverse spin\nconductivity by integers. Conversely, when LB < Cξ(C)\nl\n, the quantization changes to even integers. This result is in\nfull agreement with the logic expressed in the main text.\n[1] D. S. Antonenko, L. Fu, and L. I. Glazman, Making s-wave superconductors topological with magnetic field (2024),\narXiv:2409.15266 [cond-mat.supr-con].\n[2] B. I. Halperin, Quantized Hall conductance, current-carrying edge states, and the existence of extended states in a two-\ndimensional disordered potential, Phys. Rev. B 25, 2185 (1982).\n[3] M. V. Parfenov and I. S. Burmistrov, Instanton analysis for the spin quantum Hall symmetry class: Nonperturbative\ncorrections to physical observables and generalized multifractal spectrum, Phys. Rev. B 110, 165431 (2024).\n[4] A. Pruisken and I. Burmistrov, The instanton vacuum of generalized CPN−1 models, Ann. Phys. (N.Y.) 316, 285 (2005).\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21230v1.pdf",
    "total_pages": 16,
    "title": "Bulk-edge correspondence at the spin-to-integer quantum Hall effect crossover in topological superconductors",
    "authors": [
      "Maksim Parfenov",
      "Igor Burmistrov"
    ],
    "abstract": "The spin and integer quantum Hall effects are two cousins of topological\nphase transitions in two-dimensional electronic systems. Their close\nrelationship makes it possible to transform spin to integer quantum Hall effect\nin two-dimensional topological superconductors by continuous increase in a\nsymmetry breaking Zeeman magnetic field. We study peculiarities of bulk-edge\ncorrespondence and a fate of massless edge and bulk topological (instantons)\nexcitations at such the crossover.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}