{
  "id": "arxiv_2502.21218v1",
  "text": "Self Consistent Field Theory of isotropic-nematic inter-\nfaces and disclinations in a semiflexible molecule nematic\nLongyu Qing and Jorge Viñals\nA Self Consistent Field Theory description of equilibrium, but non uniform, configurations adopted\nby semi flexible liquid crystal molecules is presented. Two cases are considered, isotropic-nematic\nphase boundaries, and topological defects in the nematic phase (disclinations).\nNematogens are\nmodeled by worm-like chains, with microscopic interaction potential of the Maier-Saupe type, with\nan added isotropic excluded volume contribution. The thermodynamic fields obtained by numerical\nminimization of the free energy are the molecular density and the nematic tensor order parameter.\nInterfaces with both homeotropic and planar alignment are studied, as well as biaxiality and anisotropy\naround ±1/2 disclinations. The effects induced by fluid compressibility, interaction strength, and\nelastic anisotropy that follows from chain flexibility on both types of non uniform configurations are\ndiscussed. Defect core sizes decrease as the system becomes less compressible, eventually reaching\na constant value in the incompressible limit. The core size is influenced by the nematic interaction\nstrength u2 and chain persistence length lp, decreasing as the order increases in the nematic region\nthrough manipulation of lp and u2. Additionally, when the far field nematic order is fixed, the core\nsize increases with lp.\n1\nIntroduction\nSelf Consistent Field Theory (SCFT) is a well established tech-\nnique for the study of the equilibrium properties of polymer and\nblock copolymer melts by computing energy and entropy contri-\nbutions to the partition function that arise from chain architec-\nture, flexibility, and intermolecular interactions1,2. Of particular\ninterest here are systems comprising semi flexible chains that as-\nsemble into nematic and smectic ordered phases3–6. Our anal-\nysis is motivated by growing interest in orientationally ordered\nand often active fluids, including bio polymeric systems. In many\ncases, the molecular constituents are quite complex, and remain\npoorly characterized. Therefore the resulting elastic anisotropy\nof the medium, and its often unusual rheology remain largely un-\nexplored. Self Consistent Field Theory offers a potential avenue\nfor the exploration of elasticity and the structure of topological\ndefects in the types of molecular assemblies that are the focus\nof current active and biological matter research. Our work pre-\nsented below is our first step in that direction, and focuses on\nthe structure of topological defects in a nematic phase compris-\ning semi flexible molecular units.\nThe free energy of elastic distortion from a uniform nematic\nphase is given, to lowest order, by three modes of deformation:\nsplay, twist, and bend7.\nThe starting point of many theoreti-\ncal analyses of nematics, however, is the so called one constant\napproximation according to which splay, twist, and bend elas-\ntic constants are assumed to be equal.\nThis renders the ne-\nmatic elastically isotropic, a reasonably good approximation for\nsmall molecule, thermotropic liquid crystals. On the other hand,\nthe response of the so called lyotropic liquid crystals (longer\nmolecule nematogens in solution, where the isotropic to nematic\nSchool of Physics and Astronomy, University of Minnesota, Minneapolis, MN 55455,\nUSA.\ntransition is induced by concentration change) is quite different.\nBroad classes that are being studied at present include lyotropic\nchromonics8,9, and nematic micelles10. In both cases, the twist\nelastic constant is as much as one order of magnitude smaller than\nbend and twist. Such a large contrast gives rise to unexpected\nphenomenology, including, for example, spontaneous chiral sym-\nmetry breaking under confinement11? ? –13. Additional research\non nematic response in systems with complex molecular units in-\nclude, for example, actin networks14, the role of nematic order\nin cellular mechano adaptation15, or growth of gliomas in the\nbrain16. Theoretical tools are needed to describe potentially de-\nfected nematics exhibiting large elastic anisotropy, and with com-\nplex molecular architecture and rheology. Given the successes of\nSelf Consistent Field Theory in the polymer field, we begin here\nby examining the effects of fluid compressibility and molecular\nflexibility on complex configurations of a nematic phase that in-\nvolve phase boundaries and topological defects.\nIn the related case of worm like chains, it is known that\nboth persistence (lp) and chain lengths (L) determine the elastic\nanisotropy of the nematic phase17. Polymer field theory work18\nshows that the bend elastic constant (K3) is larger than the splay\nconstant (K1) for rigid chains(L ≪lp), while the splay constants\nis larger for flexible chains (L ≫lp), indicating a crossover be-\ntween splay and bend contrast as chain flexibility changes. For a\nwide range of flexibility, the twist elastic constant (K2) is smaller\nthan both splay and bend18,19. In particular, K2/K1,3 becomes\nsmall when L ≫lp. Hence, inclusion of nematogen flexibility into\nthe theory naturally leads to elastic anisotropy.\nIn addition to\nconsidering chain flexibility, we introduce a molecular interaction\npotential of the Maier-Saupe type, supplemented by an isotropic\nexcluded volume term. This allows a simultaneous study of an\ninteraction inducing nematic order, and of fluid compressibility.\nAs expected, we find that increasing density favors nematic order.\nThe same effect follows by increasing the persistence length. For\n1–10 | 1\narXiv:2502.21218v1  [cond-mat.soft]  28 Feb 2025\n\n\nthe case of an isotropic-nematic interface at coexistence, SCFT\ncorrectly predicts biaxiality in the interfacial region when the\nalignment is planar, and uniaxiality and a wider interface in the\ncase of homeotropic alignment. We also show that the interfacial\nwidth increases with persistence length. Disclinations are also\ncorrectly reproduced within the theory, including a region of bi-\naxiality near the core, crossing over to a uniaxial core. While\nthe molecular density around the defect core depends strongly on\nsystem compressibility and the value of the Maier-Saupe interac-\ntion coefficient, the nematic order parameter is largely insensitive\nto the system compressibility. Finally, the angular dependence of\nthe eigenvalues of the tensor order parameter found around ±1/2\ndisclinations is consistent with the elastic anisotropy induced by\nthe flexible chains, in agreement with experiments20, and with\ncalculations based on the singular potential method21.\n2\nSelf Consistent Field Theory\nIn this section, and for completeness, we briefly summarize our\nimplementation of the self-consistent field theory (SCFT) for\nsemiflexible molecules with Maier-Saupe interaction.\nSimilar\nderivations can be found in Ref.6,22. The molecules are approxi-\nmated by worm-like chains characterized by a contour length Lc,\nand a persistence length lp. Each chain consists of Ns segments\nor monomers. For a collection of n worm-like chains confined\nwithin volume V at temperature T, the configuration of the i-th\nchain is described by a space curve ri(s), where s (0 ≤s ≤1) is\na normalized contour variable that denotes the location of a seg-\nment along the chain. The unit tangent vector ui(s) = dri/(Lcds)\ngives the orientation of the segment s. The microscopic density of\nsegment position and orientation is defined as\nˆφ(r,u) = V\nn\nn\n∑\ni=1\nZ 1\n0 ds δ(r−ri(s))δ(u−ui(s))\n(1)\nwhich is dimensionless and satisfies the normalization condition\nR dr\nR du ˆφ(r,u) = V. For a spatially homogeneous system, the av-\nerage density φ(r,u) = ⟨ˆφ(r,u)⟩is independent of r, where ⟨.⟩\ndenotes a thermal average. Consequently, the normalization con-\ndition then implies that the average density, when integrated over\nall orientations, satisfies φ(r) =\nR duφ(r,u) = 1. In contrast, for\ninhomogeneous systems, the local average density at r may take\nvalues that are greater or less than one.\nThe energy of the system consists of a bending energy\nof individual nematoges, monomer-monomer interactions and\nmonomer-solvent interactions. The solvent is treated implicitly,\nand the monomer-monomer interactions are assumed to follow\nthe Maier-Saupe model. The Hamiltonian of the system is given\nby\nβH = lp\n2Lc\nn\n∑\ni=1\nZ 1\n0 ds\n\f\f\f\f\ndui(s)\nds\n\f\f\f\f\n2\n+\n1\n2\nn2\nV 2\nZ\ndr\nZ\ndr′\nZ\ndu\nZ\ndu′ ˆφ(r,u)V(r,r′;u,u′) ˆφ(r′,u′)\n(2)\nwhere β = 1/kBT, and the kernel function V(r,r′;u,u′) = δ(r −\nr′){u0 −u2[(u · u′)2 −1\n3]} in the present study. The excluded vol-\nume parameter u0 quantifies the strength of the isotropic inter-\naction, and u2 quantifies the strength of the anisotropic Maier-\nSaupe (MS) interaction. The resulting partition function, after a\nHubbard-Stratonovich transformation, is\nZ ∝\nZ\nDφ\nZ\nDwexp(−βF[φ,w])\n(3)\nwith a free energy functional given by,\nβF[φ,w] = −n\nV\nZ\ndr\nZ\ndu w(r,u)φ(r,u)−nlnZ1[w]+nln( n\nV )+nF0\n+ 1\n2\nn2\nV 2\nZ\ndr\nZ\ndr′\nZ\ndu\nZ\ndu′φ(r,u)V(r,r′;u,u′)φ(r′,u′)\n(4)\nwhere F0 is a constant that is independent of n and V, and Z1[w] is\nthe normalized single chain partition function that is a functional\nof any specified external field w(r,u). Note that this functional,\nas defined, is non local. Hence the free energy functional of Eq.\n(4) cannot be written as an integral, over the entire system, of a\nfree energy density. Next, a saddle point approximation assumes\nthat the extremal configurations [φ∗,w∗] dominate the functional\nintegral defining the partition function, and are defined by,\nδ(βF)\nδφ\n\f\f\f\f\nφ=φ ∗,w=w∗= 0,\nδ(βF)\nδw\n\f\f\f\f\nφ=φ ∗,w=w∗= 0.\n(5)\nThus the free energy is approximated by F[φ∗,w∗]. The saddle\npoint approximation yields the relations\nw(r,u) = n\nV\nZ\ndr′\nZ\ndu′V(r,r′;u,u′)φ(r′,u′)\n= n\nV\nZ\ndu′\n\u0014\nu0 −u2[(u·u′)2 −1\n3]\n\u0015\nφ(r′,u′)\nφ(r,u) = −V δ lnZ1[w]\nδw\n(6)\nfor the two thermodynamically independent fields w(r,u) and\nφ(r,u). Notably, the second equation involves solving for a sin-\ngle chain in external field w(r,u)\nφ(r,u) =\nZ 1\n0 dsφ(r,u,s)\n=\n1\n4πZ1[w]\nZ 1\n0 dsq(r,−u,1−s;[w])q(r,u,s;[w])\n(7)\nwhere the propagator q is a functional of w(r,u), satisfying the\nmodified diffusion equation (MDE)\n∂q(r,u,s;[w])\n∂s\n=\n\u0012 Lc\n2lp\n∇2\nu −Lcu·∇r −w(r,u)\n\u0013\nq,\n(8)\nwith initial condition q(r,u,s = 0;[w]) = 1. The normalized single\nchain partition function is given by\nZ1[w] =\n1\n4πV\nZ\ndr\nZ\nduq(r,u,s = 1;[w])\n(9)\nThe equilibrium solutions are determined self consistently accord-\ning to Eqs. 6. It means that the interaction between molecules for\n2 |\n1–10\n\n\na configuration φ(r,u) creates an effective field w(r,u). This gen-\nerated field in turn self consistently determines the configuration\nφ(r,u). The equilibrium states are obtained when both self con-\nsistency conditions are simultaneously satisfied.\nThe nematic order parameter tensor is obtained from φ(r,u)\nthrough\nQ(r) =\nR du φ(r,u)\n\u0000u⊗u−1\n3I\n\u0001\nR du φ(r,u)\n(10)\nwhere I is the rank 3 identity tensor. The denominator is needed\nfor normalization in the case of inhomogeneous states where the\nlocal density φ(r) is not uniform.\nIn order to reduce the computational complexity, we expand all\nu dependent quantities in terms of real spherical harmonics6,23.\nThe real spherical harmonic expansion of an arbitrary function\nf(r,u) is written as\nf(r,u) = ∑\nl,m\nf m\nl (r)˜Y m\nl (u)\n(11)\nwhere f can be q(r,u,s), w(r,u) and φ(r,u). The MDE can then\nbe written in terms of the spherical harmonic expansion as,\n∂qm\nl\n∂s = −Lc\n2lp\nl(l +1)qm\nl −Lc\nr\n4π\n3 Gmαmm2\n1ll2\n∂qm2\nl2\n∂xα\n−Gmm1m2\nll1l2\nwm1\nl1 qm2\nl2\n(12)\nwhere the real Gaunt coefficients are defined as Gm1m2m3\nl1l2l3\n=\nR du˜Y m1\nl1 (u)˜Y m2\nl2 (u)˜Y m3\nl3 (u)23, the integral of products of three real\nspherical harmonics over u.\nThe resulting convection diffu-\nsion equation for the coefficients is solved with a Lax-Wendroff\nmethod24, with a step size in contour length ∆s. The coordinate\nspace is divided into evenly spaced lattice points, (xi,y j,zk). A\nfield f(r,u) is represented by its expansion coefficients defined\non lattice points, f m\nl (xi,yj,zk). In the computations below, we re-\nstrict the expansion to order l = 4. The first equation in the system\n(6) leads to linear equations following the expansion6\nw0\n0(r) = 4πu0\nn\nV φ0\n0 (r)\nwm\n2 (r) = −4πu2\n5\nn\nV φm\n2 (r)\n(13)\nwhere all other components l ̸= 0,2 are zero. Therefore, the ex-\npansion in real spherical harmonics greatly reduces the number\nof degrees of freedom of the theory. The expansion also allows\nus to write the order parameter tensor in terms of the coefficients\nφm\nl , following the definition in Eq.(10)\nQ =\n1\n3\n√\n5φ0\n0\n\n\n\n−φ0\n2 +\n√\n3φ2\n2\n√\n3φ−2\n2\n√\n3φ1\n2\n√\n3φ−2\n2\n−φ0\n2 −\n√\n3φ2\n2\n√\n3φ−1\n2\n√\n3φ1\n2\n√\n3φ−1\n2\n2φ0\n2\n\n\n\n(14)\nwhere only l = 0,2 terms are nonzero due to the definition of\nQ. The five degrees of freedom for l = 2 are sufficient for Q to\ndescribe general biaxial order. As is done often, we parametrize\nthe tensor order parameter as\nQ = S(ˆn⊗ˆn−1\n3I)+P( ˆm⊗ˆm−ˆl⊗ˆl)\n(15)\nwhere ˆn, ˆm and ˆl are an orthonormal triad of eigenvectors of\nQ. The director ˆn is the eigenvector with the largest eigenvalue.\nThe constant S is the uniaxial order parameter, and P the biaxial\norder parameter. Their relationship with the eigenvalues of Q is,\n(λn,λm,λl) = ( 2\n3S,−1\n3S+P,−1\n3S−P).\nThere are only a limited number of cases in which the prop-\nagator can be obtained analytically, so a numerical solution to\nthe MDE is usually necessary. In this work, in order to find ap-\nproximate saddle point solutions (Eq. (5)), an iterative method\nis used with the following steps. Step 1: Define an initial guess\nfor the input fields wm\nl(in)(xi,yj,zk). Step 2: Solve the MDE nu-\nmerically to find the propagator qm\nl (xi,yj,zk,s;[wm\nl ]), and compute\nZ1[w], φm\nl (xi,yj,zk), and other thermodynamic quantities accord-\ningly. Step 3: Compute the output fields wm\nl(out)(xi,yj,zk) accord-\ning to the first equation in (6). Step 4: Define the absolute dif-\nference between the input and the output fields to be the er-\nror.\nWhen the maximum error among all the expansion com-\nponents and space points is smaller than a given tolerance, i.e.,\nmax(|wm\nl(out)(xi,yj,zk)−wm\nl(in)(xi,yj,zk)|) < ε, the iteration is ended.\nOtherwise, the input field is updated by using the Picard iteration\nmethod4,5, and going back to step 2. The current work obtains\nnumerical solutions using Python? .\n3\nUniform states and isotropic-nematic phase tran-\nsition\nWe first briefly review the equilibrium phase behavior provided by\nthe SCFT. We have used ∆s = 1/100 in all our calculations. Unless\notherwise specified, we set u0 = 10, Lc = lp = 1, and n/V = 1.\nThe normalization condition requires φ(r) = 1 and hence φ0\n0 (r) =\n1/\n√\n4π. Without loss of generality, we consider that the phase\ntransition is from the isotropic phase to a uniaxial nematic phase\nalong the ˆz direction, so that φm\n2 is non vanishing only for m = 0\nin the nematic phase.\nHence Eq.(14) gives the uniaxial order\nparameter S =\nq\n4π\n5 φ0\n2 .\nAs described in Sec. 2, an iterative method is generally neces-\nsary to compute SCFT solutions from an appropriate initial guess.\nFor a uniform configuration, and to the order of approximation\nin spherical harmonics that we are using, there is a more direct\nmethod. There are only two variables that need to be determined,\nw0\n2 and φ0\n2 . The free energy per chain as a function of w0\n2 and φ0\n2\nis then given by,\nβF[φ0\n2 ,w0\n2]\nn\n= F0 −lnZ1[w0\n2]−w0\n2φ0\n2 −1\n2\nn\nV\n4πu2\n5\n(φ0\n2 )2\n(16)\nwhere all constants are absorbed into F0. The resulting free en-\nergy is shown in Fig.1(a) for u2 = 9.882, the isotropic-nematic\nphase transition point. The black solid line illustrates the station-\nary condition δ(βF)\nδφ 0\n2\n= 0, whereas the dashed line corresponds to\nδ(βF)\nδw0\n2\n= 0. The saddle points are at the intersections of the solid\nand dashed lines. The equilibrium free energy per chain along the\nsolid line (w0\n2 = −4πu2\n5\nn\nV φ0\n2 ) displays a characteristic double well\nshape, and it is shown in Fig. 1(b) for different values of u2, and\nas a function of the uniaxial order parameter S. The saddle points\ncorresponds to the minima of this function. The minimum at S = 0\ncorresponds to the isotropic phase, and the minimum at S ̸= 0 cor-\nresponds to the nematic phase. The figure illustrates how, as u2\nincreases, the global minimum changes from the isotropic phase\n1–10 | 3\n\n\n(a)\n(b)\n(c)\n(d)\nFig. 1 (a) and (b)Free energy per chain of bulk state, where F0 is chosen to make the free energy of isotropic phase zero. (a) shows the free energy\nper chain as function of φ0\n2 and w0\n2 at the phase transition u2 = 9.882, where the black solid line and dashed line correspond to the conditions δ(βF)\nδφ0\n2\n= 0\nand δ(βF)\nδw0\n2 = 0, respectively. The three inset plots provide the enlarged view near the intersections. (b) shows the free energy per chain along the black\nsolid line for different values of u2. (c) and (d) Equilibrium uniaxial order S as a function of u2 for different chain number densities and flexibilities\nto the nematic phase, indicating a first order phase transition. The\nequilibrium uniaxial order parameter S as a function of MS inter-\naction coefficient u2 can be obtained from the minimum the free\nenergy. The value of u2 at the phase transition depends on combi-\nnations of parameters: Chain number density n/V and ratio Lc/lp,\nwhile it is independent of u0. Fig.1(c)(d) show S as a function of\nu2 for different values of n/V and Lc/lp. As the chain number\ndensity increases, the phase transition occurs at a lower value of\nu2. Note that u2 appears as a product with n/V in Eq.6, so the\nthree curves in Fig.1(c) will be identical if ˜u2 = u2n/V is used as\nthe horizontal axis. As the chains become stiffer, Fig.1(d) shows\nthat the phase transition occurs at a lower value of u2, which is\nconsistent with the result in Ref.6.\n4\nIsotropic-Nematic Interface\nWe study an inhomogeneous configuration with coexisting\nisotropic and nematic regions, separated by a planar interface.\nUnlike the case of Sec.\n3 in which the density φ(r) is fixed\nand uniform in space, the density here is a function of position,\nand changes across the isotropic-nematic interface.\nAt coexis-\ntence, in addition to uniform temperature, the chemical poten-\ntial µ = (∂F/∂n)|V and pressure p = −(∂F/∂V)|n need to be the\nsame in both phases. In addition, there is an equilibrium con-\ndition associated with free energy minimization with respect to\nthe nematic order parameter. Far from the interface, the nematic\nphase is assumed uniaxial. Since the order parameter S is uncon-\nstrainable, at coexistence one simply has (∂F/∂S)|n,V = 0 in both\nbulk regions. The equilibrium configuration that contains an in-\nterface is obtained as follows: An initial configuration is set up in\nwhich Q and φ are fields varying only in the ˆx direction. To model\nan isotropic-nematic interface, a step function is introduced for S,\nwhere S = 0 on the left side, representing the isotropic phase, and\nS ̸= 0 on the right side, representing the nematic phase. The initial\nvalue of φ0\n0 = 1/\n√\n4π and P = 0 are chosen for a uniform density\nconfiguration with zero biaxiality. For an arbitrary director di-\nrection ˆn in the nematic region, Eqs. (13)(14)(15) are used to\ncompute the initial values of wm\nl . Equations (6) are iterated over\na system of length Lx = 10Lc with Neumann boundary conditions\napplied on both ends. The domain [0,10] is uniformly divided into\n400 intervals. The iteration process is terminated when the max-\n4 |\n1–10\n\n\n(a)\n(b)\n(c)\n(d)\nFig. 2 Isotropic-Nematic interface for different values of u2 and u0 in (a)(c) density profiles and (b)(d) uniaxial order profiles\nimum errors in wm\nl falls below ε = 10−4. The iteration converges\nslowly if the initial interface is positioned arbitrarily. To acceler-\nate convergence, the interface location is manually adjusted until\nthe error rapidly decreases to 10−4. Although the initial condition\nassumes a uniform density configuration, a density gap between\nthe isotropic and nematic regions naturally develops during the\niteration process for a finite value of u0. Furthermore, our re-\nsults reveal the emergence of nonzero biaxiality across the inter-\nface under planar alignment, even though the initial condition\nassumes P = 0. The nonzero biaxiality is not exclusive to planar\nalignment but is observed for any alignment where the director is\nnot perpendicular to the interface4.\nFirst, we study the interface with homeotropic alignment,\nwhere the director ˆn = ˆx. Density profiles are plotted in Fig.2(a)\nfor u2 = 9.88, 10 and 10.2. The local density of the isotropic region\nφI is lower than that of the nematic region, φN, leading to a den-\nsity gap between the nematic and isotropic regions. This result is\nconsistent with previous studies4? ? . In the canonical ensemble,\nwith fixed average chain number density n/V, there exists a range\nof u2 values for which the isotropic and nematic phases coexist.\nThe relative volume fraction of the nematic and isotropic regions\ndepends on the value of u2. For higher values of u2, the nematic\nregion becomes larger but exhibits a lower density, as shown in\nFig. 2(a). The shift in the interface position is also reflected in\nthe uniaxial order profile, as depicted in Fig. 2(b). In order to ex-\ntract the width (wi) and location of the interface from our SCFT\nsolutions, we approximate the interfacial uniaxial order profiles\nby26\nS(x) = SN\n2 [tanh(x−x0\nwi\n)+1]\n(17)\nwhere x0 denotes the center of the interface, and SN represents\nthe uniaxial order in the nematic region. The interfacial widths\nfrom the density profiles can be extracted in a similar way. We\nfind that x0 from the density profiles is larger than that from the S\nprofiles, indicating that the density jump is displaced towards the\nnematic side4. Additionally, the interfacial width extracted from\nthe density profiles are smaller than that from the S profiles.\nWe next address how the fluid compressibility, determined by\nthe value of the excluded volume coefficient u0, affects the inter-\nface. By setting u2 = 9.88, the interfaces for different values of\nu0 are shown in Fig.2(c)(d). As u0 increases, the system becomes\nmore incompressible, leading to a reduction in the gaps of both\nthe uniaxial order and the density profiles. The reduction of SN\nwidens the interface because segregation between nematic and\nisotropic phases is smaller? . In the limit of infinite u0 (a com-\npletely incompressible fluid), the density gaps vanishes, resulting\nin a uniform density throughout the space, and the interface lo-\ncation is arbitrary.\nInterfacial profiles depend on the director angle in the nematic\nregion relative to the interface normal.\nThe results for planar\nalignment ˆn = ˆz are shown in Fig. 3. Unlike the homeotropic\nalignment case just described, planar alignment is accompanied\n1–10 | 5\n\n\n(a)\n(b)\nFig. 3 Interface for planar alignment. (a) shows the uniaxial order S and biaxial order P across the interface. (b) shows the three diagonal components\nof the tensor order parameter as functions of x\n(a)\n(b)\nFig. 4 Interface width dependence on flexibility. For different values of ratio L/lp, the value of u2 is chosen to establish a stable interface near x = 5\n(u2 = 16.1 for Lc/lp = 2, u2 = 9.88 for Lc/lp = 1, u2 = 7.02 for Lc/lp = 0.5 and u2 = 4.58 for Lc/lp = 0.01). (a) shows the widths extracted from both\nthe φ and S profiles as a function of Lc/lp for homeotropic and planar alignments. (b) shows the ratio of widths between homeotropic alignment and\nplanar alignment as a function Lc/lp\nby nonzero biaxiality near the interface. Near the interface, but\non the isotropic side, the component of the tensor order parame-\nter Qxx is negative, and Qyy ≈Qzz > 0. This is in agreement with\npredictions from the Landau-de Gennes free energy26.\nThe interfacial width depends on the values of the elastic con-\nstants, which, in this model, depends on the flexibility of the\nchain. Here, we consider systems that are close to the incom-\npressible limit by setting u0 = 50. Interfacial widths as a function\nof chain flexibility Lc/lp are shown in Fig.4(a). Both widths ex-\ntracted from φ and S profiles decrease as the chains become more\nflexible. In the rigid chain limit (lp ≫Lc), the interface width is\non order of Lc. However, when the chains become flexible, the\nwidth scales with lp instead.\nIn semiflexible polymer chains, K1 is the same order as K3,\nwhereas K2 can be one order of magnitude smaller than both\ndepending on the flexibility17.\nWhen K1 ≈K3, the ratio of\nhomeotropic to planar width is predicted to be\nwh\nwp =\nq\n6+4κ\n6+κ ,\nwith κ = 2(K1/K2 −1) being a measure of the anisotropy26. In\nagreement with existing phenomenology, the interfacial width in\nthe case of homeotropic alignment is larger than that of planar\nalignment4. The ratio wh/wp as a function of Lc/lp is shown in\nFig.4(b); wh/wp increases as the chains become very flexible, in-\ndicating a higher elastic anisotropy κ.\n5\nTopological Defects in Two Dimensions\nWe focus here on a different type of non uniform configuration,\na topological defect in a two-dimensional square region of lateral\ndimensions Lx = Ly = 10. The region is discretized into 200×200\nuniform square domains. Unless stated otherwise, we set u0 = 15,\nu2 = 15, Lc = lp = 1, and n/V = 1. For the analysis below, we also\ndefine polar coordinates (r,ϕ) relative to the center of the defect.\nThe defect center is defined as the location where S = P, and it\nis determined as part of the free energy minimization. Initially,\nthe disclination center is positioned at the geometric center of\nthe square region. The initial configuration is specified as S(r) =\nSN[1 −exp(−5r)], P(r) = 0, and the director angle θ = qϕ, where\nq = ±1/2 is considered in this work. To obtain the SCFT solution,\nthe iteration process terminates once the maximum error in the\n6 |\n1–10\n\n\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\nFig. 5 SCFT solutions of ±1/2 defects. Top: (a), (b), and (c) for -1/2 defect. Bottom: (d), (e), and (f) for 1/2 defect. Left: director field obtained\nfrom the largest eigenvalue of Q. Middle: uniaxial (S) and biaxial (P) order parameters as a function of position along the line y = 0. Right: density\nfield.\nwm\nl field falls below ε = 0.01.\nFigure 5 presents the SCFT solutions for q = ±1/2 defects. The\ndirector profiles are shown in Figures 5(a) and 5(d) for q = −1/2\nand q = 1/2, respectively. Figures 5(b) and 5(e) illustrate the cor-\nresponding uniaxial (S) and biaxial (P) order parameters along\nthe line y = 0. For q = −1/2, the defect core remains at the ge-\nometric center. In contrast, for q = 1/2, the defect center shifts\ntoward the −ˆx direction as the iterations progress. In both cases,\nthe configurations are uniaxial (P = 0) far from the defect core.\nHowever, as the defect core is approached, P increases, leading\nto a locally biaxial configuration. At the exact center of the de-\nfect, where S = P, the tensor Q exhibits two degenerate positive\neigenvalues, resulting in a uniaxial configuration once again27,28.\nFigures 5(c) (f) show the anisotropic density distributions near\nthe defect cores. In both cases, the core regions exhibit lower\ndensities compared to the surrounding nematic regions. Figures\n6(a) (d) present the distributions of optical retardance, Γ = S−P,\na quantity that can be experimentally measured through polar-\nization microscopy. The Γ distributions reveal cores of smaller\nextent compared to what would be inferred from the density dis-\ntributions. Figures 6(b)(e) display the density and optical retar-\ndance along the line y = 0. The density profiles are smooth across\nthe cores, while Γ exhibits singular behavior at the cores. It is\nnoteworthy that, in the case of q = −1/2, the location of low-\nest density coincides with the defect core center. However, for\nq = 1/2, the location of the lowest density does not align with the\ndefect core center. The Γ distributions are further analyzed by\ntheir angular Fourier modes Γ(r,ϕ) = ∑Γn(r)cos(nϕ), as shown in\nFig.6(c) (f). The nonzero anisotropic term Γ1 in 1/2 defect and\nΓ3 in −1/2 defect are signatures of the anisotropy in splay and\nbend constants20,21.\nWe finally examine the dependence of the core structure on the\ninteraction coefficients u0 and u2, as well as on chain flexibility.\nFigure 7 presents the density profiles (top) and optical retardance\n(bottom) along y = 0 for a q = −1/2 defect under varying param-\neters. For each plot, all parameters are held constant(u0 = 15,\nu2 = 15, Lc = 1, lp = 1, and n/V = 1), except for the specific param-\neter being examined. We observe that the compressibility param-\neter u0 does not affect nematic order (SN) in the nematic region.\nThe core radius decreases as the system become less compressible\nand reaches a plateau in the incompressible limit. However, SN\nshows an increase with u2 and lp, as expected from the bulk state\nstudy. The density difference between the defect core and the ne-\nmatic regions decreases as the system becomes less compressible\n(i.e., with increasing u0). Increases in u2 or lp lead to greater\norder (SN) in the nematic region and an increased density differ-\nence between the defect core and the nematic regions. However,\nwhile an increase in u2 expands the region of density variation,\nthe size of density variation region remains relatively unchanged\nwhen lp is increased. To quantitatively analyze the size of the\ncore from the Γ configurations, we replotted Figures 7(e) and\n7(f) in Figures 8(a) and 8(b) by normalizing the data using the\noptical retardance in the nematic region (ΓN) and a characteris-\ntic length ξ, defined such that Γ(x = −ξ,y = 0) = ΓN/2. It allows\nξ to be displayed as a function of u2 and lp, as shown in Figures\n8(d) and 8(e). The characteristic length ξ decreases with increas-\n1–10 | 7\n\n\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\nFig. 6 SCFT solutions for ±1/2 defects. Top: (a), (b), and (c) correspond to a -1/2 defect. Bottom: (d), (e), and (f) to a 1/2 defect. Left: spatial\ndistribution of Γ. Middle: Γ and the φ as a function of position along the line y = 0. Right: Fourier components of Γ as a function of the radial\ndistance from the defect center.\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\nFig. 7 Density (φ) and optical retardance (Γ) along the line y = 0 for −1/2 defect at varying values of (a)(d)u0, (b)(e)u2 and (c)(f)lp\ning u2 or lp, accompanied by an increase in ΓN. The point for\nu2 = 24,u0 = 15 appears anomalous due to its coupling to a wide\ndensity variation. To exclude the effect of ΓN and compressibility\non the core size, we chose u0 = 50 and set u2 in order to make\nSN ≈0.652 for various lp. The density and optical retardance pro-\nfiles along the line y = 0 are shown in 8(c)(f). Therefore, for an\nincompressible systems and fixed SN, the core size increases as\nthe chains become stiffer.\n8 |\n1–10\n\n\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\nFig.\n8 Normalized optical retardance Γ/ΓN as a function of position along the line y = 0 for −1/2 defect at varying values of (a)u2 and (b)lp.\nCharateristic length ξ as a function of (d)u2 and (e)lp. The point for u2 = 24,u0 = 15 appears anomalous due to its coupling to a wide density variation,\nthus points of u0 = 20 are added for comparison. (c) and (f): Density and optical retardance along the line y = 0 for −1/2 defect at varying vaules of\nlp, where u0 = 50 to make the systems close to the incompressible limit, and u2 are adjusted to make the SN ≈0.652(u2 = 22 for lp = 0.6; u2 = 15 for\nlp = 1; u2 = 9.8 for lp = 2; u2 = 5.46 for lp = 50; u2 = 5.4 for lp = 100).\n6\nConclusions\nIn this article, we have studied the equilibrium isotropic-nematic\nphase transition, isotropic-nematic interfaces, and topological de-\nfects in the nematic phase of a worm like chain liquid crystal by\nusing Self-Consistent Field Theory. For homogeneous states, the\nphase transition follows by numerical minimization of the free\nenergy functional, revealing the effects of chain number density\nand flexibility on the transition. Larger density or stiffer chains\nare associated with lower Maier-Saupe interaction strength at the\ntransition point. In the case of an isotropic-nematic interface, we\nhave studied the effects of compressibility, interaction strength u2,\nand chain flexibility on the interface. A larger value of u0 corre-\nsponds to a smaller compressibility, leading to a smaller density\ngap between the two phases. In the canonical ensemble, the value\nof u2 determines the relative portion of the system occupied by\nthe isotropic and nematic phases. The interfacial width increases\nas the chain become stiffer, as given by larger persistence length\nlp. Both homeotropic and planar alignments have been studied.\nIn contrast to homeotropic alignment, planar alignment displays\nnonzero biaxiality across the interface and a smaller interfacial\nwidth. We have also studied the equilibrium configurations as-\nsociated with ±1/2 disclinations in a thin film geometry (two di-\nmensional variations of the nematic order parameter, but allow-\ning out of plane director orienation). Defects display a region of\nbiaxial order in the core region, and a uniaxial center defined as\nthe point in which S = P, the uniaxial and biaxial order parame-\nters coincide. Elastic anisotropy, which is naturally incorporated\nin the flexible chain model, leads to an anisotropic core in agree-\nment with previous experiments and computation. Finally, we\nhave examined the dependence of the core structure and extent\non the interaction coefficients u0 and u2, as well as on chain flexi-\nbility. For fixed far field nematic order SN, the core size is seen to\nincrease with lp, and hence to effectively decrease with increasing\ntwist/bend elastic anisotropy.\nConflicts of interest\nThere are no conflicts of interest to declare.\nAcknowledgements\nThis research has been supported by the National Science Foun-\ndation under contract DMR-2223707, by the Minnesota Super-\ncomputing Institute of the University of Minnesota, and by the\nAdvanced Cyberinfrastructure Coordination Ecosystem: Services\n& Support (ACCESS) program, which is supported by U.S. Na-\ntional Science Foundation grants 2138259, 2138286, 2138307,\n2137603, and 2138296.\nNotes and references\n1 G. H. Fredrickson, V. Ganesan and F. Drolet, Macromolecules,\n2002, 35, 16–39.\n1–10 | 9\n\n\n2 G. H. Fredrickson, The Equilibrium Theory of Inhomogeneous\nPolymers, Oxford University Press, 2006.\n3 W. Song, P. Tang, H. Zhang, Y. Yang and A.-C. Shi, Macro-\nmolecules, 2009, 42, 6300–6309.\n4 Y. Jiang and J. Z. Chen, Macromolecules, 2010, 43, 10668–\n10678.\n5 M. Deng, Y. Jiang, H. Liang and J. Z. Chen, Macromolecules,\n2010, 43, 3455–3464.\n6 R. K. Spencer, N. Saeidi and B.-Y. Ha, The Journal of Chemical\nPhysics, 2020, 152,.\n7 J. V. Selinger, Introduction to the theory of soft matter: from\nideal gases to liquid crystals, Springer, 2016.\n8 S. Zhou, Y. A. Nastishin, M. M. Omelchenko, L. Tortora, V. G.\nNazarenko, O. P. Boiko, T. Ostapenko, T. Hu, C. C. Almasan,\nS. N. Sprunt, J. T. Gleeson and O. D. Lavrentovich, Phys. Rev.\nLett., 2012, 109, 037801.\n9 S. Zhou, Lyotropic Chromonic Liquid Crystals, Springer, 2017.\n10 C. F. Dietrich, P. J. Collings, T. Sottmann, P. Rudquist and\nF. Giesselmann, Proceedings of the National Academy of Sci-\nences, 2020, 117, 27238–27244.\n11 J. Jeong, Z. S. Davidson, P. J. Collings, T. C. Lubensky and\nA. Yodh, Proceedings of the National Academy of Sciences, 2014,\n111, 1742–1747.\n12 K. Nayani, R. Chang, J. Fu, P. W. Ellis, A. Fernandez-Nieves,\nJ. O. Park and M. Srinivasarao, Nature communications, 2015,\n6, 8067.\n13 Z. S. Davidson, L. Kang, J. Jeong, T. Still, P. J. Collings, T. C.\nLubensky and A. Yodh, Physical Review E, 2015, 91, 050501.\n14 R. Zhang, N. Kumar, J. L. Ross, M. L. Gardel and J. J. De Pablo,\nProceedings of the National Academy of Sciences, 2018, 115,\nE124–E133.\n15 B. L. Cook and P. W. Alford, Integrative Biology, 2023, 15,\nzyad009.\n16 S. M. Faisal, J. E. Clewner, B. Stack, M. L. Varela, A. Comba,\nG. Abbud, S. Motsch, M. G. Castro and P. R. Lowenstein, Ad-\nvanced Science, 2024, 11, 2309796.\n17 S. Varytimiadou, D. Revignas, F. Giesselmann and A. Ferrarini,\nLiquid Crystals Reviews, 2024, 12, 57–104.\n18 A. Ghosh, Q. MacPherson, Z.-G. Wang and A. J. Spakowitz,\nThe Journal of Chemical Physics, 2022, 157,.\n19 T. Odijk, Liquid Crystals, 1986, 1, 553–559.\n20 S. Zhou, S. V. Shiyanovskii, H.-S. Park and O. D. Lavrentovich,\nNature Communications, 2017, 8, 14974.\n21 C. D. Schimming and J. Viñals, Physical Review E, 2020, 102,\n010701.\n22 J. Z. Chen, Progress in Polymer Science, 2016, 54, 3–46.\n23 H. H. Homeier and E. O. Steinborn, Journal of Molecular Struc-\nture: THEOCHEM, 1996, 368, 31–37.\n24 K. C. Daoulas, D. N. Theodorou, V. A. Harmandaris, N. C.\nKarayiannis and V. G. Mavrantzas, Macromolecules, 2005, 38,\n7134–7149.\n25 Y. Jiang, C. Greco, K. C. Daoulas and J. Z. Chen, Polymers,\n2017, 9, 48.\n26 V. Popa-Nita, T. Sluckin and A. Wheeler, Journal de Physique\nII, 1997, 7, 1225–1243.\n27 C. D. Schimming and J. Viñals, Soft Matter, 2022, 18, 2234–\n2244.\n28 C. D. Schimming and J. Viñals, Proceedings of the Royal Society\nA, 2023, 479, 20230042.\n10 |\n1–10\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21218v1.pdf",
    "total_pages": 10,
    "title": "Self Consistent Field Theory of isotropic-nematic interfaces and disclinations in a semiflexible molecule nematic",
    "authors": [
      "Longyu Qing",
      "Jorge Viñals"
    ],
    "abstract": "A Self Consistent Field Theory description of equilibrium, but non uniform,\nconfigurations adopted by semi flexible liquid crystal molecules is presented.\nTwo cases are considered, isotropic-nematic phase boundaries, and topological\ndefects in the nematic phase (disclinations). Nematogens are modeled by\nworm-like chains, with microscopic interaction potential of the Maier-Saupe\ntype, with an added isotropic excluded volume contribution. The thermodynamic\nfields obtained by numerical minimization of the free energy are the molecular\ndensity and the nematic tensor order parameter. Interfaces with both\nhomeotropic and planar alignment are studied, as well as biaxiality and\nanisotropy around $\\pm 1/2$ disclinations. The effects induced by fluid\ncompressibility, interaction strength, and elastic anisotropy that follows from\nchain flexibility on both types of non-uniform configurations are discussed.\nDefect core sizes decrease as the system becomes less compressible, eventually\nreaching a constant value in the incompressible limit. The core size is\ninfluenced by the nematic interaction strength and chain persistence length,\ndecreasing as the order increases in the nematic region through manipulation of\npersistence length and nematic interaction. Additionally, when the far field\nnematic order is fixed, the core size increases with the persistence length.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}