{
  "id": "arxiv_2502.21220v1",
  "text": "XAIxArts Manifesto: Explainable AI for the Arts\nNICK BRYAN-KINNS, University of the Arts London, UK\nSHUOYANG JASPER ZHENG, Queen Mary University of London, UK\nFRANCISCO CASTRO, New York University, United States\nMAKAYLA LEWIS, Kingston University, UK\nJIA-REY CHANG, Queen’s University Belfast, UK\nGABRIEL VIGLIENSONI, Concordia University, Canada\nTERENCE BROAD, University of the Arts London, UK\nMICHAEL CLEMENS, University of Utah, United States\nELIZABETH WILSON, University of the Arts London, UK\nFig. 1. Early version of the XAIxArts manifesto as a poster at the ACM Creativity and Cognition (C&C) 2024 conference with post-it\nnotes added by conference attendees.\nAuthors’ Contact Information: Nick Bryan-Kinns, University of the Arts London, London, UK, n.bryankinns@arts.ac.uk; Shuoyang Jasper Zheng,\nQueen Mary University of London, London, UK, shuoyang.zheng@qmul.ac.uk; Francisco Castro, New York University, New York, United States,\nfrancisco.castro@nyu.edu; Makayla Lewis, Kingston University, London, UK, m.m.lewis@kingston.ac.uk; Jia-Rey Chang, Queen’s University Belfast,\nBelfast, UK, j.chang@qub.ac.uk; Gabriel Vigliensoni, Concordia University, Montréal, Canada, gabriel.vigliensoni@concordia.ca; Terence Broad, University\nof the Arts London, London, UK, t.broad@arts.ac.uk; Michael Clemens, University of Utah, Salt Lake City, United States, michael.clemens@utah.edu;\nElizabeth Wilson, University of the Arts London, London, UK, e.j.wilson@arts.ac.uk.\nPermission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not\nmade or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for third-party\ncomponents of this work must be honored. For all other uses, contact the owner/author(s).\nManuscript submitted to ACM\n1\narXiv:2502.21220v1  [cs.HC]  28 Feb 2025\n\n\n2\nBryan-Kinns et al.\nExplainable AI (XAI) is concerned with how to make AI models more understandable to people. To date these explanations have\npredominantly been technocentric - mechanistic or productivity oriented. This paper introduces the Explainable AI for the Arts\n(XAIxArts) manifesto to provoke new ways of thinking about explainability and AI beyond technocentric discourses. Manifestos offer\na means to communicate ideas, amplify unheard voices, and foster reflection on practice. To supports the co-creation and revision of\nthe XAIxArts manifesto we combine a World Café style discussion format with a living manifesto to question four core themes: 1)\nEmpowerment, Inclusion, and Fairness; 2) Valuing Artistic Practice; 3) Hacking and Glitches; and 4) Openness. Through our interactive\nliving manifesto experience we invite participants to actively engage in shaping this XIAxArts vision within the CHI community and\nbeyond.\nCCS Concepts: • Human-centered computing →Human computer interaction (HCI); Interaction design; Visualization; •\nApplied computing →Arts and humanities; • Computing methodologies →Artificial intelligence.\nAdditional Key Words and Phrases: Manifesto, Explainable AI (XAI), Artificial Intelligence (AI), Arts, Generative Arts, AI Arts, Digital\nArts, Human-Centred AI, Human-Computer Interaction (HCI), Interaction Design\nACM Reference Format:\nNick Bryan-Kinns, Shuoyang Jasper Zheng, Francisco Castro, Makayla Lewis, Jia-Rey Chang, Gabriel Vigliensoni, Terence Broad,\nMichael Clemens, and Elizabeth Wilson. 2025. XAIxArts Manifesto: Explainable AI for the Arts. In Extended Abstracts of the CHI\nConference on Human Factors in Computing Systems (CHI EA ’25), April 26-May 1, 2025, Yokohama, Japan. ACM, New York, NY, USA,\n12 pages. https://doi.org/10.1145/3706599.3716227\n1\nIntroduction\nThe field of Explainable AI (XAI) [17] is concerned with how to make AI models more understandable to people and\nhas been a growing theme at Human-Computer Interaction (HCI) conferences including CHI, for example Ehsan et al.\n[14], Panigutti et al. [29], Zhang and Lim [41] and the “Mistakes, Explainability” session at the ACM CHI 2022 conference.\nHowever, and somewhat ironically, explainability and explanation are ambiguously defined in current literature [11]. For\nexample, in machine learning (ML) literature, explainability usually refers to making the reasons behind ML decisions\nmore comprehensible to people. We subscribe to a broader view of the meaning of explainability in which “explainability\nencompasses everything that makes ML models transparent and understandable, also including information about the\ndata, performance, etc.” [24]. From this point of view, explainability involves clarifying how AI models work and the\nreasoning behind their decisions, identifying and addressing biases in training datasets, understanding how these biases\naffect the models, and explaining the impact of AI models on energy consumption, the environment, and society.\nXAI approaches are part of the broader fields of Responsible AI and Human-Centred AI [28, 34], which have also been\ngrowing themes within HCI and the CHI community. Whilst XAI has been explored in areas such as healthcare [30]\nand automation [33], the explanations have predominantly been technocentric - mechanistic or productivity oriented -\nfocusing on explaining functional aspects of AI models or the reasoning behind specific decisions made by AI systems\nas illustrated in the survey of Guidotti et al. [16]. In response to this, the XAIxArts workshop series was started in\n2023 [6] to investigate how XAI might be applied and understood within the Arts, and how the Arts could provide an\n“alternative lens through which to examine XAI” [7]. Here the Arts inclusively refers to all artistic practices from music\nto visual arts, from dance to sculpture, or from poetry to film making.\n© 2025 Copyright held by the owner/author(s).\nManuscript submitted to ACM\nManuscript submitted to ACM\n\n\nXAIxArts Manifesto: Explainable AI for the Arts\n3\nOur XAIxArts international community has brought together over 60 academics and practising artists to date. The\nartistic practices in our community involve methods, techniques, and conceptual approaches used across creative\ndisciplines of human expression, culture, creativity, and design. Works from our XAIxArts workshops can be found on\nthe XAIxArts website1. In our workshops we explored questions such as the role of XAI as an artistic material [4, 38],\nhow Arts practices could be used to explain [1] and navigate AI models [40], and explaining artistic practices with\nAI [20]. We explored how AI models could be made more explainable and controllable by artists [12, 42], how bias in\ngenerative models could be better explained [10], and how AI-generated errors could be captured and repurposed as part\nof artistic practice [19]. Through these explorations of XAI for the Arts, as a community, we identified challenges and\nopportunities for XAI through the lens of the Arts beyond the predominant technocentric discourses of explainability.\nChallenges include the lack of explainable AI contributing to barriers to equitable access to AI Arts tools by diverse\nuser groups, and the atomised, isolated experiences that individual artists and creative practitioners are having with AI\nmodels. Opportunities include valuing artistic practice over mechanistic explanations of AI in order to offer alternative\ninsights into AI, to demystify AI, and to build trust in AI.\nTo move the field of XAIxArts forward, we propose constructive and actionable approaches in the form of a manifesto\n- a call to action approach [18] that advocates for change, to act rather than critique, and to concretize steps rather\nthan dissect problems. Manifestos have historically served as powerful catalysts for innovation and progress across\nvarious domains, from art and design to technology and social movements [3, 26, 27, 39]. Manifestos can effectively\ngalvanize communities and drive positive change by presenting concrete steps and actionable items [2]. A manifesto\ngives voice to unheard views and scaffolds an ongoing process of reflective discourse. In the context of XAIxArts, this\napproach is important as it encourages developing and implementing solutions that address the unique challenges\nand opportunities at the intersection of Explainable AI and the Arts. Rather than solely critiquing existing limitations\nor speculating on potential futures, this manifesto aims to inspire action and facilitate tangible progress. It is a call\nto embrace experimentation, collaboration, and innovation, and to actively shape the future of XAIxArts. We aim to\nengage with a broad spectrum of audiences with our XAIxArts manifesto. Our core audience brings together artists,\nHCI academics including “Artists as Researchers” and “Researchers as Artists” [35], and technologists interested in AI\nand the Arts.\nWe developed the first version of our XAIxArts manifesto in our 2024 workshop on XAIxArts [7] to highlight these\nchallenges and opportunities, and to drive positive human-centered change in Explainable AI for the Arts, and XAI\nmore broadly. This paper marks the first publication of our XAIxArts manifesto and aims to engage a broader audience\nin our vision for a future where AI and art merge to foster innovation and understanding. It serves as a platform to\ndisseminate the principles and actionable approaches to explainable AI for the Arts, inviting the broader community to\ncontribute to its evolution and implementation. By extending the reach of the manifesto through this publication, we\naim to spark further dialogue and collaboration, driving positive human-centered change in the field of XAIxArts.\n2\nManifesto Development\nTo co-create the first version of the XAIxArts manifesto, we brought together a community of 39 participants of\nresearchers and creative practitioners in Human-Computer Interaction (HCI), Interaction Design, AI, explainable AI\n(XAI), and Digital Arts at the second International Workshop on Explainable AI for the Arts (XAIxArts) at the ACM\nCreativity and Cognition conference 2024. The goal of the workshop was to create a wide and inclusive community\n1https://xaixarts.github.io/\nManuscript submitted to ACM\n\n\n4\nBryan-Kinns et al.\nFig. 2. Authors Gallery from XAIxArts Workshop 2 at Creativity and Cognition 2024: (1) Performer Manoela Rangel as part of the\nPatterns In Between Intelligences project explores latent decoding with sensors on the body [40], Image Credit: Frank Sperling, https:\n//franksperling.net/Info; (2) A sketching interface for neural audio synthesis models [42], MaxMSP and nn˜, Shuoyang Zheng, Anna\nXambó Sedó and Nick Bryan-Kinns, 2024; (3) Generation Process of a Single Coral Model and Coral Database Interface Design on Vision\nPro [15]; (4) The artwork (un)stable equilibrium by Terence Broad, 2019 [4]; (5) Loki Test [10] https://vimeo.com/904719832/d8b045a5b1,\nTouchDesigner with ChatGPT API, Jia-Rey Chang, 2024; (6) The artwork LOAB by Steph Maj Swanson, 2022 [4]; (7) 3D Coral\nConverted by AI Software and Processed into USDZ Format Using Zbrush [15]; and (8) Looking Back, Moving Forward was exhibited\nat \"Spaces of Enquiry\" at the Stanley Picker Gallery in the UK, Apple Pencil is on iPad Pro using the Procreate app, Makayla Lewis,\n2024 [21].\nwhere AI and Arts practices intersect. Following a peer-review process, eleven submissions were accepted to be\npresented in a hybrid format at the workshop to collect insights and critically reflect on current and emerging practices\nin XAIxArts. Figure 2 illustrates a selection of works shown by authors at the second XAIxArts workshop.\nTo develop the first version of the XAIxArts manifesto, workshop participants (Figure 3) undertook two hybrid\nbrainstorming activities to develop a mindmap (Figure 4) that captured reflections, thoughts, and questions about the\nartistic and research work presented in the workshop (rectangles in the figure), and other work related to XAIxArts.\nThe brainstorming activities were followed by each participant reflecting on the content they had contributed to the\nmindmap. The mindmap was then collaboratively organised around themes that emerged in the workshop (diamond-\nshapes in Figure 4). The XAIxArts Manifesto was then created to summarize key topics and themes identified in\nthe mindmap. The authors drafted the manifesto over a period of two days after the workshop using a collaborative\ndocument editor. The final version of the XAIxArts manifesto was then drafted in poster format, which was printed and\ndisplayed at the ACM Creativity and Cognition 2024 conference. Conference attendees were invited to add comments\nand thoughts to the manifesto using post-it notes to the poster, as shown in Figure 1. These contributions were used to\nrefine the text further, with a final collaborative iteration of editing the manifesto text taking place online to produce\nthe XAIxArts manifesto presented in this paper for the first time. Our XAIxArts manifesto complements established\ninitiatives in AI and the Arts such as large scale-scale institutional practices of Future Art Ecosystems (FAE)2. We see\napproaches such as FAE as focussed more on eco-system and infrastructure building and long-term strategy whereas\n2https://futureartecosystems.org/\nManuscript submitted to ACM\n\n\nXAIxArts Manifesto: Explainable AI for the Arts\n5\nFig. 3. Participants of the 2nd International Workshop on Explainable AI for the Arts (XAIxArts)\nour XAIxArts manifesto is a call for action for individuals to change our AI and Arts infrastructures and practices and\nto reframe our ways of thinking about AI and the Arts through an explainable AI lens.\nTo ensure our approach aligns with standard manifesto creation norms, we reviewed notable manifestos from various\nfields including: The Futurist Manifesto (1909) [26]; The Surrealist Manifesto (1924) [3]; The Fluxus Manifesto (1963)\n[25]; The Xenofeminist Manifesto (2018) [13]; Considerations on a Hacker Manifesto (2012) [39]; The Algorithmic\nResistance Research Group (2023) [32]; and ACM SIGCHI manifestos, e.g. Sketching in HCI Manifesto (2019) [23] and\nColor Blind Accessibility Manifesto (2022) [27].\n3\nXAIxArts Manifesto 1.0\nThis is our Explainable AI for the Arts (XAIxArts) Manifesto. It prioritises transparent and ethical practices, provoking us\nto ensure AI tools and artworks are fair, inclusive, and empowering. By embracing glitches and imperfections as artistic\nelements, we will reveal AI’s underlying mechanisms, turning potential flaws into opportunities for creative expression\nand insight. This manifesto embodies our collective vision for a future where AI and the Arts thrive together, inspiring\ninnovation and fostering a dynamic ecosystem of creativity and understanding beyond dominant technocentric concerns\nof productivity and efficiency. We believe that explainability is a key to unlocking this future.\nManuscript submitted to ACM\n\n\n6\nBryan-Kinns et al.\nFig. 4. Co-created mind-map from the 2nd International Workshop on Explainable AI for the Arts (XAIxArts) exploring the themes that\nlead to the creation of the XAIxArts Manifesto. High Resolution and Interactive Mindmap: https://app.excalidraw.com/l/8sDmlvduhSt/\n6OVLf5GFL7f\nEmpowerment, Inclusion, and Fairness\nExplainable AI is fundamentally a human-centred approach to AI design. It offers opportunities for more transparent\nunderstanding of AI models and interaction with AI. However, poorly designed XAI or XAI focused purely on techno-\ncentric values may raise barriers to AI use and bias AI further towards metrics of productivity and efficiency, which do\nnot positively contribute to human well-being. We ask you to:\nFair AI Practices. Advocate for ethical XAI practices recognising the inherent bias in AI [1], prioritising the well-being\nand empowerment of all users, particularly marginalised groups, building a risk-register of inequity, and gaining consent\nfor any data that is used in AI training and inference.\nEthical Guidelines. Develop and promote ethical guidelines for the use of AI in art, emphasising the importance of\nexplainability contributing to doing no harm and enhancing human well-being.\nCommunity Engagement. Engage with underrepresented communities to gather input and feedback on AI tools, datasets,\nand their bias, to inform future XAI ensuring they meet the needs of a broad range of users.\nEquitable Access Programs. Co-develop artist programs to provide artists from diverse backgrounds and with diverse\nabilities access to XAI tools, resources, and datasets, ensuring fairness and inclusivity in AI-driven art. Set up labs and\nworkshops dedicated to inclusive design, where artists and technologists work together to develop XAI Arts tools that\nare accessible and empowering for all.\nManuscript submitted to ACM\n\n\nXAIxArts Manifesto: Explainable AI for the Arts\n7\nAccessible and Inclusive Design. Design XAI tools and platforms which incorporate actionable mechanisms to advance\naccessible, ethical, and inclusive AI practices. For example, building on studies of the use of generative AI tools by people\nwith sensory impairments [31], and designing for artists with a range of technical literacies [12]. This aligns with alt.chi’s\nvalues and our manifesto’s potential to foster dialogue around ethical, human-centred AI through interdisciplinary\ncollaboration.\nAccessibility Audits. Conduct regular explainability audits and build risk-registers of AI Arts tools and platforms to\nensure they meet accessibility standards and address the needs of diverse user groups.\nAI Literacy. Launch campaigns to educate the creative community about the challenges, benefits, and potential of\nXAI, focusing on transparency and ethical use of AI, and advocate for artist control of AI. Publish case studies of\ncollaborations between artists and AI systems [20, 22], highlighting how AI can enhance creative practices without\ncompromising artistic integrity, such as Holly Herndon and Mat Dryhurst’s “The Call” exhibition at the Serpentine\nGallery3 which foregrounded the curation of training data and training of AI models as a form of public AI literacy.\nCreate training and AI literacy programs for artists to use AI tools effectively, with increased control of machine\nlearning systems, and foster a sense of agency and confidence in their creative process through XAI approaches.\nValuing Artistic Practice for Explainability\nCurrent approaches to XAI are technocentric and typically originate from academic research labs with a focus on\nHuman-Computer Interaction or Engineering, or are from major technology companies. This has resulted in XAI\napproaches driven by productivity, optimisation, and efficiency-oriented discourses. The Arts provide an alternative\nlens through which to drive XAI and offer the potential for radically alternative forms of explanation. We ask you to:\nAesthetic-Driven Research. Promote research that focuses on first-person accounts and explorations [9] of AI art’s\naesthetic and experiential aspects rather than purely technical explanations. For example, building on and engaging\nwith longitudinal accounts of sustained artistic engagement with generative AI models in creative practice [38].\nArtist-in-Residence Programs. Establish artist-in-residence programs [36] within AI research labs to prioritise artistic\nexploration and control, and practice-led research on XAI. Organise residencies that bring artists and AI researchers\ntogether to create works that make AI models understandable through sound, visual, and interactive art.\nCollaborative workshops. Host workshops encouraging artists to explore new creative avenues with XAI, pushing the\nboundaries of traditional art forms and methods.\nDemystifying AI. Develop educational materials, such as interactive installations, online platforms, videos, and articles,\nthat explain the computational materiality of AI in accessible language and engaging formats.\nAI Art Exhibitions. Host exhibitions showcasing artworks that explain AI concepts, accompanied by workshops and\ntalks to engage the audience in understanding the underlying technology and its implications in art making and creative\npractices.\n3https://www.serpentinegalleries.org/whats-on/holly-herndon-mat-dryhurst-the-call/\nManuscript submitted to ACM\n\n\n8\nBryan-Kinns et al.\nHacking and Glitches\nThe Arts offer practice-based approaches to challenging existing norms and discourses. Prominent strategies involves\nemploying the ideas of hacking and glitch as creative tools. These are commonly exploited by artists to exploring the\nsometimes unruly inner-workings of machines underneath the apparent order at the surface [9]. Hacking is often used\nin artistic practices to subvert, re-purpose, or reinterpret systems–be they technological, social or ideological. Similarly,\nglitch—traditionally regarded as a technological malfunction—is embraced as a deliberate aesthetic and conceptual\nchoice. By embracing error, whilst removing expectations of perfection for artists, also allows us to reveal the fragility\nand unpredictability of these systems. Such practices could be deployed to critically challenge and reflect on the use of\nAI and explanations of AI. We ask you to:\nHackathons. Regularly organise hackathons and workshops that encourage collaboration and experimentation with\nXAI, fostering a culture of innovation and creativity. For example, building on Broad [4]’s Hacker’s Guide to using\ngenerative AI as an artistic material.\nTransparency and Surprise. Promote projects that embrace glitches and imperfections in AI as artistic elements [19],\nrevealing the inner workings and boundaries of the technology through unexpected and playful outcomes instead of\npragmatic explanations.\nOpenness\nArtistic practices can integrate knowledge across diverse disciplines. This interdisciplinary view offers combined\nthinking and sharing of methods to enable research in XAI that is at the same time technically robust, and also inclusive,\nintuitive, and engaging for broad audiences. Moreover, a cross-disciplinary view from the Arts ensures that insights and\ninnovation are accessible to those without technical expertise. To increase interdisciplinarity in XAI research, especially\ngreater inclusion of artists in XAI research, we ask you to:\nOpen Communities. Support community-driven projects that leverage XAI to create novel and impactful artworks,\npromoting a collaborative approach to AI art. Proactively reach out to underrepresented art groups to build more\ninclusive communities around AI and the Arts.\nOpen Collaborations. Facilitate collaborations between artists, technologists, and other disciplines to foster interdisci-\nplinary innovation in AI art, and incorporate XAI into existing art practices. For example, engaging with and building\non networks such as Bryan-Kinns and Li [8]’s international network on reducing bias in AI models for music.\nOpen Access. Support initiatives that provide open access to datasets and models, with transparency around where\nany data used was sourced from. Strive to reduce the homogenization of output and enable a wider range of creative\nexperimentation and research on explanations and XAI. Encourage the creation and sharing of open-source AI projects\n(i.e., architectures, datasets, model weights, documentation), allowing artists and researchers to examine and modify\nthe underlying code and data.\nOpen Tools and Datasets. Develop XAI tools, user interfaces, and collections of open-source datasets specifically designed\nfor artists, allowing for personalisation, customisation and meaningful control over AI-generated outputs. Connecting\nto wider discourses on Future Art Ecosystems, openness requires developing more open and explainable Art x Public\nAI systems [37].\nManuscript submitted to ACM\n\n\nXAIxArts Manifesto: Explainable AI for the Arts\n9\n4\nConclusion and Invitation\nBy implementing the steps in this manifesto, we aim to demystify and humanize AI, making it more accessible, relatable,\nunderstandable, and explainable. The interdisciplinary collaborations sparked and catalysed by the XAIxArts manifesto\nwill bridge the gap between technologists and artists, enriching both fields through mutual knowledge exchange. We\ninvite you to comment, amend, and change this manifesto in person at our alt.chi 2025 living manifesto session, and\nonline through our living manifesto4. Your insights and contributions are essential in shaping a more transparent\nand harmonious future where AI and the Arts not only coexist but inform and enrich each other beyond current\ntechnocentric discourses. Let’s work together to keep this dynamic intersection of Explainable AI and the Arts vibrant,\ninclusive, and innovative.\nAccessibility Statement\nWe use Miro to support co-creation of our living manifesto at alt.chi 2025 and previous XAIxArts workshops. Miro is an\naccessible digital whiteboard with features including keyboard navigation, screen reader support, and zoom options,\nmaking it user-friendly for people with visual, motor, or cognitive impairments. Accessing Miro online also ensures\nthat we are inclusive in our approach and engage with participants who are not able to engage in person with the\nmanifesto - its intuitive design and assistive technology compatibility make it ideal for a iteratively co-created living\nmanifesto in-person and online.\nAuthor disclosures\nThis manifesto is original work; it was co-created by attendees (Terence Broad, Nick Bryan-Kinns, Francisco Castro,\nJia-Rey Chang, Michael Clemens, Corey Ford, Jie Fu, Helen Kennedy, Makayla Lewis, Sophie Rollins, Karen Royer,\nAustin Tecks, Gabriel Vigliensoni, Elizabeth Wilson, and Shuoyang Zheng)vof the 2nd International Workshop on\nExplainable AI for the Arts (XAIxArts), part of ACM Creativity and Cognition conference 2024. Artificial Intelligence\n(ChatGPT and Grammar.ly) was utilized for copy-editing purposes only.\nAcknowledgments\nMany thanks to the attendees of the ACM Creativity and Cognition 2024 conference who contributed their thoughts\nto revisions of the manifesto. This work was supported in part by the RAI UK International Partnerships project\n“Responsible AI international community to reduce bias in AI music generation and analysis” [Responsible AI IP054\nGrant Ref: EP/Y009800/1], the Bridging Responsible AI Divides programme with funds received from the Arts and\nHumanities Research Council [grant number AH/X007146/1], and the University of the Arts London Creative Computing\nInstitute. Shuoyang Zheng is a research student at the UKRI Centre for Doctoral Training in Artificial Intelligence and\nMusic, supported by UK Research and Innovation [grant number EP/S022694/1].\nAppendix: Presentation at alt.chi 2025\nThis alt.chi 2025 paper introduces a manifesto for Explainable Artificial Intelligence for the Arts (XAIxArts). We do this\nin the alt.chi forum to provoke rethinking of what it means to explain AI and at the same time to co-create with the\nalt.chi community version 2.0 of the XAIxArts manifesto.\n4XAIxArts Living Manifesto: https://miro.com/app/board/uXjVL7tcbz8=/\nManuscript submitted to ACM\n\n\n10\nBryan-Kinns et al.\nAt the alt.chi session at CHI 2025 we transform the conventional conference presentation format into an interactive\nliving manifesto experience by combining a World Café [5] style discussion with a living manifesto wall. We engage in\nsmall group discussions around café style tables (if available in the alt.chi venue or a nearby café space) to question\neach of our four manifesto themes described in Section 3 one by one. Participants rotate between tables every 10 to 20\nminutes as time permits in the alt.chi session. We will prepare living walls for the space on which participants can add\ncomments using pens, post-it notes, and any other materials they have to have - large sheets of paper printed with\neach of the XAIxArts themes and calls to action. We then invite harvesting of ideas and reflections and document them\nby commenting on and co-editing our living manifesto. The living manifesto will be hybrid at alt.chi 2025 to increase\naccessibility and engagement - participants can either co-edit the manifesto online or in person by writing directly on\nthe pre-prepared living walls. The hybrid living manifesto remains available for comment throughout alt.chi 2025 and\nthe physical parts are documented and moved online using open and accessible collaborative document editing tools5.\nWe aim to produce our updated XAIxArts manifesto 2.0 during the CHI conference so that it could be published online\nduring CHI 2025. We will then keep our living manifesto alive online for ongoing editing and comment after the close\nof the conference at the XAIxArts website6.\nReferences\n[1] Luís Arandas, Mick Grierson, and Miguel Carvalhais. 2023. Antagonising explanation and revealing bias directly through sequencing and multimodal\ninference. In Proceedings of The first international workshop on eXplainable AI for the Arts. arXiv.\nhttps://doi.org/10.48550/arXiv.2309.12345\narXiv:2309.12345 [cs].\n[2] Simone Ashby, Julian Hanna, Alwin De Rooij, Michelle Kasprzak, Julianne Hoekstra, and Sjuul Bos. 2023. Articulating (Uncertain) AI Futures of\nArtistic Practice: A Speculative Design and Manifesto Sprint Approach. In Proceedings of the 15th Conference on Creativity and Cognition (C&C ’23).\nAssociation for Computing Machinery, New York, NY, USA, 312–318. https://doi.org/10.1145/3591196.3596819 event-place: Virtual Event, USA.\n[3] Andre Breton. 1924. First surrealist manifesto. Surrealism. McGraw-Hill, New York (1924), 66–75.\n[4] Terence Broad. 2024. Using Generative AI as an Artistic Material: A Hacker’s Guide. In Proceedings of The second international workshop on\neXplainable AI for the Arts (XAIxArts 2).\n[5] Juanita Brown. 2001. The World Café: Living Knowledge Through Conversations That Matter’. The Systems Thinker (2001).\n[6] Nick Bryan-Kinns, Corey Ford, Alan Chamberlain, Steven David Benford, Helen Kennedy, Zijin Li, Wu Qiong, Gus G. Xia, and Jeba Rezwana. 2023.\nProceedings of The first international workshop on eXplainable AI for the Arts (XAIxArts). arXiv:2310.06428 [cs.AI]\n[7] Nick Bryan-Kinns, Corey Ford, Shuoyang Zheng, Helen Kennedy, Alan Chamberlain, Makayla Lewis, Drew Hemment, Zijin Li, Qiong Wu, Lanxi\nXiao, Gus Xia, Jeba Rezwana, Michael Clemens, and Gabriel Vigliensoni. 2024. Explainable AI for the Arts 2 (XAIxArts2). In Proceedings of\nthe 16th Conference on Creativity & Cognition (Chicago, IL, USA) (C&C ’24). Association for Computing Machinery, New York, NY, USA, 86–92.\nhttps://doi.org/10.1145/3635636.3660763\n[8] Nick Bryan-Kinns and Zijin Li. 2024. Reducing Barriers to the Use of Marginalised Music Genres in AI. In Proceedings of Explainable AI for the Arts\nWorkshop 2024 (XAIxArts 2024). arXiv. https://doi.org/10.48550/arXiv.2407.13439 arXiv:2407.13439 [cs].\n[9] Baptiste Caramiaux and Sarah Fdili Alaoui. 2022. \"Explorers of Unknown Planets\": Practices and Politics of Artificial Intelligence in Visual Arts.\nProc. ACM Hum.-Comput. Interact. 6, CSCW2 (Nov. 2022), 477:1–477:24. https://doi.org/10.1145/3555578\n[10] Jia-Rey Chang. 2024. Loki Test. In Proceedings of The second international workshop on eXplainable AI for the Arts (XAIxArts 2).\n[11] Giovanni Ciatto, Michael I. Schumacher, Andrea Omicini, and Davide Calvaresi. 2020. Agent-Based Explanations in AI: Towards an Abstract\nFramework. In Explainable, Transparent Autonomous Agents and Multi-Agent Systems: Second International Workshop, EXTRAAMAS 2020, Auckland,\nNew Zealand, May 9–13, 2020, Revised Selected Papers (Auckland, New Zealand). Springer-Verlag, Berlin, Heidelberg, 3–20. https://doi.org/10.1007/978-\n3-030-51924-7_1\n[12] Michael Clemens. 2023. Explaining the Arts: Toward a Framework for Matching Creative Tasks with Appropriate Explanation Mediums. In Proceedings\nof The First International Workshop on eXplainable AI for the Arts (XAIxArts). arXiv. https://doi.org/10.48550/arXiv.2308.09586 arXiv:2308.09586 [cs].\n[13] Laboria Cuboniks. 2018. The xenofeminist manifesto: A politics for alienation. Verso Books.\n[14] Upol Ehsan, Philipp Wintersberger, Q. Vera Liao, Elizabeth Anne Watkins, Carina Manger, Hal Daumé III, Andreas Riener, and Mark O Riedl. 2022.\nHuman-Centered Explainable AI (HCXAI): Beyond Opening the Black-Box of AI. In Extended Abstracts of the 2022 CHI Conference on Human Factors\nin Computing Systems (New Orleans, LA, USA) (CHI EA ’22). Association for Computing Machinery, New York, NY, USA, Article 109, 7 pages.\nhttps://doi.org/10.1145/3491101.3503727\n5XAIxArts Living Manifesto: https://miro.com/app/board/uXjVL7tcbz8=/\n6https://xaixarts.github.io/\nManuscript submitted to ACM\n\n\nXAIxArts Manifesto: Explainable AI for the Arts\n11\n[15] Jie Fu, Shun Fu, and Mick Grierson. 2024. Coral Model Generation from Single Images for Virtual Reality Applications. In Proceedings of The second\ninternational workshop on eXplainable AI for the Arts (XAIxArts 2). arXiv:2409.02376\n[16] Riccardo Guidotti, Anna Monreale, Salvatore Ruggieri, Franco Turini, Dino Pedreschi, and Fosca Giannotti. 2018. A Survey Of Methods For\nExplaining Black Box Models. arXiv:1802.01933 [cs.CY]\n[17] David Gunning, Mark Stefik, Jaesik Choi, Timothy Miller, Simone Stumpf, and Guang-Zhong Yang. 2019. XAI—Explainable artificial intelligence.\nScience Robotics 4, 37 (Dec. 2019), eaay7120. https://doi.org/10.1126/scirobotics.aay7120\n[18] Julian Hanna, Simone Ashby, Sónia Matos, Alexis Faria, and Ricardo Rodrigues. 2019. Dissent by Design: A Manifesto for CHI Manifestos. In\nExtended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19). Association for Computing Machinery, New\nYork, NY, USA, 1–10. https://doi.org/10.1145/3290607.3310423 event-place: Glasgow, Scotland Uk.\n[19] Jamal Knight, Andrew Johnston, and Adam Berry. 2023. Artistic control over the glitch in AI-generated motion capture. In Proceedings of The First\nInternational Workshop on eXplainable AI for the Arts (XAIxArts). arXiv. https://doi.org/10.48550/arXiv.2308.08576 arXiv:2308.08576 [cs].\n[20] Makayla Lewis. 2023. AIxArtist: A First-Person Tale of Interacting with Artificial Intelligence to Escape Creative Block. In Proceedings of The First\nInternational Workshop on eXplainable AI for the Arts (XAIxArts). arXiv. https://doi.org/10.48550/arXiv.2308.11424 arXiv:2308.11424 [cs].\n[21] Makayla Lewis. 2024. Looking Back, Moving Forward: A First-Person Perspective Of How Past Artificial Intelligence Encounters Shape Today’s\nCreative Practice. In Proceedings of The second international workshop on eXplainable AI for the Arts (XAIxArts 2). arXiv:2408.04978\n[22] Makayla Lewis. 2024. Looking Back, Moving Forward: A First-Person Perspective Of How Past Artificial Intelligence Encounters Shape Today’s\nCreative Practice. In Proceedings of The First International Workshop on eXplainable AI for the Arts (XAIxArts).\n[23] Makayla Lewis, Miriam Sturdee, and Nicolai Marquardt. 2019. Sketching in HCI: Hands-on Course of Sketching Techniques. In Extended Abstracts of\nthe 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–5.\nhttps://doi.org/10.1145/3290607.3298805 event-place: Glasgow, Scotland Uk.\n[24] Q. Vera Liao, Daniel Gruen, and Sarah Miller. 2020. Questioning the AI: Informing Design Practices for Explainable AI User Experiences. Association\nfor Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376590\n[25] George Maciunas. 1963. Fluxus Manifesto. https://www.moma.org/collection/works/127947\n[26] Filippo Tomasso Marinetti. 2009. The Futurist Manifesto. 1909. Online: https://www. societyforasianart. org/sites/default/files/manifesto_futurista.\npdf.[accessed 1 May 2020] (2009).\n[27] Federico Monaco. 2022. Color blind accessibility manifesto. Commun. ACM 65, 8 (2022), 7–7.\n[28] Ozlem Ozmen Garibay, Brent Winslow, Salvatore Andolina, Margherita Antona, Anja Bodenschatz, Constantinos Coursaris, Gregory Falco, Stephen\nM. Fiore, Ivan Garibay, Keri Grieman, John C. Havens, Marina Jirotka, Hernisa Kacorri, Waldemar Karwowski, Joe Kider, Joseph Konstan, Sean Koon,\nMonica Lopez-Gonzalez, Iliana Maifeld-Carucci, Sean McGregor, Gavriel Salvendy, Ben Shneiderman, Constantine Stephanidis, Christina Strobel,\nCarolyn Ten Holter, and Wei Xu. 2023. Six Human-Centered Artificial Intelligence Grand Challenges. International Journal of Human–Computer\nInteraction 39, 3 (2023), 391–437. https://doi.org/10.1080/10447318.2022.2153320\n[29] Cecilia Panigutti, Andrea Beretta, Fosca Giannotti, and Dino Pedreschi. 2022. Understanding the Impact of Explanations on Advice-Taking: A User\nStudy for AI-Based Clinical Decision Support Systems. In Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems (New\nOrleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 568, 9 pages. https://doi.org/10.1145/3491102.3502104\n[30] Gwenolé Quellec, Hassan Al Hajj, Mathieu Lamard, Pierre-Henri Conze, Pascale Massin, and Béatrice Cochener. 2021. ExplAIn: Explanatory artificial\nintelligence for diabetic retinopathy diagnosis. Medical Image Analysis (2021), 102118.\n[31] Gayatri Raman and Erin Brady. 2024. Exploring Use and Perceptions of Generative AI Art Tools by Blind Artists. In Proceedings of The Second\nInternational Workshop on eXplainable AI for the Arts (XAIxArts 2). arXiv. https://doi.org/10.48550/arXiv.2409.08226 arXiv:2409.08226 [cs].\n[32] Eryk Salvaggio, Caroline Sinders, and Steph Maj Swanson. 2023. The Algorithmic Resistance Research Group.\n[33] Yuan Shen, Shanduojiao Jiang, Yanlin Chen, Eileen Yang, Xilun Jin, Yuliang Fan, and Katie Driggs Campbell. 2020. To explain or not to explain: A\nstudy on the necessity of explanations for autonomous vehicles. arXiv preprint arXiv:2006.11684 (2020).\n[34] Ben Shneiderman. 2022. Human-Centered AI. Oxford University Press.\n[35] Miriam Sturdee, Makayla Lewis, Angelika Strohmayer, Katta Spiel, Nantia Koulidou, Sarah Fdili Alaoui, and Josh Urban Davis. 2021. A Plurality of\nPractices: Artistic Narratives in HCI Research. In Proceedings of the 13th Conference on Creativity and Cognition (C&amp;C ’21). Association for\nComputing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3450741.3466771\n[36] Serpentine Arts Technologies. 2020. Future Art Ecosystems (1 ed.). Vol. 1: Art x Advanced Technologies. Serpentine.\n[37] Serpentine Arts Technologies. 2024. Future Art Ecosystems (1 ed.). Vol. 4: Art x Public AI. Serpentine.\n[38] Austin Tecks, Thomas Peschlow, and Gabriel Vigliensoni. 2024. Explainability Paths for Sustained Artistic Practice with AI. In Proceedings of The\nsecond international workshop on eXplainable AI for the Arts (XAIxArts 2). arXiv:2407.15216\n[39] McKenzie Wark. 2012. Considerations on a hacker manifesto. In Digital labor. Routledge, 69–75.\n[40] Elizabeth Wilson, Deva Scubert, Mika Satomi, Alex McLean, and Juan Felipe Amaya Gonzalez. 2024. Embodied Exploration of Latent Spaces and\nExplainable AI. In Proceedings of The second international workshop on eXplainable AI for the Arts (XAIxArts 2). arXiv:2410.14590\n[41] Wencan Zhang and Brian Y Lim. 2022. Towards Relatable Explainable AI with the Perceptual Process. In Proceedings of the 2022 CHI Conference on\nHuman Factors in Computing Systems (New Orleans, LA, USA) (CHI ’22). Association for Computing Machinery, New York, NY, USA, Article 181,\n24 pages. https://doi.org/10.1145/3491102.3501826\nManuscript submitted to ACM\n\n\n12\nBryan-Kinns et al.\n[42] Shuoyang Zheng, Anna Xambó Sedó, and Nick Bryan-Kinns. 2024. A Mapping Strategy for Interacting with Latent Audio Synthesis Using Artistic\nMaterials. In Proceedings of The second international workshop on eXplainable AI for the Arts (XAIxArts 2). arXiv:2407.04379\nManuscript submitted to ACM\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21220v1.pdf",
    "total_pages": 12,
    "title": "XAIxArts Manifesto: Explainable AI for the Arts",
    "authors": [
      "Nick Bryan-Kinns",
      "Shuoyang Jasper Zheng",
      "Francisco Castro",
      "Makayla Lewis",
      "Jia-Rey Chang",
      "Gabriel Vigliensoni",
      "Terence Broad",
      "Michael Clemens",
      "Elizabeth Wilson"
    ],
    "abstract": "Explainable AI (XAI) is concerned with how to make AI models more\nunderstandable to people. To date these explanations have predominantly been\ntechnocentric - mechanistic or productivity oriented. This paper introduces the\nExplainable AI for the Arts (XAIxArts) manifesto to provoke new ways of\nthinking about explainability and AI beyond technocentric discourses.\nManifestos offer a means to communicate ideas, amplify unheard voices, and\nfoster reflection on practice. To supports the co-creation and revision of the\nXAIxArts manifesto we combine a World Caf\\'e style discussion format with a\nliving manifesto to question four core themes: 1) Empowerment, Inclusion, and\nFairness; 2) Valuing Artistic Practice; 3) Hacking and Glitches; and 4)\nOpenness. Through our interactive living manifesto experience we invite\nparticipants to actively engage in shaping this XIAxArts vision within the CHI\ncommunity and beyond.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}