{
  "id": "arxiv_2502.21277v1",
  "text": " \nLei & Sornette: Preprint at arXiv \n1 \n \nLog-Periodic Precursors to Volcanic Eruptions: Evidence from 34 Events \nQinghua Lei1,, Didier Sornette2 \n1Department of Earth Sciences, Uppsala University, Uppsala, Sweden \n2Institute of Risk Analysis, Prediction and Management, Academy for Advanced Interdisciplinary \nStudies, Southern University of Science and Technology, Shenzhen, China \nAbstract Forecasting volcanic eruptions remains a formidable challenge due to the inherent \ncomplexity and variability of volcanic processes. A key source of uncertainty arises from the sporadic \nnature of volcanic unrest, which is often characterised by intermittent phases of quiescent deceleration \nand sudden acceleration, rather than a consistent, predictable progression towards eruption. This \nseemingly erratic pattern complicates volcano forecasting as it challenges conventional time-to-\nfailure models that often assume a simple smooth power law acceleration. We propose a log-periodic \npower law singularity model, which effectively captures the intermittent and non-monotonic rupture \ndynamics characteristic of reawakening volcanoes at the site scale. Mathematically, generalising the \npower law exponent by extending it from real to complex numbers, this model captures the partial \nbreak of continuous scale invariance to discrete scale invariance that is inherent to the intermittent \ndynamics of damage and rupture processes in heterogeneous crustal systems. By performing \nparametric and nonparametric tests on a large dataset of 34 historical eruptions worldwide, we present \nempirical evidence and theoretical arguments demonstrating the statistical significance of log-\nperiodic oscillations decorating power law finite-time singularities during pre-eruptive volcanic \nunrest. Log-periodicity in volcanoes may originate from various mechanisms, including diffusion-\ndominated magma flow, magma-driven propagation of subparallel dykes, interaction between stress \ndrop and stress corrosion, and/or interplay of inertia, damage, and healing within volcanic systems. \nOur results have important implications for volcano forecasting, because understanding and \ncharacterising log-periodicity could turn the intermittency of volcanic activity from a challenge into \na valuable asset for improving predictions. \nKeywords Volcanic eruption; Catastrophic failure; Power law; Discrete scale invariance; Log-\nperiodicity; Prediction \n \n \n Corresponding author: qinghua.lei@geo.uu.se \n\n\n \nLei & Sornette: Preprint at arXiv \n2 \n \n1. Introduction \nVolcanic eruptions pose significant threats to life, infrastructure, and ecosystems, with impacts \nranging from local catastrophic devastation to global climate disruption. Forecasting volcanic \neruptions is therefore crucial and a fundamental objective of volcanology (Sparks, 2003; Acocella et \nal., 2023). Achieving reliable volcano forecasting is essential for enabling civil authorities to \neffectively inform the public about potential eruptions and their timing, ensuring timely preparation, \nfacilitating timely evacuations and the implementation of other safety measures. Over the past \ndecades, great efforts have been dedicated to developing and deploying high-precision monitoring \ntechnologies to observe active volcanoes (White and McCausland, 2016; Sparks et al., 2012; Poland \net al., 2020), aiming to detect and characterise potential precursors of impending eruptive events as \nwell as anticipate their subsequent evolution. \nNumerous approaches, ranging from physics-based models to data-driven empirical techniques, \nhave been developed to forecast imminent volcanic eruptions (Acocella et al., 2023; Blake and Cortés, \n2018; Robertson and Kilburn, 2016; Sparks, 2003; Voight, 1989, 1988). Among these, the Failure \nForecast Method (FFM), which integrates a power-law time-to-failure model (Voight, 1989) with an \ninverse rate analysis technique (Voight, 1988), has emerged as a cornerstone of modern eruption \nforecasting efforts. This framework leverages accelerating precursory signals, such as seismicity or \nground deformation, to estimate the timing of volcanic rupture, offering a systematic way to interpret \ntransient unrest patterns. \nSeveral mechanisms have been proposed to explain such precursory power law dynamics \nfrequently observed in reawakening volcanoes. One mechanism is based on an analogy between \ncatastrophic failures and critical points, highlighting the scaling symmetry of power laws, akin to \ncritical phase transitions (Sornette, 2006). Another mechanism attributes the presence of power law \nacceleration to stress corrosion-induced subcritical crack growth and damage accumulation \n(Cornelius and Scott, 1993; Kilburn, 2003; Kilburn and Voight, 1998; Main, 2000). This failure \nforecast method, including its stochastic variant, has been applied to forecast the eruption timings of \nnumerous volcanoes (Bevilacqua et al., 2022; Boué et al., 2016; Chastin and Main, 2003; Cornelius \nand Voight, 1994, 1995; Tárraga et al., 2008; Voight and Cornelius, 1991). However, despite its \nutility, the FFM approach has faced persistent limitations, as demonstrated by an extensive body of \n\n\n \nLei & Sornette: Preprint at arXiv \n3 \n \nwork (Bell et al., 2011a, 2011b, 2013). A critical limitation stems from the episodic rupture dynamics \nof reawakening volcanic systems (Acocella et al., 2023), which frequently exhibit non-linear, \ndiscontinuous inflation-deflation episodes prior to eruption. This behaviour deviates fundamentally \nfrom the gradual, monotonic acceleration assumed by classical power law models, complicating the \ndetection of clear precursory trends. \nThe Log-Periodic Power Law Singularity (LPPLS) model extends the conventional power law \nframework by incorporating log-periodic components, enabling it to capture the intermittent \noscillations of heterogeneous systems undergoing progressive failure toward global rupture (Anifrani \net al., 1995; Sornette and Sammis, 1995). Our recent study has demonstrated that the LPPLS model \noutperforms conventional power law models, as evidenced by a comprehensive analysis of a global \ndataset covering landslides, rockbursts, glacier breakoffs, and volcanic eruptions (Lei and Sornette, \n2024). By capitalising on the irregular and intermittent nature of geomaterial rupture, the LPPLS \nmodel exploits unsteady, non-monotonic signals—traditionally often regarded as noise—to refine its \npredictions, offering a promising framework for forecasting catastrophic events. Indeed, noise often \nreflects unexplored complexity, but with expanded analytical frameworks like LPPLS, it can reveal \ndiscernible patterns that were previously undetectable using incomplete models. \nThis Letter aims to present empirical evidence and theoretical insights into the statistical \nsignificance of log-periodicity in reawakening volcanoes, which has important implications for \nunderstanding and forecasting volcanic eruptions. More specifically, first, log-periodic patterns \nindicate the spontaneous hierarchical organisation of damage in heterogeneous crustal systems, \noffering valuable insights into the underlying mechanisms driving volcanic unrest; second, log-\nperiodicity can improve the reliability of failure time prediction by constraining the model fit to the \naccelerating oscillatory pattern of volcanic activity. \nThe rest of the Letter is organised as follows. Section 2 introduces the LPPLS model along with \nthe parametric calibration and nonparametric test methods. Section 3 presents the results of our \nanalysis based on a comprehensive dataset of 34 historical eruption events. Section 4 discusses the \nsignificance of log-periodicity in volcanoes, interprets the possible underlying mechanisms, and \nexplores the implications for eruption forecasting. Finally, section 5 concludes the paper. \n\n\n \nLei & Sornette: Preprint at arXiv \n4 \n \n2. Model description \nThe pre-eruptive unrest of a volcano is typically modelled by a nonlinear dynamic equation \n(Voight, 1988, 1989), expressing a power law relation between the first and second derivatives of an \nobservable quantity Ω of the volcanic system (e.g. displacement, strain, tilt, energy release, \nearthquake count, and gas emission, etc.): \n\n\n=\n, with \n1\n, \n(1) \nwhere μ is a positive constant and α is an exponent characterising the nonlinearity of the accelerating \ndynamics. With α > 1, positive feedbacks dominate, driving a super-exponential dynamic that \nculminates in a finite-time singularity (Johansen and Sornette, 2000; Main, 1999). This singular \nbehaviour becomes evident if we integrate equation (1), yielding: \nc\n(\n)\nt\nt\n\n\n−\n=\n−\n, \n(2) \nwhere ζ = (β/μ)β, β = 1/(α‒1), with β > 0 (for α > 1) ensuring the emergence of a singularity as time t \napproaches the critical time tc. Further integrating equation (2) yields the power law time-to-failure \nmodel (Main, 1999; Voight, 1989, 1988): \nc\n( )\n(\n)m\nt\nA\nB t\nt\n\n=\n+\n−\n, with \n1\nm , \n(3) \nwhere m = 1‒β = (α‒2)/(α‒1) is the singularity exponent, and A and B = ‒ ζ/m are constants. This \npower law relation exhibits continuous scale invariance, where scaling tc‒t by an arbitrary factor λ \nleads to a corresponding scaling of the observable (for m ≤ 0) or of the difference of the observable \nto its final value A (for 0 < m < 1) by the factor λm which is independent of tc‒t. \nWe now extend the power law model by allowing the singularity exponent to take complex \nvalues, m+iω, which are generalised solutions of renormalisation group equations near critical points \n(Saleur et al., 1996) and naturally arise in dissipative systems (like volcanoes) with out-of-equilibrium \ndynamics and quenched disorder (Saleur and Sornette, 1996). The first-order Fourier expansion of \nthe general solution of Ω leads to the LPPLS model (Anifrani et al., 1995; Lei and Sornette, 2024; \nSornette and Sammis, 1995), given by: \n\n\n\n\nc\nc\n( )\ncos\nln(\n)\n(\n)m\nt\nA\nB\nC\nt\nt\nt\nt\n\n\n\n=\n+\n+\n−\n−\n−\n, with \n1\nm . \n(4) \nwhere, compared to equation (3), three new parameters are involved, viz. a constant C, an angular log \nfrequency ω, and a phase shift ϕ. This introduces a log-periodic correction with a relative amplitude \n\n\n \nLei & Sornette: Preprint at arXiv \n5 \n \nof C/B (typically on the order of 10%) superimposed on the overal power law trend with a pre-factor \nB. In this case, continuous scale invariance is partially broken into discrete scale invariance (Sornette, \n1998), where the observable remains invariant under scaling of tc‒t by integer powers of a \nfundamental scaling factor λ > 1 that is related to ω through ω = 2π/lnλ. The local maxima of the log-\nperiodic term in the LPPLS formula thus form a geometric time series {t1, t2, …, tk, …}, satisfying \ntc‒tk = λ-kexp(ϕ/ω), where k is an integer, such that the argument of the cosine function in equation \n(4) is an integer multiple of 2π. By inherently encoding this discrete hierarchy of time scales, the \nLPPLS model can capture the intermittent dynamics of rupture phenomena, where burst frequency \nincreases geometrically towards tc. This pattern reflects the localised and threshold nature of the \nmechanics of rupture in heterogeneous materials (Johansen and Sornette, 2000; Sornette, 2002). Note \nthat only the first-order correction is included in equation (4), while higher-order terms with smaller \namplitudes also exist but are generally less significant (Zhou and Sornette, 2002a). \nWe employ a stable and robust parametric calibration scheme to calibrate the LPPLS model \nagainst time series data, with the procedures briefly summarised as follows (see Supplementary Text \nS1 for more detailed descriptions). First, we use the Lagrange regularization method (Demos and \nSornette, 2019) to identify the onset time t0 of the volcanic unrest, whose endpoint is set at the last \navailable data point before the eruption. Then, the optimal set of LPPLS model parameters is \nestimated using the ordinary least squares method, through a minimisation of the sum of the squares \nof the differences between the model prediction and the observational data (Filimonov and Sornette, \n2013). \nAdditionally, we conduct a nonparametric test to qualify the presence of log-periodic \noscillations in the time series data. We apply the following transformation (Johansen and Sornette, \n2001) to remove the background power law trend: \nc\nc\n( )\n(\n)\n( )\n(\n)\nm\nm\nt\nA\nB t\nt\nt\nC t\nt\n\n\n−\n−\n−\n=\n−\n, \n(5) \nwhere the normalised residual ε as a function of the log normalised time τ = (tc‒t)/(tc‒t0) should obey \na pure cosine function, i.e. cos(ωlnτ‒ϕ), if equation (4) gives a perfect description of the data. In most \ncases, the ε signals would be unevenly spaced on the logarithmic time lnτ, as occurs for instance when \nthey are evenly sampled on the linear time scale τ, rendering the standard fast Fourier transform \n\n\n \nLei & Sornette: Preprint at arXiv \n6 \n \nunsuitable for our analysis. To address this issue, we use the Lomb spectral method (Lomb, 1976), \nwhich performs least-squares fitting of sinusoids to local data points, with no requirement of \nequidistant sampling (see Supplementary Text S2), making it ideal for our problem of detecting \nperiodicity on the logarithmic time to a singularity. \n3. Results \nThe first case to study is Axial Seamount, which is an active volcano with a summit caldera at \napproximately 1.5 km depth and a base at around 2.4 km, located in the Pacific Ocean and about 500 \nkm off the coast of Oregon, USA. This basaltic shield volcano, fed by magma from the Cobb hotspot \non the Juan de Fuca spreading ridge, has experienced three eruptive episodes over the past 30 years, \nspecifically in 1998, 2011, and 2015 (Chadwick et al., 2022). A large shallow magma reservoir may \nlie approximately 1.5 to 2.5 km beneath the caldera, accompanied by a series of deeper, stacked sills \nat depths ranging from 2.5 to 4.5 km (Carbotte et al., 2020). Since 1998, this submarine volcano has \nbeen closely monitored by various seafloor instruments and since 2014 by a cabled observatory, \nwhere the seafloor vertical displacement is measured by bottom and mobile pressure recorders at a \nresolution of ~1 cm (Kelley et al., 2014). We focus on the eruption event that occurred in April 2011, \nduring which a total volume of about 99 million m3 lava was erupted into the sea (Chadwick et al., \n2012). This volcano displayed a series of short-term inflation-deflation cycles over about 8 years prior \nto the 2011 eruption, resulting in an accelerating and oscillating evolutionary pattern of seafloor \ndeformation, which is effectively captured by the LPPLS model (Fig. 1a). Log-periodic oscillations \nare also evident in the ϵ-lnτ plot (inset of Fig. 1a), despite considerable fluctuations around the overall \nsinusoidal trend, which may arise from the underlying complex dynamics and/or the presence of \nvarious disturbances. From the Lomb periodogram (Fig. 1b), we can identify a dominant peak at the \nlog frequency f ≈ 1.52 (with the angular log frequency ω ≈ 9.55 and the scaling ratio λ ≈ 1.93). We \nhave also performed analysis of the seafloor deformation data for the other two eruption events at this \nvolcano. Despite the limited observational data for the 1998 eruption and the short acceleration period \npreceding the 2015 eruption, the results yield a similar value of dominant frequency at f ≈ 1.2 with ω \n≈ 7.7 and λ ≈ 2.2 (see Fig. S1 in Supplementary Materials), which is compatible with that for the 2011 \neruption. \n\n\n \nLei & Sornette: Preprint at arXiv \n7 \n \n \nFig. 1. (a) Monitoring data showing the temporal evolution of seafloor uplift (aggregated on a weekly \nbasis) at the Axial Seamount volcano in the Pacific Ocean, prior to an eruption in April 2011. The \nraw data originally recorded by a single-station bottom pressure recorder at very high frequencies (i.e. \nevery 15 seconds) are aggregated on a much lower frequency (i.e. weekly) to expedite the model \ncalibration and facilitate the visualisation. Inset displays the variation of normalised residual ε as a \nfunction of log normalised time τ = (tc‒t)/(tc‒t0). (b) The Lomb periodogram analysis for detecting \nlog-periodic oscillatory components in the data. \nThe second example is Sierra Negra, which is a shield volcano located at the southeastern end of \nIsabela Island, Ecuador. The large summit caldera of this volcano, with dimensions of 7.5 km by 9.5 \nkm and a depth of around 100 m, may be underlain by a flat-topped, sill-like magma reservoir at \napproximately 2 km depth beneath it (Yun et al., 2006). This active basaltic volcano has erupted three \ntimes over the last 30 years: in 1979, 2005, and 2018. Since 2002, a local network of continuous \nGlobal Positioning System stations has been in place, with the pre-eruptive and co-eruptive ground \ndeformation captured for the 2005 and 2018 events (Bell et al., 2021; Chadwick et al., 2006), during \nwhich approximately 150 million m3 and 140 million m3 of lava were erupted, respectively (Geist et \nal., 2008; Vasconez et al., 2018). The data revealed that this volcano experienced significant surface \nuplift during the pre-eruptive inflation phase prior to both 2005 and 2018 eruptions (Bell et al., 2021; \nChadwick et al., 2006). The existence of log-periodicity in Sierra Negra is demonstrated by the \nexcellent fit of the LPPLS model to the time series of surface uplift and the sinusoidal-like signals in \n(a)\n(b)\nf = 1.52 (ω = 9.55, λ = 1.93)\n\n\n \nLei & Sornette: Preprint at arXiv \n8 \n \nthe ϵ-lnτ plot (Fig. 2a and c). The Lomb periodograms reveal a dominant peak at f = 1.51 and 1.55 for \nthe 2005 and 2018 eruptions, respectively, with ω = 9.51 and 9.74, and λ = 1.94 and 1.91 \ncorrespondingly (Fig. 2b and d). \n \nFig. 2. Temporal evolution of surface uplift recorded by the continuous Global Positioning System \nstations GV02 and GV04 at the Sierra Negra volcano in Ecuador, prior to the (a) 2005 and (b) 2018 \neruptions. The raw data originally recorded daily are aggregated on a weekly basis to expedite the \nmodel calibration and facilitate the visualisation. Insets in the left panel display the variation of \nnormalised residual ε as a function of log normalised time τ = (tc‒t)/(tc‒t0). The Lomb periodogram \nanalysis for detecting log-periodic oscillatory components in the pre-eruptive deformational pattern \nof the (b) 2005 and (d) 2018 events. \n(a)\n(b)\nf = 1.51 (ω = 9.51, λ = 1.94)\n(c)\n(d)\nf = 1.55 (ω = 9.74, λ = 1.91)\n\n\n \nLei & Sornette: Preprint at arXiv \n9 \n \nThe third study case is the Mount St. Helens, which is an active stratovolcano located in the \nPacific Northwest region of the United States. Between 1980 and 1986, the volcano underwent a \nseries of explosive eruptions and dome-building events, resulting in the formation of a new lava dome \nwithin the crater. Its activity has been continuously monitored using various instruments (Chadwick \net al., 1983; Dzurisin et al., 1983; Malone et al., 1983), capturing significant deformational and \nseismic precursors associated with pre-eruptive dome inflation driven by magma intrusion. We focus \non an eruption event that occurred in March 1982, which was preceded by distinct accelerating and \noscillatory patterns in earthquake and tiltmeter measurements (Fig. 3a, c, and e). The existence of \nlog-periodicity in the earthquake count data is demonstrated by the LPPLS fit and the ϵ-lnτ pattern \n(Fig. 3a), with the Lomb periodogram yielding f = 0.77, ω = 4.85, and λ = 3.65 (Fig. 3b). The LPPLS \nfit and ϵ-lnτ plot for the tilt data also confirms the presence of log-periodicity (Fig. 3c and e), and the \nLomb spectral analysis indicates f = 0.99, ω = 6.23, and λ = 2.74 for the tilt along the radial direction \n(Fig. 3d) and f = 1.16, ω = 7.26, and λ = 2.37 for the tilt along the radial direction (Fig. 3f). Notably, \nthe λ values derived from tiltmeter measurements are significantly higher than that obtained from \nearthquake counts. \nThe next case study focuses on Merapi volcano in Indonesia, one of the most active and \nhazardous volcanoes globally. It has erupted regularly, about every 4 to 6 years, typically with low \nexplosivity and involving the formation of a lava dome. A major eruption took place in June 2006, \nreleasing approximately 5.3 million m3 of magma, just before the Mw 6.4 Yogyakarta earthquake \n(Ratdomopurbo et al., 2013). The existence of log-periodicity is indicated by the LPPLS fit to the \ndata and the cyclical pattern in the ϵ-lnτ plot (Fig. 4a). On the Lomb periodogram, a dominant peak \nis found at f = 0.78 (with ω = 4.90 and λ = 3.61), while a harmonic at 1.61 is also noticeable, \ncorresponding approximately to the second harmonic 2f (Fig. 4b). In October 2010, Merapi exploded \nagain but in a much more violent manner, marking its largest eruption over a century (Surono et al., \n2012). This event was preceded by a clear accelerating and oscillating pattern in the earthquake count \ndata, which is well captured by the LPPLS model (Fig. 4c). The ϵ-lnτ plot also confirms the presence \nof log-periodicity (inset of Fig. 4c), and the Lomb spectral analysis indicates f = 1.42, ω = 8.91, and \nλ = 2.02 (Fig. 4d). Notably, the Lomb periodogram highlights a series of harmonics occurring at \ninteger multiples of this fundamental frequency f—another signature of log-periodicity. \n\n\n \nLei & Sornette: Preprint at arXiv \n10 \n \n \nFig. 3. Time series of earthquake count and tiltmeter measurements at the Mount St. Helens volcano \n(a)\n(b)\nf = 0.77 (ω = 4.85, λ = 3.65)\n(c)\n(d)\nf = 0.99 (ω = 6.23, λ = 2.74)\n(e)\n(f)\nf = 1.16 (ω = 7.26, λ = 2.37)\n\n\n \nLei & Sornette: Preprint at arXiv \n11 \n \nin the United States, prior to an eruption in March 1982. Insets in the left panel display the variation \nof normalised residual ε as a function of log normalised time τ = (tc‒t)/(tc‒t0). The Lomb periodogram \nanalysis for detecting log-periodic oscillatory components in the (b) seismic data as well as (d) radial \nand (f) tangential tiltmeter measurements. \n \nFig. 4. Time series of earthquake count at the Merapi volcano in Indonesia, prior to the (a) 2006 and \n(c) 2010 eruptions. Insets in the left panel display the variation of normalised residual ε as a function \nof log normalised time τ = (tc‒t)/(tc‒t0). The Lomb periodogram analysis for detecting log-periodic \noscillatory components in the data for the (b) 2006 and (d) 2010 eruptions. \nWe further show our analysis on two other representative volcanoes, i.e. Mount Pinatubo in \nPhilippines and Mount Etna in Italy. In June 1991, Pinatubo experienced a massive cataclysmic \n(a)\n(b)\nf = 0.78 (ω = 4.90, λ = 3.61)\n(c)\n(d)\nf = 1.42 (ω = 8.91, λ = 2.02)\n\n\n \nLei & Sornette: Preprint at arXiv \n12 \n \nexplosion and discharged about 5 billion m3 pyroclastic material (Kress, 1997), making it the second-\nlargest terrestrial eruption in the 20th century. A clear log-periodic oscillatory pattern decorating an \noverall power law acceleration can be seen in the time series of earthquake count which is well \ncaptured by the LPPLS model (Fig. 5a). The significance of log-periodic oscillations is indicated by \nthe sinusoidal-like signals in the ϵ-lnτ plot (inset of Fig. 5a) and the emergence of a major Lomb peak \n(Fig. 5b), pointing to f = 1.06, ω = 6.64, and λ = 2.58. Regarding the Etna volcano that erupted in \nSeptember 1989 (Rymer et al., 1993), the existence of log-periodicity is also demonstrated by the \nexcellent fit of the LPPLS model to the time series data of earthquake count and the visible cyclical \npattern in the ϵ-lnτ plot (Fig. 6a). On the Lomb periodogram (Fig. 6b), a major peak is observed at f \n= 1.87 corresponding to ω = 11.77 and λ = 1.71, with a secondary peak also identified at the log \nfrequency of 3.65 indicating the second harmonic. \nIn total, we have performed the LPPLS calibration and Lomb periodogram analysis on a large \ndataset including 34 volcanic eruptions (Supplementary Table 1 and Fig. S2-S4). This dataset \nincludes different types of volcanoes (stratovolcano, shield volcano, and complex volcano) monitored \nby different instruments (e.g. electronic tiltmeter, seismic/geochemical stations, bottom/mobile \npressure recorders, and Global Positioning System) (Supplementary Table 1). In Fig. 7, we show the \nhistograms of selected key parameters derived from the Lomb spectral analysis of this large dataset \n(see Supplementary Table S2 for the parameter values of each eruption event). The angular log \nfrequency ω spans from 3.5 to 14, with a notable concentration between 4 and 10 (Fig. 7a). \nCorrespondingly, the scaling ratio λ mostly falls in the range of 1.5 to 6, exhibiting a concentration \naround 2 (Fig. 7b). The frequency distributions of ω and λ obtained using the Lomb method generally \nalign with those derived from the LPPLS calibration (Supplementary Fig. S5). The frequency and \ncumulative distributions of maximum Lomb peak heights Pmax of these eruptions indicates that 94% \nexceed 5, 79% are beyond 10, and 59% reach over 20 (Fig. 7c), highlighting the significance of log-\nperiodicity (Zhou and Sornette, 2002b). The first-to-second peak ratio 𝜂, which quantifies the relative \nstrength of the two highest peaks in each Lomb periodogram, reveals that 62% of these events are \nbeyond 2, 47% surpass 3, and 32% exceed 4 (Fig. 7d). This reinforces the evidence for log-periodicity, \nas it highlights the presence of both a fundamental log frequency and its first harmonic. \n \n\n\n \nLei & Sornette: Preprint at arXiv \n13 \n \n \nFig. 5. (a) Time series of earthquake count at the Pinatubo volcano in Philippines, prior to the 1991 \neruption. Inset displays the variation of normalised residual ε as a function of log normalised time τ \n= (tc‒t)/(tc‒t0). (b) The Lomb periodogram analysis for detecting log-periodic oscillatory components \nin the data. \n \nFig. 6. (a) Time series of earthquake count at the Etna volcano in Italy, prior to the 1989 eruption. \nInset displays the variation of normalised residual ε as a function of log normalised time τ = (tc‒t)/(tc‒\nt0). (b) The Lomb periodogram analysis for detecting log-periodic oscillatory components in the data. \n(a)\n(b)\nf = 1.06 (ω = 6.64, λ = 2.58)\n(a)\n(b)\nf = 1.87 (ω = 11.77, λ = 1.71)\n\n\n \nLei & Sornette: Preprint at arXiv \n14 \n \n \nFig. 7. Histograms together with the empirical cumulative distribution function (eCDF) of the \nparameter values derived from the Lomb periodogram analysis of 34 volcanic eruptions, including \n(a) the log-periodic frequency ω, (b) the scaling ratio λ, (c) the maximum Lomb peak height Pmax, \nand (d) the first-to-second peak ratio η. \n4. Discussion \nOur findings suggest that log-periodicity is a common precursor to volcanic eruption, \ndemonstrated by the strong agreement between the LPPLS model and monitoring data from a diverse \nrange of volcanoes (Figs. 1-6 and Supplementary Figs. 1-4). It is important to note that the possibility \nof overfitting by the LPPLS model has been ruled out in our previous study based on Akaike and \nBayesian information criteria (Lei and Sornette, 2024). Our LPPLS parametric calibration reveals \nthat the singularity exponent m, which characterises the nonlinearity of power law acceleration \ndynamics, predominantly ranges from -1 to 1 with a concentration between 0.5 and 1. \nCorrespondingly, the exponent α = 1+1/(1‒m) is mostly larger than 1.5, with a concentration in the \n\n\n \nLei & Sornette: Preprint at arXiv \n15 \n \nrange above 3. This deviates from the commonly assumed α = 2.0 in the inverse rate method \n(Cornelius and Voight, 1995, 1994; Voight, 1989, 1988; Voight and Cornelius, 1991), suggesting that \nspecial caution is needed when adopting this assumption in practice. The transition from the power \nlaw framework of the FFM model to the LPPLS model yields a substantial improvement in fitting \nvolcanic unrest time series, as evidenced by a marked reduction in residual variance (Lei and Sornette, \n2024). Crucially, the statistical robustness of log-periodic components is underscored by oscillatory \npatterns in FFM residuals when plotted on a logarithmic time axis nearing the critical time. These \ncoherent and stable oscillations—incompatible with stochastic noise or power law scaling alone—\nprovide diagnostic validation of the LPPLS model’s ability to capture the intermittent bursty \nbehaviors in the accelerated dynamics in all the eruption events studied (see insets of Figs. 1-6 and \nSupplementary Figs. 1-4). Some discrepancies in a few cases may arise from either the scarcity of \navailable data or the effect of higher-order harmonics that are not included in this version of the \nLPPLS model, which includes only the first-order log-periodic correction to the pure power law. \nHigher-order corrections could be incorporated (Gluzman and Sornette, 2002; Johansen and Sornette, \n2001), which however would make the calibration process less parsimonuous. The relative amplitude \nof the log-periodic components typically ranges from 0.01 to 0.2, with a concentration around 0.1, \nconsistent with the hypothesis that it is on the order of 10-1 for systems approaching failure (Sornette, \n1998). Our nonparametric tests offer additional support for the presence of log-periodicity in volcanic \nactivity. In particular, the high Lomb peaks across different eruption events, with most surpassing 10 \nand over half exceeding 20 (Fig. 7c), reveal the statistical significance of log-periodic components \n(Zhou and Sornette, 2002b). If the data were associated with Gaussian noise, we could analytically \ncalculate the false-alarm probability, which quantifies the chance that random noise is mistakenly \nidentified as a genuine log-periodic signal (Supplementary Text S2). Among the 34 events studied, \nonly 3 show a false-alarm probability exceeding 0.05 (Supplementary Table S2). Although the noise \nin the real data is likely non-Gaussian, the high first-to-second Lomb peak ratios, with most exceeding \n2 and half surpassing 3, still provide compelling evidence of log-periodicity (Zhou and Sornette, \n2002b). This is further supported by the high signal-to-noise ratios in most cases, with 82% above 1, \n56% exceeding 1.5, and 38% surpassing 2 (Supplementary Table S2), a metric that is applicable for \ndifferent types of noise (Zhou and Sornette, 2002a, 2002b). It is worth mentioning that log-periodicity \n\n\n \nLei & Sornette: Preprint at arXiv \n16 \n \nmay also arise due to artifacts (Huang et al., 2000), but for most cases that we analysed, the most \nprobable artificial log frequency is very different from the detected log frequency in the Lomb \nperidogram (Supplementary Table S2). In some cases, they are close but with high signal-to-noise \nratios that could still exclude the possible noise origin of the detected log-periodicity (Supplementary \nTable S2). \nThe log-periodic patterns provide important clues about the possible underlying mechanisms \nbehind the observed intermittent rupture behaviour of volcanoes. Log-periodicity indicates the \npresence of discrete scale invariance (Saleur et al., 1996; Sornette, 1998), linked to complex critical \nexponents that are commonly observed in nonunitary (dissipative) systems with quenched disorder \nexhibiting out-of-equilibrium dynamics (Saleur and Sornette, 1996). One possible mechanism for \ndiscrete scale invariance is a cascade of ultraviolet Mullins-Sekerka instabilities that occurs in the \ngrowth processes of diffusion-limited aggregation and crack array propagation, with a preferred \nscaling ratio close to 2 (Huang et al., 1997; Johansen and Sornette, 1998; Sornette, 1998; Sornette et \nal., 1996). This may explain the frequent occurrence of λ around 2 (Fig. 7b). In the context of \nvolcanoes, diffusion-limited aggregation can be envisioned as the flow of magma through porous \nmedia between the magma chamber and the surrounding crust. This mechanism may explain the \nobserved λ ≈ 2 for the Axial Seamount volcano (see Fig. 1b), aligning with previously proposed \nconceptual models for the short-term inflation-deflation cycles at this volcano (Chadwick et al., 2022). \nSimilarly, log-periodicity could spontaneously emerge in crack propagation, where larger cracks \nexperience less screening and grow more quickly, while smaller cracks are inhibited due to stress \nshadowing and crack interactions (Huang et al., 1997). This theory, formulated for a system of parallel \ncracks, may account for the observed λ ≈ 2 for the Sierra Negra volcano, where dyke propagation and \nfissure opening have been observed in the northern sector of the caldera (Rezaeifar et al., 2024) and \ninterpreted to relate to the seismic tremors recorded (Li et al., 2022). Another possible mechanism \ninvolves the interplay between stress drop during seismic phases and stress corrosion during inter-\nseismic phases, with a mean-field prediction of λ = 3.6 (Lee and Sornette, 2000). This theory, which \nmay explain some of the volcanoes having λ values around 3.5-4.0 (Fig. 7b), is consistent with the \nsuspected involvement of pre-existing fault reactivation and subcritical crack growth in triggering \nvolcanic eruptions (Gudmundsson, 2016; Heap et al., 2011; Kilburn, 2003; Kilburn and Voight, 1998). \n\n\n \nLei & Sornette: Preprint at arXiv \n17 \n \nAdditionally, log-periodicity could emerge from the interplay of inertia, damage, and healing (Ide \nand Sornette, 2002; Sornette and Ide, 2003), which may explain the large variability in λ values \nobserved across different volcanoes, reflecting the differences in their healing properties. In the \ncontext of volcanoes, the presence of inertia, damage, and healing is supported by the commonly \nobserved volcano-tectonic earthquakes, dyke intrusion, and magma cooling/crystallisation (Acocella \net al., 2023; Caricchi et al., 2021). \nThus, discrete scale invariance can emerge spontaneously through mechanisms such as (i) \ncascades of instabilities, (ii) the interplay between stress drop during seismic phases and stress \ncorrosion during inter-seismic phases, or (iii) the interplay of inertia, damage, and healing. In addition, \ndiscrete scale invariance derives naturally in systems where the structure itself exhibits hierarchical \norganisation, such as fracture networks governed by discrete preferred scaling ratios in the uppermost \ncrust, which imprint log-periodic signatures (Sornette, 1998). These various mechanisms are likely \nto coexist and interact in actual volcanoes, with the dominant mechanism changing across different \nsites or over time at the same site. For example, the Merapi volcano exhibited λ ≈ 3.6 during the pre-\neruptive inflation before the 2006 eruption (Fig. 4b), indicating a possible dominance of stress drop \nalong geological structures and stress corrosion damage in crustal rocks, while λ ≈ 2 during the 2010 \nunrest (Fig. 4d) may suggest a dominant role of dyke intrusion and/or magma diffusion. Interestingly, \nfor the 1982 eruption at Mount St. Helens, the λ value derived from earthquake counts is around 3.6 \nwhile that from tiltmeter measurements is about 2.5, which may be attributed to the fact that they \nreflect distinct processes (e.g. faulting versus dyking, respectively) operating within the same system. \nIn addition to shedding light on the mechanisms driving volcanic unrest, log-periodic signals \ncould be useful for forecasting impending volcanic eruptions in practice. More specifically, by \n“locking” into the oscillatory temporal evolution pattern of reawakening volcanoes, the LPPLS model \ncan transform the information of intermittency from traditionally perceived noise into valuable \nconstraints to improve the prediction of the critical time of failure (Lei and Sornette, 2024; Sornette, \n2002). Its potential for prospective forecasting of volcanic eruptions will be explored in our future \nwork. Moreover, log-periodic signatures could serve as indicators for early warning, a concept proven \neffective for forecasting financial crises (Demirer et al., 2019) and to be explored for volcanoes in \nour future research. However, the Lomb nonparametric analysis alone may be less robust for \n\n\n \nLei & Sornette: Preprint at arXiv \n18 \n \nprediction than the LPPLS parametric fit and finds its use as a diagnostic tool (Zhou and Sornette, \n2002a). Finally, it is important to note that the presence of log-periodic signatures in a volcano only \nindicates that the system is at or close to the critical point and does not guarantee the definite \noccurrence of an eruption. In other words, log-periodicity alone is insufficient to distinguish between \nvolcanic crises that will escalate into an eruption and those that will not. Many cases of significant \nvolcanic unrest have not resulted in eruptions (Phillipson et al., 2013), while there are also situations \nwhere eruptions occurred without clear precursory accelerating signals (Smittarello et al., 2022). \nTherefore, log-periodicity should be combined with other geophysical and geochemical indicators to \nimprove the reliability of eruption forecasts. \n5. Conclusions \nTo conclude, through comprehensive parametric and nonparametric tests on a large dataset of \n34 volcanic eruptions, we provided strong empirical evidence, supported by solid theoretical \narguments, demonstrating the statistical significance of log-periodic oscillations in reawakening \nvolcanoes. Log-periodicity seems to be a ubiquitous feature decorating the power law finite-time \nsingularities during pre-eruptive volcanic unrest. It reveals discrete scale invariance in volcanic \nactivity that is inherent to the intermittent dynamics of damage and rupture processes in \nheterogeneous systems. Drawing from the log-periodic patterns derived from empirical data, we \ninferred that log-periodicity in volcanoes may arise from various mechanisms, such as diffusion-\ndominated magma flow, magma-driven dyke intrusion, interaction between stress drop and stress \ncorrosion, and/or interplay of inertia, damage, and healing, within magmatic and crustal systems. Our \nfindings have important implications for volcano forecasting, since log-periodicity can help turn \nvolcanic intermittency from traditionally perceived noise into valuable information to constrain \npredictions. \nReferences \nAcocella, V., Ripepe, M., Rivalta, E., Peltier, A., Galetto, F., Joseph, E., 2023. Towards scientific \nforecasting \nof \nmagmatic \neruptions. \nNat. \nRev. \nEarth. \nEnviron. \n5, \n5–22. \nhttps://doi.org/10.1038/s43017-023-00492-z \nAnifrani, J.-C., Le Floc’h, C., Sornette, D., Souillard, B., 1995. Universal log-periodic correction to \nrenormalization group scaling for rupture stress prediction from acoustic emissions. J. Phys. \n\n\n \nLei & Sornette: Preprint at arXiv \n19 \n \nI France 5, 631–638. https://doi.org/10.1051/jp1:1995156 \nBell, A.F., Greenhough, J., Heap, M.J., Main, I.G., 2011a. Challenges for forecasting based on \naccelerating rates of earthquakes at volcanoes and laboratory analogues. Geophys. J. Int. 185, \n718–723. https://doi.org/10.1111/j.1365-246X.2011.04982.x \nBell, A.F., La Femina, P.C., Ruiz, M., Amelung, F., Bagnardi, M., Bean, C.J., Bernard, B., Ebinger, \nC., Gleeson, M., Grannell, J., Hernandez, S., Higgins, M., Liorzou, C., Lundgren, P., Meier, \nN.J., Möllhoff, M., Oliva, S.-J., Ruiz, A.G., Stock, M.J., 2021. Caldera resurgence during the \n2018 eruption of Sierra Negra volcano, Galápagos Islands. Nat Commun 12, 1397. \nhttps://doi.org/10.1038/s41467-021-21596-4 \nBell, A.F., Naylor, M., Heap, M.J., Main, I.G., 2011b. Forecasting volcanic eruptions and other \nmaterial failure phenomena: An evaluation of the failure forecast method. Geophys. Res. Lett. \n38, 2011GL048155. https://doi.org/10.1029/2011GL048155 \nBell, A.F., Naylor, M., Main, I.G., 2013. The limits of predictability of volcanic eruptions from \naccelerating \nrates \nof \nearthquakes. \nGeophys. \nJ. \nInt. \n194, \n1541–1553. \nhttps://doi.org/10.1093/gji/ggt191 \nBevilacqua, A., De Martino, P., Giudicepietro, F., Ricciolino, P., Patra, A., Pitman, E.B., Bursik, M., \nVoight, B., Flandoli, F., Macedonio, G., Neri, A., 2022. Data analysis of the unsteadily \naccelerating GPS and seismic records at Campi Flegrei caldera from 2000 to 2020. Sci Rep \n12, 19175. https://doi.org/10.1038/s41598-022-23628-5 \nBlake, S., Cortés, J.A., 2018. Forecasting deflation, intrusion and eruption at inflating volcanoes. \nEarth Planet. Sci. Lett. 481, 246–254. https://doi.org/10.1016/j.epsl.2017.10.040 \nBoué, A., Lesage, P., Cortés, G., Valette, B., Reyes-Dávila, G., Arámbula-Mendoza, R., Budi-\nSantoso, A., 2016. Performance of the ‘material Failure Forecast Method’ in real-time \nsituations: A Bayesian approach applied on effusive and explosive eruptions. Journal of \nVolcanology \nand \nGeothermal \nResearch \n327, \n622–633. \nhttps://doi.org/10.1016/j.jvolgeores.2016.10.002 \nCarbotte, S.M., Arnulf, A., Spiegelman, M., Lee, M., Harding, A., Kent, G., Canales, J.P., Nedimović, \nM., 2020. Stacked sills forming a deep melt-mush feeder conduit beneath Axial Seamount. \nGeology 48, 693–697. https://doi.org/10.1130/g47223.1 \n\n\n \nLei & Sornette: Preprint at arXiv \n20 \n \nCaricchi, L., Townsend, M., Rivalta, E., Namiki, A., 2021. The build-up and triggers of volcanic \neruptions. Nat. Rev. Earth. Environ. 2, 458–476. https://doi.org/10.1038/s43017-021-00174-\n8 \nChadwick, W.W., Geist, D.J., Jónsson, S., Poland, M., Johnson, D.J., Meertens, C.M., 2006. A \nvolcano bursting at the seams: Inflation, faulting, and eruption at Sierra Negra volcano, \nGalápagos. Geol 34, 1025. https://doi.org/10.1130/G22826A.1 \nChadwick, W.W., Nooner, S.L., Butterfield, D.A., Lilley, M.D., 2012. Seafloor deformation and \nforecasts of the April 2011 eruption at Axial Seamount. Nat. Geosci. 5, 474–477. \nhttps://doi.org/10.1038/ngeo1464 \nChadwick, W.W., Swanson, D.A., Iwatsubo, E.Y., Heliker, C.C., Leighley, T.A., 1983. Deformation \nmonitoring at Mount St. Helens in 1981 and 1982. Science 221, 1378–1380. \nhttps://doi.org/10.1126/science.221.4618.1378 \nChadwick, W.W., Wilcock, W.S.D., Nooner, S.L., Beeson, J.W., Sawyer, A.M., Lau, T. ‐K., 2022. \nGeodetic monitoring at Axial Seamount since its 2015 eruption reveals a waning magma \nsupply and tightly linked rates of deformation and seismicity. Geochem. Geophys. Geosyst. \n23, e2021GC010153. https://doi.org/10.1029/2021GC010153 \nChastin, S.F.M., Main, I.G., 2003. Statistical analysis of daily seismic event rate as a precursor to \nvolcanic \neruptions. \nGeophysical \nResearch \nLetters \n30, \n2003GL016900. \nhttps://doi.org/10.1029/2003GL016900 \nCornelius, R.R., Scott, P.A., 1993. A materials failure relation of accelerating creep as empirical \ndescription of damage accumulation. Rock Mech Rock Engng 26, 233–252. \nhttps://doi.org/10.1007/BF01040117 \nCornelius, R.R., Voight, B., 1995. Graphical and PC-software analysis of volcano eruption precursors \naccording to the Materials Failure Forecast Method (FFM). Journal of Volcanology and \nGeothermal Research 64, 295–320. https://doi.org/10.1016/0377-0273(94)00078-U \nCornelius, R.R., Voight, B., 1994. Seismological aspects of the 1989–1990 eruption at Redoubt \nVolcano, Alaska: the Materials Failure Forecast Method (FFM) with RSAM and SSAM \nseismic data. Journal of Volcanology and Geothermal Research 62, 469–498. \nhttps://doi.org/10.1016/0377-0273(94)90048-5 \n\n\n \nLei & Sornette: Preprint at arXiv \n21 \n \nDemirer, R., Demos, G., Gupta, R., Sornette, D., 2019. On the predictability of stock market bubbles: \nevidence from LPPLS confidence multi-scale indicators. Quantitative Finance 19, 843–858. \nhttps://doi.org/10.1080/14697688.2018.1524154 \nDemos, G., Sornette, D., 2019. Comparing nested data sets and objectively determining financial \nbubbles’ \ninceptions. \nPhysica \nA \nStat. \nMech. \nAppl. \n524, \n661–675. \nhttps://doi.org/10.1016/j.physa.2019.04.050 \nDzurisin, D., Westphal, J.A., Johnson, D.J., 1983. Eruption prediction aided by electronic tiltmeter \ndata \nat \nMount \nSt. \nHelens. \nScience \n221, \n1381–1383. \nhttps://doi.org/10.1126/science.221.4618.1381 \nFilimonov, V., Sornette, D., 2013. A stable and robust calibration scheme of the log-periodic power \nlaw \nmodel. \nPhysica \nA \nStat. \nMech. \nAppl. \n392, \n3698–3707. \nhttps://doi.org/10.1016/j.physa.2013.04.012 \nGeist, D.J., Harpp, K.S., Naumann, T.R., Poland, M., Chadwick, W.W., Hall, M., Rader, E., 2008. \nThe 2005 eruption of Sierra Negra volcano, Galápagos, Ecuador. Bull. Volcanol. 70, 655–\n673. https://doi.org/10.1007/s00445-007-0160-3 \nGluzman, S., Sornette, D., 2002. Log-periodic route to fractal functions. Phys. Rev. E 65, 036142. \nhttps://doi.org/10.1103/PhysRevE.65.036142 \nGudmundsson, A., 2016. The mechanics of large volcanic eruptions. Earth-Science Reviews 163, 72–\n93. https://doi.org/10.1016/j.earscirev.2016.10.003 \nHeap, M.J., Baud, P., Meredith, P.G., Vinciguerra, S., Bell, A.F., Main, I.G., 2011. Brittle creep in \nbasalt and its application to time-dependent volcano deformation. Earth Planet. Sci. Lett. 307, \n71–82. https://doi.org/10.1016/j.epsl.2011.04.035 \nHuang, Y., Johansen, A., Lee, M.W., Saleur, H., Sornette, D., 2000. Artifactual log‐periodicity in \nfinite size data: Relevance for earthquake aftershocks. J. Geophys. Res. 105, 25451–25471. \nhttps://doi.org/10.1029/2000JB900195 \nHuang, Y., Ouillon, G., Saleur, H., Sornette, D., 1997. Spontaneous generation of discrete scale \ninvariance \nin \ngrowth \nmodels. \nPhys. \nRev. \nE \n55, \n6433–6447. \nhttps://doi.org/10.1103/PhysRevE.55.6433 \nIde, K., Sornette, D., 2002. Oscillatory finite-time singularities in finance, population and rupture. \n\n\n \nLei & Sornette: Preprint at arXiv \n22 \n \nPhysica \nA: \nStatistical \nMechanics \nand \nits \nApplications \n307, \n63–106. \nhttps://doi.org/10.1016/S0378-4371(01)00585-4 \nJohansen, A., Sornette, D., 2001. Finite-time singularity in the dynamics of the world population, \neconomic and financial indices. Physica A: Statistical Mechanics and its Applications 294, \n465–502. https://doi.org/10.1016/S0378-4371(01)00105-4 \nJohansen, A., Sornette, D., 2000. Critical ruptures. Eur. Phys. J. B 18, 163–181. \nhttps://doi.org/10.1007/s100510070089 \nJohansen, A., Sornette, D., 1998. Evidence of discrete scale invariance in DLA and time-to-failure \nby \ncanonical \naveraging. \nInt. \nJ. \nMod. \nPhys. \nC \n09, \n433–447. \nhttps://doi.org/10.1142/S0129183198000339 \nKelley, D.S., Delaney, J.R., Juniper, S.K., 2014. Establishing a new era of submarine volcanic \nobservatories: Cabling Axial Seamount and the Endeavour Segment of the Juan de Fuca Ridge. \nMarine Geology 352, 426–450. https://doi.org/10.1016/j.margeo.2014.03.010 \nKilburn, C.R.J., 2003. Multiscale fracturing as a key to forecasting volcanic eruptions. Journal of \nVolcanology and Geothermal Research 125, 271–289. https://doi.org/10.1016/S0377-\n0273(03)00117-3 \nKilburn, C.R.J., Voight, B., 1998. Slow rock fracture as eruption precursor at Soufriere Hills Volcano, \nMontserrat. Geophys. Res. Lett. 25, 3665–3668. https://doi.org/10.1029/98GL01609 \nKress, V., 1997. Magma mixing as a source for Pinatubo sulphur. Nature 389, 591–593. \nhttps://doi.org/10.1038/39299 \nLee, M.W., Sornette, D., 2000. Novel mechanism for discrete scale invariance in sandpile models. \nEur. Phys. J. B 15, 193–197. https://doi.org/10.1007/s100510051115 \nLei, Q., Sornette, D., 2024. Generalized failure law for landslides, rockbursts, glacier breakoffs, and \nvolcanic eruptions. https://doi.org/10.48550/ARXIV.2409.11455 \nLi, K.L., Bean, C.J., Bell, A.F., Ruiz, M., Hernandez, S., Grannell, J., 2022. Seismic tremor reveals \nslow fracture propagation prior to the 2018 eruption at Sierra Negra volcano, Galápagos. Earth \nPlanet. Sci. Lett. 586, 117533. https://doi.org/10.1016/j.epsl.2022.117533 \nLomb, N.R., 1976. Least-squares frequency analysis of unequally spaced data. Astrophys Space Sci \n39, 447–462. https://doi.org/10.1007/BF00648343 \n\n\n \nLei & Sornette: Preprint at arXiv \n23 \n \nMain, I.G., 2000. A damage mechanics model for power-law creep and earthquake aftershock and \nforeshock sequences. Geophys. J. Int. 142, 151–161. https://doi.org/10.1046/j.1365-\n246x.2000.00136.x \nMain, I.G., 1999. Applicability of time-to-failure analysis to accelerated strain before earthquakes \nand volcanic eruptions. Geophys. J. Int. 139, F1–F6. https://doi.org/10.1046/j.1365-\n246x.1999.00004.x \nMalone, S.D., Boyko, C., Weaver, C.S., 1983. Seismic precursors to the Mount St. Helens eruptions \nin 1981 and 1982. Science 221, 1376–1378. https://doi.org/10.1126/science.221.4618.1376 \nPhillipson, G., Sobradelo, R., Gottsmann, J., 2013. Global volcanic unrest in the 21st century: An \nanalysis of the first decade. Journal of Volcanology and Geothermal Research 264, 183–196. \nhttps://doi.org/10.1016/j.jvolgeores.2013.08.004 \nPoland, M.P., Lopez, T., Wright, R., Pavolonis, M.J., 2020. Forecasting, detecting, and tracking \nvolcanic \neruptions \nfrom \nspace. \nRemote \nSens \nEarth \nSyst \nSci \n3, \n55–94. \nhttps://doi.org/10.1007/s41976-020-00034-x \nRatdomopurbo, A., Beauducel, F., Subandriyo, J., Agung Nandaka, I.G.M., Newhall, C.G., Suharna, \nSayudi, D.S., Suparwaka, H., Sunarta, 2013. Overview of the 2006 eruption of Mt. Merapi. \nJournal \nof \nVolcanology \nand \nGeothermal \nResearch \n261, \n87–97. \nhttps://doi.org/10.1016/j.jvolgeores.2013.03.019 \nRezaeifar, M., Bean, C.J., Grannell, J., Möllhoff, M., Bell, A.F., 2024. Intrusive mechanism of the \n2018 Sierra Negra Galápagos eruption, constrained by 4D tomographic images. Journal of \nVolcanology \nand \nGeothermal \nResearch \n451, \n108112. \nhttps://doi.org/10.1016/j.jvolgeores.2024.108112 \nRobertson, R.M., Kilburn, C.R.J., 2016. Deformation regime and long-term precursors to eruption at \nlarge calderas: Rabaul, Papua New Guinea. Earth Planet. Sci. Lett. 438, 86–94. \nhttps://doi.org/10.1016/j.epsl.2016.01.003 \nRymer, H., Murray, J.B., Brown, G.C., Ferrucci, F., McGuire, W.J., 1993. Mechanisms of magma \neruption and emplacement at Mt Etna between 1989 and 1992. Nature 361, 439–441. \nhttps://doi.org/10.1038/361439a0 \nSaleur, H., Sammis, C.G., Sornette, D., 1996. Discrete scale invariance, complex fractal dimensions, \n\n\n \nLei & Sornette: Preprint at arXiv \n24 \n \nand log‐periodic fluctuations in seismicity. J. Geophys. Res. 101, 17661–17677. \nhttps://doi.org/10.1029/96JB00876 \nSaleur, H., Sornette, D., 1996. Complex exponents and log-periodic corrections in frustrated systems. \nJ. Phys. I France 6, 327–355. https://doi.org/10.1051/jp1:1996160 \nSmittarello, D., Smets, B., Barrière, J., Michellier, C., Oth, A., Shreve, T., Grandin, R., Theys, N., \nBrenot, H., Cayol, V., Allard, P., Caudron, C., Chevrel, O., Darchambeau, F., De Buyl, P., \nDelhaye, L., Derauw, D., Ganci, G., Geirsson, H., Kamate Kaleghetso, E., Kambale Makundi, \nJ., Kambale Nguomoja, I., Kasereka Mahinda, C., Kervyn, M., Kimanuka Ruriho, C., Le \nMével, H., Molendijk, S., Namur, O., Poppe, S., Schmid, M., Subira, J., Wauthier, C., Yalire, \nM., d’Oreye, N., Kervyn, F., Syavulisembo Muhindo, A., 2022. Precursor-free eruption \ntriggered \nby \nedifice \nrupture \nat \nNyiragongo \nvolcano. \nNature \n609, \n83–88. \nhttps://doi.org/10.1038/s41586-022-05047-8 \nSornette, D., 2006. Critical Phenomena in Natural Sciences - Chaos, Fractals, Selforganization and \nDisorder: Concepts and Tools. Springer, Berlin/Heidelberg. https://doi.org/10.1007/3-540-\n33182-4 \nSornette, D., 2002. Predictability of catastrophic events: Material rupture, earthquakes, turbulence, \nfinancial crashes, and human birth. Proc. Natl. Acad. Sci. 99, 2522–2529. \nhttps://doi.org/10.1073/pnas.022581999 \nSornette, D., 1998. Discrete-scale invariance and complex dimensions. Phys. Rep. 297, 239–270. \nhttps://doi.org/10.1016/S0370-1573(97)00076-8 \nSornette, D., Ide, K., 2003. Theory of self-similar oscillatory finite-time singularities. Int. J. Mod. \nPhys. C 14, 267–275. https://doi.org/10.1142/S0129183103004462 \nSornette, D., Johansen, A., Arneodo, A., Muzy, J.F., Saleur, H., 1996. Complex fractal dimensions \ndescribe the hierarchical structure of diffusion-limited-aggregate clusters. Phys. Rev. Lett. 76, \n251–254. https://doi.org/10.1103/PhysRevLett.76.251 \nSornette, D., Sammis, C.G., 1995. Complex critical exponents from renormalization group theory of \nearthquakes: Implications for earthquake predictions. J. Phys. I France 5, 607–619. \nhttps://doi.org/10.1051/jp1:1995154 \nSparks, R.S.J., 2003. Forecasting volcanic eruptions. Earth Planet. Sci. Lett. 210, 1–15. \n\n\n \nLei & Sornette: Preprint at arXiv \n25 \n \nhttps://doi.org/10.1016/S0012-821X(03)00124-9 \nSparks, R.S.J., Biggs, J., Neuberg, J.W., 2012. Monitoring volcanoes. Science 335, 1310–1311. \nhttps://doi.org/10.1126/science.1219485 \nSurono, Jousset, P., Pallister, J., Boichu, M., Buongiorno, M.F., Budisantoso, A., Costa, F., \nAndreastuti, S., Prata, F., Schneider, D., Clarisse, L., Humaida, H., Sumarti, S., Bignami, C., \nGriswold, J., Carn, S., Oppenheimer, C., Lavigne, F., 2012. The 2010 explosive eruption of \nJava’s Merapi volcano—A ‘100-year’ event. J. Volcanol. Geotherm. Res. 241–242, 121–135. \nhttps://doi.org/10.1016/j.jvolgeores.2012.06.018 \nTárraga, M., Carniel, R., Ortiz, R., García, A., 2008. The Failure Forecast Method: Review and \nApplication for the Real-Time Detection of Precursory Patterns at Reawakening Volcanoes, \nin: Developments in Volcanology. Elsevier, pp. 447–469. https://doi.org/10.1016/S1871-\n644X(07)00013-7 \nVasconez, F.J., Ramón, P., Hernandez, S., Hidalgo, S., Bernard, B., Ruiz, M., Alvarado, A., La \nFemina, P., Ruiz, G., 2018. The different characteristics of the recent eruptions of Fernandina \nand \nSierra \nNegra \nvolcanoes \n(Galápagos, \nEcuador). \nVolcanica \n1, \n127–133. \nhttps://doi.org/10.30909/vol.01.02.127133 \nVoight, B., 1989. A relation to describe rate-dependent material failure. Science 243, 200–203. \nhttps://doi.org/10.1126/science.243.4888.200 \nVoight, B., 1988. A method for prediction of volcanic eruptions. Nature 332, 125–130. \nhttps://doi.org/10.1038/332125a0 \nVoight, B., Cornelius, R.R., 1991. Prospects for eruption prediction in near real-time. Nature 350, \n695–698. https://doi.org/10.1038/350695a0 \nWhite, R., McCausland, W., 2016. Volcano-tectonic earthquakes: A new tool for estimating intrusive \nvolumes and forecasting eruptions. Journal of Volcanology and Geothermal Research 309, \n139–155. https://doi.org/10.1016/j.jvolgeores.2015.10.020 \nYun, S., Segall, P., Zebker, H., 2006. Constraints on magma chamber geometry at Sierra Negra \nVolcano, Galápagos Islands, based on InSAR observations. Journal of Volcanology and \nGeothermal Research 150, 232–243. https://doi.org/10.1016/j.jvolgeores.2005.07.009 \nZhou, W.-X., Sornette, D., 2002a. Generalized q analysis of log-periodicity: Applications to critical \n\n\n \nLei & Sornette: Preprint at arXiv \n26 \n \nruptures. Phys. Rev. E 66, 046111. https://doi.org/10.1103/PhysRevE.66.046111 \nZhou, W.-X., Sornette, D., 2002b. Statistical significance of periodicity and log-periodicity with \nheavy-tailed \ncorrelated \nnoise. \nInt. \nJ. \nMod. \nPhys. \nC \n13, \n137–169. \nhttps://doi.org/10.1142/S0129183102003024 \nCRediT authorship contribution statement \nQL: Conceptualisation; Methodology; Software; Validation; Formal analysis; Investigation; \nResources; Writing - Original Draft; Visualization; Project administration. \nDS: Conceptualisation; Methodology; Software; Resources; Writing - Review & Editing; Funding \nacquisition. \nDeclaration of competing interest \nThe authors declare that they have no known competing financial interests or personal relationships \nthat could have appeared to influence the work reported in this paper. \nAcknowledgement \nQ.L. acknowledges the National Academic Infrastructure for Supercomputing in Sweden (NAISS), \npartially funded by the Swedish Research Council through grant agreement no. 2022-06725, for \nawarding this project access to the LUMI supercomputer, owned by the EuroHPC Joint Undertaking \nand hosted by CSC (Finland) and the LUMI consortium. D.S. acknowledges partial support from the \nNational Natural Science Foundation of China (Grant No. U2039202, T2350710802), from the \nShenzhen Science and Technology Innovation Commission (Grant No. GJHZ20210705141805017) \nand the Center for Computational Science and Engineering at the Southern University of Science and \nTechnology. \nData availability \nNo new data were produced in this work. The data underlying our study are either from prior \npublished studies or datasets, with sources provided in the Supporting Information. \n\n\n \n1 \n \nSupplementary Materials for \nLog-Periodic Precursors to Volcanic Eruptions: Evidence from 34 Events \nQinghua Lei1,, Didier Sornette2 \n1Department of Earth Sciences, Uppsala University, Uppsala, Sweden \n2Institute of Risk Analysis, Prediction and Management, Academy for Advanced Interdisciplinary Studies, \nSouthern University of Science and Technology, Shenzhen, China \nContents of this file \nText S1 to S2 \nFigures S1 to S5 \nTables S1 to S2 \nText S1. Calibration of the LPPLS model \nWe implement a robust calibration scheme (Demos and Sornette, 2019; Filimonov and Sornette, 2013) \nto calibrate the LPPLS model to time series data. Consider a time series \n1\n2\n{\n,\n,...,\n}\nN\n= \n\nΩ\n measured at \ntime stamps \n1\n2\n0\nf\n{ , ,...,\n}\n[ ,\n]\nN\nt t\nt\nt t\n=\n\nt\n, where N  is the total number of time stamps, and \n0t  and \nft  mark \nthe start and final points of the time window for LPPLS fitting. \nThe original LPPLS formula is written as: \n\n\n\n\nc\nc\n( )\ncos\nln(\n)\n(\n)\nm\nt\nA\nB\nC\nt\nt\nt\nt\n\n\n\n=\n+\n+\n−\n−\n−\n, \n(S1) \nwith the parameter set \nc\n{ ,\n,\n, ,\n,\n, }\nA B C t m \n=\nθ\n having 7 parameters, among which the first 3 are linear and \nthe last 4 are nonlinear. Introducing \n1\ncos\nC\nC\n\n=\n and \n2\nsin\nC\nC\n\n=\n, equation (S1) is rewritten as: \n\n\n\n\nc\n1\nc\nc\n2\nc\nc\n( )\n(\n)\n(\n) cos\nln(\n)\n(\n) sin\nln(\n)\nm\nm\nm\nt\nA\nB t\nt\nC t\nt\nt\nt\nC t\nt\nt\nt\n\n\n\n=\n+\n−\n+\n−\n−\n+\n−\n−\n, \n(S2) \nwith the new parameter set \n1\n2\nc\n{ ,\n,\n,\n, ,\n, }\nA B C C t m \n=\nθ\n having 7 parameters as well, among which however \nthe first 4 are linear and the last 3 are nonlinear. Using the ordinary least squares method, the cost function is \ndefined as: \n \n Corresponding author: qinghua.lei@geo.uu.se \n\n\n \n2 \n \n\n\n\n\n\n\n2\nLPPLS\nc\n1\nc\nc\n2\nc\nc\n1\n(\n;\n, )\n(\n)\n(\n) cos\nln(\n)\n(\n) sin\nln(\n)\nN\nm\nm\nm\ni\ni\ni\ni\ni\ni\ni\nF\nA\nB t\nt\nC t\nt\nt\nt\nC t\nt\nt\nt\n\n\n=\n=\n−\n−\n−\n−\n−\n−\n−\n−\n−\n\nθ\nΩ t\n, \n(S3) \nwhich will be minimised to estimate model parameters: \nˆ\nargmin\n( ;\n, )\nF\n=\nθ\nθ\nθ Ω t . \n(S4) \nWe enslave the 4 linear parameters \n1\n2\n{ , ,\n,\n}\nA B C C\n to the 3 nonlinear ones \nc\n{ ,\n, }\nt m \n, so that the \nminimisation problem is reduced to: \nc\nc\n1\nc\n,\n,\nˆ\nˆ\nˆ\n{ ,\n, }\nargmin\n( ,\n,\n)\nt\nm\nt m\nF t m\n\n\n\n=\n, \n(S5) \nwith \n1\n2\n1\nc\n1\n2\nc\nc\n1\n2\n, ,\n,\nˆ\nˆ\nˆ\nˆ\n( ,\n,\n)\nmin\n( , ,\n,\n, ,\n,\n)\n( ,\n,\n, , ,\n,\n)\nA B C C\nF t m\nF A B C C t m\nF t m\nA B C C\n\n\n\n=\n=\n. \n(S6) \nThe 4 linear parameters \n1\n2\n{ , ,\n,\n}\nA B C C\n can be estimated by solving the optimisation problem for fixed values \nof the 3 nonlinear parameters \nc\n{ ,\n, }\nt m : \n1\n2\n1\n2\n1\n2\nc\n, ,\n,\nˆ\nˆ\nˆ\nˆ\n{ , ,\n,\n}\nargmin\n( , ,\n,\n, ,\n, )\nA B C C\nA B C C\nF A B C C t m \n=\n, \n(S7) \nwhose solution can be analytically derived from the system of linear equations below: \n2\n2\n1\n2\n2\nˆ\nˆ\nˆ\nˆ\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\nA\nN\nf\ng\nh\nB\nf\nf\nf g\nf h\nf\ng\nf g\ng\ng h\ng\nC\nh\nf h\ng h\nh\nh\nC\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n=\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n, \n(S8) \nwhere \nc\n(\n)m\ni\ni\nf\nt\nt\n=\n−\n, \n\n\nc\nc\n(\n) cos\nln(\n)\nm\ni\ni\ni\ng\nt\nt\nt\nt\n\n=\n−\n−\n, and \n\n\nc\nc\n(\n) sin\nln(\n)\nm\ni\ni\ni\nh\nt\nt\nt\nt\n\n=\n−\n−\n. \nWe can further reduce the minimisation problem (S5) to be: \nc\nc\n2\nc\nˆ\nargmin\n( )\nt\nt\nF t\n=\n, \n(S9) \nwith \n2\nc\n1\nc\n1\nc\n,\nˆ\nˆ\n( )\nmin\n( ,\n,\n)\n( ,\n,\n)\nm\nF t\nF t m\nF t m\n\n\n\n=\n=\n, \n(S10) \nso that, for a fixed tc, the parameters { , }\nm  can be estimated from: \n1\nc\n,\nˆ\nˆ\n{ , }\nargmin\n( ,\n,\n)\nm\nm\nF t m\n\n\n\n=\n. \n(S11) \n\n\n \n3 \n \nDuring the calibration, we employ a filter of 1.5\n15\n\n\n\n, to prevent physically less relevant oscillation \nscenarios (Filimonov and Sornette, 2013). Here, a relatively low value is adopted for the lower bound to avoid \nhaving boundary effect on the model calibration. In addition, log-periodicity may arise due to noise in the data \n(Huang et al., 2000), where the most probable artificial angular log frequency ωnoise = 2πfnoise can be estimated \nfrom: \nnoise\nc\n0\nc\nf\n1.5\nln(\n)\nln(\n)\nf\nt\nt\nt\nt\n=\n−\n−\n−\n. \n(S12) \nWe use the Lagrange regularisation approach (Demos and Sornette, 2019) to detect the optimal start time \n0t  of the time window for the LPPLS fitting, given a fixed end time \nft . More specifically, the following cost \nfunction is minimised: \n0\n0\n0\n( )\n( )\n( )\nt\nt\nt\nF\nF\nN\n\n\n=\n−\n, \n(S13) \nwhere  is the Lagrange multiplier and \n0\n( )\nt\nF\n is the normalised sum of squared residuals given by: \n0\n0\n( )\n( )\nt\nt\nF\nF\nN\nn\n=\n−\n, \n(S14) \nwith F  is given by equation (S3) and \n7\nn =\n is the number of degrees of freedom corresponding to the \nnumber of parameters of the LPPLS model. The Lagrange parameter  may be approximated via a linear \nregression of \n0\n( )\nt\nF\n over \n0t . \nText S2. Lomb method \nConsider a time series of normalized residual εi sampled at log normalised times lnτi, where i = 1, 2, …, N and \nτi = (tc‒ti)/(tc‒t0). The mean and variance of the signal are respectively given by: \n1\n1\nN\ni\nN\n\n\n=\n\n and \n(\n)\n2\n2\n1\n1\n1\nN\ni\nN\n\n\n\n=\n−\n−\n. \n(S15) \nThe normalized Lomb periodogram can then be calculated as (Zhou and Sornette, 2002a): \n(\n)\n(\n)\n2\n2\n1\n1\n2\n2\n2\n1\n1\ncos (ln\n)\nsin\n(ln\n)\n1\n( )\n2\ncos\n(ln\n)\nsin\n(ln\n)\nN\nN\ni\ni\ni\ni\nN\nN\ni\ni\nP\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n−\n−\n−\n−\n\n\n\n\n\n\n\n\n\n\n\n\n=\n+\n\n\n\n\n−\n−\n\n\n\n\n\n\n\n\n. \n(S16) \nwhere ω = 2πf is the angular log frequency with f being the log frequency, while ξ can be derived from: \n\n\n \n4 \n \n1\n1\ntan(2\n)\nsin2 ln\ncos2 ln\nN\nN\ni\ni\n\n\n\n\n\n\n\n\n\n= \n\n\n\n\n\n\n\n\n\n. \n(S17) \nIn the Lomb periodogram, peaks at specific angular log frequencies suggest the potential presence of log-\nperiodic components, with the highest peak representing the dominant log frequency in the time series. A \nhigher peak indicates greater statistical significance of the corresponding log-periodic component. For data \ncharacterised by independently and normally distributed Gaussian noise, the probability that a detected peak \nsurpasses a given height 𝑧 can be analytically calculated as: \n(\n)\n1\n(1\n)\nz\nM\np\nz\ne−\n\n= −\n−\n, \n(S18) \nwith M being the effective number of independent frequencies. \nOn the Lomb periodogram, the maximum peak height Pmax can be identified together with the \ncorreponding dominant log frequency fLomb or angular log frequency ωLomb. The false-alarm probability pFA for \nthe highest peak can be further obtained by substituting Pmax for the variable z into equation (S18). We also \nderive the first-to-second highest peak ratio η, quantifying the relative significance of the maximum Lomb \npeak (Zhou and Sornette, 2002a). The signal-to-noise ratio γ is also computed as: \n1/2\nmax\nmax\n4\n2\nP\nN\nP\n\n\n\n= \n\n−\n\n\n, \n(S19) \nwhich generally holds for various noises (Zhou and Sornette, 2002a, 2002b). \n \n\n\n \n5 \n \n \nFig. S1. Monitoring data showing the temporal evolution of seafloor uplift (aggregated on a weekly basis) at \nthe central caldera of the Axial Seamount volcano in the Pacific Ocean, prior to its eruptions in (a) January \n1998 and (c) April 2015, with (b, d) the corresponding Lomb periodograms for detecting log-periodic \noscillatory components in the data. Insets display the temporal evolution of normalised residual ε as a function \nof log normalised time τ = (tc‒t)/(tc‒t0). \n \nf = 1.22 (ω = 7.68, λ = 2.27)\n(c)\n(d)\n(a)\n(b)\nf = 1.23 (ω = 7.74, λ = 2.25)\n\n\n \n6 \n \n \nFig. S2. Monitoring data of various volcanoes fitted to the LPPLS model (insets show the variation of \nnormalised residual ϵ as a function of log normalised time τ = (tc‒t)/(tc‒t0)) together with Lomb periodograms. \n(a)\nAdatara – 1996 event\n(b)\nAugustine – 2006 event\n(c)\nBezymianny – 1960 event\n(d)\nAsama – 2009 event\nEtna – 2013 event\n(e)\nHierro – 2011 event\n(f)\nKīlauea – 1971 event\n(g)\nKīlauea – 1972 event\n(h)\n\n\n \n7 \n \n \nFig. S3. Monitoring data of various volcanoes fitted to the LPPLS model (insets show the variation of \nnormalised residual ϵ as a function of log normalised time τ = (tc‒t)/(tc‒t0)) together with Lomb periodograms. \n(a)\nKīlauea – 1983 event\n(b)\nMauna Loa – 1984 event\n(c)\nRabaul – 1994 event\n(d)\nKujusan – 1995 event\nRedoubt – 1989 event\n(e)\nRedoubt – 2009 event\n(f)\n(g)\n(h)\nRuapehu – 1995 event\nRuapehu – 1996 event \n\n\n \n8 \n \n \nFig. S4. Monitoring data of various volcanoes fitted to the LPPLS model (insets show the variation of \nnormalised residual ϵ as a function of log normalised time τ = (tc‒t)/(tc‒t0)) together with Lomb periodograms. \n(a)\nRuapehu – 2006 event \n(b)\nSt. Helens – 1981 event\n(c)\nSt. Helens – 1985 event\n(d)\nSakurajima – 2017 event \nSoufriere Hills – 1995 event\n(e)\nTokachidake – 2004 event\n(f)\nUnzen – 1990 event\n(g)\nYakedake – 1995 event\n(h)\n\n\n \n9 \n \n \nFig. S5. Histograms together with the empirical cumulative distribution function (eCDF) of the LPPLS \nparameters of 34 volcanic eruption events, including (a) the log-periodic frequency ω, (b) the fundamental \nscaling ratio λ, (c) the singularity exponent m, and (d) the relative amplitude C/B. \n \n \n\n\n \n10 \n \nTable S1. Volcano information (34 events in total). \nEvent \nLocation \nType \nEruption \ntime \nErupted \nvolume (m3) \nMonitoring \nmethod \nData \nsource \nReference \nAdatara \n(1996 event) \nJapan \nStratovolcano \n1996-09-\n01 \n1.1×106 \nJMA seismic \nnetwork \nOriginal \nWOVOdat \nAsama \n(2009 event) \nJapan \nComplex \nvolcano \n2009-02-\n02 \n~104 \nJMA seismic \nnetwork \nOriginal \nWOVOdat \nAugustine \n(2006 event) \nUSA \nStratovolcano \n2006-01-\n11 \n7.3×107 \nUSGS seismic \nnetwork-AVO \nOriginal \nWOVOdat \nAxial Seamount \n(1998 event) \nPacific \nOcean \nShield volcano \n1998-01-\n25 \n3.1×107 \nBottom pressure \nrecorders & mobile \npressure recorders \nOriginal \n(Chadwick et \nal., 2013) \nAxial Seamount \n(2011 event) \nPacific \nOcean \nShield volcano \n2011-04-\n06 \n9.9×107 \nBottom pressure \nrecorders & mobile \npressure recorders \nOriginal \n(Chadwick et \nal., 2012) \nAxial Seamount \n(2015 event) \nPacific \nOcean \nShield volcano \n2015-04-\n24 \n1.5×108 \nBottom pressure \nrecorders & mobile \npressure recorders \nOriginal \n(Chadwick et \nal., 2016) \nBezymianny \n(1960 event) \nRussia \nStratovolcano \n1960-04-\n10 \n~106 \nUnspecified \nDigitised \n(Voight, \n1988) \nEtna \n(1989 event) \nItaly \nStratovolcano \n1989-09-\n08 \n~107 \nISCSN \nOriginal \nWOVOdat \nEtna \n(2013 event) \nItaly \nStratovolcano \n2013-09-\n05 \n~106 \nGeochemical \nmonitoring stations \nOriginal \nWOVOdat \nHierro \n(2011 event) \nSpain \nSubmarine \nshield volcano \n2011-10-\n10 \n3.3×107 \nEl Hierro seismic \nnetwork \nOriginal \nWOVOdat \nKilauea \n(1971 event) \nUSA \nShield volcano \n1971-08-\n14 \n9.1×106 \nNCDC-ANSS \nseismic network \nOriginal \nWOVOdat \nKilauea \n(1972 event) \nUSA \nShield volcano \n1972-02-\n04 \n1.2×108 \nNCDC-ANSS \nseismic network \nOriginal \nWOVOdat \nKilauea \n(1983 event) \nUSA \nShield volcano \n1983-01-\n03 \n4×106 \nNCDC-ANSS \nseismic network \nOriginal \nWOVOdat \nKujusan \n(1995 event) \nJapan \nStratovolcano \n1995-10-\n11 \n2×105 \nJMA seismic \nnetwork \nOriginal \nWOVOdat \nMauna Loa \n(1984 event) \nUSA \nShield volcano \n1984-03-\n25 \n~108 \nUnspecified \nDigitised WOVOdat \nMerapi \n(2006 event) \nIndonesia \nStratovolcano \n2006-06-\n06 \n5.3×106 \nPlawangan \nObservatory \nOriginal \nWOVOdat \nMerapi \n(2010 event) \nIndonesia \nStratovolcano \n2010-10-\n26 \n~107 \nPlawangan \nObservatory \nOriginal \nWOVOdat \n \n \n\n\n \n11 \n \nTable S1 (continued). Volcano information (34 events in total). \nEvent \nLocation \nType \nEruption \ntime \nErupted \nvolume (m3) \nMonitoring \nmethod \nData \nsource \nReference \nPinatubo \n(1991 event) \nPhilippines Stratovolcano \n1991-06-\n07 \n5×109 \nSeismic network Original \nWOVOdat \nRabaul \n(1994 event) \nPapua New \nGuinea \nShield volcano \n1994-09-\n19 \n~2×108 \nGeodetic \nnetwork \nDigitised \n(Robertson \nand Kilburn, \n2016) \nRedoubt \n(1989 event) \nUSA \nStratovolcano \n1989-12-\n14 \n~108 \nANSS seismic \nnetwork \nOriginal \nWOVOdat \nRedoubt \n(2009 event) \nUSA \nStratovolcano \n2009-03-\n22 \n~108 \nANSS seismic \nnetwork \nOriginal \nWOVOdat \nRuapehu \n(1995 event) \nNew \nZealand \nStratovolcano \n1995-09-\n18 \n2×105 \nNew Zealand \nseismic network \nOriginal \nWOVOdat \nRuapehu \n(1996 event) \nNew \nZealand \nStratovolcano \n1996-06-\n19 \n~107 \nNew Zealand \nseismic network \nOriginal \nWOVOdat \nRuapehu \n(2006 event) \nNew \nZealand \nStratovolcano \n2006-10-\n04 \n~105 \nNew Zealand \nseismic network \nOriginal \nWOVOdat \nSakurajima \n(2017 event) \nJapan \nStratovolcano \n2017-03-\n25 \n~106 \nJMA seismic \nnetwork \nOriginal \nWOVOdat \nSierra Negra \n(2005 event) \nEcuador \nShield volcano \n2005-10-\n22 \n1.5×108 \nContinuous GPS \nnetwork \nOriginal \n(Geist et al., \n2008) \nSierra Negra \n(2018 event) \nEcuador \nShield volcano \n2018-06-\n26 \n1.4×108 \nContinuous GPS \nnetwork \nOriginal \n(Bell et al., \n2021) \nSt. Helens \n(1981 event) \nUSA \nStratovolcano \n1981-09-\n06 \n~106 \nPNSN \nOriginal \nWOVOdat \nSt. Helens \n(1982 event) \nUSA \nStratovolcano \n1982-03-\n19 \n~106 \nPNSN, tiltmeter \nOriginal \nWOVOdat \nSt. Helens \n(1985 event) \nUSA \nStratovolcano \n1985-05-\n25 \n~106 \nPNSN \nOriginal \nWOVOdat \nSoufriere Hills \n(1995 event) \nUK \nStratovolcano \n1995-11-\n15 \n7×107 \nISCSN \nOriginal \nWOVOdat \nTokachidake \n(2004 event) \nJapan \nStratovolcano \n2004-02-\n25 \n~105 \nJMA seismic \nnetwork \nOriginal \nWOVOdat \nUnzen \n(1990 event) \nJapan \nComplex \nvolcano \n1990-11-\n17 \n2.1×108 \nISCSN \nOriginal \nWOVOdat \nYakedake \n(1995 event) \nJapan \nStratovolcano \n1995-02-\n11 \n6×103 \nJMA seismic \nnetwork \nOriginal \nWOVOdat \nNote: WOVOdat - World Organization of Volcano Observatories (Newhall et al., 2017); PNSN - Pacific Northwest Seismic Network; ISCSN - International \nSeismological Centre Seismographic Network; JMASN - Japan Meteorological Agency Seismic Network; NCDC - National Climatic Data Center; ANSS - \nAdvanced National Seismic System; GPS - Global Positioning System; USGS - United States Geological Survey; AVO - Alaska Volcano Observatory. \n\n\n \n12 \n \nTable S2. Parameters from the LPPLS calibration and Lomb periodogram analysis. \nEvent \nmLPPLS ωLPPLS λLPPLS C/B (%) \nfLomb ωLomb λLomb \nPmax \nη \npFA \nγ \nfnoise \nAdatara \n(1996 event) \n0.32 \n7.56 \n2.30 \n1.89 \n1.20 \n7.53 \n2.30 \n57.83 \n3.21 \n0.00 \n2.26 \n0.67 \nAsama \n(2009 event) \n0.78 \n10.84 \n1.79 \n3.76 \n1.78 11.20 \n1.75 \n4.46 \n1.04 \n0.43 \n0.68 \n0.39 \nAugustine \n(2006 event) \n-0.96 \n9.95 \n1.88 \n6.77 \n1.53 \n9.60 \n1.92 \n20.94 \n1.15 \n0.00 \n1.95 \n0.64 \nAxial Seamount \n(1998 event) \n0.99 \n7.86 \n2.22 \n17.62 \n1.23 \n7.74 \n2.25 \n4.07 \n1.65 \n0.24 \n1.44 \n0.88 \nAxial Seamount \n(2011 event) \n0.64 \n9.23 \n1.98 \n6.83 \n1.52 \n9.55 \n1.93 \n46.96 \n1.28 \n0.00 \n0.72 \n0.25 \nAxial Seamount \n(2015 event) \n0.81 \n7.71 \n2.26 \n3.56 \n1.22 \n7.68 \n2.27 \n7.57 \n1.63 \n0.04 \n0.66 \n0.57 \nBezymianny \n(1960 event) \n-0.55 \n3.06 \n7.79 \n4.64 \n0.51 \n3.21 \n7.07 \n7.12 \n12.61 \n0.02 \n2.22 \n0.51 \nEtna \n(1989 event) \n-0.3 \n11.84 \n1.70 \n1.02 \n1.87 11.77 \n1.71 \n24.00 \n4.56 \n0.00 \n1.23 \n0.72 \nEtna \n(2013 event) \n0.76 \n4.73 \n3.77 \n2.22 \n0.79 \n4.96 \n3.55 \n25.48 \n1.08 \n0.00 \n1.07 \n0.30 \nHierro \n(2011 event) \n0.88 \n4.88 \n3.62 \n8.39 \n0.73 \n4.61 \n3.91 \n17.96 \n1.69 \n0.00 \n1.15 \n0.33 \nKilauea \n(1971 event) \n-0.016 \n3.61 \n5.70 \n0.27 \n0.56 \n3.53 \n5.94 \n70.00 \n15.26 \n0.00 \n4.18 \n0.50 \nKilauea \n(1972 event) \n0.39 \n6.63 \n2.58 \n4.64 \n1.05 \n6.57 \n2.60 \n21.35 \n2.89 \n0.00 \n2.36 \n0.78 \nKilauea \n(1983 event) \n0.99 \n8.56 \n2.08 \n7.24 \n1.27 \n7.95 \n2.20 \n20.88 \n3.80 \n0.00 \n1.98 \n0.83 \nKujusan \n(1995 event) \n0.77 \n5.44 \n3.17 \n13.42 \n0.87 \n5.45 \n3.17 \n37.63 \n3.63 \n0.00 \n2.37 \n0.81 \nMauna Loa \n(1984 event) \n-0.15 \n5.09 \n3.44 \n0.85 \n0.83 \n5.23 \n3.32 \n32.18 139.98 0.00 \n1.41 \n0.50 \nMerapi \n(2006 event) \n0.47 \n4.99 \n3.52 \n1.26 \n0.78 \n4.90 \n3.61 \n21.00 \n4.75 \n0.00 \n3.74 \n0.84 \nMerapi \n(2010 event) \n-0.75 \n8.36 \n2.12 \n2.27 \n1.42 \n8.91 \n2.02 \n11.05 \n10.87 \n0.00 \n1.85 \n0.85 \nPinatubo \n(1991 event) \n0.088 \n6.56 \n2.61 \n1.15 \n1.06 \n6.64 \n2.58 \n24.73 \n3.64 \n0.00 \n2.52 \n0.45 \nRabaul \n(1994 event) \n-0.29 \n8.81 \n2.04 \n1.79 \n1.42 \n8.95 \n2.02 \n47.20 \n2.95 \n0.00 \n1.31 \n0.61 \n\n\n \n13 \n \nTable S2 (continued). Parameters from the LPPLS calibration and Lomb periodogram analysis. \nEvent \nmLPPLS ωLPPLS λLPPLS C/B (%) \nfLomb \nωLomb λLomb \nPmax \nη \npFA \nγ \nfnoise \nRedoubt \n(1989 event) \n0.55 \n4.53 \n4.00 \n9.86 \n0.71 \n4.46 \n4.10 \n16.56 \n2.79 \n0.00 \n2.36 \n0.39 \nRedoubt \n(2009 event) \n0.71 \n8.13 \n2.17 \n5.68 \n1.29 \n8.10 \n2.17 \n6.84 \n2.23 \n0.06 \n0.78 \n0.59 \nRuapehu \n(1995 event) \n0.63 \n7.06 \n2.44 \n7.55 \n1.10 \n6.89 \n2.49 \n62.05 \n7.03 \n0.00 \n2.88 \n0.71 \nRuapehu \n(1996 event) \n0.71 \n3.34 \n6.56 \n16.54 \n0.56 \n3.52 \n5.95 \n25.48 \n1.73 \n0.00 \n1.40 \n0.32 \nRuapehu \n(2006 event) \n0.33 \n13.56 \n1.59 \n0.99 \n2.12 13.31 \n1.60 \n14.24 \n1.83 \n0.00 \n0.94 \n0.81 \nSakurajima \n(2017 event) \n0.85 \n2.21 \n17.17 \n24.51 \n0.33 \n2.09 \n20.08 \n39.73 \n5.71 \n0.00 \n3.88 \n0.33 \nSierra Negra \n(2005 event) \n-0.52 \n9.10 \n1.99 \n1.72 \n1.51 \n9.51 \n1.94 \n33.10 \n1.70 \n0.00 \n1.61 \n0.81 \nSierra Negra \n(2018 event) \n-0.4 \n9.40 \n1.95 \n0.87 \n1.55 \n9.74 \n1.91 \n56.58 \n5.20 \n0.00 \n1.38 \n0.80 \nSt. Helens \n(1981 event) \n0.72 \n4.91 \n3.60 \n7.06 \n0.73 \n4.56 \n3.97 \n13.47 \n1.33 \n0.00 \n0.68 \n0.30 \nSt. Helens \n(1982 event, \nseismic data) \n-1.2 \n4.64 \n3.87 \n15.12 \n0.77 \n4.85 \n3.65 \n26.09 \n5.29 \n0.00 \n3.65 \n0.83 \nSt. Helens \n(1982 event, \nradial tilt) \n-0.31 \n5.83 \n2.94 \n1.61 \n0.99 \n6.23 \n2.74 \n22.24 \n3.11 \n0.00 \n2.32 \n0.83 \nSt. Helens \n(1982 event, \ntangential tilt) \n-0.77 \n7.15 \n2.41 \n1.88 \n1.16 \n7.26 \n2.37 \n19.70 \n1.98 \n0.00 \n1.87 \n0.83 \nSt. Helens \n(1985 event) \n-1.7 \n5.99 \n2.85 \n13.93 \n0.81 \n5.06 \n3.46 \n8.34 \n2.34 \n0.01 \n1.25 \n0.71 \nSoufriere Hills \n(1995 event) \n-0.14 \n6.00 \n2.85 \n2.66 \n0.97 \n6.09 \n2.81 \n8.16 \n1.64 \n0.01 \n1.54 \n0.66 \nTokachidake \n(2004 event) \n0.99 \n4.82 \n3.68 \n19.96 \n0.73 \n4.58 \n3.94 \n14.78 \n4.26 \n0.00 \n2.18 \n0.84 \nUnzen \n(1990 event) \n0.82 \n6.11 \n2.80 \n12.84 \n1.01 \n6.36 \n2.68 \n10.55 \n1.16 \n0.00 \n1.74 \n0.42 \nYakedake \n(1995 event) \n0.94 \n3.77 \n5.29 \n13.05 \n0.60 \n3.77 \n5.29 \n27.16 \n4.57 \n0.00 \n2.10 \n0.82 \n \n \n\n\n \n14 \n \nReferences \nBell, A.F., La Femina, P.C., Ruiz, M., Amelung, F., Bagnardi, M., Bean, C.J., Bernard, B., Ebinger, C., \nGleeson, M., Grannell, J., Hernandez, S., Higgins, M., Liorzou, C., Lundgren, P., Meier, N.J., Möllhoff, \nM., Oliva, S.-J., Ruiz, A.G., Stock, M.J., 2021. Caldera resurgence during the 2018 eruption of Sierra \nNegra volcano, Galápagos Islands. Nat. Commun. 12, 1397. https://doi.org/10.1038/s41467-021-\n21596-4 \nChadwick, W.W., Clague, D.A., Embley, R.W., Perfit, M.R., Butterfield, D.A., Caress, D.W., Paduan, J.B., \nMartin, J.F., Sasnett, P., Merle, S.G., Bobbitt, A.M., 2013. The 1998 eruption of Axial Seamount: New \ninsights on submarine lava flow emplacement from high‐resolution mapping. Geochem Geophys \nGeosyst 14, 3939–3968. https://doi.org/10.1002/ggge.20202 \nChadwick, W.W., Nooner, S.L., Butterfield, D.A., Lilley, M.D., 2012. Seafloor deformation and forecasts of \nthe April 2011 eruption at Axial Seamount. Nat. Geosci. 5, 474–477. https://doi.org/10.1038/ngeo1464 \nChadwick, W.W., Paduan, J.B., Clague, D.A., Dreyer, B.M., Merle, S.G., Bobbitt, A.M., Caress, D.W., Philip, \nB.T., Kelley, D.S., Nooner, S.L., 2016. Voluminous eruption from a zoned magma body after an \nincrease \nin \nsupply \nrate \nat \nAxial \nSeamount. \nGeophysical \nResearch \nLetters \n43. \nhttps://doi.org/10.1002/2016GL071327 \nDemos, G., Sornette, D., 2019. Comparing nested data sets and objectively determining financial bubbles’ \ninceptions. Physica A Stat. Mech. Appl. 524, 661–675. https://doi.org/10.1016/j.physa.2019.04.050 \nFilimonov, V., Sornette, D., 2013. A stable and robust calibration scheme of the log-periodic power law model. \nPhysica A Stat. Mech. Appl. 392, 3698–3707. https://doi.org/10.1016/j.physa.2013.04.012 \nGeist, D.J., Harpp, K.S., Naumann, T.R., Poland, M., Chadwick, W.W., Hall, M., Rader, E., 2008. The 2005 \neruption of Sierra Negra volcano, Galápagos, Ecuador. Bull. Volcanol. 70, 655–673. \nhttps://doi.org/10.1007/s00445-007-0160-3 \nHuang, Y., Johansen, A., Lee, M.W., Saleur, H., Sornette, D., 2000. Artifactual log‐periodicity in finite size \ndata: \nRelevance \nfor \nearthquake \naftershocks. \nJ. \nGeophys. \nRes. \n105, \n25451–25471. \nhttps://doi.org/10.1029/2000JB900195 \nNewhall, C.G., Costa, F., Ratdomopurbo, A., Venezky, D.Y., Widiwijayanti, C., Win, N.T.Z., Tan, K., \nFajiculay, E., 2017. WOVOdat – An online, growing library of worldwide volcanic unrest. J. Volcanol. \nGeotherm. Res. 345, 184–199. https://doi.org/10.1016/j.jvolgeores.2017.08.003 \nRobertson, R.M., Kilburn, C.R.J., 2016. Deformation regime and long-term precursors to eruption at large \ncalderas: \nRabaul, \nPapua \nNew \nGuinea. \nEarth \nPlanet. \nSci. \nLett. \n438, \n86–94. \nhttps://doi.org/10.1016/j.epsl.2016.01.003 \nVoight, B., 1988. A method for prediction of volcanic eruptions. Nature 332, 125–130. \nhttps://doi.org/10.1038/332125a0 \nZhou, W.-X., Sornette, D., 2002a. Statistical significance of periodicity and log-periodicity with heavy-tailed \ncorrelated noise. Int. J. Mod. Phys. C 13, 137–169. https://doi.org/10.1142/S0129183102003024 \nZhou, W.-X., Sornette, D., 2002b. Generalized q analysis of log-periodicity: Applications to critical ruptures. \nPhys. Rev. E 66, 046111. https://doi.org/10.1103/PhysRevE.66.046111 \n \n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21277v1.pdf",
    "total_pages": 40,
    "title": "Log-Periodic Precursors to Volcanic Eruptions: Evidence from 34 Events",
    "authors": [
      "Qinghua Lei",
      "Didier Sornette"
    ],
    "abstract": "Forecasting volcanic eruptions remains a formidable challenge due to the\ninherent complexity and variability of volcanic processes. A key source of\nuncertainty arises from the sporadic nature of volcanic unrest, which is often\ncharacterised by intermittent phases of quiescent deceleration and sudden\nacceleration, rather than a consistent, predictable progression towards\neruption. This seemingly erratic pattern complicates volcano forecasting as it\nchallenges conventional time-to-failure models that often assume a simple\nsmooth power law acceleration. We propose a log-periodic power law singularity\nmodel, which effectively captures the intermittent and non-monotonic rupture\ndynamics characteristic of reawakening volcanoes at the site scale.\nMathematically, generalising the power law exponent by extending it from real\nto complex numbers, this model captures the partial break of continuous scale\ninvariance to discrete scale invariance that is inherent to the intermittent\ndynamics of damage and rupture processes in heterogeneous crustal systems. By\nperforming parametric and nonparametric tests on a large dataset of 34\nhistorical eruptions worldwide, we present empirical evidence and theoretical\narguments demonstrating the statistical significance of log-periodic\noscillations decorating power law finite-time singularities during pre-eruptive\nvolcanic unrest. Log-periodicity in volcanoes may originate from various\nmechanisms, including diffusion-dominated magma flow, magma-driven propagation\nof subparallel dykes, interaction between stress drop and stress corrosion,\nand/or interplay of inertia, damage, and healing within volcanic systems. Our\nresults have important implications for volcano forecasting, because\nunderstanding and characterising log-periodicity could turn the intermittency\nof volcanic activity from a challenge into a valuable asset for improving\npredictions.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}