{
  "id": "arxiv_2502.20364v1",
  "text": "Bridging Legal Knowledge and AI:\nRetrieval-Augmented Generation with Vector Stores, Knowledge\nGraphs, and Hierarchical Non-negative Matrix Factorization\nRyan C. Barron\nbarron@lanl.gov\nTheoretical Division,\nLos Alamos National Laboratory\nLos Alamos, New Mexico, USA\nCSEE, UMBC\nBaltimore, Maryland, USA\nMaksim E. Eren\nmaksim@lanl.gov\nAdvanced Research in Cyber Systems,\nLos Alamos National Laboratory\nLos Alamos, New Mexico, USA\nOlga M. Serafimova\nOMSerafimova@hollandhart.com\nHolland & Hart LLP\nSanta Fe, New Mexico, USA\nCynthia Matuszek\ncmat@umbc.edu\nCSEE, UMBC\nBaltimore, Maryland, USA\nBoian S. Alexandrov\nboian@lanl.gov\nTheoretical Division,\nLos Alamos National Laboratory\nLos Alamos, New Mexico, USA\nABSTRACT\nAgentic Generative AI, powered by Large Language Models (LLMs)\nand enhanced with Retrieval-Augmented Generation (RAG), Knowl-\nedge Graphs (KGs), and Vector Stores (VSs), represents a transforma-\ntive technology applicable across specialized domains such as legal\nsystems, research, recommender systems, cybersecurity, and global\nsecurity, including proliferation research. This technology excels at\ninferring relationships within vast unstructured or semi-structured\ndatasets. The legal domain we focus on here comprises inherently\ncomplex data characterized by extensive, interrelated, and semi-\nstructured knowledge systems with complex relations. It comprises\nconstitutions, statutes, regulations, and case law. Extracting insights\nand navigating the intricate networks of legal documents and their\nrelations is crucial for effective legal research and decision-making.\nHere, we introduce a generative AI system that integrates RAG,\nVS, and KG, constructed via Non-Negative Matrix Factorization\n(NMF), to enhance legal information retrieval and AI reasoning and\nminimize hallucinations. In the legal system, these technologies\nempower AI agents to identify and analyze complex connections\namong cases, statutes, and legal precedents, uncovering hidden re-\nlationships and predicting legal trends—challenging tasks that are\nessential for ensuring justice and improving operational efficiency.\nOur system employs web scraping techniques to systematically col-\nlect legal texts, such as statutes, constitutional provisions, and case\nlaw, from publicly accessible platforms like Justia. It bridges the\ngap between traditional keyword-based searches and contextual\nunderstanding by leveraging advanced semantic representations,\nPermission to make digital or hard copies of all or part of this work for personal or\nclassroom use is granted without fee provided that copies are not made or distributed\nfor profit or commercial advantage and that copies bear this notice and the full citation\non the first page. Copyrights for components of this work owned by others than the\nauthor(s) must be honored. Abstracting with credit is permitted. To copy otherwise, or\nrepublish, to post on servers or to redistribute to lists, requires prior specific permission\nand/or a fee. Request permissions from permissions@acm.org.\nICAIL 2025, June 16–20, 2024, Chicago, IL, USA\n© 2025 Copyright held by the owner/author(s). Publication rights licensed to ACM.\nACM ISBN 978-1-4503-XXXX-X/18/06...$15.00\nhttps://doi.org/XXXXXXX.XXXXXXX\nhierarchical relationships, and latent topic discovery. This approach\nis demonstrated in legal document clustering, summarization, and\ncross-referencing tasks. The framework marks a significant step\ntoward augmenting legal research with scalable, interpretable, and\naccurate retrieval methods for semi-structured data, advancing the\nintersection of computational law and artificial intelligence.\nCCS CONCEPTS\n• Computing methodologies →Natural language process-\ning; Reasoning about belief and knowledge; Ontology engineering; •\nApplied computing →Law; • Information systems →Docu-\nment topic models; Content analysis and feature selection;\nOntologies; Document collection models.\nKEYWORDS\nlaw, legal knowledge, nmf, topic labeling, llm, chain of thought,\nprompt tuning,information retrieval\nACM Reference Format:\nRyan C. Barron, Maksim E. Eren, Olga M. Serafimova, Cynthia Matuszek,\nand Boian S. Alexandrov. 2025. Bridging Legal Knowledge and AI: Retrieval-\nAugmented Generation with Vector Stores, Knowledge Graphs, and Hi-\nerarchical Non-negative Matrix Factorization. In Proceedings of The 20th\nInternational Conference on Artificial Intelligence and Law (ICAIL 2025). ACM,\nNew York, NY, USA, 10 pages. https://doi.org/XXXXXXX.XXXXXXX\n1\nINTRODUCTION\nThe legal domain is uniquely complex, encompassing constitu-\ntions, statutes, court rules, regulations, ordinances, and case law.\nEach data type follows a different structural or organizational\nlogic—constitutions and statutes often contain hierarchical ele-\nments, whereas case law typically consists of lengthy, unstructured\nopinions. As new legal texts are continually produced, practition-\ners and scholars require computational systems that move beyond\nsimplistic keyword-based searches to deliver meaningful results.\nTraditional legal information retrieval methods, relying predom-\ninantly on Boolean logic [50] and lexical indexing (TF-IDF)[12],\narXiv:2502.20364v1  [cs.CL]  27 Feb 2025\n\n\nICAIL 2025, June 16–20, 2024, Chicago, IL, USA\nBarron et al.\nfrequently miss the subtle conceptual overlaps and deep contextual\ncues that characterize legal inquiries.\nIn response, RAG has become a framework that unites the strengths\nof information retrieval and generative models. RAG systems re-\ntrieve relevant legal documents or data points and then employ\na language model to synthesize that information into coherent,\ncontextually grounded answers. When applied to the legal domain,\nRAG can help reduce issues experienced by LLMS, like hallucina-\ntions [30, 34]. This is done by rooting responses in reliable texts,\nwhich then improves tasks such as case law retrieval, statutory in-\nterpretation, and document summarization. In order to fulfill these\nbenefits, an underlying infrastructure must effectively represent,\nretrieve, and interpret large volumes of legal data.\nThis paper addresses these requirements by integrating three\ncore technologies:\n• VS: By embedding legal texts into dense vector represen-\ntations (from models like BERT [21] or GPT [13, 44]), our\nsystem encompasses semantic meanings beyond keyword\nmatching. This helps users to locate relevant documents\neven when the exact search terms differ from the query’s\nlanguage.\n• KG: Legal concepts—such as statutes, precedential cases,\nand doctrines—are often interconnected through citations or\nshared legal principles. KGs formalize these relationships, en-\nabling structured navigation of the domain, explicit linking\nof related legal authorities, and improves reasoning over case-\nto-case, case-to-statute, and statute-to-statute references.\n• NMF: While KGs excel at mapping explicit legal connec-\ntions, many latent topics and patterns remain hidden in\nunstructured text. NMF uncovers these by factorizing word-\nembedding matrices into interpretable topics, aiding tasks\nlike clustering related cases or identifying new legal trends\nBy combining the strengths of the thee components into a domain-\nspecific RAG system, we aim to deliver insights and more reliable\noutputs for a wide spectrum of legal tasks. The integrated frame-\nwork leverages the high-recall semantic matching of vector stores,\nthe structured relationships codified in knowledge graphs, and the\ntopic discovery capabilities of NMF. This combination not only\nimproves retrieval quality but also strengthens the system’s ability\nto provide explainable reasoning over extremely large datasets.\n2\nRELEVANT WORK\nThis section reviews contributions across RAG domains, semantic\nsearch using vector embeddings, knowledge graph construction,\nNMF, and legal information systems.\n2.1\nNon-Negative Matrix Factorization for\nPattern Discovery\nNMF is a dimensionality reduction technique used to uncover latent\npatterns in data. [33] analyzed NMF as an interpretable method\nfor extracting features and topics from large datasets, specifically\nhighlighting its ability to identify meaningful and non-overlapping\ncomponents. Building on this work, [27] introduced sparseness\nconstraints for better interpretability, improving applications of\nNMF in real-world scenarios through more focused feature selec-\ntion. In the legal domain, NMF has been valuable for analyzing\ncomplex textual data, such as case law and statutes, and assist-\ning with topic discovery and clustering. For instance, [14] applied\nNMF to legal documents to extract latent topics and visualize rela-\ntionships, demonstrating how NMF’s interpretable structure aids\nresearchers in identifying underlying topics not readily apparent in\nraw text. They even applied NMF hierarchically to find fine-grained\ntopics, however did not have a way to approximate the number\nof clusters automatically at each decomposition. More recently,\n[35] proposed a guided semi-supervised NMF approach for topic\ndiscovery in legal documents, using domain knowledge to steer\nfactorization and ensure the extracted topics remain highly rele-\nvant. This semi-supervised extension bridges the gap between fully\nautomated unsupervised techniques and expert-driven analysis.\nNMF’s utility in legal contexts is particularly significant, providing\nan interpretable framework for analyzing large textual datasets.\n2.2\nRetrieval-Augmented Generation\nRAG has emerged as a foundational approach for improving AI sys-\ntems across various domains, including law. For instance, [34] intro-\nduced a framework that dynamically retrieves relevant documents\nto ground generative outputs, achieving notable gains in accuracy.\nBuilding on this idea, [26] proposed a retrieval-augmented pre-\ntraining method that integrates external knowledge for improved\ndownstream task performance. In contrast, [29] demonstrated the\neffectiveness of retrieval in open-domain question answering. These\nadvances lay the groundwork for applying RAG to the legal sector,\nwhere the method’s ability to ground LLMs in authoritative texts\nreduces hallucinations and increases accuracy in tasks such as case\nlaw retrieval, statutory reasoning, and judgment prediction. Notable\nexamples include CBR-RAG, which incorporates Case-Based Rea-\nsoning to structure retrieval for legal QA [51], and LegalBench-RAG.\nThis benchmark suite tailors evaluation metrics to the demands of\nlegal information synthesis [42]. Parallel work has demonstrated\nRAG’s capabilities in other domains, such as malware data analysis,\nby combining embeddings, KGs, and NMF [9]. Other works show\nhow LLMs can dynamically decide when and what to retrieve to\nimprove legal reasoning [32] and how multi-step legal judgment\nprediction can benefit from iterative retrieval and generation [48],\nfurther demonstrating th effectiveness of combining retrieval strate-\ngies with LLMs.\n2.3\nSemantic Search with Vector Embeddings\nSemantic search operates on dense vector representations to find\nthe deeper semantic relationships in texts, going beyond keyword\nmatching to proper context retrieval [26, 31]. This search is espe-\ncially valuable in the legal domain, where queries often demand con-\nceptual rather than surface-level understanding. Domain-specific\npretraining has become increasingly important, as in LEGAL-BERT\n[17], outperforming general-purpose models by better capturing\nlegal language nuances. Benchmarks like LeCaRD [36] show the\neffectiveness of dense retrievers—such as SBERT—in legal case re-\ntrieval of Chinese law and the abilities of hybrid approaches that\nintegrate both lexical and dense retrieval methods. Hierarchical\ntransformer architectures [28] and long-context models like Long-\nformer [10] further address the challenges of lengthy legal docu-\nments. In contrast, citation-driven approaches such as SPECTER\n\n\nBridging Legal Knowledge and AI:\nRetrieval-Augmented Generation with Vector Stores, Knowledge Graphs, and Hierarchical Non-negative Matrix Factorization\nICAIL 2025, June 16–20, 2024, Chicago, IL, USA\n[20] leverage metadata to improve retrieval. Furthermore, work on\nneighborhood contrastive learning for scientific document represen-\ntations (SciNCL) [41] demonstrates how controlled nearest neighbor\nsampling over citation graph embeddings can provide continuous\nsimilarity. This strategy could also inform citation-based retrieval\nimprovements in legal domains. Challenges remain around scaling,\nexplainability, and incorporating heterogeneous data sources in\nreal-world legal workflows.\n2.4\nKnowledge Graphs in Legal Research\nIn the legal domain, researchers have used KGs for knowledge ex-\ntraction [46], constructed domain-specific graphs tailored to legal\ncontexts [23], and explored their potential for addressing trust, pri-\nvacy, and transparency concerns [15]. Recent studies have demon-\nstrated the effectiveness of KGs in recommending similar legal\ncases [22], linking case law with statutes for improved retrieval\n[52], and using graphs to enhance legal case law search in Chinese\nlegal systems [11]. Beyond retrieval, KGs have been incorporated\ninto knowledge-aware machine reading systems for legal question\nanswering [25]. Collectively, these works demonstrate KGs’ ca-\npacity to represent intricate legal concepts, structure regulatory\nframeworks, and encourage reasoning over legal data.\n2.5\nLegal Systems and Case Retrieval\nLegal information systems have evolved rapidly with the advent of\nneural architectures and hybrid retrieval pipelines, enabling precise\ntasks such as precedent retrieval, statute matching, and judgment\nprediction [16, 19, 45]. Benchmarks like LeCaRD [36] and LexGLUE\n[18], along with LEGAL-BERT-based systems [17], have demon-\nstrated the capability of these neural methods to improve accuracy\nin analyzing legal corpora. In particular, researchers have leveraged\nstructured reasoning with transformers and graph representations\nto link statutes and precedents, as evidenced in the COLIEE competi-\ntion [43]. Nonetheless, several limitations remain: data scarcity and\njurisdictional bias continue to restrict the generalizability of such\nmodels. At the same time, resource-intensive retrievers like BERT-\nbased cross-encoders [53] have challenges scaling to large-scale\nlegal databases. Earlier works in juris-informatics have highlighted\nthe potential of automating legal reasoning and document analysis\n[8], laying the groundwork for modern approaches that fuse knowl-\nedge graphs, transformers, vector stores, and agent-oriented RAG\npipelines to deliver more explainable and efficient legal research\nworkflows.\n3\nMETHODS\nLaws and their interpretations are limited in application to their\nrespective jurisdictions. This work selected the State of New Mexico,\nusing the available Supreme Court and Court of Appeals case law,\nthe state constitution, and state statutes as the main data resource.\n3.1\nData Collection\nTo compile a research-oriented corpus of legal documents, we uti-\nlized Justia’s publicly accessible resources, in full compliance with\ntheir Terms of Service and any applicable usage guidelines, includ-\ning robots.txt. We developed a restricted and responsible crawler to\nonly access permitted documents—namely statutes, constitutional\nprovisions, and case law in the public domain—and to avoid any\nsections or usage not authorized by Justia’s policies. To minimize\nserver load and respect rate limits, our scraper introduces time\ndelays between requests, monitors for HTTP status codes indicat-\ning rate-limiting or errors, and uses exponential backoff to handle\npotential network disruptions gracefully.\nFrom the main landing page, a dynamic crawler identifies only\nthose hyperlinks consistent with the site’s navigation structure and\nrelevant public legal content, converting them to absolute URLs\nand recursively traversing nested content where permitted. Our\nprocess extracts metadata such as chapter names, article titles,\nsection numbers, full text for statutes, constitutional provisions, and\njudicial opinions for New Mexico’s Court of Appeals and Supreme\nCourt cases.\nThroughout this procedure, we take multiple measures to main-\ntain compliance and transparency:\n• Logs track processed URLs to prevent duplication, resume\ninterrupted crawls responsibly, and record request timing.\n• Rate-limiting measures ensure we do not exceed usage\nthresholds or impose an undue burden on Justia’s servers.\n• No circumvention of technical safeguards defined in\nrobots.txt and the TOS restrictions.\n• Non-commercial use only: we do not republish, sell, or\notherwise exploit Justia’s content and only use it for legiti-\nmate scholarly research.\nThese practices keep the data process ethical, legally sound, and\nconsistent with Justia’s rules for site usage and content retrieval.\n3.2\nDimension Reduction in Legal Texts\nLegal documents- constitutions, statutes, and case law- are tradi-\ntionally organized into chapters, articles, and sections, but these\nstructures do not always match the latent patterns revealed through\nfactorization. Each document type is analyzed separately using non-\nnegative tensor and matrix factorization to explore these hidden\nrelationships. A TF-IDF matrix, X, is first constructed from the\ncleaned corpus. Constitutional provisions, statutory clauses, and\ncase law paragraphs form the units of analysis for clustering.\nIn this study, we use the public repository called Tensor Extrac-\ntion of Latent Features (T-ELF)1 [24], combined with automatic\nmodel selection, to decompose X into coherent topic H-clusters.\nT-ELF efficiently identifies latent topics, grouping constitutional\nprovisions around themes such as “separation of powers” and clus-\ntering statutes and case law based on regulatory objectives and\nrecurring legal doctrines, respectively.\n3.2.1\nApplication of Non-Negative Matrix Factorization to Legal\nTexts. NMF approximates the matrix X with two non-negative ma-\ntrices, W and H:\nX ≈W · H,\nwhere W describes how terms distribute over topics, and H\ndescribes how these topics distribute across documents. Constitu-\ntional articles and sections reveal underlying governance or civil\nrights themes; statute clauses highlight regulatory objectives, and\n1https://github.com/lanl/T-ELF\n\n\nICAIL 2025, June 16–20, 2024, Chicago, IL, USA\nBarron et al.\nsegmented judicial opinions expose common doctrines and legal\nreasoning patterns.\n3.2.2\nAutomatic Model Determination Using NMFk. A central chal-\nlenge in applying NMF is selecting the best number of latent fea-\ntures (𝑘). We use NMFk [7], which combines clustering stability with\nreconstruction accuracy. Bootstrap resampling generates slightly\nperturbed versions of the original matrix, and repeated decompo-\nsitions measure how consistently clusters form. Silhouette scores\nhelp ensure cohesive, well-separated topics, while reconstruction\nerror verifies that the model effectively captures patterns in the\noriginal data.\nBy adapting this NMF approach to a hierarchical setting, legal\ntexts can be organized into a tree-like structure. Constitutions may\nbe segmented into articles and sections, statutes into chapters and\nclauses, and case law into layered precedents and sub-issues. This\nhierarchical perspective enhances the discovery of latent relation-\nships at multiple levels of granularity, facilitating deeper analyses\nof large-scale legal corpora.\nStatute\nSection\n[Citation]\nConstitution\nSection\n[Citation]\nSupreme \nCourt \nCase Law\n[Year]\nAppeals\nCourt \nCase Law\n[Year]\nNMFk \nTopic\n[Label, \nDocument Count]\nNMFk\nKeyword\nBOW\nVocabulary\nFigure 1: Knowledge Graph Schema, with the primary iden-\ntifier in bold and attributes in brackets.\n3.3\nKnowledge Graph\nFeatures derived from T-ELF and document metadata are trans-\nformed into a series of head, entity, and tail relations, forming\ndirectional triplets integrated into a Neo4j KG [37].\nIn the legal context, the KG incorporates metadata and latent\nfeatures extracted from constitutions, statutes, and case law. The\nprimary nodes in the graph represent legal documents, including\nconstitutional provisions, statutory sections, and judicial opinions.\nThese nodes are enriched with metadata such as titles, hierarchical\nidentifiers (e.g., chapter and section numbers), jurisdiction, court\nnames, decision dates, and topics derived from latent features.\nEdges in the KG establish relationships between nodes to repre-\nsent the interconnected nature of legal documents. For instance:\n• Constitutional Nodes: Linked to statutory provisions or\njudicial interpretations that reference or rely on specific\nconstitutional clauses.\n• Statutory Nodes: Connected to cases interpreting the statute\nor related provisions within the same legislative framework.\n• Case Law Nodes: Interlinked based on shared topics, com-\nmon legal principles, or hierarchical relationships in appel-\nlate decisions.\nThis graph structure enables the RAG system to query and re-\ntrieve legal documents based on semantic similarity and explicit\nrelationships. For example, a query about \"due process\" might re-\ntrieve the relevant constitutional clause, cases that discuss its inter-\npretation, and statutory provisions impacted by those rulings. By\ncombining metadata and latent features, the KG supports advanced\nreasoning and logical traversal, enhancing the precision and depth\nof legal information retrieval.\nEach part had decomposition topics containing keywords that\nconnected to the documents. The bag of words (BOW) vocabulary\nwas also extracted and inserted into the knowledge graph. These\ncan be observed in the knowledge graph schema of Figure 1.\n3.4\nVector Store\nA vector database was implemented to manage and index legal doc-\numents, improving the RAG process for legal research. Using Mil-\nvus [47], the system stores vectorized representations of constitu-\ntions, statutes, and case law, treating each document type uniquely\nto ensure contextually relevant retrieval.\nConstitutional provisions are segmented into paragraphs, each\nassigned a unique ID, and vectorized using OpenAI’s text-embedding-\nada-002 [40] model for granular semantic searches. Statutes are\ndivided by sections or clauses, with metadata like chapter numbers\nand section titles integrated for precise retrieval. Case law, due to\nits unstructured narrative format, is chunked into meaningful units,\npreserving logical flow and indexed with metadata such as case\nname and citation.\nThe RAG application queries the database to retrieve relevant\nfragments—constitutional paragraphs, statutory clauses, or case law\nsections—based on the query’s focus. Retrieved text is processed\nby the LLM agents with custom prompts to construct responses,\nallowing the LLM to cite specific paragraphs or clauses, for trace-\nability.\nFor additional context, the system leverages a connected knowl-\nedge graph to explore related statutes, judicial interpretations, or\nprecedent cases.\n1920\n1940\n1960\n1980\n2000\n2020\nYear\n0\n100\n200\n300\n400\n500\nNumber of Cases\nSupreme Court Cases\nAppeals Court Cases\nSupreme Court Created (3 Justices), 1912\nSupreme Court Expanded (5 Justices), 1929\nAppeals Court Created (4 Judges), 1965\nAppeals Expanded (5 Judges), 1972\nAppeals Expanded (7 Judges), 1978\nAppeals Expanded (10 Judges), 1991\nFigure 2: New Mexico Supreme/Appeals case counts per year.\n4\nRESULTS\nThis section presents the resulting atomic parts of the legal texts\nand their hierarchical decomposition, offering a detailed breakdown\nof the sections and cases within each document type. The following\nresults illustrate the scope and depth of the collected data, providing\na foundation for further exploration of trends and patterns across\nthe legal corpus.\n\n\nBridging Legal Knowledge and AI:\nRetrieval-Augmented Generation with Vector Stores, Knowledge Graphs, and Hierarchical Non-negative Matrix Factorization\nICAIL 2025, June 16–20, 2024, Chicago, IL, USA\n4.1\nDataset\nAfter collecting and structuring the data, the three types of legal\ndocuments had the following atomic parts of data, either as sections\nin the constitution and statutes or cases from case law:\n• Constitution: 265 sections\n• Statutes: 28,251 sections\n• Case Law:\n– Court of Appeals: 10,072 cases\n– Supreme Court: 5,727 cases\nFigure 2 shows the trends in the 5,727 Supreme Court and 10,072\nCourt of Appeals cases over the years, as they were available from\nJustia [5], which also includes the expansions and creations of the\ncourts themselves.\n4.2\nDecomposition\nThe four component data types were decomposed hierarchically\nwith NMFk. The vocabulary for building the TF-IDF matrix was\ncollected using specific parameters for each part. For the Consti-\ntution vocabulary, the minimum token document frequency (DF)\nwas set to 5 documents, with a maximum token DF of 80% of the\ncorpus, resulting in a final size of 416 tokens. For the Statutes vo-\ncabulary, the minimum token DF was set to 30 documents, with\na maximum token DF of 70% of the corpus, yielding 7,508 tokens.\nThe Court of Appeals vocabulary used a minimum token DF of 50\ndocuments (cases) and a maximum token DF of 70% of the corpus,\nresulting in 10,189 tokens. Last, the Supreme vocabulary employed\na minimum token DF of 50 papers and a maximum token DF of\n70% of the corpus, with a final size of 8,425 tokens. The maximum\ndepth was set to 2, of which only the constitution sections did not\nreach due to the limited number of sections. The limiting factor\nof further decompositions was 100 documents, so if the preceding\ncluster had ≥100, the cluster would decompose and stop otherwise.\nAs seen in Figure 3a, the largest H-cluster is from cluster 4 in dark\nblue with 49 sections, with the fewest documents in yellow with\nsix sections in H-cluster 0. The other three decompositions can\nbe examined in the larger Figure 3, where the court cases, there\nare 10 leaf H-clusters in the constitution decomposition, 985 leaf\nH-clusters in the statutes decomposition, 420 leaf H-clusters in the\nCourt of Appeals cases, and 248 leaf H-clusters in the Supreme\nCourt cases. From the methods in [49], each H-cluster throughout\nthe decomposition hierarchies has LLM-generated labels for ease\nof reference and quick insight. Labels for the first decomposition\ndepth for the constitution can be observed in Table 1, the statutes\nin Table 2, the Supreme court in Table 4, and the appeals in Table 3.\nThe depth-0 H-clustering corresponds to the first ring radial from\nthe center totals in Figure 3.\nTable 1: NM Constitutional Depth-0 H-Clusters\n#\nLabel\n0\nIrrigation and Water Resource Management Principles\n1\nRegulation of Private Sector Influence on Public Schools and Education Services\n2\nBranches of Government Structure and Functionality\n3\nEducation Funding for New Mexico’s Educational Institutions\n4\nLegislative Proceedings and Lawmaking Activities Enacted During Sessions\n5\nTerritorial Transition: Constitutional Ratification and Statehood Provisions\n6\nGovernance, Land, and Taxation Framework\n7\nMunicipal and County Financial Obligations and Liabilities Management\n8\nJudicial Power and Jurisdictional Frameworks\n9\nPublic Service Election Governance Structure and Processes\nTable 2: NM Statutory Depth-0 H-Clusters\n#\nLabel\n0\nMunicipal Court Civil Cases Involving Children’s Rights\n1\nPublic Education Infrastructure Management Systems\n2\nCriminal Codes, Local Governance Boundaries, Licensing Rules\n3\nComprehensive Emergency Health and Human Services Response Framework\n4\nTaxation and Revenue Collection Oversight\n5\nMilitary Decorations, Licensing Procedures, Governance Boards\n6\nRegulatory Insurance Contract Law and Policy Analysis\n7\nPublic Obligations Financing and Project Bonds Issuance\n8\nState Government Investment Grants for Education and Economic Development\n9\nIrrigation and Water Rights Regulations\n10\nMilitary Honors, Discrimination Penalties, and Trust Authority\n11\nCorporation Governance Framework and Regulatory Compliance\nTable 3: NM Appeals Court Case Law Depth-0 H-Clusters\n#\nLabel\n0\nReal Property Rights and Interests\n1\nCivil Liability and Injury Issues Arising from Healthcare Services\n2\nParental Rights and Custody Proceedings Involving Disputed Parental Fitness\n3\nMotor Vehicle Insurance and Liability Claims Processing Procedures\n4\nMortgage Foreclosure and Secured Lending Frameworks\n5\nArraignments, Tribal Jurisdiction, Divorce, Bond Conditions, Motor Licensing\n6\nCourtroom Advocacy and Representation Strategies\n7\nPetitioner’s Right to Parental Decision Making\n8\nFourth Amendment Protections Against Unlawful Searches and Seizures\n9\nTaxation of Gross Receipts and Sales Transactions in a Business Context\n10\nKey Legal Concepts Related to Sexual Offenses\n11\nChild Protective Services Laws and Regulations\n12\nWork-Related Injury and Disability Compensation Process\n13\nHealthcare Contract Dispute Resolution Processes\n14\nMarital Property and Financial Disposition\n15\nLegal Proceedings Involving Jury Determination of Guilt\n16\nProbation Supervision and Monitoring Oversight Process\n17\nJuvenile Protection, Miranda Rights, Evidence Collection\n18\nFirearms, Substances, DWI, and Sentencing\n19\nSentencing Enhancements for Serious Repeat Offenders\n20\nTraffic Stop Under Suspicion with Mandatory Blood Alcohol Testing\n21\nCriminal Proceedings Trial Litigation Documentation and Record-Keeping Procedures\n22\nWorkers’ Rights and Insurance Benefits\n23\nChildren’s Welfare and Family Reunification Efforts\n24\nPublic Municipal Legal Frameworks and Governance Structure\n25\nBusiness Disputes, Wrongful Injury, Taxation Appeals, Workers’ Compensation\n26\nAdministrative Disputes, Native American Legal Memorandums\nTable 4: NM Supreme Court Case Law Depth-0 H-Clusters\n#\nLabel\n0\nArbitration of Contract Disputes and Judicial Decision-Making in Motor Vehicle Cases\n1\nRevenue and Taxation Frameworks in Governance and Administration\n2\nMineral Rights Leases\n3\nNative American Self-Governance and Tribal Jurisdictional Frameworks\n4\nMunicipal Zoning Ordinances and Regulations of Local Governance Areas\n5\nDamages Award for Wrongful Conduct Against Business Partners\n6\nJurisdictional Appeals, Juvenile Sentencing, Felony Enhancements, Parole Terms\n7\nPost-Divorce Asset Distribution and Management Strategies\n8\nConstitutional Challenges to Public Education Governance\n9\nSecured Financial Instruments and Property Rights\n10\nWater Resource Allocation and Management\n11\nElectric Utility Rate Regulation Oversight Authority\n12\nLaw Enforcement Procedures and Rights Protection under Fourth Amendment Protections\n13\nState Legislative Review Process Decisions\n14\nDenial of Petition for Habeas Corpus\n15\nWorkers’ Compensation Process for Work-Related Injuries and Disabilities\n16\nReal Estate Boundary Disputes and Conveyance Matters\n17\nParental Rights and Legal Guardianship Proceedings\n18\nAppellant’s Argument Against the Ruling of a Trial Court\n19\nDocument Terms and Conditions Regarding Business Transactions\n20\nMutual Insurance Policies for Vehicle and Individual Coverage\n21\nAccident resulting from driver error on public roadways leads to legal consequences\n22\nCourt proceedings involving criminal trials and testimonial evidence\n23\nCivil Litigation Proceedings and Trials\n4.3\nKnowledge Graph\nThe four data parts, 265 constitutional provisions, 28,251 Statute sec-\ntions, 5,727 Supreme Court cases, and 10,072 Court of Appeals cases,\nwere inserted into the neo4j [37] knowledge graph. The graph’s\nnumber of nodes and edges can be seen in Table 5, where edge\ncounts are where the triplet’s tail originates with the row’s node.\nThe legal citations were collected by iterating the text of each case\nor section into chat-gpt-3.5-turbo with the following prompt: \"You\n\n\nICAIL 2025, June 16–20, 2024, Chicago, IL, USA\nBarron et al.\nTOTAL\n265\n4\n49\n8\n39\n7\n30\n6\n29\n5\n26\n9\n26\n1\n24\n3\n21\n2\n15\n0\n6\n(a) 10 latent topics from\nConstitutional Provisions\nTOTAL\n28,251\n11\n6205\n0\n3481\n5\n3235\n8\n3149\n10\n3111\n9\n2630\n2\n2094\n3\n1082\n4\n984\n6\n980\n7\n857\n1\n443\n24\n800\n15\n523\n6\n482\n8\n457\n21\n434\n5\n406\n0\n316\n14\n284\n16\n284\n13\n239\n10\n238\n19\n232\n23\n183\n4\n178\n17\n150\n22\n136\n18\n125\n20\n124\n11\n107\n2\n104\n1\n94\n12\n90\n9\n86\n7\n78\n3\n55\n16\n499\n22\n471\n19\n353\n12\n350\n21\n224\n0\n208\n14\n181\n18\n134\n17\n121\n1\n113\n11\n107\n15\n106\n20\n89\n5\n70\n6\n69\n10\n68\n8\n68\n7\n47\n3\n45\n4\n45\n13\n42\n2\n38\n9\n33\n24\n593\n20\n330\n21\n211\n17\n177\n23\n160\n18\n147\n2\n138\n3\n136\n16\n134\n22\n129\n14\n124\n11\n122\n19\n108\n5\n104\n13\n88\n10\n81\n8\n80\n6\n74\n12\n71\n15\n48\n0\n47\n1\n36\n4\n35\n9\n35\n7\n27\n16\n777\n15\n316\n1\n305\n14\n225\n3\n208\n12\n177\n0\n159\n7\n140\n4\n138\n2\n115\n11\n114\n8\n108\n13\n86\n10\n85\n5\n80\n6\n63\n9\n53\n13\n1359\n0\n223\n8\n210\n11\n195\n1\n155\n4\n149\n6\n143\n12\n141\n7\n130\n10\n95\n5\n94\n3\n78\n2\n76\n9\n63\n20\n318\n18\n221\n17\n174\n19\n166\n4\n162\n10\n160\n12\n156\n13\n131\n14\n119\n11\n117\n16\n115\n5\n110\n0\n103\n9\n95\n8\n91\n7\n88\n2\n87\n1\n77\n3\n66\n15\n57 6\n17\n15\n704\n10\n452\n14\n164\n11\n117\n7\n105\n2\n84\n8\n68\n0\n66\n12\n61\n9\n57\n3\n51\n4\n41\n13\n36\n5\n35\n1\n30\n6\n23\n2\n348\n3\n269\n5\n269\n1\n95\n0\n56\n4\n45\n10\n165\n11\n133\n14\n96\n4\n95\n0\n84\n5\n65\n7\n63\n12\n57\n13\n54\n2\n35\n8\n34\n9\n34\n6\n29\n3\n24\n1\n16\n15\n235\n12\n179\n5\n89\n14\n67\n1\n54\n9\n54\n0\n49\n3\n49\n4\n45\n8\n44\n11\n34\n13\n23\n2\n22\n10\n17\n6\n11\n7\n8\n13\n206\n16\n66\n4\n60\n11\n52\n15\n51\n1\n49\n10\n42\n18\n38\n8\n36\n12\n34\n9\n33\n14\n31\n3\n30\n5\n26\n0\n25\n17\n25\n7\n25\n6\n19\n2\n9\n13\n68\n15\n53\n2\n45\n9\n42\n5\n39\n8\n37\n11\n36\n14\n33\n10\n15\n1\n14\n6\n14\n0\n11\n12\n10\n4\n10\n7\n9\n3\n7\n12\n257\n2\n84\n3\n78\n10\n73\n8\n71\n0\n67\n5\n61\n9\n39\n1\n17\n6\n16\n4\n15\n11\n11\n7\n11\n3\n433\n1\n46\n2\n34\n0\n10\n7\n169\n12\n66\n3\n37\n11\n33\n0\n29\n10\n27\n1\n23\n8\n21\n9\n19\n5\n18\n4\n16\n6\n15\n2\n9\n11\n83\n14\n72\n13\n71\n6\n63\n7\n35\n10\n33\n12\n20\n8\n16\n0\n11\n1\n11\n5\n11\n9\n11\n4\n8\n2\n7\n3\n5\n4\n284\n3\n85\n0\n29\n2\n21\n1\n15\n18\n119\n10\n40\n15\n28\n9\n26\n3\n25\n1\n22\n8\n22\n16\n21\n17\n18\n14\n14\n2\n11\n6\n11\n4\n10\n13\n9\n12\n8\n5\n8\n11\n6\n0\n5\n7\n3\n2\n97\n0\n62\n7\n51\n3\n43\n6\n35\n5\n14\n1\n7\n4\n7\n7\n120\n6\n55\n1\n25\n5\n21\n2\n20\n4\n20\n3\n12\n0\n11\n1\n195\n0\n89\n12\n55\n10\n44\n4\n41\n9\n23\n11\n18\n3\n17\n5\n15\n0\n8\n1\n6\n6\n4\n7\n3\n8\n3\n2\n2\n6\n93\n4\n43\n0\n42\n5\n23\n3\n22\n1\n9\n2\n6\n9\n75\n3\n29\n7\n28\n8\n28\n2\n18\n1\n13\n6\n12\n0\n11\n4\n10\n5\n8\n0\n23\n2\n18\n12\n11\n13\n11\n16\n11\n20\n11\n8\n10\n17\n9\n19\n9\n5\n9\n4\n8\n6\n7\n10\n6\n14\n6\n15\n6\n3\n6\n9\n6\n11\n5\n1\n4\n7\n4\n18\n3\n10\n22\n13\n18\n16\n18\n12\n14\n8\n12\n14\n11\n17\n11\n15\n10\n5\n10\n9\n10\n0\n8\n11\n6\n2\n6\n4\n6\n7\n6\n1\n5\n6\n3\n3\n2\n2\n35\n11\n34\n10\n21\n9\n17\n0\n8\n7\n7\n5\n6\n3\n5\n4\n5\n8\n5\n6\n4\n1\n3\n3\n27\n6\n21\n2\n20\n5\n20\n7\n19\n1\n15\n4\n11\n0\n3\n11\n19\n0\n17\n9\n14\n4\n13\n3\n9\n7\n9\n10\n8\n2\n8\n5\n8\n8\n8\n1\n7\n6\n5\n8\n18\n3\n17\n1\n14\n10\n13\n11\n13\n12\n11\n2\n8\n6\n8\n5\n7\n9\n6\n4\n4\n7\n3\n0\n2\n3\n14\n0\n13\n10\n13\n9\n13\n6\n12\n8\n12\n5\n11\n7\n7\n4\n5\n1\n4\n2\n3\n4\n28\n8\n19\n6\n16\n7\n14\n3\n7\n1\n6\n5\n6\n2\n5\n0\n3\n2\n407\n0\n70\n1\n22\n6\n125\n5\n96\n2\n91\n7\n69\n4\n39\n0\n22\n1\n18\n3\n11\n3\n159\n1\n74\n0\n71\n2\n49\n6\n71\n0\n47\n7\n47\n3\n44\n10\n22\n15\n19\n2\n17\n9\n15\n11\n12\n14\n12\n8\n11\n12\n10\n1\n6\n13\n6\n5\n6\n4\n5\n0\n115\n2\n94\n1\n15\n7\n59\n5\n42\n1\n36\n6\n27\n0\n17\n4\n11\n2\n9\n3\n7\n13\n30\n2\n20\n10\n18\n11\n15\n3\n15\n6\n15\n5\n11\n4\n10\n7\n9\n8\n9\n9\n9\n0\n7\n12\n7\n1\n6\n7\n27\n2\n24\n11\n16\n6\n13\n9\n11\n10\n10\n8\n8\n0\n6\n4\n6\n1\n5\n5\n5\n3\n3\n11\n21\n0\n18\n8\n14\n9\n14\n10\n11\n7\n10\n3\n9\n2\n7\n5\n5\n1\n4\n4\n4\n6\n4\n4\n37\n0\n29\n3\n26\n2\n11\n1\n10\n4\n29\n10\n18\n8\n14\n9\n13\n3\n7\n1\n5\n5\n5\n7\n5\n2\n4\n6\n4\n0\n3\n10\n23\n7\n21\n6\n19\n2\n14\n8\n7\n5\n5\n3\n4\n4\n4\n9\n4\n0\n3\n1\n2\n2\n231\n4\n189\n5\n46\n3\n42\n6\n39\n1\n38\n0\n8\n5\n98\n8\n70\n3\n41\n7\n32\n2\n28\n1\n21\n4\n14\n6\n14\n0\n12\n18\n35\n16\n23\n13\n16\n3\n16\n11\n15\n17\n13\n5\n13\n10\n12\n15\n12\n7\n10\n9\n8\n8\n7\n6\n6\n0\n5\n1\n5\n14\n5\n12\n4\n4\n4\n2\n2\n7\n57\n0\n21\n5\n21\n9\n18\n8\n16\n2\n14\n3\n13\n4\n10\n6\n4\n1\n3\n2\n96\n1\n42\n0\n22\n5\n57\n1\n37\n6\n20\n3\n13\n0\n8\n4\n7\n2\n5\n3\n109\n2\n17\n0\n6\n1\n6\n15\n19\n4\n15\n13\n14\n6\n14\n11\n11\n1\n9\n8\n9\n10\n7\n5\n7\n14\n6\n3\n6\n9\n5\n12\n4\n2\n4\n0\n3\n7\n3\n13\n16\n6\n14\n12\n13\n5\n13\n11\n12\n2\n11\n9\n10\n0\n8\n1\n7\n3\n7\n7\n7\n8\n7\n10\n6\n4\n3\n10\n28\n0\n23\n5\n20\n4\n11\n2\n9\n6\n8\n8\n8\n9\n8\n1\n5\n7\n5\n3\n4\n1\n11\n12\n10\n16\n10\n10\n9\n13\n8\n14\n8\n17\n8\n3\n8\n4\n8\n8\n8\n15\n7\n11\n5\n2\n5\n7\n5\n5\n4\n9\n4\n0\n3\n6\n3\n0\n37\n4\n29\n5\n21\n3\n16\n2\n11\n1\n8\n4\n65\n2\n18\n3\n11\n0\n8\n1\n6\n4\n59\n5\n19\n0\n9\n1\n8\n3\n5\n2\n4\n9\n178\n10\n159\n1\n135\n2\n87\n6\n55\n8\n52\n7\n31\n4\n26\n5\n25\n0\n19\n3\n10\n0\n173\n2\n110\n1\n33\n0\n130\n3\n127\n2\n35\n1\n13\n1\n41\n8\n29\n10\n24\n11\n21\n12\n19\n4\n18\n7\n18\n9\n12\n6\n11\n2\n10\n5\n10\n3\n8\n0\n4\n2\n78\n6\n36\n7\n23\n0\n21\n5\n14\n1\n13\n4\n13\n3\n10\n9\n19\n6\n16\n7\n16\n8\n16\n1\n15\n14\n14\n2\n13\n12\n12\n0\n11\n11\n11\n10\n9\n4\n9\n3\n813\n5\n5\n3\n1\n41\n2\n30\n5\n28\n6\n24\n3\n20\n0\n8\n4\n8\n7\n48\n6\n38\n3\n16\n5\n10\n4\n9\n0\n8\n1\n7\n2\n4\n4\n95 0\n22\n3\n11\n1\n5\n2\n5\n3\n42\n5\n34\n2\n19\n0\n9\n4\n7\n1\n4\n7\n10\n10\n9\n5\n9\n17\n8\n9\n8\n11\n7\n2\n7\n12\n6\n13\n6\n14\n6\n15\n6\n16\n6\n3\n6\n1\n5\n8\n5\n6\n4\n0\n3\n4\n3\n13\n17\n4\n15\n10\n13\n8\n10\n1\n8\n6\n8\n7\n7\n12\n6\n11\n5\n2\n5\n3\n4\n5\n4\n0\n3\n9\n3\n8\n640\n4\n193\n0\n112\n6\n91\n7\n91\n3\n88\n2\n52\n1\n46\n5\n46\n3\n168 2\n35 1\n11\n0\n9\n7\n45\n8\n44\n0\n34\n6\n20\n3\n19\n4\n18\n1\n11\n2\n10\n5\n9\n11\n72\n10\n24\n7\n17\n4\n16\n2\n13\n0\n12\n9\n12\n5\n8\n8\n8\n3\n6\n6\n6\n19\n30\n18\n17\n12\n9\n15\n8\n10\n7\n17\n7\n3\n7\n7\n7\n8\n7\n9\n7\n13\n6\n4\n6\n5\n6\n0\n5\n11\n5\n14\n5\n16\n5\n2\n4\n6\n4\n1\n3\n3\n36\n7\n31\n6\n19\n5\n18\n4\n14\n1\n12\n0\n11\n2\n8\n9\n27\n10\n22\n2\n21\n8\n14\n5\n12\n4\n10\n7\n10\n6\n9\n3\n8\n1\n6\n0\n4\n9\n38\n8\n22\n11\n21\n10\n17\n3\n10\n4\n6\n7\n6\n0\n5\n5\n5\n6\n5\n1\n3\n2\n3\n13\n27\n12\n17\n11\n16\n7\n14\n9\n12\n10\n9\n4\n8\n8\n6\n1\n5\n6\n5\n0\n3\n3\n3\n5\n3\n2\n2\n4\n59\n5\n46\n11\n42\n1\n35\n10\n33\n8\n26\n3\n20\n0\n13\n9\n13\n6\n12\n7\n10\n2\n9\n11\n41\n8\n32\n2\n25\n0\n24\n10\n22\n1\n17\n3\n15\n9\n12\n4\n9\n6\n9\n7\n9\n5\n6\n5\n68\n2\n27\n3\n24\n1\n23\n0\n22\n4\n10\n2\n83\n1\n76 0\n7\n1\n38\n6\n33\n2\n32\n3\n20\n5\n19\n0\n11\n4\n9\n2\n67\n0\n59\n1\n34\n7\n32\n9\n30\n5\n27\n4\n17\n1\n11\n3\n10\n8\n9\n0\n8\n6\n7\n2\n5\n4\n55\n0\n28\n1\n21\n3\n15\n2\n12\n7\n44\n2\n19\n0\n18\n6\n15\n4\n8\n5\n6\n3\n5\n1\n4\n2\n62\n1\n47\n0\n8\n6\n29\n3\n26\n7\n21\n5\n11\n2\n10\n1\n9\n4\n5\n0\n4\n12\n29\n9\n14\n8\n10\n3\n9\n10\n8\n2\n8\n5\n8\n11\n7\n7\n5\n6\n4\n0\n3\n1\n3\n4\n2\n7\n27\n0\n19\n6\n18\n5\n15\n2\n9\n1\n7\n3\n4\n4\n4\n6\n168\n8\n163\n5\n135\n4\n64\n2\n47\n1\n46\n0\n33\n7\n29\n3\n19\n0\n128\n12\n55\n7\n33\n8\n32\n10\n31\n11\n30\n5\n30\n2\n29\n9\n26\n3\n17\n1\n16\n6\n14\n4\n11\n6\n31\n10\n25\n2\n20\n7\n20\n8\n14\n9\n12\n3\n11\n4\n11\n0\n7\n1\n7\n5\n6\n7\n38\n0\n26\n5\n13\n6\n12\n2\n10\n3\n8\n1\n6\n4\n4\n4\n28\n5\n26\n0\n18\n2\n12\n3\n11\n1\n10\n3\n166\n8\n42\n6\n40\n1\n24\n7\n22\n5\n19\n0\n18\n4\n9\n2\n8\n0\n269\n2\n140\n5\n58\n1\n29\n4\n24\n0\n10\n3\n8\n3\n78\n0\n62 1\n14\n2\n11\n8\n49\n7\n22\n6\n14\n3\n12\n0\n9\n1\n8\n2\n7\n4\n6\n5\n6\n5\n56\n4\n55\n2\n29\n8\n24\n0\n18\n6\n17\n1\n13\n7\n12\n3\n11\n5\n48\n1\n37\n2\n32\n4\n31\n0\n18\n3\n13\n1\n188 0\n18\n(b) 985 latent topics from\nStatutory Sections\nTOTAL\n10,072\n21\n1486\n24\n981\n1\n611\n15\n596\n20\n588\n0\n546\n5\n505\n26\n500\n18\n485\n12\n456\n8\n370\n10\n316\n6\n284\n25\n263\n19\n259\n22\n192\n4\n191\n3\n165\n16\n158\n9\n156\n17\n153\n23\n153\n11\n147\n14\n137\n7\n127\n2\n125\n13\n122\n6\n459\n10\n349\n7\n213\n9\n138\n8\n86\n1\n50\n0\n44\n3\n43\n5\n42\n2\n34\n4\n28\n12\n204\n3\n139\n1\n118\n9\n88\n7\n82\n11\n72\n8\n69\n5\n51\n2\n43\n4\n34\n10\n30\n0\n26\n6\n25\n0\n97\n8\n87\n2\n86\n6\n65\n3\n61\n4\n56\n9\n42\n10\n39\n5\n33\n7\n26\n1\n19\n20\n85\n19\n56\n15\n51\n2\n47\n9\n35\n7\n32\n4\n29\n1\n27\n17\n27\n14\n25\n5\n25\n12\n24\n16\n22\n13\n21\n8\n18\n3\n17\n10\n16\n11\n11\n6\n11\n18\n10\n0\n7\n6\n90\n9\n86\n17\n67\n16\n54\n12\n40\n11\n36\n15\n32\n10\n30\n4\n25\n13\n23\n0\n22\n14\n19\n3\n14\n2\n12\n5\n12\n8\n10\n7\n9\n1\n7\n0\n165\n7\n109\n2\n85\n5\n46\n6\n46\n4\n38\n1\n29\n3\n28\n10\n127\n14\n69\n5\n39\n1\n36\n0\n28\n12\n27\n3\n26\n8\n26\n11\n22\n9\n22\n13\n21\n6\n19\n2\n18\n7\n13\n4\n12\n13\n97\n1\n79\n12\n53\n3\n51\n7\n48\n10\n47\n6\n25\n9\n24\n11\n15\n2\n13\n5\n13\n0\n12\n4\n12\n8\n11\n5\n85\n15\n79\n17\n43\n4\n40\n16\n34\n12\n32\n14\n25\n8\n21\n11\n19\n6\n19\n1\n17\n0\n14\n9\n14\n13\n12\n10\n11\n3\n9\n7\n7\n2\n4\n10\n85\n5\n68\n2\n58\n8\n43\n11\n40\n0\n29\n12\n29\n6\n27\n4\n19\n7\n17\n3\n16\n9\n15\n1\n10\n2\n194\n0\n144\n1\n32\n4\n125\n0\n87\n2\n51\n3\n42 1\n11\n9\n57\n6\n36\n10\n26\n2\n26\n11\n25\n5\n22\n3\n17\n7\n16\n0\n15\n1\n15\n8\n15\n4\n14\n21\n38\n16\n18\n10\n16\n11\n16\n18\n15\n20\n15\n17\n14\n1\n13\n9\n13\n0\n12\n19\n11\n12\n10\n8\n10\n5\n9\n7\n9\n2\n8\n6\n8\n15\n7\n3\n6\n4\n6\n13\n5\n14\n4\n2\n126\n1\n108\n0\n25\n2\n61\n4\n43\n5\n33\n0\n27\n1\n14\n3\n14\n1\n26\n10\n25\n12\n24\n13\n20\n2\n20\n4\n15\n11\n13\n7\n11\n5\n9\n9\n8\n3\n6\n6\n6\n0\n4\n8\n4\n15\n43\n3\n20\n14\n16\n7\n15\n0\n12\n13\n12\n5\n7\n12\n6\n6\n6\n10\n5\n8\n5\n9\n5\n2\n4\n4\n4\n11\n3\n1\n2\n4\n28\n11\n22\n12\n19\n10\n17\n7\n13\n9\n11\n8\n10\n2\n9\n5\n9\n3\n7\n1\n6\n6\n5\n0\n2\n6\n35\n7\n31\n0\n30\n8\n19\n1\n14\n5\n9\n4\n8\n3\n6\n2\n4\n4\n30\n8\n28\n7\n24\n5\n22\n6\n21\n3\n12\n2\n8\n0\n6\n1\n2\n12\n23\n13\n23\n8\n19\n9\n18\n11\n11\n3\n9\n5\n9\n0\n7\n1\n7\n10\n7\n7\n7\n2\n5\n6\n5\n4\n3\n3\n52\n2\n39\n1\n34\n0\n22\n4\n39\n7\n24\n0\n20\n5\n14\n2\n12\n3\n11\n6\n10\n1\n7\n12\n15\n0\n14\n5\n14\n4\n13\n1\n11\n11\n11\n6\n9\n10\n8\n3\n8\n9\n8\n8\n7\n2\n5\n7\n4\n4\n25\n2\n20\n6\n20\n5\n19\n0\n17\n3\n15\n1\n9\n3\n22\n10\n18\n9\n18\n1\n15\n6\n15\n5\n9\n7\n8\n8\n8\n4\n4\n0\n3\n2\n2\n5\n105\n7\n94\n9\n76\n6\n41\n8\n33\n0\n32\n4\n31\n3\n23\n1\n15\n2\n9\n9\n61\n6\n59\n8\n51\n1\n44\n7\n39\n2\n33\n5\n22\n3\n20\n4\n13\n0\n7\n14\n26\n2\n24\n5\n23\n4\n22\n11\n20\n8\n15\n10\n13\n13\n12\n3\n12\n1\n10\n12\n10\n6\n7\n9\n7\n0\n6\n7\n6\n5\n26\n9\n26\n0\n15\n7\n14\n6\n13\n2\n12\n3\n9\n1\n8\n4\n8\n8\n7\n2\n180\n1\n17\n0\n7\n3\n76\n2\n31\n0\n20\n1\n12\n1\n26\n3\n21\n7\n20\n5\n16\n4\n14\n2\n12\n6\n7\n0\n2\n6\n38\n8\n35\n1\n29\n4\n23\n5\n13\n2\n11\n7\n9\n0\n5\n3\n2\n8\n42\n6\n13\n0\n10\n3\n9\n4\n9\n7\n8\n2\n7\n1\n6\n5\n5\n6\n38\n4\n32\n5\n30\n2\n11\n3\n9\n1\n5\n0\n2\n4\n57\n6\n41\n2\n36\n1\n25\n5\n17\n3\n14\n0\n4\n9\n26\n5\n18\n11\n17\n3\n12\n7\n12\n10\n11\n1\n10\n2\n10\n0\n8\n6\n8\n4\n6\n8\n6\n4\n55\n2\n22\n3\n21\n0\n18\n1\n9\n9\n27\n2\n23\n1\n15\n0\n14\n5\n11\n8\n11\n7\n8\n6\n7\n3\n6\n4\n4\n3\n37\n4\n30\n1\n19\n2\n16\n0\n6\n(c) 420 latent topics from\nCourt of Appeals Cases\nTOTAL\n5727\n23\n747\n22\n707\n21\n450\n15\n344\n13\n314\n19\n296\n9\n285\n8\n241\n6\n240\n16\n234\n12\n204\n20\n194\n18\n189\n5\n180\n7\n172\n11\n158\n4\n155\n17\n134\n1\n117\n2\n105\n10\n84\n14\n82\n3\n58\n0\n37\n26\n62\n23\n49\n14\n39\n7\n37\n16\n33\n8\n33\n5\n31\n9\n30\n22\n29\n27\n29\n6\n29\n0\n28\n12\n26\n2\n26\n21\n26\n28\n26\n19\n22\n24\n22\n4\n22\n25\n21\n18\n20\n15\n19\n20\n18\n11\n15\n17\n14\n1\n13\n10\n12\n3\n9\n13\n7\n5\n281\n0\n164\n4\n99\n1\n82\n3\n66\n2\n15\n9\n116\n0\n72\n5\n62\n6\n46\n8\n37\n4\n35\n2\n33\n3\n19\n7\n19\n1\n11\n4\n116\n3\n92\n1\n66\n2\n41\n0\n29\n8\n139\n10\n65\n9\n35\n4\n17\n7\n11\n2\n10\n1\n9\n3\n9\n5\n8\n6\n8\n0\n3\n5\n159\n4\n43\n2\n34\n0\n24\n1\n23\n3\n13\n3\n57\n9\n44\n8\n35\n1\n31\n6\n30\n2\n24\n7\n24\n4\n20\n0\n12\n5\n8\n6\n50\n4\n41\n10\n36\n8\n34\n1\n22\n9\n22\n2\n10\n5\n10\n7\n8\n0\n4\n3\n4\n8\n48\n2\n35\n9\n34\n5\n29\n6\n22\n7\n21\n4\n15\n3\n13\n0\n12\n1\n11\n0\n36\n4\n32\n3\n29\n11\n24\n5\n21\n10\n20\n2\n18\n7\n14\n1\n11\n6\n11\n9\n10\n8\n8\n4\n42\n0\n31\n5\n29\n7\n25\n1\n22\n2\n22\n3\n17\n6\n16\n4\n29\n1\n25\n3\n21\n7\n20\n10\n18\n5\n18\n0\n17\n11\n14\n9\n11\n6\n9\n8\n7\n2\n5\n3\n91\n2\n45\n0\n38\n1\n15\n1\n37\n0\n31\n7\n28\n4\n21\n3\n19\n6\n16\n8\n16\n5\n8\n2\n4\n7\n35\n2\n25\n4\n25\n0\n23\n1\n21\n6\n20\n5\n17\n3\n6\n11\n24\n8\n23\n10\n22\n6\n19\n3\n17\n4\n12\n7\n10\n9\n10\n5\n9\n2\n6\n1\n4\n0\n2\n9\n36\n4\n25\n8\n21\n1\n19\n0\n17\n2\n10\n5\n8\n6\n8\n7\n7\n3\n4\n8\n25\n10\n24\n5\n19\n6\n15\n4\n13\n7\n11\n0\n9\n9\n9\n3\n4\n2\n3\n1\n2\n12\n16\n11\n14\n8\n12\n13\n11\n7\n10\n5\n9\n1\n8\n10\n8\n2\n7\n0\n6\n6\n6\n3\n4\n4\n3\n9\n3\n6\n40\n1\n22\n3\n16\n5\n15\n0\n4\n2\n4\n4\n4\n12\n55\n5\n41\n11\n29\n7\n29\n6\n21\n2\n20\n9\n17\n1\n16\n10\n16\n8\n12\n3\n10\n4\n8\n0\n7\n1\n53\n2\n29\n4\n28\n5\n24\n0\n17\n3\n13\n2\n44\n4\n42\n3\n21\n0\n6\n1\n3\n4\n18\n11\n11\n12\n11\n7\n10\n13\n9\n0\n8\n8\n8\n6\n7\n9\n7\n1\n6\n10\n6\n2\n6\n5\n6\n3\n3\n2\n77\n1\n51\n0\n11\n3\n113\n2\n28\n1\n12\n0\n6\n(d) 248 latent leaf topics from\nSupreme Court Cases\nFigure 3: Legal Documents from New Mexico hierarchically decomposed. The Constitution only had enough documents to\ndecompose the first depths, whereas the other three sources continued to the terminal depth of 2 (a hyper-parameter of\ndecomposition). Each H-cluster has a natural language label, where depth-0 from each can be seen in Tables 1, 2, 4, and 3.\nTable 5: Neo4j Node and Edge Overview\nNode Type\nNodes\nOut Edges\nLegal Cites\nNMFk Topics\n2,469\n92,634\n–\nNMFk Keyword\n11,076\n8,281,843\n–\nBOW Vocabulary\n132,423\n–\n–\nConstitution\n265\n9,067\n41\nStatute\n28,251\n1,930,707\n81,353\nSupreme Court Case\n5,727\n2,437,161\n76,478\nCourt of Appeals Case\n10,072\n4,176,288\n131,230\nTotal Unique\n190,283\n16,927,700\n289,102\nFigure 4: Examination of ‘Estoppel’ relating to being a key-\nword in topics, vs bag of word vocabulary\nare an expert legal document analyzer. Your job is to find all refer-\nences to the Constitution, Case Law, or Statutes in the text.\" The\nresult was that the LLM acted like a named entity extractor, such\nthat any citations in the text were pulled out in an enumerated list.\nThe citations mainly included the cases, statutes, and constitution\nof New Mexico but also had references to the United States Consti-\ntution, New Mexico Administrative Code, and New Mexico Rules\nAnnotated (NMRA). The NMRA had many references to Uniform\nJury instructions and the rules of criminal and civil proceedings.\nIn figure 4, the NMFk topic cluster keyword and a bag of word\nvocabulary were both queried for ‘estoppel.’ The NMFk keyword is\nDark blue, the topics are light blue, and the BOW node is brown.\nThree documents occur for this keyword: the statutes are green\nnodes, the Court of Appeals cases are yellow, and the Supreme\nCourt cases are orange. The constitution neither clustered over\nthe term nor mentions it, which is not represented in Figure 4.\nThere is a partition in the nodes at the brown bag of words node\nsince all nodes with the NMFk keyword have the bag of word node\nconnection. Still, not all documents mentioning ‘estoppel’ were\nclustered with the word, which is to say other terms and concepts\nfrom those terms had more importance for the documents on the left\nside of the image that ‘estoppel’. There are 14 topics, 441 Court of\nAppeals cases, 276 Supreme Court Cases, and 131 Statutes in Figure\n4. These topics have ‘estoppel’ in their top keywords, whereas\nif every topic that contained ‘estoppel’ in its words were called,\nthere would be 341 topics. Of the 14 topics, one was connected to\nthe Statutes, “Collection and recovery of liabilities made to board members with errors and\nomissions.\" Three of the 14 topics were connected to supreme court\ncases: “Employment Rights and Property Disputes in New Mexico Municipal Affairs\", “Public\nCorporation Property Taxation Matters and Disputes with Licensing Authorities\", “Drilling and Gas\nAgreement Terms Regarding Oil Wells.\" Finally, the remain 10 of the 14 topics\nwith ‘estoppel’ in its top words were connected to cases from the\nCourt of Appeals: \"Litigation outcomes and jurisdictional limitations\", \"Administrative\nLicense Revocation Proceedings by Division Officers\", \"Legal Proceedings and Litigation Issues in a\nMedical Context\", \"Corporate Governance and Financial Management Matters\", \"Dispute Resolution\nProcess for Agricultural Property Transactions\", \"Motor Vehicle Administrative License Actions\",\n\"Insanity Defense Expert Witness Testimony\", \"Malpractice claim within time constraints\", \"Employer\nLiability for Federal Disability Claims Against Administration Agencies\", \"Criminal offenses and\ndoctrine involve multiple types of larceny charges\", \"Collection and recovery of liabilities made to\nboard members with errors and omissions\", \"Public Corporation Property Taxation Matters and\nDisputes with Licensing Authorities\", \"Employment Rights and Property Disputes in New Mexico\nMunicipal Affairs\", \"Drilling and Gas Agreement Terms Regarding Oil Wells.\"\n4.4\nQuery Cross Comparison\nQuestions were formulated to query information about legal con-\ncepts from LLM channels. There were five questions from each\n\n\nBridging Legal Knowledge and AI:\nRetrieval-Augmented Generation with Vector Stores, Knowledge Graphs, and Hierarchical Non-negative Matrix Factorization\nICAIL 2025, June 16–20, 2024, Chicago, IL, USA\nGPT-4,API\nGEMINI,CHAT\nNEMOTRON-fp16,API\nGPT-4,ChatGPT\nSMART-SLIC\nGPT-4,API\nGEMINI,CHAT\nNEMOTRON-fp16,API\nGPT-4,ChatGPT\nSMART-SLIC\n0%\n20%\n40%\n60%\n80%\n100%\nPercentage (%)\nAttempted\nAccuracy\nLegend\nAtt.-GPT-4,API\nAtt.-GEMINI,CHAT\nAtt.-NEMOTRON-fp16,API\nAtt.-GPT-4,ChatGPT\nAtt.-SMART-SLIC\nAcc.-GPT-4,API\nAcc.-GEMINI,CHAT\nAcc.-NEMOTRON-fp16,API\nAcc.-GPT-4,ChatGPT\nAcc.-SMART-SLIC\nFigure 5: 25 questions queried across five different LLM chan-\nnels. Attempts are the percentage of responses tried to an-\nswer the question, and accuracy is the percentage of those\nanswered with correct responses.\ndata source: the constitutional provisions, the Statutes, the Court\nof Appeals, and the Supreme Court. Then, five additional quan-\ntity questions were added. The results can be seen in Figure 5,\nwhere the five different models were OpenAi’s GPT-4 [39] over the\nAPI, Google’s Gemini [6] over a web chat, Nvidia’s nemotron:70b-\ninstruct with 8-bit quantization [38], OpenAi’s GPT-4 [39] over a\nweb chat, and finally our system for this work, Smart-SLIC. Ques-\ntions related to the Constitution appear generally answerable by the\nlanguage models, likely due to its structured and concise wording.\nAnswering legal questions becomes increasingly challenging\nwith larger datasets, especially case law, which was the most diffi-\ncult. Unlike statutes, where hierarchical structures are more straight-\nforward for LLMs to train and summarize, case law is unstructured,\nlengthy texts that are more challenging to summarize. Constitu-\ntional questions were relatively simple, though many models men-\ntioned articles rather than sections, citing frequent changes in how\nsections are enumerated. Our evaluation procedure assigns zero\nif the model refuses to answer and if any attempt to respond was\nmade. Accuracy then ranges from 0 to 3: a correct or nearly correct\nanswer receives 3, primarily correct but partially misunderstood\nresponses receive 2, mostly incorrect yet partially true answers\nreceive 1, and responses entirely wrong or hallucinations get 0.\nSome models were given points when they produced close numeric\nestimates, even if derived through flawed “database lookups.” In\ncontrast, our system provides traceable reasoning by referencing\nthe KG and analyzing the decomposed hierarchical structure of the\ntexts themselves.\nThe following are comparisons between each of the models with\nformatting and truncations (as ...) so the text is more readable:\n(a) Comparison 1 - Quantities:\n• Question: “How many New Mexico Supreme Court cases mention ‘Habeas\nCorpus’?”\n• GPT-4,API: I don’t have the ability to provide real-time or exact counts of\nSupreme Court cases mentioning \"habeas corpus\" up to the current date...\n• GPT-4o,ChatGPT: Determining the exact number of New Mexico Supreme\nCourt cases that mention ’habeas corpus’ is challenging due to the extensive\nhistory of the court’s decisions and the limitations of available databases...\n• Smart-Slic: There are 215 Supreme Court cases that mention ’Habeas Corpus.’\n• Gemini: The exact number of Supreme Court cases that mention \"Habeas\nCorpus\" is difficult to determine precisely. Here’s why: - Vast Number of Cases:\n... - Varied Mention: ... - No Centralized Database: ...\n• nemotron:70b-instruct-q8_0: I’ll outline my research methodology and then\nshare the results. Research Methodology: 1. Database Selection: ... 2. Search\nParameters: ... 3. Search Approach: ... After conducting thorough searches\nacross the selected databases: Approximate Number of Cases Mentioning\n’Habeas Corpus’: Over 1,300 ... Breakdown ...: * Pre-1950: ... 450 ... * 1950-2000:\n... 550 ... * 2001-Present: ... 300 ...\nThe responses highlight significant differences in model abilities.\nGPT-4 API and ChatGPT provided an understanding of their limits\nto offer real-time or exact counts due to limitations such as access\nto historical databases or the complexity of case records. Gemini\nfollowed a similar pattern, explaining why determining a precise\nnumber is challenging. In contrast, our system directly reported a\nspecific count, stating 215 cases mentioning ’Habeas Corpus,’ show-\ning its ability to process and retrieve meaningful data. Meanwhile,\nnemotron:70b-instruct-q8_0 provided a detailed method to find the\ncorrect answer in an open context. It even went into breaking the\ncount into approximate ranges across different periods, suggesting\nover 1,300 cases in total. However, these counts from Nemotron\nare part of an extreme hallucination since it was an offline model\nwithout the ability to make any lookups.\n(b) Comparison 2 - Legal Citations:\n• Question: “What are common citations among New Mexico Court of Appeals\ncases that mention ‘malpractice’?”\n• GPT-4,API: I don’t have direct access to specific databases or the ability to\nbrowse the internet.\n• GPT-4o,ChatGPT: In New Mexico Court of Appeals cases addressing malprac-\ntice, several key legal principles and precedents are frequently cited: Elements\nof Legal Malpractice: ... Mireles v. Broderick, 1992 ... Statute of Limitations:\n... Sharts v. Natelson, 1994 ... Expert Testimony Requirement: ... Rummell v.\nEdgemont Realty Partners ... 1993 ... Causation and \"Case Within a Case\"\nDoctrine: ... Garcia v. Rodey, Dickason, Sloan, Akin & Robb ... 1988 ... Damages:\n... Sanders, Bruin, Coll & Worley ... 2010 ...\n• Smart-Slic: The common citations among New Mexico Court of Appeals cases\nthat mention ’malpractice’ include NMSA 41-5-1 with 36 cases, NMSA 41-5-13\nwith 35 cases, NMSA 41-4-1 with 23 cases, CERVANTES v FORBIS 1964 with 18\ncases, NMSA 37-1-8 with 15 cases, NMSA 41-5-3 and NMSA 41-5-15 each with\n14 cases, NMSA 41-5-6 with 13 cases, GOODMAN v BROCK 1972 with 12 cases,\nand NMSA 41-5-22 with 10 cases.\n• Gemini: Common citations in New Mexico Court of Appeals cases men-\ntioning \"malpractice\" often include: - Leyba v. Whitley...1995... - Rancho del\nv. Weisfeld...1995... Bassett v. Sheehan, Sheehan & Stelzner...2008... Akutagawa v.\nLaflin, Pick & Heer...2005...\n• nemotron:70b-instruct-q8_0: Steps to Find Common Citations: 1. Access\nLegal Databases: ... 2. Construct Your Search Query: ... 3. Filter Results (if\npossible): ... 4. Analyze Top Cases for Citations: ... Please note, the following\nare hypothetical examples... 1. Cases: - Hypothetical Example 1: Smith v.\nJones, 2010 ... - Hypothetical Example 2: Doe v. Healthcare Inc., 2015 ... 2.\nStatutes or Regulations: - ... NMSA 1978, Section 41-5-1 ... - NMSA 1978, §\n41-4-11 to 41-4-17 ... 3. Court Rules: - ... NMRCvP, Rule 1-026 ... - ... NMRE,\nRule 702 ...\nGPT-4 API again opted not to answer, stating that it did not have\naccess to specific databases or the ability to browse legal records.\nGPT-4o (ChatGPT), on the other hand, offered an insightful sum-\nmary of key legal principles and precedents frequently cited in\nmalpractice cases, naming specific examples like Mireles v. Broder-\nick (1992) and Garcia v. Rodey (1988). This response demonstrated\ndomain awareness but was missing particular detail.\nIn contrast, our system delivered a detailed list of the most com-\nmon citations, including exact counts for specific statutes and cases,\nsuch as NMSA 41-5-1 cited in 36 cases and CERVANTES v FORBIS\n(1964) cited in 18 cases. Our system’s response is specific and direct,\nallowing for faster and more reasoned legal research. Meanwhile,\nGemini offered a mix of case-specific citations, similar to GPT-4o,\nbut with limited depth and no accompanying counts, which made\nthe response less precise.\nFinally, nemotron:70b-instruct-q8_0 outlined a hypothetical strat-\negy to find citations, including steps like accessing legal databases\n\n\nICAIL 2025, June 16–20, 2024, Chicago, IL, USA\nBarron et al.\nand filtering results. However, the examples provided, such as\n\"Smith v. Jones, 2010,\" were explicitly hypothetical, undermining the\ncredibility of the response. Additionally, nemotron’s inclusion of\nactual statutes like NMSA 41-5-1 blurred the line between hypothet-\nical examples and genuine analysis, leading to potential confusion.\nThis comparison highlights the strengths and weaknesses of each\nsystem: some models are better at summarizing legal principles,\nsuch as GPT-4o and Gemini, while our System shows the capability\nfor precise data retrieval and analysis. Nemotron, despite its detailed\nmethodology, suffered most from hallucinations.\nCorpus\nChunking\nTopics\nTopic \n Chunking\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\nMean Reciprocal Rank (MRR)\n0.56\n0.56\n0.78\n0.78\nConstitution\nCorpus\nChunking\nTopics\nTopic \n Chunking\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0.52\n0.48\n0.73\n0.70\nStatutes\nCorpus\nChunking\nTopics\nTopic \n Chunking\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\nMean Reciprocal Rank (MRR)\n0.19\n0.28\n0.51\n0.65\nCourt of Appeals\nCorpus\nChunking\nTopics\nTopic \n Chunking\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0.29\n0.32\n0.62\n0.62\nSupreme Court\n0\n20\n40\n60\n80\n100\n84.9\n84.5\n97.0\n96.6\n0\n20\n40\n60\n80\n100\nTop 10 Inclusion (%)\n74.0\n70.0\n94.0\n94.0\n0\n20\n40\n60\n80\n100\n29.3\n43.7\n75.5\n84.0\n0\n20\n40\n60\n80\n100\nTop 10 Inclusion (%)\n42.2\n49.7\n85.1\n87.4\nFigure 6: MRR and top 10 hit rate percentage per data cate-\ngory over several embedding methods.\n4.5\nQuestion Answering\nTo evaluate the effectiveness of our QA SLIC-SMART system, we\nconducted a series of experiments focusing on various performance\nmetrics. Figure 6 shows various retrieval methods from the em-\nbedding space. The four data sources are treated separately for\ncomparison. Each data source uses four separate methods to embed\nthe data. The first is the entire corpus of each, where all documents\nare put into a single vector store. Where the text was short and\nstructured, this had top 10 retrieval percentages more significant\nthan 70 to 80%, such as the statutes and constitutional provisions.\nThe cases had less structure and longer text, making the plain\nembedding challenging. Next is the chunking method, where the\nentire dataset is again placed into a single dataset but chunked\nat 3000 characters with 500 overlapping. The top row, with more\nconcise and structured concepts, decreased slightly in performance,\nwhereas the cases significantly improved. This is likely because the\nconcepts are broken down across multiple texts instead of being in\none coherent text to query. Still, with the decrease, the structured\ntexts outperformed the cases by more than 20%. Third, the NMFk\nhierarchical cases are incorporated into the vector store process,\nwhere each topic has an individual vector store. The topics per\nquery were controlled such that the query was searched in the vec-\ntor store corresponding to the question origin. Topic identification\nin the vector store is an outstanding problem for future work. When\nthe NMFk hierarchical topics were introduced, the performance\nsignificantly improved across all data sources, with the most sig-\nnificant gains in the longer case texts. When the chunking process\nwas incrementally added on top of the NMFk topics, the cases still\nimproved, again likely to break up much larger texts into more\nmeaningful segments of the texts. In contrast, the structured texts\nin the constitutional provisions and the statutes slightly decreased\nperformance, likely attributed to the splitting of concepts in the\nquestions across several chunks. Still, NMFk topics with chunk-\ning and correct topic identification outperform the other methods\noverall.\n4.5.1\nCase Studies. To illustrate the practical applications and ef-\nfectiveness of the QA Smart-Slic system, we present four detailed\ncase studies:\n(a) Case Study 1 - Constitutional Analysis:\n• Question Source: Article IV, Section 22 [1]\n• Question: “What happens to a bill if the governor neither returns it within\nthe specified three-day window (Sundays excepted) nor signs it?”\n• Response: According to Article IV - Legislative Department – § 22 \"Governor’s\napproval or veto of bills\" of the provided text, if a bill is presented to the gover-\nnor and he neither returns it within the specified three-day window (Sundays\nexcepted) nor signs it, then the bill becomes a law automatically, whether signed\nby him or not, unless the legislature by adjournment prevents such return.\n(b) Case Study 2 - Statutory Analysis:\n• Question Source: Chapter 50, Article 17, Section 3 [4]\n• Question: “Under the Healthy Workplaces Act, how does an employee accrue\nand utilize earned sick leave, and what provisions exist for its carryover,\nuse for family or personal health, and reinstatement after separation from\nemployment?”\n• Response: Accrue: Employees accrue a minimum of one hour of earned sick\nleave for every thirty hours worked. Employers may elect to provide the full\nsixty-four hours of earned sick leave for the year on January 1 or pro-rata for\nmid-year hires.\nUse: Earned sick leave can be used for the employee’s or their family members’\nillness, injury, health condition, medical care, or preventive medical care. It can\nalso be used for issues related to domestic abuse, sexual assault, or stalking.\nCarryover: Unused earned sick leave carries over year to year, although use\nmay be capped at 64 hours per twelve-month period, unless the employer sets a\nhigher cap.\nReinstatement: If an employee is rehired within twelve months of separation\nby the same employer, previously accrued and unused earned sick leave must be\nreinstated. Additionally, the employee is entitled to accrue additional sick leave\nupon re-commencement of employment.\n(c) Case Study 3 - Court of Appeals Case Law Analysis:\n• Question Source: KRM, Inc. v. Caviness, 1996 [3]\n• Question: “In the case KRM, Inc. v. Caviness, what was the court’s reasoning\nfor determining that the water rights established by Williams’ 1963 declaration\ndid not belong to the land sold to Caviness?”\n• Response: The court determined that the water rights established by Williams’\n1963 declaration were not appurtenant to the land sold to Caviness because there\nwas no evidence that the water had been used for irrigation on that land. Since\nthe appropriated water was never used for irrigation purposes on the property, it\ndid not qualify as appurtenant water rights that would automatically transfer\nwith the land. The court concluded because the usage of the water was unrelated\nto the benefit or use of the land itself, the water rights remained separate and\ndid not pass to Caviness when he purchased the land.\n(d) Case Study 4 - Supreme Court Case Law Analysis:\n• Question Source: Smith v. South, 1955 [2]\n• Question: “In Smith v. South, what were the legal issues raised regarding\nthe enforceability of the Washington child support decree in New Mexico,\nand how did the court address the conflict between the parties’ post-decree\nagreement and the original judgment?”\n• Response: The legal issues raised in Smith v. South regarding the enforceability\nof the Washington child support decree in New Mexico included whether New\nMexico courts should acknowledge and enforce the original Washington decree\nfor child support or consider the modifications reportedly agreed upon by the\nparties after the decree. The conflict between the parties’ post-decree agreement\nand the original judgment involved assertions that they had informally agreed\nto alter the child support payments stipulated by the Washington court.\n\n\nBridging Legal Knowledge and AI:\nRetrieval-Augmented Generation with Vector Stores, Knowledge Graphs, and Hierarchical Non-negative Matrix Factorization\nICAIL 2025, June 16–20, 2024, Chicago, IL, USA\nThe court addressed this issue by considering the jurisdictional and legal princi-\nples guiding child support enforcement across state lines. They emphasized the\nimportance of adhering to the formal judicial process. The court likely examined\nwhether the post-decree modifications had been legally formalized or approved\nby any court, and whether such modifications complied with the relevant child\nsupport enforcement laws, particularly under the Uniform Interstate Family\nSupport Act (UIFSA), though it wasn’t explicitly mentioned in the text snippet.\nUIFSA provides mechanisms for establishing, enforcing, and modifying child\nsupport orders across state boundaries.\nIf the modifications were not legally recognized through a court process, the\noriginal Washington decree would remain enforceable in New Mexico, and any\ninformal or unratified agreements between the parties would not typically alter\nthe enforceability of the court-ordered decree. The court would focus on ensuring\nthat child support arrangements comply with legal standards to serve the chil-\ndren’s best interests and that enforcement respects the authority of the original\njurisdiction (Washington) unless properly modified through legal channels.\n5\nCONCLUSION\nThis work introduced Smart-Slic, a generative AI framework tai-\nlored to the legal domain, leveraging RAG, vector stores, and a\nNeo4j-based knowledge graph constructed through NMFk. Our\napproach uses T-ELF with metadata and chunking strategies to\ncapture fine-grained H-clusters and minimize hallucinations to\nimprove reliability. By bridging structured and unstructured data–\nspanning constitutional provisions, statutes, and case law–, our\nsystem supports advanced semantic reasoning and dimensionally\nreduced insight into the latent structure of legal texts.\nExperimental results across multiple retrieval strategies show\nthat chunking, combined with hierarchical NMFk, improves accu-\nracy, particularly for large, unstructured case law datasets. Short,\nhighly structured documents, constitutional provisions, and statute\nsections benefit from minimal chunking, revealing the importance\nof aligning preprocessing approaches with data characteristics. We\ndemonstrated the framework’s capability to derive interpretive\nlegal topics and precisely answer domain-specific queries by har-\nnessing topically segmented embeddings and explicit links within\nthe knowledge graph.\nDespite the positive results, challenges remain. Author attribu-\ntion in networks is incomplete, limiting the knowledge graph’s\npotential for thorough precedent tracing and interlinking. Includ-\ning additional datasets—such as administrative codes and judicial\nrules—would provide richer context and increase the system’s cover-\nage of a functioning state government. Moreover, systematically rec-\nonciling informal post-decree agreements with formal judgments\nis needed to model a more acute legal flow.\nThis framework marks a step forward in computational law\nand legal AI, demonstrating a scalable, interpretable method for\ndiscovering, retrieving, and reasoning over complex legal corpora.\nCombining semantic embeddings, latent topic modeling, and knowl-\nedge graphs contributes to more robust, data-driven legal research\npathways. Future directions include refining the citation extraction\npipeline, expanding the collection to encompass broader legal in-\nstruments, and applying advanced LLM-driven reasoning for deeper\nprecedent analysis and trend prediction.\nACKNOWLEDGMENTS\nThis research was funded by the U.S. Department of Energy Na-\ntional Nuclear Security Administration’s Office of Defense Nuclear\nNonproliferation Research and Development (DNN R&D), sup-\nported by the U.S. DOE NNSA under Contract No. 89233218CNA000001,\nas well as by the LANL Institutional Computing Program.\nREFERENCES\n[1] 1953. New Mexico Constitution, Article IV, Section 22. https://law.justia.com/\nconstitution/new-mexico/article-iv/section-22/ Governor’s approval or veto of\nbills. Amended September 15, 1953..\n[2] 1955. Smith v. South. Remanded with instructions to make findings of fact and\nconclusions of law on default issues..\n[3] 1996. KRM, Inc. v. Caviness. Reversed and remanded for further proceedings..\n[4] 2021. Employment Law – Healthy Workplaces – Earned Sick Leave; Use and\nAccrual. Effective July 1, 2022.\n[5] n.d.. Justia: Free Law and Legal Information. https://www.justia.com Accessed:\n2025-01-07.\n[6] Google AI. 2023. Gemini: Google’s Generative AI Model. https://ai.google/.\nAccessed: 2025-01-26.\n[7] Boian S Alexandrov, Ludmil B Alexandrov, Filip L Iliev, Valentin G Stanev, and\nVelimir V Vesselinov. 2020. Source identification by non-negative matrix factor-\nization combined with semi-supervised clustering. US Patent 10,776,718.\n[8] Kevin D. Ashley. 2017. Artificial Intelligence and Legal Analytics: New Tools for\nLaw Practice in the Digital Age. Cambridge University Press, Cambridge, UK.\nhttps://doi.org/10.1017/9781316761380\n[9] Ryan C. Barron, Ves Grantcharov, Selma Wanna, Maksim E. Eren, Manish Bhat-\ntarai, Nicholas Solovyev, George Tompkins, Charles Nicholas, Kim Ø. Rasmussen,\nCynthia Matuszek, and Boian S. Alexandrov. 2024. Domain-Specific Retrieval-\nAugmented Generation Using Vector Stores, Knowledge Graphs, and Tensor\nFactorization. arXiv:2410.02721 [cs.CL] https://arxiv.org/abs/2410.02721\n[10] Iz Beltagy, Matthew E. Peters, and Arman Cohan. 2020. Longformer: The Long-\nDocument Transformer. arXiv:2004.05150 [cs.CL] https://arxiv.org/abs/2004.\n05150\n[11] Sheng Bi, Zafar Ali, Meng Wang, Tianxing Wu, and Guilin Qi. 2022. Learning het-\nerogeneous graph embedding for Chinese legal document similarity. Knowledge-\nBased Systems 250 (2022), 109046. https://doi.org/10.1016/j.knosys.2022.109046\n[12] Shivangi Bithel and Sumitra S Malagi. 2021. Unsupervised Identification of Rele-\nvant Prior Cases. In Proceedings of the 18th International Conference on Artificial\nIntelligence and Law. ACM, 10–19.\n[13] Tom Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared D Kaplan,\nPrafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda\nAskell, Sandhini Agarwal, Ariel Herbert-Voss, Gretchen Krueger, Tom Henighan,\nRewon Child, Aditya Ramesh, Daniel Ziegler, Jeffrey Wu, Clemens Winter,\nChris Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin\nChess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya\nSutskever, and Dario Amodei. 2020. Language Models are Few-Shot Learners.\nIn Advances in Neural Information Processing Systems, H. Larochelle, M. Ran-\nzato, R. Hadsell, M.F. Balcan, and H. Lin (Eds.), Vol. 33. Curran Associates,\nInc., 1877–1901.\nhttps://proceedings.neurips.cc/paper_files/paper\\\\/2020/file/\n1457c0d6bfcb4967418bfb8ac142f64a-Paper.pdf\n[14] Ryan Budahazy, Lu Cheng, Yihuan Huang, Andrew Johnson, Pengyu Li, Joshua\nVendrow, Zhoutong Wu, Denali Molitor, Elizaveta Rebrova, and Deanna Needell.\n2021. Analysis of Legal Documents via Non-negative Matrix Factorization Meth-\nods. ArXiv abs/2104.14028 (2021).\nhttps://api.semanticscholar.org/CorpusID:\n233444252\n[15] Pompeu Casanovas Romeu, Daniel Schwabe, and Carlos Laufer. 2021. Knowledge\nGraphs: Trust, Privacy, and Transparency from a Legal Governance Approach.\n37, 1 (Aug. 2021), 24–41. https://doi.org/10.26826/law-in-context.v37i1.136 A.\nDaniel Schwabe was partially supported by a grant from CNPq. The present\nwork by Pompeu Casanovas has been carried out for the EU H2020 Programme\nLYNX, Legal Knowledge Graph for Multilingual Compliance Services..\n[16] Ilias Chalkidis, Ion Androutsopoulos, and Nikolaos Aletras. 2019. Neural Legal\nJudgment Prediction in English. In Proceedings of the 57th Annual Meeting of the\nAssociation for Computational Linguistics, Anna Korhonen, David Traum, and\nLluís Màrquez (Eds.). Association for Computational Linguistics, Florence, Italy,\n4317–4323. https://doi.org/10.18653/v1/P19-1424\n[17] Ilias Chalkidis, Manos Fergadiotis, Prodromos Malakasiotis, Nikolaos Aletras,\nand Ion Androutsopoulos. 2020. LEGAL-BERT: The Muppets straight out of\nLaw School. In Findings of the Association for Computational Linguistics: EMNLP\n2020, Trevor Cohn, Yulan He, and Yang Liu (Eds.). Association for Computational\nLinguistics, Online, 2898–2904. https://doi.org/10.18653/v1/2020.findings-emnlp.\n261\n[18] Ilias Chalkidis, Abhik Jana, Dirk Hartung, Michael Bommarito, Ion Androut-\nsopoulos, Daniel Katz, and Nikolaos Aletras. 2022. LexGLUE: A Benchmark\nDataset for Legal Language Understanding in English. In Proceedings of the\n60th Annual Meeting of the Association for Computational Linguistics (Volume\n1: Long Papers), Smaranda Muresan, Preslav Nakov, and Aline Villavicencio\n(Eds.). Association for Computational Linguistics, Dublin, Ireland, 4310–4330.\n\n\nICAIL 2025, June 16–20, 2024, Chicago, IL, USA\nBarron et al.\nhttps://doi.org/10.18653/v1/2022.acl-long.297\n[19] Ilias Chalkidis, Vasiliki Koukoulioti, and Nikolaos Aletras. 2021. Paragraph-level\nrationalization of legal judgments using reinforcement learning. In Proceedings\nof the 2021 Conference of the North American Chapter of the Association for Com-\nputational Linguistics: Human Language Technologies (NAACL-HLT). 1081–1090.\n[20] Arman Cohan, Sergey Feldman, Iz Beltagy, Doug Downey, and Daniel Weld. 2020.\nSPECTER: Document-level Representation Learning using Citation-informed\nTransformers. In Proceedings of the 58th Annual Meeting of the Association for\nComputational Linguistics, Dan Jurafsky, Joyce Chai, Natalie Schluter, and Joel\nTetreault (Eds.). Association for Computational Linguistics, Online, 2270–2282.\nhttps://doi.org/10.18653/v1/2020.acl-main.207\n[21] Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT:\nPre-training of Deep Bidirectional Transformers for Language Understanding. In\nNorth American Chapter of the Association for Computational Linguistics. https:\n//api.semanticscholar.org/CorpusID:52967399\n[22] Jaspreet Singh Dhani, Ruchika Bhatt, Balaji Ganesan, Parikshet Sirohi, and Va-\nsudha Bhatnagar. 2024. Similar Cases Recommendation using Legal Knowledge\nGraphs. arXiv:2107.04771 [cs.AI] https://arxiv.org/abs/2107.04771\n[23] Biao Dong, Haoze Yu, and Haisheng Li. 2021. A Knowledge Graph Construction\nApproach for Legal Domain. Tehnicki vjesnik - Technical Gazette (2021). https:\n//api.semanticscholar.org/CorpusID:235719041\n[24] Maksim Eren, Nick Solovyev, Ryan Barron, Manish Bhattarai, Duc Truong, Ismael\nBoureima, Erik Skau, Kim Ø. Rasmussen, and Boian Alexandrov. 2023. Tensor\nExtraction of Latent Features (T-ELF). https://doi.org/10.5281/zenodo.10257897\n[25] Shangbin Feng, Zhaoxuan Tan, Wenqian Zhang, Zhenyu Lei, and Yulia Tsvetkov.\n2023. KALM: Knowledge-Aware Integration of Local, Document, and Global\nContexts for Long Document Understanding. https://openreview.net/forum?id=\nNxPQ3QOGTWl\n[26] Kelvin Guu, Kenton Lee, Zora Tung, Panupong Pasupat, and Ming-Wei Chang.\n2020. REALM: retrieval-augmented language model pre-training. In Proceedings\nof the 37th International Conference on Machine Learning (ICML’20). JMLR.org,\nArticle 368, 10 pages.\n[27] Patrik O. Hoyer. 2004. Non-negative Matrix Factorization with Sparseness Con-\nstraints. J. Mach. Learn. Res. 5 (Dec. 2004), 1457–1469.\n[28] Zhiqi Huang, Shahrzad Naseri, Hamed Bonab, Sheikh Muhammad Sarwar, and\nJames Allan. 2023. Hierarchical Transformer-based Query by Multiple Docu-\nments. In Proceedings of the 2023 ACM SIGIR International Conference on Theory of\nInformation Retrieval (Taipei, Taiwan) (ICTIR ’23). Association for Computing Ma-\nchinery, New York, NY, USA, 105–115. https://doi.org/10.1145/3578337.3605130\n[29] Gautier Izacard and Edouard Grave. 2021. Leveraging Passage Retrieval with\nGenerative Models for Open Domain Question Answering. In Proceedings of the\n16th Conference of the European Chapter of the Association for Computational\nLinguistics: Main Volume, Paola Merlo, Jorg Tiedemann, and Reut Tsarfaty (Eds.).\nAssociation for Computational Linguistics, Online, 874–880. https://doi.org/10.\n18653/v1/2021.eacl-main.74\n[30] Ziwei Ji, Nayeon Lee, Jason Fries, Tenghao Yu, Etsuko Ishii, Yejin Bang, and\nZhiting Xia. 2023. A Survey on Hallucination in Natural Language Generation.\narXiv preprint arXiv:2305.15021 (2023).\n[31] Vladimir Karpukhin, Barlas Oguz, Sewon Min, Patrick Lewis, Ledell Wu, Sergey\nEdunov, Danqi Chen, and Wen-tau Yih. 2020. Dense Passage Retrieval for Open-\nDomain Question Answering. In Proceedings of the 2020 Conference on Empirical\nMethods in Natural Language Processing (EMNLP), Bonnie Webber, Trevor Cohn,\nYulan He, and Yang Liu (Eds.). Association for Computational Linguistics, Online,\n6769–6781. https://doi.org/10.18653/v1/2020.emnlp-main.550\n[32] Tiziano Labruna, Jon Ander Campos, and Gorka Azkune. 2024. When to Retrieve:\nTeaching LLMs to Utilize Information Retrieval Effectively. ArXiv abs/2404.19705\n(2024). https://api.semanticscholar.org/CorpusID:269457164\n[33] Daniel D. Lee and H. Sebastian Seung. 2000. Algorithms for non-negative matrix\nfactorization. In Proceedings of the 14th International Conference on Neural Infor-\nmation Processing Systems (Denver, CO) (NIPS’00). MIT Press, Cambridge, MA,\nUSA, 535–541.\n[34] Patrick Lewis, Ethan Perez, Aleksandra Piktus, Fabio Petroni, Vladimir Karpukhin,\nNaman Goyal, Heinrich Küttler, Mike Lewis, Wen-tau Yih, Tim Rocktäschel,\nSebastian Riedel, and Douwe Kiela. 2020. Retrieval-augmented generation for\nknowledge-intensive NLP tasks. In Proceedings of the 34th International Conference\non Neural Information Processing Systems (Vancouver, BC, Canada) (NIPS ’20).\nCurran Associates Inc., Red Hook, NY, USA, Article 793, 16 pages.\n[35] Pengyu Li, Christine Tseng, Yaxuan Zheng, Joyce A. Chew, Longxiu Huang,\nBenjamin Jarman, and Deanna Needell. 2022. Guided Semi-Supervised Non-\nnegative Matrix Factorization on Legal Documents. ArXiv abs/2201.13324 (2022).\nhttps://api.semanticscholar.org/CorpusID:248328863\n[36] Yixiao Ma, Yunqiu Shao, Yueyue Wu, Yiqun Liu, Ruizhe Zhang, Min Zhang,\nand Shaoping Ma. 2021. LeCaRD: A Legal Case Retrieval Dataset for Chinese\nLaw System. In Proceedings of the 44th International ACM SIGIR Conference on\nResearch and Development in Information Retrieval (Virtual Event, Canada) (SIGIR\n’21). Association for Computing Machinery, New York, NY, USA, 2342–2348.\nhttps://doi.org/10.1145/3404835.3463250\n[37] Neo4j, Inc. 2023. Neo4j: The #1 Platform for Connected Data. https://neo4j.com/.\n[38] NVIDIA. 2023. NeMoTron-70B Instruct: NVIDIA’s Generative AI Model. https:\n//build.nvidia.com/nvidia/llama-3_1-nemotron-70b-instruct. Accessed: 2025-01-\n26.\n[39] OpenAI. 2023. GPT-4: OpenAI’s Language Model. https://openai.com/research/\ngpt-4. Accessed: 2025-01-26.\n[40] OpenAI. 2024. OpenAI API. https://www.openai.com/api/ Accessed: 2025-01-08.\n[41] Malte Ostendorff, Nils Rethmeier, Isabelle Augenstein, Bela Gipp, and Georg\nRehm. 2022. Neighborhood Contrastive Learning for Scientific Document Repre-\nsentations with Citation Embeddings. In Proceedings of the 2022 Conference on Em-\npirical Methods in Natural Language Processing, Yoav Goldberg, Zornitsa Kozareva,\nand Yue Zhang (Eds.). Association for Computational Linguistics, Abu Dhabi,\nUnited Arab Emirates, 11670–11688. https://doi.org/10.18653/v1/2022.emnlp-\nmain.802\n[42] Nicholas Pipitone and Ghita Houir Alami. 2024.\nLegalBench-RAG: A\nBenchmark for Retrieval-Augmented Generation in the Legal Domain.\narXiv:2408.10343 [cs.AI] https://arxiv.org/abs/2408.10343\n[43] Juliano Rabelo, Randy Goebel, Mi-Young Kim, Yoshinobu Kano, Masaharu Yosh-\nioka, and Ken Satoh. 2022. Overview and Discussion of the Competition on Legal\nInformation Extraction/Entailment (COLIEE) 2021. The Review of Socionetwork\nStrategies 16, 1 (April 2022), 111–133. https://doi.org/10.1007/s12626-022-00105-z\n[44] Alec Radford and Karthik Narasimhan. 2018. Improving Language Understanding\nby Generative Pre-Training. https://api.semanticscholar.org/CorpusID:49313245\n[45] Livio Robaldo, Guido Boella, and Leendert van der Torre. 2020. A neural approach\nto automated legal case matching. Artificial Intelligence and Law 28, 1, 65–81.\n[46] Francesco Sovrano, Monica Palmirani, and Fabio Vitali. 2020. Legal Knowledge Ex-\ntraction for Knowledge Graph Based Question-Answering. In International Con-\nference on Legal Knowledge and Information Systems. https://api.semanticscholar.\norg/CorpusID:229377581\n[47] Jianguo Wang, Xiaomeng Yi, Rentong Guo, Hai Jin, Peng Xu, Shengjun Li, Xi-\nangyu Wang, Xiangzhou Guo, Chengming Li, Xiaohai Xu, et al. 2021. Milvus:\nA Purpose-Built Vector Data Management System. In Proceedings of the 2021\nInternational Conference on Management of Data. 2614–2627.\n[48] Xuran Wang, Xinguang Zhang, Vanessa Hoo, Zhouhang Shao, and Xuguang\nZhang. 2024. LegalReasoner: A Multi-Stage Framework for Legal Judgment\nPrediction via Large Language Models and Knowledge Integration. IEEE Access\nPP (01 2024), 1–1. https://doi.org/10.1109/ACCESS.2024.3496666\n[49] Selma Wanna, Nicholas Solovyev, Ryan Barron, Maksim E. Eren, Manish Bhat-\ntarai, Kim Ø. Rasmussen, and Boian S. Alexandrov. 2024. TopicTag: Automatic\nAnnotation of NMF Topic Models Using Chain of Thought and Prompt Tuning\nwith LLMs. In Proceedings of the ACM Symposium on Document Engineering 2024\n(San Jose, CA, USA) (DocEng ’24). Association for Computing Machinery, New\nYork, NY, USA, Article 8, 4 pages. https://doi.org/10.1145/3685650.3685667\n[50] Hannes Westermann, Jaromir Savelka, Vern R Walker, Kevin D Ashley, and Karim\nBenyekhlef. 2021. Computer-Assisted Creation of Boolean Search Rules for Text\nClassification in the Legal Domain. arXiv preprint arXiv:2112.05807 (2021).\n[51] Nirmalie Wiratunga, Ramitha Abeyratne, Lasal Jayawardena, Kyle Martin, Stew-\nart Massie, Ikechukwu Nkisi-Orji, Ruvan Weerasinghe, Anne Liret, and Bruno\nFleisch. 2024. CBR-RAG: Case-Based Reasoning for Retrieval Augmented Gener-\nation in LLMs for Legal Question Answering. In Case-Based Reasoning Research\nand Development, Juan A. Recio-Garcia, Mauricio G. Orozco-del Castillo, and\nDerek Bridge (Eds.). Springer Nature Switzerland, Cham, 445–460.\n[52] Jie Zhou, Xin Chen, Hang Zhang, and Zhe Li. 2024. Automatic Knowledge Graph\nConstruction for Judicial Cases. arXiv:2404.09416 [cs.CL] https://arxiv.org/abs/\n2404.09416\n[53] Junlin Zhu, Xudong Luo, and Jiaye Wu. 2022. A BERT-Based Two-Stage Ranking\nMethod for Legal Case Retrieval. In Knowledge Science, Engineering and Manage-\nment, Gerard Memmi, Baijian Yang, Linghe Kong, Tianwei Zhang, and Meikang\nQiu (Eds.). Springer International Publishing, Cham, 534–546.\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20364v1.pdf",
    "total_pages": 10,
    "title": "Bridging Legal Knowledge and AI: Retrieval-Augmented Generation with Vector Stores, Knowledge Graphs, and Hierarchical Non-negative Matrix Factorization",
    "authors": [
      "Ryan C. Barron",
      "Maksim E. Eren",
      "Olga M. Serafimova",
      "Cynthia Matuszek",
      "Boian S. Alexandrov"
    ],
    "abstract": "Agentic Generative AI, powered by Large Language Models (LLMs) with\nRetrieval-Augmented Generation (RAG), Knowledge Graphs (KGs), and Vector Stores\n(VSs), represents a transformative technology applicable to specialized domains\nsuch as legal systems, research, recommender systems, cybersecurity, and global\nsecurity, including proliferation research. This technology excels at inferring\nrelationships within vast unstructured or semi-structured datasets. The legal\ndomain here comprises complex data characterized by extensive, interrelated,\nand semi-structured knowledge systems with complex relations. It comprises\nconstitutions, statutes, regulations, and case law. Extracting insights and\nnavigating the intricate networks of legal documents and their relations is\ncrucial for effective legal research. Here, we introduce a generative AI system\nthat integrates RAG, VS, and KG, constructed via Non-Negative Matrix\nFactorization (NMF), to enhance legal information retrieval and AI reasoning\nand minimize hallucinations. In the legal system, these technologies empower AI\nagents to identify and analyze complex connections among cases, statutes, and\nlegal precedents, uncovering hidden relationships and predicting legal\ntrends-challenging tasks that are essential for ensuring justice and improving\noperational efficiency. Our system employs web scraping techniques to\nsystematically collect legal texts, such as statutes, constitutional\nprovisions, and case law, from publicly accessible platforms like Justia. It\nbridges the gap between traditional keyword-based searches and contextual\nunderstanding by leveraging advanced semantic representations, hierarchical\nrelationships, and latent topic discovery. This framework supports legal\ndocument clustering, summarization, and cross-referencing, for scalable,\ninterpretable, and accurate retrieval for semi-structured data while advancing\ncomputational law and AI.",
    "published_date": "2025-02-27",
    "source": "arxiv"
  }
}