{
  "id": "arxiv_2502.21013v1",
  "text": "arXiv:2502.21013v1  [math.NA]  28 Feb 2025\nA parallel-in-time solver for nonlinear\ndegenerate time-periodic parabolic problems\nHerbert Egger1,2 and Andreas Schafelner1\n1Institute of Numerical Mathematics, Johannes Kepler University Linz\n2Johann Radon Institute for Computational and Applied Mathematics\nherbert.egger@jku.at,andreas.schafelner@jku.at\nAbstract. A class of abstract nonlinear time-periodic evolution prob-\nlems is considered which arise in electrical engineering and other scien-\ntiﬁc disciplines. An eﬃcient solver is proposed for the systems arising\nafter discretization in time based on a ﬁxed-point iteration. Every step\nof this iteration amounts to the solution of a discretized time-periodic\nand time-invariant problem for which eﬃcient parallel-in-time methods\nare available. Global convergence with contraction factors independent\nof the discretization parameters is established. Together with an appro-\npriate initialization step, a highly eﬃcient and reliable solver is obtained.\nThe applicability and performance of the proposed method is illustrated\nby simulations of a power transformer. Further comparison is made with\nother solution strategies proposed in the literature.\nKeywords: Parallel-in-time methods · Nonlinear time-periodic prob-\nlems · Mesh-independent convergence.\n1\nIntroduction\nWe consider the eﬃcient numerical solution of degenerate nonlinear time-periodic\nproblems of the general abstract form\nM∂tu(t) + K(u(t)) = f(t)\nin V∗, t ∈[0, T ]\n(1)\nMu(0) = Mu(T )\nin H∗.\n(2)\nHere V ⊂H are two real Hilbert spaces, H∗⊂V∗the corresponding dual spaces,\nK : V →V∗is assumed strongly monotone and Lipschitz, and M : H →H∗to\nbe continuous, symmetric, and non-negative. Existence of a unique solution to\nsuch problems can be established by monotonicity arguments; see e.g. [13, 17].\nSystems of this kind have important applications of electrical engineering,\ne.g., in the modelling of electric motors and power transformers, and much re-\nsearch has been devoted to their analysis and eﬃcient numerical solution. Re-\nsults about the existence of a unique solution to the time-harmonic magneto-\nquasistatic problem can be found in [3, 5] based on non-constructive arguments.\nThe ﬁrst reference further studies the numerical approximation by a Fourier-\nGalerkin method in time together with a ﬁnite element discretization in space.\n\n\n2\nH. Egger and A. Schafelner\nRelated results can be found under the name Harmonic Balance ﬁnite element\nmethods in the engineering literature [16, 1, 9]. While this approach seems well-\nsuited from an approximation point of view, its implementation requires the so-\nlution of a large fully-coupled and highly nonlinear ﬁnite element system which\nseems to limit the actual applicability in practice [12]. Discretizing (1)–(2) in\ntime, e.g., by the implicit Euler method, leads to a loosely coupled system of\nnonlinear elliptic problems, whose solution can be tackled by ﬁxed-point or New-\nton methods [4, 6, 14]. A comparison of the approaches can be found in [11]. The\neﬃcient solution of linear time-invariant methods by the Parareal and Multigrid-\nin-Time methods has be demonstrated in [7, 10] and [8]. To the best of our knowl-\nedge, a rigorous convergence analysis of iterative solvers for inﬁnite-dimensional\ndegenerate nonlinear time-periodic problems is not available to date.\nIn this paper, we propose an eﬃcient iterative solution strategy for time-\nperiodic problems of the form (1)–(2). Similar to [4], the system is ﬁrst discretized\nin time and then solved iteratively by a ﬁxed-point iteration. Every step of\nthis iteration requires the solution of a time-periodic and time-invariant linear\nsystem. The well-posedness of this iteration as well as its global convergence,\nindependent of discretization parameters, is established. The individual steps\nof the ﬁxed-point iteration can ﬁnally be realized eﬃciently by the multigrid-\nin-time strategy proposed in [8]. Together with a careful initialization strategy,\nwe obtain a provably convergent and highly eﬃcient parallel-in-time solver. The\nmain arguments used in our proofs also apply to the time-continuous problem.\nAs a by-product of our analysis, we thus also obtain a constructive proof for the\nexistence and uniqueness of solutions to the time-continuous system (1)–(2).\n2\nPreliminaries\nLet V ⊂H be real Hilbert spaces with continuous embedding. We identify H\nwith its dual H∗and obtain a Gelfand triple V ⊂H ⊂V∗. We assume that\n(A1) K : V →V∗is strongly monotone and Lipschitz, i.e., ⟨K(u)−K(v), u−v⟩≥\nγ∥u−v∥2\nV and ∥K(u)−K(v)∥V ∗≤L∥u−v∥V for all u, v ∈V with L, γ > 0;\n(A2) M : H →H∗is continuous, symmetric, and non-negative, i.e., ∥Mu∥H ≤\nC∥u∥H, ⟨Mu, v⟩= ⟨u, Mv⟩, and ⟨Mu, u⟩≥0 for all u, v ∈H.\nThese general assumptions already allow to establish the following result.\nTheorem 1. For any T > 0 and f ∈L2(0, T ; V ∗), the system (1)–(2) has a\nunique solution u ∈L2(0, T ; V ) with M∂tu ∈L2(0, T ; V ∗).\nA proof of this assertion can be deduced from [13, 17]; also see Remark 3 below.\nNow let T > 0 and N ∈N be given. We deﬁne τ = T/N, set tn = nτ, and\ndenote by dτun = 1\nτ (un −un−1) the backward diﬀerence quotient in time. In the\nrest of the paper, we consider the following semi-discrete problem.\n\n\nParallel-in-time solver for nonlinear time-periodic problems\n3\nProblem 1. Given (f 1, . . . , f N) ⊂V∗, ﬁnd (u1, . . . , uN) ⊂V such that\nMdτun + K(un) = f n,\nn = 1, . . . , N,\n(3)\nwith\nu0 = uN.\n(4)\nThe second equation is used to implicitly deﬁne dτu1 = 1\nτ (u1−u0) = 1\nτ (u1−uN).\nTheorem 2. Let (A1)–(A2) hold. Then Problem 1 has a unique solution.\nProof. We introduce U = (u1, . . . , uN) and F = (f 1, . . . , f n) for abbreviation.\nThen Problem 1 can be written equivalently as\nFind U ∈VN :\nA(U) = F\nin (V∗)N\n(5)\nwith nonlinear operator A : VN →(VN)∗deﬁned by A(U)n = Mdτun + K(un).\nIt is known that dτ|an|2 = 2(dτan, an) −τ|dτan|2 ≤2(dτan, an). Together with\nthe properties of M and K, we thus obtain\n⟨A(U) −A(V ), U −V ⟩\n=\nXN\nn=1⟨M∂t(un −vn), un −vn⟩+ ⟨K(un) −K(vn), un −vn⟩\n≥\nXN\nn=1\n1\n2dτ(M(un −vn), un −vn) + γ∥un −vn∥2\nV = ∥U −V∥2\nVN.\nWe used ∥U∥2\nVN = P\nn ∥un∥2\nV to abbreviate the squared norm on VN. This shows\nthat A is strongly monotone. In a similar manner, one can see that\n∥A(U) −A(V )∥(V∗)N ≤\n\u0000 2C\nτ + L\n\u0001\n∥U −V ∥VN.\nHence A : VN →(V∗)N is a strongly monotone and Lipschitz continuous opera-\ntor. Existence of a unique solution to A(U) = F then follows from Zarantonello’s\nﬁxed-point theorem; see [17, Thm. 25.B].\n⊓⊔\nThe proof of Zarantonello’s ﬁxed-point theorem, and hence also of the previous\nresult, provides an iterative method for the solution of (3)–(4). The contraction\nfactor however dependence on the ratio of the Lipschitz- and monotonicity con-\nstants, and hence degenerates with the time-step τ going to zero. In the following\nsection, we propose an alternative iterative scheme which converges uniformly.\n3\nIterative solution strategy\nLet bK : V →V∗be a linear and continuous operator, and (u1,0, . . . , uN,0) ∈VN\nsome given initial iterate. For the numerical solution of (3)–(4), we consider the\nﬁxed-point iteration deﬁned by\nMdτun,k+1 + bKun,k+1 = f n + bKun,k −K(un,k),\nn = 1, . . . , N,\n(6)\nwith\nu0,k+1 = uN,k+1,\nk ≥0.\n(7)\n\n\n4\nH. Egger and A. Schafelner\nAbbreviating U k = (u1,k, . . . , uN,k) and U k+1 = (u1,k+1, . . . , uN,k+1) as before,\nthe system (6)–(7) can be written as ﬁxed-point iteration U k+1 = Φ(uk) with\nmapping Φ : VN →VN, U k 7→Φ(U k) = U k+1 deﬁned implicitly via the equa-\ntions above. Convergence of this iteration is guaranteed by the following result.\nTheorem 3. Let (A1)–(A2) hold and assume that bK : V →V∗is a linear,\ncontinuous, symmetric, and elliptic operator which satisﬁes\n∥bK(u −v) −(K(u) −K(v))∥b\nK−1 ≤q∥u −v∥b\nK\n∀u, v ∈V\n(8)\nwith some q < 1. Then for any U 0 = (u1,0, . . . , uN,0) ∈VN, the iteration (6)–(7)\nconverges linearly to the unique solution U = (u1, . . . , uN) of (3)–(4), i.e.,\n∥U k+1 −U∥b\nK ≤q ∥U k −U∥b\nK,\n∀k ≥0.\n(9)\nHere ∥U∥2\nb\nK = PN\nn=1 ∥un∥2\nb\nK and ∥u∥2\nb\nK = ⟨bKu, u⟩denote the square of the norms\non VN and V induced by the operator bK, and similarly ∥F∥2\nb\nK−1 = PN\nn=1 ∥f n∥2\nb\nK−1\nand ∥f∥2\nbK−1 = ⟨bK−1f, f⟩deﬁne corresponding squared norms on (V∗)N and V∗.\nProof. The operator bK : V →V∗is continuous and elliptic, and hence satis-\nﬁes the assumption (A1)–(A2). We may thus apply Theorem 2 to see that the\niteration (6)–(7) is well-deﬁned. In particular, Φ : VN →VN, U →Φ(U) is a\nself-mapping on VN. Similar to the proof of Theorem 2, we see that\n∥U k+1 −U∥2\nK ≤\nXN\nn=1⟨dτ(un −vn), un −vn⟩+ ⟨bK(un,k+1 −un), un,k+1 −un⟩\n=\nXN\nn=1⟨bK(un,k −un) −(K(un,k) −K(un)), un,k+1 −un⟩.\nIn the second step, we used the deﬁnitions of U k+1 and U provided by (6)–(7)\nand (3)–(4), respectively. By application of (8), we obtain\n⟨bK(un,k −un) −(K(un,k) −K(un)), un,k+1 −un⟩\n≤∥bK(un,k −un) −(K(un,k) −K(un))∥b\nK−1∥un,k+1 −un∥b\nK\n≤q∥un,k −un∥b\nK∥un,k+1 −un∥b\nK.\nInserting this into the previous formula and applying a Cauchy-Schwarz inequal-\nity for the sum, we arrive at\n∥U k+1 −U∥2\nb\nK ≤q∥U k −U∥b\nK∥U k+1 −U∥b\nK\nwhich implies the estimate (9) and the remaining assertions of the theorem.\n⊓⊔\nRemark 1. Let R : V∗→V be the Riesz-isomorphism on the Hilbert space V\ndeﬁned by (Rf, v)V = ⟨f, v⟩for all v ∈V. Further set bK = 1\nωR−1 with ω > 0 to\nbe determined. Then we can express ∥u∥2\nb\nK = ω∥u∥2\nV and obtain\n∥bK(u −v) −(K(u) −K(v))∥2\nb\nK−1\n= ∥u −v∥2\nb\nK −2⟨K(u) −K(v), u −v⟩+ ∥K(u) −K(v)∥2\nb\nK−1\n≤∥u −v∥2\nb\nK(1 −2ωγ + ω2L2).\n\n\nParallel-in-time solver for nonlinear time-periodic problems\n5\nIn the second step we used the monotonicity and Lipschitz estimates provided\nby assumption (A1) and the relation between the norms stated above. For any\n0 < ω < L2/γ, the factor q(ω)2 = 1−2ωγ +ωL2 is smaller than one. This shows\nthat condition (9) can always be satisﬁed with a uniform constant q < 1.\nRemark 2. Every step of the ﬁxed-point method (6)–(7) requires the solution\nof a semi-discrete time-periodic and time-invariant system. Via discrete Fourier\ntransforms, this system can be converted into block-diagonal form with complex\nsymmetric operators iωkM+ bK on the diagonal. Such a strategy was used in [4].\nAlternatively, the systems can be solved by multigrid-in-time algorithms [8, 15].\nBoth strategies essentially lead to parallel-in-time algorithms.\nRemark 3. The arguments used in the previous proof can in principle also be\napplied to the original system (1)–(2). This leads to the ﬁxed-point iteration\nM∂tuk+1(t) + bK(uk+1(t)) = f(t) + bKuk(t) −K(uk(t)),\n0 ≤t ≤T\nMuk+1(0) = Muk+1(0).\nEvery step of this iteration amounts to the solution of a linear time-periodic and\ntime-invariant problem. Well-posedness of the iteration can then be obtained\nfrom standard result [13], and convergence of the iterates in the space L2(0, T ; V )\nfollows with the same reasoning as above.\n4\nNumerical illustration\nIn order to illustrate the applicability and eﬃciency of the proposed method, we\nconsider the time-periodic magnetic ﬁelds in a power transformer. The problem\nsetup is adopted from [11], but to simplify the reproducibility of the results, we\nhere consider only a two-dimensional setting.\nTest problem. The domain Ω⊂R2 represents the cross-section of the trans-\nformer, which is covered by diﬀerent materials; see Figure 1a for a sketch. The\nΩsteel\nΩiron\nΩair\nΩwinding+\nΩwinding−\n(a)\nΩi\niron\nsteel\nair\nwinding±\nσi [S/m]\n0\n107\n0\n0\nai [m/H]\n5.85\n130.171\n0\n0\nbi [1]\n2.196\n1.102\n–\n–\nci [1] 136026 6112.97\n–\n–\ndi [m/H]\n23.15\n43.742 107/(4π) 107/(4π)\nji [A/m2]\n0\n0\n0\n±1.9 104\n(b)\nFig. 1: Cross-section of transformer (left); table with material parameters (right).\n\n\n6\nH. Egger and A. Schafelner\nz-component u of the magnetic vector potential is governed by\nσ∂tu −div(ν(|∇u|)∇u(t)) = j\nin Ω, t ∈[0, T ]\nu = 0\non ∂Ω, t ∈[0, T ]\nwith j denoting the z-component of the current in the windings. All ﬁelds are\nassumed time-periodic with period T = 0.02 [s]. The electric conductivity σ and\nmagnetic reluctivity ν are assumed to be of the form\nσ = σi\nand\nν(s) = ai min{exp(bis2), ci} + di\nin Ωi\nwith material dependent constants σi, . . . , di. The current density is given by\nj(t) = ji cos(2πt/T )\nwith piecewise constant current amplitudes ji. The values for the coeﬃcients\nused in our simulations are summarized in Figure 1b.\nSimulation setup. The problem is discretized in space by piecewise linear ﬁnite\nelements over a triangular mesh. The dimension of the corresponding ﬁnite ele-\nment spaces is denoted by NV . For time-discretization, we use the implicit Euler\nmethod with constant time step τ = T/N. This leads to a ﬁnite-dimensional\nversion of (3)–(4). According to our analysis, we expect convergence of the pro-\nposed iterative solvers with iterations numbers independent of NV and N. In\nour numerical tests, we compare the following three solution strategies:\n(M1) the ﬁxed-point iteration proposed in this paper; the linearized systems\n(6)–(7) are solved by the multigrid-in-time method proposed in [8];\n(M2) the Newton-method applied to (3)–(4); the resulting linearized systems\nare solved by the multigrid-in-time method proposed in [8]; Armijo back-\ntracking is applied to guarantee decay in the residual;\n(M3) a simple nonlinear time-stepping method; the iteration (3) is performed\nfor n ≥0 until the periodic limit cycle is reached; the nonlinear systems in\nevery time-step are solved by a Newton method with Armijo back-tracking.\nInitialization. All iterations are initialized by solving the decoupled nonlinear\nstatic problems that result from setting σ ≡0. The iterations are stopped when\nthe residual has been reduced suﬃciently, i.e., when\n∥F −A(U k)∥ℓ2 ≤tol ∥F −A(U 0)∥ℓ2.\nHere F −A(U) amounts to the residual vector for the ﬁnite element approxima-\ntion of (3)–(4). For our computational tests, we choose the tolerance tol = 10−4.\nNumerical results. The methods (M1)–(M3) are implemented using the ﬁ-\nnite element library MFEM [2], with the spatial solvers provided by Hypre1 and\n1 https://github.com/hypre-space/hypre\n\n\nParallel-in-time solver for nonlinear time-periodic problems\n7\nSuiteSparse2. The comparison runs are performed on a single node of Dane3,\nwhich consists of a 112-core Intel Sapphire Rapid processor, while the scaling\ntests were performed on multiple nodes of the same platform. We present the\nnumber of iterations for the methods (M1)–(M3) in Table 1a, where the cor-\nresponding wall time is included in parentheses. Iterations marked with ∗were\nstopped early due to slow convergence. We also report the run times for the ini-\ntialization step, which requires the solution of a sequence of decoupled nonlinear\nelliptic problems. Methods (M1) and (M2) use 8 MPI ranks, while method (M3)\nutilizes multi-threading for the linear solvers. In Table 1b, we present the results\nof a parallel scaling study for (M1), for a problem with NV = 8208 spatial dofs.\nN\nNV\ninit\n(M1)\n(M2)\n(M3)\n128\n8208\n28.85 s\n13 (8.25 s)\n5 (12.79 s)\n10∗(153.18 s)\n128\n32451\n190.37 s\n10 (24.68 s)\n5 (49.11 s)\n10∗(647.64 s)\n256\n8208\n58.32 s\n13 (16.07 s)\n5 (24.42 s)\n10∗(306.23 s)\n256\n32451\n406.60 s\n10 (49.65 s)\n5 (94.21 s)\n10∗(1288.96 s)\n512\n8208\n135.19 s\n13 (30.39 s)\n5 (48.03 s)\n10∗(617.97 s)\n512\n32451\n828.55 s\n10 (98.53 s)\n5 (187.65 s)\n10∗(2577.77 s)\n(a) Comparison of methods (M1) – (M3) for diﬀerent discretization parameters.\nN \\ R\n16\n32\n64\n128\n256\n512\n256\n13 (9.21 s)\n13 (5.29 s)\n13 (3.45 s)\n13 (2.66 s)\n–\n–\n512\n13 (16.84 s)\n13 (9.18 s)\n13 (5.38 s)\n13 (3.59 s)\n13 (3.03 s)\n–\n1024\n13 (31.08 s)\n13 (16.39 s)\n13 (9.02 s)\n13 (5.44 s)\n13 (4.03 s)\n13 (3.79 s)\n2048\n–\n–\n13 (16.42 s)\n13 (9.13 s)\n13 (6.05 s)\n13 (5.05 s)\n(b) Weak and strong scaling results for (M1) with NV = 8208 and MPI ranks R.\nTable 1: Iteration counts and wall times.\nDiscussion of the numerical results. As predicted by our theoretical results,\nthe proposed method (M1) converges with an almost ﬁxed number of iteration,\nindependent of the discretization parameters. A similar observation holds for the\nNewton method (M2). Although the latter requires fewer outer iterations, the\nsolution of the linearized time-periodic problems in every step of the iteration\nis somewhat faster for method (M1), and hence the overall computation times\nare smaller. Let us note that convergence of the multigrid-in-time method for\nthe Newton system is not fully covered by theory yet. An analysis of this aspect\nwould be an interesting topic for future research. Even after 10 cycles over all\ntime steps, the simple time-stepping scheme (M3) did not converge to the de-\nsired accuracy. Moreover, this method is sequential in time, and hence run-times\nlargely exceed the other methods which can be executed parallel in time.\n2 https://github.com/DrTimothyAldenDavis/SuiteSparse\n3 https://hpc.llnl.gov/hardware/compute-platforms/dane\n\n\n8\nH. Egger and A. Schafelner\nReferences\n1. Albanese, R., Coccorese, E., Martone, R., Miano, G., Rubinacci, G.: Periodic so-\nlutions of nonlinear eddy current problems in three-dimensional geometries. IEEE\nTrans. Magn. 28 (1992)\n2. Anderson, R., et al.: MFEM: A modular ﬁnite element methods library. Comp.\nMath. Appl. 81, 42–74 (2021)\n3. Bachinger, F., Langer, U., Schöberl, J.: Numerical analysis of nonlinear multihar-\nmonic eddy current problems. Numer. Math. 100, 593–616 (2005)\n4. Biro, O., Preis, K.: An eﬃcient time domain method for nonlinear periodic eddy\ncurrent problems. IEEE Trans. Magn. 42, 695–698 (2006)\n5. Cesarano, A., Dapogny, C., Gangl, P.: Space-time shape optimization of rotating\nelectric machines. Math. Models Meth. Appl. Sci. 34, 2647–2708 (2024)\n6. Dlala, E., Belahcen, A., Arkkio, A.: Locally convergent ﬁxed-point method for\nsolving time-stepping nonlinear ﬁeld problems. IEEE Trans. Magn. 43 (2007)\n7. Gander, M.J., Jiang, Y.L., Song, B., Zhang, H.: Analysis of two parareal algorithms\nfor time-periodic problems. SIAM J. Sci. Comput. 35, A2393–A2415 (2013)\n8. Gander, M.J., Neumüller, M.: Analysis of a new space-time parallel multigrid al-\ngorithm for parabolic problems. SIAM J. Sci. Comput. 38, a2173–a2208 (2016)\n9. Gyselinck, J., Dular, P., Geuzaine, C., Legros, W.: Harmonic-balance ﬁnite-element\nmodeling of electromagnetic devices. IEEE Trans. Magn. 38 (2002)\n10. Kulchytska-Ruchka, I., Schöps, S.: Eﬃcient parallel-in-time solution of time-\nperiodic problems using a multiharmonic coarse grid correction. SIAM J. Sci. Com-\nput. 43, c61–c88 (2021)\n11. Plasser, R., Takahashi, Y., Koczka, G., Bíró, O.: Comparison of 2 methods for the\nﬁnite element steady-state analysis of nonlinear 3D periodic eddy-current problems\nusing the A,V–formulation. Int. J. Numer. Model. 31, e2279 (2018)\n12. Scolaro, E., Alberti, L., Sabariego, R.V., Gyselinck, J.: Harmonic balance applied\nto a 2D nonlinear ﬁnite-element magnetic model with motion and circuit coupling.\nInt. J. Numer. Model. 37, e3275 (2024)\n13. Showalter, R.E.: Monotone operators in Banach space and nonlinear partial diﬀer-\nential equations. American Math. Soc., Providence, RI (1997)\n14. Takahashi, Y., Iwashita, T., Nakashima, H., Tokumasu, T., Fujita, M., Wakao, S.,\nFujiwara, K., Ishihara, Y.: Parallel time-periodic ﬁnite-element method for steady-\nstate analysis of rotating machines. IEEE Trans. Magn. 48 (2012)\n15. Vandewalle, S., Piessens, R.: Eﬃcient parallel algorithms for solving initial-\nboundary value and time-periodic parabolic partial diﬀerential equations. SIAM J.\nSci. Statist. Comput. 13, 1330–1346 (1992)\n16. Yamada, S., Bessho, K.: Harmonic ﬁeld calculation by the combination of ﬁnite\nelement analysis and harmonic balance method. IEEE Trans. Magn. 24 (1988)\n17. Zeidler, E.: Nonlinear functional analysis and its applications II/B: Nonlinear\nMonotone Operators. Springer-Verlag, New York (1990)\nAcknowledgments. This work was supported by the DFG/FWF Collaborative Re-\nsearch Centre CREATOR (DFG: Project-ID 492661287/TRR 361; FWF: 10.55776/F90).\nThe authors would like to thank Hillary Fairbanks for providing access to Dane.\nDisclosure of Interests. The authors have no competing interests to declare that\nare relevant to the content of this article.\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21013v1.pdf",
    "total_pages": 8,
    "title": "A parallel-in-time solver for nonlinear degenerate time-periodic parabolic problems",
    "authors": [
      "Herbert Egger",
      "Andreas Schafelner"
    ],
    "abstract": "A class of abstract nonlinear time-periodic evolution problems is considered\nwhich arise in electrical engineering and other scientific disciplines. An\nefficient solver is proposed for the systems arising after discretization in\ntime based on a fixed-point iteration. Every step of this iteration amounts to\nthe solution of a discretized time-periodic and time-invariant problem for\nwhich efficient parallel-in-time methods are available. Global convergence with\ncontraction factors independent of the discretization parameters is\nestablished. Together with an appropriate initialization step, a highly\nefficient and reliable solver is obtained. The applicability and performance of\nthe proposed method is illustrated by simulations of a power transformer.\nFurther comparison is made with other solution strategies proposed in the\nliterature.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}