{
  "id": "arxiv_2502.21160v1",
  "text": "Imperfect preparation and Trojan attack on the\nphase modulator in the decoy-state BB84 protocol\nAleksei Reutov\nQRate, Moscow, Russia\nMoscow Center for Advanced Studies, Moscow, Russia\nAbstract\nQuantum key distribution (QKD) provides a theoretically secure method\nfor cryptographic key exchange by leveraging quantum mechanics, but practi-\ncal implementations face vulnerabilities such as Trojan horse attack on phase\nmodulators. This work analyzes the security of QKD systems under such at-\ntacks, considering both ideal and imperfect state preparation scenarios. The\nTrojan attack model is generalized to arbitrary states of probing pulses and\nconservative bounds of information leakage through side-channel of special\nform are introduced. The quantum coin imbalance, a critical security param-\neter, remains low (on the order of 10−7 for ideal state preparation and 10−5\nfor imperfect preparation) with this new approach and presence additional\nhardware passive countermeasures. Numerical simulations confirm nonzero\nsecure key rate at distances over 100 km through optical fiber channel.\narXiv:2502.21160v1  [quant-ph]  28 Feb 2025\n\n\nIntroduction\nQuantum key distribution (QKD) represents a main area of modern quantum cryp-\ntography, suggesting a theoretically secure method [1] for exchanging cryptographic\nkeys between distant parties. By leveraging the principles of quantum mechanics,\nan ideal implementation of QKD ensures that any eavesdropping attempt on the\nkey exchange process is detectable, thereby providing a level of security unattain-\nable by classical cryptographic methods. However, the practical implementation of\nQKD systems is not without challenges [2]. Real-world devices often deviate from\nassumptions of idealized theoretical QKD schemes, introducing vulnerabilities that\ncan be exploited by sophisticated attacks. Among these, the Trojan horse attack [3]\non phase modulators stands out as a powerful threat, capable of compromising the\nsecurity of QKD systems without leaving detectable influence on observables mea-\nsured during QKD protocol.\nThis article addresses the BB84 decoy-state protocol [4, 5] and the specifics of\nTrojan-horse attacks on phase modulators (PMs). Unlike some previous studies [6–8]\nthat assume coherent states for the probing Trojan pulses, this article is appealed\nto a more general scenario where the eavesdropper can prepare arbitrary states\nfor phase-modulator’s probing. Such generalization allows to derive conservative\nbounds on the information leakage caused by Trojan attacks and Alice’s side chan-\nnels. Side channel of specific and low-dimensional form is proposed as upper bound\nfor any Trojan probing by arbitrary (pure or mixed) state. This result is formalized\nin three Statements, one for asymptotic case and two other for finite-key effects\nwith statistical corrections based on Chernoff bounds. The possible imperfect state\npreparations are also considered and the imperfect choice of bits and bases are mod-\neled using a Gaussian approximation close to behavior of quantum-state sources in\npractical QKD systems.\nPresented in this article analysis reveals that the quantum coin imbalance, a\ncritical parameter affecting phase error, remains weakly varying in the presence of\nTrojan attack and without it. There are demonstrated for realistic case of QKD\nimplementation with isolators and spectral filters that the quantum coin imbalance\nvalues are on the order of 10−7 for ideal state preparation and 10−5 for imperfect\npreparation.\nThese findings are validated through numerical simulations of the\nsecret key rate, which show that our conservative approach yields low changes in\nkey rate and maximum transmission distance.\nFurthermore, the performance of\nthe protocol under realistic conditions of practical schemes is evaluated and it is\ndemonstrated that secure key distribution is achievable over distances higher than\n100 km.\nIn the following sections, an exposition of the state preparation process (Appen-\ndices A and B contain more details about imperfect state preparation and Gaussian\napproximation for it) is provided, the theoretical framework for Trojan attack on\nPM is analyzed and the numerical results support article‘s conclusions. This findings\nunderscore the importance of rigorous security analysis in the design and implemen-\ntation of practical QKD systems, ensuring their resilience against both known and\nemerging threats.\n2\n\n\n|V ⟩\n|H⟩\n|L⟩\n|R⟩\n|D⟩\n|A⟩\n|ψ2⟩\n|ψ1⟩\n|ψ4⟩\n|ψ3⟩\nφ0\nz\ny\nx\nFigure 1: Polarization states on the Bloch sphere transmitted by Alice, reprinted\nfrom [9]. The blue and orange dots mark the perfectly prepared (2) states and the\n(4) states are schematically depicted as orange and blue areas on the sphere surface.\n1\nState preparation\nThe variation of BB84 protocol with decoy-state technique [4, 5] is used in this\npaper. BB84 [1], introduced by Bennett and Brassard in 1984, is a quantum key\ndistribution (QKD) method that enables two distant parties, Alice and Bob, to\nsecurely generate a shared secret key using the principles of quantum mechanics.\nAlice sends qubits to Bob encoded in one of two non-orthogonal bases and Bob\nmeasures them in a randomly chosen basis, after which they publicly compare bases\nto discard mismatched results. The final key is distilled through error correction\nand privacy amplification providing information-theoretical security.\nThe decoy-state technique [10–13] is a method to enhance security and key gen-\neration rates in practical implementations using weak coherent pulses, which are\nsusceptible to photon-number-splitting (PNS) attacks. By randomly adding decoy\npulses of varying intensities to signal pulses, Alice and Bob can estimate the con-\ntribution of single-photon and multi-photon measurements. It allows two distant\nparties to detect and handle with eavesdropper’s (Eve’s) PNS attacks. This tech-\nnique significantly improves the robustness and performance of QKD systems under\nrealistic conditions.\nIn our implementation of decoy-state BB84 protocol [14] we use polarization\nencoding of prepared states. Any arbitrary pure polarization state can be described\nby spherical coordinates φ ∈[0, 2π) and θ ∈[0, π] on the Bloch sphere,\n|ψ(φ, θ)⟩= cos\n\u0012θ\n2\n\u0013\n|H⟩+ eiφ sin\n\u0012θ\n2\n\u0013\n|V ⟩,\n(1)\nwhere |H⟩and |V ⟩denote the horizontal and vertical polarization states respectively.\nThe azimuth angle is set to θ = π/2 in the protocol and the relative phase, which\ndetermines the basis and the bit value, is adjusted to ϕi ∈{0, π, π/2, 3π/2}. Thus,\nthe azimuth angle of the ith state is φi = ϕ0 + ϕi.\nStates in our practical scheme are prepared and measured (with assumption of\nideal phase modulators) in elliptical polarization bases X′ : {|ψ1⟩, |ψ2⟩} and Y ′ :\n{|ψ3⟩, |ψ4⟩} obtained by rotating the basis vectors X : {|D⟩, |A⟩} and Y : {|R⟩, |L⟩}\n3\n\n\naround the z-axis by ϕ0 (see Fig. 1):\n|ψperfect\n1,2\n⟩= 1\n√\n2\n\u0000|H⟩± eiϕ0 |V ⟩\n\u0001\n,\n|ψperfect\n3,4\n⟩= 1\n√\n2\n\u0000|H⟩± ieiϕ0 |V ⟩\n\u0001\n.\n(2)\nThe density matrices of these states can be expressed as:\nρi = |ψperfect\ni\n⟩⟨ψ perfect\ni\n| .\n(3)\nBob will perform measurements in the bases X′ and Y ′ randomly applying one of\nthe positive operator-valued measures {|ψperfect\ni\n⟩⟨ψ perfect\ni\n|}.\nHowever, phase modulators a not ideal in practical schemes (e.g., due to im-\nperfect voltage control or mechanical inaccuracy of connection between the optical\ncomponents [9]). Thus, there is a deviation from θ = π/2 on the Bloch sphere, as\nwell as deviations of φi from the ideal φi ∈{0, π, π/2, 3π/2}. As a result of all these\nimperfections, the ideal states (2) change and can be written as:\n|ψi⟩= |ψ(φi, θ)⟩,\n(4)\nwhere φi and θ are random variables with some probability distributions. Note that,\nthese states are no longer mutually orthogonal in the corresponding basis and do not\nlie in the xy plane of the Bloch sphere. In Appendix A and B the case of imperfect\npreparation is considered in more details and the density matrices ρ1, ρ2, ρ3 and ρ4\nare determined for the four polarization states of the protocol instead of |ψperfect\ni\n⟩.\n2\nTrojan attack on phase modulator\nTrojan probing [3] of phase modulators in QKD schemes refers to an attack strategy\nwhere Eve actively interrogates the phase modulation components to extract sensi-\ntive information about the quantum states being transmitted. Eve can be remaining\nundetected by conventional security measures during this attack. Possible robust\ncountermeasures includes real-time monitoring, anomaly detection, passive isolation\nof QKD devices by outer probing emission and modifications of theoretical protocol.\nA number of papers [6–8] consider the Trojan attack under the assumption that\nthe probe pulses are coherent states |α⟩(the polarization dependencies are omitted\nfor simplicity):\n|α⟩= e−| α2|\n2\n∞\nX\nn=0\nαn\n√\nn!\n|n⟩.\n(5)\nBut Eve does not have to be limited by this assumption and theoretically can prepare\nany state of light. Moreover, infinite-dimensional coherent state complicates the\nfidelity calculation (especially for imperfect state preparation) needed to determine\nthe phase error that affects the key rate. Therefore, this section provide framework\nfor arbitrary probing state with simplification of fidelity calculation and, accordingly,\ndetermining the phase error.\nFirstly, let’s assume that Eve is able to prepare a Trojan probing with an ar-\nbitrary state as presented, for example, in [15]. But, unlike [15], this paper focus\non detailed consideration Trojan probing of PM and corresponding usage of fidelity\nbetween quantum states. It is important to mention the interpretation of Alice be-\nhavior when she randomly choose firstly a number of photon in pulse [16,17] (and\n4\n\n\nonly then randomly choose a label of decoy or signal intensity). This paper introduce\nsimilar logic: there is assumed that Eve firstly decide to obtain a specific number of\nprobing photons reflected from Alice devices and Eve’s choice can be described as\nprobability distribution Pn.\nLet the eavesdropper emission reflected from Alice’s devices be given by an ar-\nbitrary pure state |ψout⟩:\n|ψout⟩=\n∞\nX\nn=0\np\nPn |n⟩.\n(6)\nHence, the Trojan light can be described as a random variable, the outcome of which\nis the emission of n photons |n⟩with probability Pn. The eavesdropper attack is\nbounded in intensity from above by the value µout due to the maximum intensity\npermissible for the integrity of optical fiber [6,18] (i.e., up to critical intensity of light\nin optical fiber and optical devices after which the optical elements will be degradate\nand any transmission will be impossible).\n|ψout⟩has also 4 possible variations,\ndepending on 4 settings on the transmitter phase modulator, which set the states\nρi (33).\nAssumption. Let the protocol and its implementation be subject to the condition\nµout < 1, where µout is the maximum intensity of the output Trojan emission.\nThe choice of such a limitation is due to the fact that the presence of a non-zero\nkey rate requires low values of the output probing intensity µout [6].\nIn the case of the implementation of an arbitrary Trojan emission (for now, it\nmeans Trojan pure states with arbitrary photon-number distribution), there are\nrandom sets of ni probing photons and each set is obtained i-th times from Alice’s\nsetup. The total number of photons is limited by:\nN\nX\ni=1\nni = Nµout ,\n(7)\nwhere N is the number of pulses transmitted by Alice during the quantum key\ndistribution. It is worth noting to say that Nµout < N follows by Assumption, which\nmeans that it is impossible to randomly fill all Alice’s pulses with non-zero Trojan\nphotons. Each pulse with a non-zero Trojan photon means a pulse compromised by\nattack and this affects the final length of the secret key, but zero Trojan photons\nin the i-th pulse do not provide an information leakage. It follows that the more\npulses are filled (and compromised by Trojan emission), the more information will\nbe received by an eavesdropper through the Trojan side channel.\nConsider the following side channel:\n|ψs.ch.⟩=\np\n1 −µout |vac⟩+ √µout |1 ph.⟩,\n(8)\nwhere |vac⟩is the vacuum state, |1 ph.⟩is the state with one photon. Such side\nchannel will have an average intensity equal to µout. The proposed state corresponds\nto the situation when the Alice’s pulses are filled either with one Trojan photon or\nremain empty. The total number of filled positions will be Nµout.\nStatement 1. Asymptotically (for N →+∞), any Trojan emission with ar-\nbitrary representation (6) and with average intensity no higher than µout gives the\neavesdropper less equal or information than side channel (8).\n5\n\n\nProof. The amount of information received by the eavesdropper is determined by\nthe Alice’s pulses that contained Trojan photons. The more such filled pulses means\nthe more information for the eavesdropper. Let us define the number of filled pulses\n|ψout⟩as K. The number of filled pulses K will be:\nK =\n∞\nX\nn=1\nNPn ≤N\n∞\nX\nn=1\nPn · n ≤N\n∞\nX\nn=0\nPn · n = N ⟨ψout| ˆN |ψout⟩≤Nµout ,\n(9)\nwhere ⟨ψout| ˆN |ψout⟩is average intensity of |ψout⟩and it is taken into account that\nN →+∞. Nµout is the number of filled pulses for (8), i.e., due to the inequality (9),\nside channel (8) gives more or equal information to the eavesdropper than arbitrary\nTrojan probing (6).\nHowever, in practical implementations of QKD, the statistics of measured ob-\nservables are finite and the condition N →+∞is not satisfied. In addition, due\nto channel losses and the usage of weak coherent states with significant vacuum\ncomponent, only M L\n1 < N pulses are used to generate the secret key (where M L\n1 is\nthe decoy-state method estimation of a number of single-photon bits in the verified\nkey). All other pulses do not provide information about the key and their leakage\nwill not lead to the disclosure of bits of the verified key. Accordingly, the substitution\nN →M L\n1 will be used in the proof of the following statement.\nStatement 2. With an accuracy of 2ε, any Trojan attack on PM of form (6)\nand with an intensity no higher than µout gives the eavesdropper less information\nthan side channel with form:\n|ψs.ch.⟩=\np\n1 −µ′\nout |vac⟩+\np\nµ′\nout |1 ph.⟩,\n(10)\nwhere µ′\nout is is determined through the implicit equation M L\n1 µ′\nout −δL(M L\n1 µ′\nout) =\nM L\n1 µout + δU(M L\n1 µout) and δL,U(x) is statistical corrections of the Chernoff bound,\nM L\n1 is lower bound for single-photon clicks.\nRemark. The upper bound KU\n1 of the number of single-photon clicks compro-\nmised by a probing attack is defined similarly (9):\nKU\n1 = E[K1] + δU(K1) = M L\n1\n∞\nX\nn=1\nPn + δU(E[K1]) ≤M L\n1 µout + δU(E[K1]) ,\n(11)\nwhere used\n∞\nX\nn=1\nPn ≤\n∞\nX\nn=1\nnPn\n(12)\nand µout = P∞\nn=1 nPn is upper bound for the average Trojan output intensity for\n|ψout⟩and δU(x) is provided by the Chernoff bound.\nProof. It can be shown for the Chernoff bounds that for two expectations 0 ≤A ≤\nB:\nf(A) ≤f(B)\n(13)\nwhere f(x) = x + δU(x), i.e. the inequality of expectations provides the inequality\nfor the value bounds (the proof is given in the Appendix C in Lemma 1).\nLet\nB = M L\n1 µout and A = E[K1] ≤M L\n1 µout, then the inequality (11) is rewritten as:\nKU\n1 ≤M L\n1 µout + δU(M L\n1 µout) ,\n(14)\n6\n\n\nThe expectation of compromised single-photon clicks for a side channel of the form\n(10) is defined as E[Ks.ch.] = M L\n1 µ′\nout. Similarly to (14), the lower bound is estimated\nas:\nKL\ns.ch. ≥M L\n1 µ′\nout −δL(M L\n1 µ′\nout) ,\n(15)\nand let this estimation be greater than the upper estimation of single-photon clicks\ncompromised by the Trojan attack:\nKU\n1 ≤KL\ns.ch. .\n(16)\nThis is satisfied by the following condition on µ′\nout:\nM L\n1 µ′\nout −δL(M L\n1 µ′\nout) = M L\n1 µout + δU(M L\n1 µout) ,\n(17)\nwhich proves the original statement with an accuracy of 2ε.\nStill we assume pure states for Trojan probing. Now we write a generic (possibly\nmixed) state for Eve’s probing system:\nρout =\nX\nm\npm |ψm⟩⟨ψm| ,\n(18)\nwhere |ψm⟩can be not mutually orthogonal and has form close to (6):\n|ψm⟩=\n∞\nX\nn=0\np\nPn,m |n⟩.\n(19)\nAny ρout can be purified:\n|ψ′\nout⟩=\nX\nm\n√pm |ψm⟩|am⟩=\nX\nm\n∞\nX\nn=0\np\npmPn,m |n⟩|am⟩,\n(20)\nwhere {|am⟩} is orthonormal basis of Eve’s ancillary system. The number of vacuum\nTrojan pulses can be obtained as:\nK0 = N\nX\nm\npmP0,m = N −N\nX\nm\npm\n∞\nX\nn=1\nPN,m\n(21)\nand filled Trojan pulses is\nK = N\nX\nm\npm\n∞\nX\nn=1\nPN,m\n(22)\nIt is allow us to write equation similar to (9):\nK = N\n∞\nX\nn=1\nX\nm\npmPN,m ≤N\n∞\nX\nn=1\nn ·\nX\nm\npmPn,m\n≤N\n∞\nX\nn=0\nn ·\nX\nm\npmPn,m = N ⟨ψ′\nout| ˆN |ψ′\nout⟩= Tr[ ˆNρout] ≤Nµout .\n(23)\nNote, that operator ˆN does not act on ancillary system of Eve. With the equation\n(23), Statement 1 and Statement 2, we can write final generalized statement.\n7\n\n\nStatement 3. With an accuracy of 2ε, any Trojan attack on PM of arbitrary\nform (18) and with an intensity no higher than µout gives the eavesdropper less or\nequal information than side channel with form:\n|ψs.ch.⟩=\np\n1 −µ′\nout |vac⟩+\np\nµ′\nout |1 ph.⟩,\n(24)\nwhere µ′\nout is is determined through the implicit equation M L\n1 µ′\nout −δL(M L\n1 µ′\nout) =\nM L\n1 µout + δU(M L\n1 µout) and δL,U(x) is statistical correction of the Chernoff bound,\nM L\n1 is lower bound for single-photon clicks.\nNow we found that any Trojan attack with average intensity Tr[ ˆNρout] ≤µout\ncan be conservatively bounded by a side channel of the form (10) with 2ε-accuracy.\nThe side channel (10) can be represented in the case of polarization encoding as four\ndensity matrices as:\nρE,1 =\n\n\n\nµ′\nout\n2\nµ′\nout\n2\n1\n2\np\nµ′\nout(1 −µ′\nout)\nµ′\nout\n2\nµ′\nout\n2\n1\n2\np\nµ′\nout(1 −µ′\nout)\n1\n2\np\nµ′\nout(1 −µ′\nout)\n1\n2\np\nµ′\nout(1 −µ′\nout)\n1 −µ′\nout\n\n\n,\nρE,2 =\n\n\n\nµ′\nout\n2\n−µ′\nout\n2\n1\n2\np\nµ′\nout(1 −µ′\nout)\n−µ′\nout\n2\nµ′\nout\n2\n−1\n2\np\nµ′\nout(1 −µ′\nout)\n1\n2\np\nµ′\nout(1 −µ′\nout)\n−1\n2\np\nµ′\nout(1 −µ′\nout)\n1 −µ′\nout\n\n\n,\nρE,3 =\n\n\n\nµ′\nout\n2\n−iµ′\nout\n2\n1\n2\np\nµ′\nout(1 −µ′\nout)\niµ′\nout\n2\nµ′\nout\n2\ni\n2\np\nµ′\nout(1 −µ′\nout)\n1\n2\np\nµ′\nout(1 −µ′\nout)\n−i\n2\np\nµ′\nout(1 −µ′\nout)\n1 −µ′\nout\n\n\n,\nρE,4 =\n\n\n\nµ′\nout\n2\niµ′\nout\n2\n1\n2\np\nµ′\nout(1 −µ′\nout)\n−iµ′\nout\n2\nµ′\nout\n2\n−i\n2\np\nµ′\nout(1 −µ′\nout)\n1\n2\np\nµ′\nout(1 −µ′\nout)\ni\n2\np\nµ′\nout(1 −µ′\nout)\n1 −µ′\nout\n\n\n.\n(25)\nwhere, for example, the first matrix is obtained from |ψs.ch.,1⟩⟨ψs.ch.,1|:\n|ψs.ch.,1⟩=\np\n1 −µ′\nout |vac⟩+\np\nµ′\nout |D1 ph.⟩\n(26)\nand |D1 ph.⟩= (|H1 ph.⟩+|V1 ph.⟩)/\n√\n2 denotes diagonal polarization with one photon.\n|ψs.ch.,1⟩limits from above the Trojan light that came out of the Alice’s setup when\nthe Alice’s pulse ρ1 is transmitted. All density matrices are found similarly to (26).\nThe density matrices (25) correspond to the side channel emission when the phase\nmodulator is configured to generate states |ψ1⟩, |ψ2⟩, |ψ3⟩and |ψ4⟩, respectively.\nThen the light in different polarization bases emitted from Alice’s setup can be\nconservatively estimated from above as ρBE,X′ and ρBE,Y ′:\nρBE,X′ = ρ1 ⊗ρE,1 + ρ2 ⊗ρE,2 ,\nρBE,Y ′ = ρ3 ⊗ρE,3 + ρ4 ⊗ρE,4 .\n(27)\n(Here a generic form of the Alice’s states ρi is choosed due to possible imperfect\nstate preparation described in Appendices A and B.)\nTo quantify the difference between the phase error Eph,X′\n1\nand the bit error\nEY ′\n1 , let use the concept of quantum coin introduced in [19] for an equivalent\nentanglement-based virtual protocol. Applying the complementarity argument [20]\n8\n\n\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90 100 110 120 130 140 150\nTransmission distance, km\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\nlsec/lver\nCoherent, perfect s.p.\nArbitrary, perfect s.p.\nArbitrary, imperfect s.p.\n0\n10\n20\n30\n40\n50\n60\n70\n80\n90 100 110 120 130 140 150\nTransmission distance, km\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\nlsec/lver\n∆= 10−5\n∆= 10−6\n∆= 10−7\n∆= 10−8\n∆= 10−9\n∆= 10−10\n∆= 10−11\n∆= 10−12\nFigure 2: Left: the secret key rate per one verified click. Blue line indicates the\nscenario for the Trojan attack by probing with coherent pulses in the presence of\nperfect Alice’s state preparation (∆= 5 × 10−7), orange and green are for Trojan\nprobing by arbitrary pure states with perfect (∆= 5 × 10−7) and imperfect (∆=\n9.2 × 10−6) Alice’s state preparations respectively. Right: the secret key rate per\none verified click for different values of D∆. Note, configurations of three isolators\n{28 dB, 28 dB, 48 dB} and {28 dB, 48 dB, 48 dB} provide (for the case of ideal state\npreparation) ∆≈10−9 and ∆≈10−11 respectively.\nand the Bloch sphere bound [21] to the quantum coin yields the following inequal-\nity [22]:\nq\nF(ρBE,X′, ρBE,Y ′) ≤1−Y1 +Y1\n\u0012q\nEph,X′\n1\nEY ′\n1 +\nq\n(1 −Eph,X′\n1\n)(1 −EY ′\n1 )\n\u0013\n, (28)\nwhere the conditional probability of single-photon clicks Y1 = (YX′\n1\n+ YY ′\n1 )/2 is\nintroduced and the fidelity F between two states is defined as:\nF(ρBE,X′, ρBE,Y ′) ≡\n\u0014\nTr\n\u0012q√ρBE,X′ ρBE,Y ′ √ρBE,X′\n\u0013\u00152\n.\n(29)\nHere we have not taken into account possible transformations of all matrices by\nthe same unitary operator U to Eve’s and Alice’s system, but it can be shown\n(through properties of square root of matrices and trace and properties of self-\nadjoint and unitary matrices) that substituting U into (29) will not change the\nvalue of F(ρBE,X′, ρBE,Y ′). Solving (28), one can obtain the following upper bound\non the single-photon phase errors:\nEph,X′\n1\n≤EY ′\n1 +4∆′(1−∆′)(1−2EY ′\n1 )+4(1−2∆′)\nq\n∆′(1 −∆′)EY ′\n1 (1 −EY ′\n1 ) , (30)\n∆′ = 1 −\np\nF(ρBE,X′, ρBE,Y ′)\n2Y1\n= ∆\nY1\n,\n(31)\nwhere the value ∆= (1 −\n√\nF)/2 is usually called the quantum coin imbalance.\n3\nResults and discussion\nThe maximum input intensity of the Trojan probing is chosen as Iin = 2.5 × 1012\nphotons per Alice’s pulse and this value was determined for commercial QKD\n9\n\n\nscheme [18].\nThe total loss of the Trojan photons in the Alice’s equipment is\nαA = 172 dB, where two optical isolators with 28 dB and 48 dB is used as pas-\nsive countermeasure against Trojan-horse attack (see [18] for detailed description\nof the commercial scheme and experimental analysis of its Trojan-horse loophole).\nAuthors determine the Trojan output intensity as µout = 10−αA/10Iin = 1.5 × 10−5.\nIn this paper µout = 10−6 is chosen, which is realistic value for scheme with 2-3 isola-\ntors and corresponds previous investigations [6,23]. However, the work [18] suggest\nto use an additional isolator for achieving value µout ≤10−9. Therefore, the values\nup to µout = 10−12 are considered in the context of an influence on the secrete key\nrate.\nTwo cases of Alice’s states are examined: the ideal state preparation (3) and the\nimperfect one with the Gaussian approximation (35). The imbalance value of the\nquantum coin were found as ∆= 5 × 10−7 and ∆= 9.2 × 10−6 by new approach\nand with the states (3) and (35), respectively. ∆= 5 × 10−7 is for Trojan attack\nby coherent states [6] and perfectly prepared states. Simulation of the secret key\nrates gives the results shown in Fig. 2 (see Subsection 2.1 Experimental Setup and\nAppendix B in [9] for a description of the simulation methods and parameters).\nIt is worth noting to say that there are presented a rather conservative approach\nby replacing one side channel (Trojan attack with emission given by arbitrary statis-\ntics) with another side channel given by (10). However, the evaluation for the con-\nservative side-channel (10) yields almost the same secrete key rate as in the scenario\nwith the additional assumption of coherent Trojan states. The secrete key rate is\nalso estimated for realistic setup parameters and imperfect state preparation (for\nsimplicity described by a Gaussian model of imperfect polarization-state prepara-\ntion) and the key transmission maximum range is found higher than 100 km (see\nleft Fig. 2).\nThe main contribution to the quantum-coin imbalance value is derived from\nimperfect state preparation and it can be seen in significant difference between ∆’s\nfor ideal state preparation and modeled imperfect one. For example, the value µout =\n10−100 provide ∆= 8.8×10−6 for the proposed model of imperfectly prepared states.\nNevertheless, after ∆< 10−8 (right Fig. 2) the influence on the key rate decrease\nrapidly. Consequently, the main leakage threat comes from imperfect preparation\nand conservative estimation of the Trojan-horse attack by side channel (10) (instead\nof previous approaches [6–8]) does not significantly reduce the secrete key rate.\n4\nConclusions\nThis work provides a analysis of the security of quantum key distribution (QKD)\nsystems against Trojan horse attack on phase modulators, considering both ideal and\nimperfect state preparation. By addressing imperfections in transmitted states and\nmodeling Trojan probing by arbitrary generic (pure or mixed) states, a framework\nfor enhancing QKD security in practical scenarios is developed. The Trojan attack\nmodel is generalized to arbitrary states, conservative bounds on information leakage\nare derived as leakage through single-photon side-channel states.\nThis approach\nallows to more realistically assess the threat posed by Trojan horse attacks and\nit does not rely on restrictive assumptions about the nature of the eavesdropper’s\nprobing pulses.\nThe quantum coin imbalance remains low (5 × 10−7 for ideal and 9.2 × 10−6\n10\n\n\nfor imperfect preparation) even under Trojan attack on PM, demonstrating the re-\nsilience of practical QKD systems when equipped with proper countermeasures, such\nas isolators and spectral filters, which are essential for mitigating the risk of infor-\nmation leakage. Moreover, numerical simulations confirm secure key distribution\nover distances higher than 100 km. This work bridges theory and practice, offering\ntools to enhance QKD security against emerging threats for practical applications\nand increasing the feasibility of quantum-secured communication.\nAcknowledgements\nThe author is grateful to Andrey Tayduganov and Daniil Menskoy for fruitful dis-\ncussions and valuable advices on the manuscript.\nAppendix A\nImperfect state preparation\nDensity matrices ρX′ = 1\n2(|ψ1⟩⟨ψ1| + |ψ2⟩⟨ψ2|) and ρY ′ = 1\n2(|ψ3⟩⟨ψ3| + |ψ4⟩⟨ψ4|) can\nbe written as follows in the case of imperfect preparation:\nρX′ = 1\n2\n \n1 + cos θ\ne−i φ1+φ2\n2\ncos\n\u0000 φ1−φ2\n2\n\u0001\nsin θ\nei φ1+φ2\n2\ncos\n\u0000 φ1−φ2\n2\n\u0001\nsin θ\n1 −cos θ\n!\n,\nρY ′ = 1\n2\n \n1 + cos θ\ne−i φ3+φ4\n2\ncos\n\u0000 φ3−φ4\n2\n\u0001\nsin θ\nei φ3+φ4\n2\ncos\n\u0000 φ3−φ4\n2\n\u0001\nsin θ\n1 −cos θ\n!\n.\n(32)\nThe condition (2) ρX′ = ρY ′ is satisfied for perfectly prepared states, i.e. the photon\nsource is basis-independent. If ρX′ ̸= ρY ′ is true, then the values of single-photon\nphase errors Eph,X′\n1\nin X′-basis are not estimated from the measured bit error EY ′\n1\nin Y ′-basis (or vice versa).\nIn the paper [24] devoted to fully passive QKD, the authors consider an equiva-\nlent protocol based on virtual entanglement. In this protocol, the source emits signal\nstates with mixed polarization in the Z-basis. It is argued that Alice’s imperfect\npreparation of states in the Z-basis is equivalent to Bob’s imperfect measurement.\nThis leads to one of the ideas in [24,25] – the replacing of the source of randomly\nfluctuating on Bloch sphere pure states {|ψi⟩} with an equivalent source emitting\nmixed states {ρi},\nρi =\nZ 2π\n0\nZ π\n0\npi(φ, θ)|ψ(φ, θ)⟩⟨ψ(φ, θ)|dφdθ ,\n(33)\nwhere distributions {pi(φ, θ)} is characterized directly from the test experimental\nsetup measurements (a simple Gaussian approximation of this distributions is pro-\nposed in Appendix B). The density matrices (32) in this case are replaced by another\none:\nρX′ = ρ1 + ρ2 ,\nρY ′ = ρ3 + ρ4 .\n(34)\n11\n\n\nAppendix B\nGaussian distribution pi(φ, θ)\nUsing a simple Gaussian model pi(φ, θ) = G\n\u0000φ, φi, σφi\n\u0001\nG\n\u0000θ, θ, σθ\n\u0001\n, the following\nanalytical approximation can be obtained:\nρi ≃\nZ 2π\n0\nZ π\n0\nG\n\u0000φ, φi, σφi\n\u0001\nG\n\u0000θ, θ, σθ\n\u0001\n|ψ(φ, θ)⟩⟨ψ(φ, θ)|dφdθ\n≃1\n2\n\n\n1 + e−\nσ2\nθ\n2 cos θ\ne−iφi−1\n2 (σ2\nφi+σ2\nθ) sin θ\neiφi−1\n2 (σ2\nφi+σ2\nθ) sin θ\n1 −e−\nσ2\nθ\n2 cos θ\n\n,\n(35)\nwhere for simplicity the probability density normalization coefficients are omited,\nsince\nZ xmax\n0\nG(x, x, σx)dx = 1\n2\n\u0014\nerf\n\u0012 x\n√\n2σ\n\u0013\n+ erf\n\u0012xmax −x\n√\n2σ\n\u0013\u0015\n≃1 ,\n(36)\nfor σx ≪x and σx ≪xmax −x.\nAppendix C\nNon-decreasing of Chernoff bound\nLemma 1. The following holds:\nf(x) > f(y),\n(37)\nfor the Chernoff bound f(x) = (1 + δ)x\n\u0014\neδ\n(1 + δ)1+δ\n\u0015x\n= ε ,\nδ > 0, x > 0,\n(38)\nand for x > y. The same statement holds for the lower Chernoff bound.\nProof. Let introduce the notation f(x) = (1 + δ)x = zx and rewrite (38):\nez−1\nzz\n= ε1/x\n(39)\nDerivative with respect to x is:\nz′ez−1\nzz lnz = ε1/x\nx2 ln(ε)\n(40)\nSubstitute the left side of the equation (39) into the right side of (40):\nz′ez−1\nzz lnz = ez−1\nzz\n1\nx2ln(ε)\n(41)\nz′lnz = 1\nx2ln(ε)\n(42)\nFind ln(ε) using (39):\nln(ε) = x(z −1 −zln(z))\n(43)\nand substitute in (42):\nz′lnz = z −1 −zln(z)\nx\n(44)\n12\n\n\nz′ = z −1 −zln(z)\nxlnz\n(45)\nDerivative f ′(x) is:\nf ′(x) = xz′(x) + z(x) = z −1 −zln(z)\nlnz\n+ z = z −1\nlnz\n(46)\nSince δ > 0, then z = 1 + δ > 1 and ln(z) > 0 which means f ′(x) = (z −1)/lnz > 0.\nConsequently, f(x) is an increasing function. Similarly, reversed inequality can be\nproven for the lower Chernoff bound.\nRemark. Also the differential equation (42) gives an exact solution for δ(x) > 0:\nδ(x) = e1+W0(−x+ln(ε)\nex\n) −1,\n(47)\nwhere W0(y) is one of the Lambert W-function branches. Note, that other Chernoff\nbounds can be similarly rewritten in an explicit form with Lambert W-function\nbranches.\nReferences\n[1] C. H. Bennett and G. Brassard, “Quantum cryptography: Public-key\ndistribution and coin tossing”, in Proceedings of the IEEE International\nConference on Computers, Systems, and Signal Processing (IEEE, New York,\n1984), pp. 175–179. 1984.\n[2] F. Xu, X. Ma, Q. Zhang, H.-K. Lo, and J.-W. Pan, “Secure quantum key\ndistribution with realistic devices”, Reviews of Modern Physics 92 (2020)\nno. 2, , arXiv:1903.09051.\n[3] A. Vakhitov, V. Makarov, and D. R. Hjelme, “Large pulse attack as a method\nof conventional optical eavesdropping in quantum cryptography”, Journal of\nModern Optics 48 (2001) no. 13, 2023–2038.\n[4] A. Trushechkin, E. Kiktenko, and A. Fedorov, “Practical issues in decoy-state\nquantum key distribution based on the central limit theorem”, Phys. Rev. A\n96 (2017) 022316, arXiv:1702.08531.\n[5] A. Trushechkin, E. Kiktenko, D. Kronberg, and A. Fedorov, “Security of the\ndecoy state method for quantum key distribution”, Physics-Uspekhi 64 (2021)\nno. 1, 88, arXiv:2101.10128.\n[6] M. Lucamarini, I. Choi, M. Ward, J. Dynes, Z. Yuan, and A. Shields,\n“Practical Security Bounds Against the Trojan-Horse Attack in Quantum Key\nDistribution”, Physical Review X 5 (2015) no. 3, , arXiv:1506.01989.\n[7] W. Wang, K. Tamaki, and M. Curty, “Finite-key security analysis for\nquantum key distribution with leaky sources”, New. J. Phys. 20 (2018) no. 8,\n083027, arXiv:1803.09508.\n13\n\n\n[8] K. Tamaki, M. Curty, and M. Lucamarini, “Decoy-state quantum key\ndistribution with a leaky source”, New. J. Phys. 18 (2016) no. 6, 065008,\narXiv:1803.06045.\n[9] A. Reutov, A. Tayduganov, V. Mayboroda, and O. Fat’yanov, “Security of\nthe decoy-state bb84 protocol with imperfect state preparation”, Entropy 25\n(2023) no. 11, 1556, arXiv:2310.01610.\n[10] W.-Y. Hwang, “Quantum Key Distribution with High Loss: Toward Global\nSecure Communication”, Phys. Rev. Lett. 91 (2003) 057901,\narXiv:quant-ph/0211153.\n[11] H.-K. Lo, X. Ma, and K. Chen, “Decoy State Quantum Key Distribution”,\nPhys. Rev. Lett. 94 (2005) 230504, arXiv:quant-ph/0411004.\n[12] X.-B. Wang, “Beating the Photon-Number-Splitting Attack in Practical\nQuantum Cryptography”, Phys. Rev. Lett. 94 (2005) no. 23, ,\narXiv:quant-ph/0410075.\n[13] X. Ma, B. Qi, Y. Zhao, and H.-K. Lo, “Practical decoy state for quantum key\ndistribution”, Phys. Rev. A 72 (2005) 012326, arXiv:quant-ph/0503005.\n[14] A. Duplinskiy, V. Ustimchik, A. Kanapin, V. Kurochkin, and Y. Kurochkin,\n“Low loss qkd optical scheme for fast polarization encoding”, Opt. Express 25\n(2017) no. 23, , arXiv:1709.06655.\n[15] M. Pereira, G. Curr´as-Lorenzo, A. Navarrete, A. Mizutani, G. Kato, M. Curty,\nand K. Tamaki, “Modified bb84 quantum key distribution protocol robust to\nsource imperfections”, Phys. Rev. Res. 5 (2023) 023065, arXiv:2210.11754.\n[16] C. C. W. Lim, M. Curty, N. Walenta, F. Xu, and H. Zbinden, “Concise\nsecurity bounds for practical decoy-state quantum key distribution”, Physical\nReview A 89 (2014) no. 2, , arXiv:1311.7129.\n[17] D. Tupkary, S. Nahar, P. Sinha, and N. L¨utkenhaus, “Phase error rate\nestimation in qkd with imperfect detectors”, arXiv eprint (2024) ,\narXiv:2408.17349.\n[18] V. Makarov, A. Abrikosov, P. Chaiwongkhot, A. K. Fedorov, A. Huang,\nE. Kiktenko, M. Petrov, A. Ponosova, D. Ruzhitskaya, A. Tayduganov,\nD. Trefilov, and K. Zaitsev, “Preparing a commercial quantum key\ndistribution system for certification against implementation loopholes”,\nPhysical Review Applied 22 (2024) no. 4, , arXiv:2310.20107.\n[19] D. Gottesman, H.-K. Lo, N. L¨uttkenhaus, and J. Preskill, “Security of\nquantum key distribution with imperfect devices”, Quant. Inf. Comput. 4\n(2004) no. 5, 325–360, arXiv:quant-ph/0212066.\n[20] M. Koashi, “Simple security proof of quantum key distribution based on\ncomplementarity”, New J. Phys. 11 (2009) no. 4, 045018.\n14\n\n\n[21] K. Tamaki, M. Koashi, and N. Imoto, “Unconditionally Secure Key\nDistribution Based on Two Nonorthogonal States”, Phys. Rev. Lett. 90 (2003)\n167904, arXiv:quant-ph/0212162.\n[22] H.-K. Lo and J. Preskill, “Security of Quantum Key Distribution Using Weak\nCoherent States with Nonrandom Phases”, Quantum Info. Comput. 7 (2007)\nno. 5, 431–458, arXiv:quant-ph/0610203.\n[23] M. Pereira, M. Curty, and K. Tamaki, “Quantum key distribution with flawed\nand leaky sources”, npj Quantum Information 5 (2019) , arXiv:1902.02126.\n[24] W. Wang, R. Wang, C. Hu, V. Zapatero, L. Qian, B. Qi, M. Curty, and H.-K.\nLo, “Fully Passive Quantum Key Distribution”, Phys. Rev. Lett. 130 (2023)\n220801, arXiv:2207.05916.\n[25] V. Zapatero, W. Wang, and M. Curty, “A fully passive transmitter for\ndecoy-state quantum key distribution”, Quantum Science and Technology 8\n(2023) no. 2, 025014, arXiv:2208.12516.\n15\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21160v1.pdf",
    "total_pages": 15,
    "title": "Imperfect preparation and Trojan attack on the phase modulator in the decoy-state BB84 protocol",
    "authors": [
      "Aleksei Reutov"
    ],
    "abstract": "Quantum key distribution (QKD) provides a theoretically secure method for\ncryptographic key exchange by leveraging quantum mechanics, but practical\nimplementations face vulnerabilities such as Trojan horse attack on phase\nmodulators. This work analyzes the security of QKD systems under such attacks,\nconsidering both ideal and imperfect state preparation scenarios. The Trojan\nattack model is generalized to arbitrary states of probing pulses and\nconservative bounds of information leakage through side-channel of special form\nare introduced. The quantum coin imbalance, a critical security parameter,\nremains low (on the order of $10^{-7}$ for ideal state preparation and\n$10^{-5}$ for imperfect preparation) with this new approach and presence\nadditional hardware passive countermeasures. Numerical simulations confirm\nnonzero secure key rate at distances over 100 km through optical fiber channel.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}