{
  "id": "arxiv_2502.21261v1",
  "text": "Astronomy & Astrophysics manuscript no. uxastro\n©ESO 2025\nMarch 3, 2025\nObservations of UX Ori in deep minima with the Nordic Optical\nTelescope. I. Analysis of spectral lines\nL.V. Tambovtseva1, A.A. Djupvik2, 3, V.P. Grinin1, H. Weber4, H. Bengtsson5, H. De Angelis5, G. Duszanowicz5, D.\nHeinonen5, L. Hermansson5, G. Holmberg5, T. Karlsson5, M. Larsson5, J. Warell5, T. Wikander5\n1 Pulkovo Astronomical Observatory, Russian Academy of Sciences, Pulkovskoe sh. 65, St. Petersburg, 196140, Russia\ne-mail: lvtamb@mail.ru\n2 Nordic Optical Telescope, Rambla José Ana Fernández Pérez 7, ES-38711 Breña Baja, Spain\n3 Department of Physics and Astronomy, Aarhus University, Munkegade 120, DK-8000 Aarhus C, Denmark\n4 Luleå University of Technology, SE-971 87 Luleå Sweden\n5 SAAF, Svensk AmatörAstronomisk Förening, Sweden\nReceived; accepted\nABSTRACT\nContext. UX Orionis stars are the most active young stars; they undergo sporadic fadings of 2 - 4 magnitudes in the V-band, due to\nvariable circumstellar extinction caused by a nearly edge-on star–disc system. The long-lasting monitoring of a number of stars of\nthis type with the Nordic Optical Telescope from 2019 to 2024 has given a rich collection of material of high-resolution (R ∼25000)\nspectra obtained during different brightness states of the stars. In this paper, we present the results of observations for UX Ori itself.\nUntil now only one spectrum of high resolution had been obtained for this star during brightness minimum, making it difficult to do a\ncomprehensive analysis.\nAims. Our aim is to analyse how different spectral lines change during such irregular fading events, when the star is going in and out\nof eclipses, obscured by dust along the line of sight.\nMethods. For this purpose we provide a comparative analysis of the profiles and equivalent widths of the spectral lines belonging to\nthe different atoms and ions. In addition we compare the results for UX Ori with those made for another target in our sample: RR Tau.\nResults. Common features of variability are revealed: (1) a strengthening of the Hα line relatively to the continuum during eclipses;\n(2) the appearance of additional emission on the frequencies of photospheric lines (e.g. FeII, CaII, SiII). The different behaviour of\nthe spectral lines during fading found for UX Ori and RR Tau may be caused by two effects: a different contribution of the scattered\nlight to the stellar flux during eclipses or a less intense disc wind of UX Ori.\nKey words. Stars: variables: T Tauri, Herbig Ae/Be – Stars: individual: UX Ori, RR Tau – Stars: winds, outflows – accretion,\naccretion disks – Techniques: spectroscopic – Techniques: photometric\n1. Introduction\nUX Orionis stars (UXORs) are among the most active young\nstars. This is demonstrated by irregular flux variability, which\ntakes the form of sporadic brightness weakening with ampli-\ntudes from 2 to 4 magnitudes in the V-band. The UXOR family\nincludes both low-mass T Tauri stars (TTSs) and intermediate-\nmass Herbig Ae stars (HAEs). The latter makes up the majority\nof this family. The typical duration of these brightness minima\nranges from a few days to a few weeks for stars of spectral type\nA - F (see e.g. Mel’nikov 2001; Shakhovskoi et al. 2003, and\nreferences therein). Cooler TTSs often exhibit small-amplitude\nbrightness minima (dippers) with duration of 1 - 2 days (see e.g.\nAnsdell et al. 2016; Roggero et al. 2021, and references therein).\nOccasionally, very long-lasting minima (more than a year) are\nobserved (see e.g. Rostopchina-Shakhovskaja et al. 2012). This\nphotometric behaviour is due to variable circumstellar (CS) ex-\ntinction caused by dust from their protoplanetary discs, which\nin these stars make a small angle with the line of sight (LOS).\nIn other words, an observer sees these star–disc systems nearly\nedge-on. This conclusion has been reached based (1) on obser-\nvations of linear polarisation of UXORs (Grinin et al. 1991)\nand their modelling (Natta & Whitney 2000; Shulman & Grinin\n2019), (2) on the behaviour of the shape of the Hα line profiles\nwith the level of photometric activity (Grinin & Rostopchina\n1996; Vioque et al. 2018), and (3) on the modelling of hydro-\ngen lines (Tambovtseva et al. 2020). Modern interferometric ob-\nservations have confirmed this conclusion (Kreplin et al. 2013,\n2016, and refereces therein).\nNevertheless, while the physical explanation of the flux fad-\ning is found to be dust fragments passing in front of the star\nand eclipsing it, the cause of these sporadic appearances of dust\nclouds is less well established. One suggestion is that the disc\nwind or the poloidal component of the magnetic field is lift-\ning up material from the disc atmosphere. In order to investi-\ngate how disc winds, dust clouds, and sub-structure in the inner\nregions of protoplanetary discs are connected, we have mon-\nitored with high-resolution spectroscopy several UXOR stars.\nDramatic changes in the emission lines during the flux varia-\ntion was shown by Rodgers et al. (2002) for the UXOR star\nRR Tau, and hybrid models treating both accretion and magneto-\ncentrifugal disc winds have been proposed to explain them (Tam-\nbovtseva et al. 2020). Thus, monitoring the spectral behaviour of\nsuch stars during the dust eclipses is a way to investigate the\nprocesses at play. In addition, since the dust eclipses behave as\na coronagraph, these observations offer a view into the inner re-\nArticle number, page 1 of 19\narXiv:2502.21261v1  [astro-ph.SR]  28 Feb 2025\n\n\nA&A proofs: manuscript no. uxastro\ngions of young protoplanetary systems that cannot be resolved\nspatially.\nEchelle spectra of high resolution (R ∼25000 Å) were ob-\ntained with the Nordic Optical Telescope (NOT) of several UX-\nORs over the period 2019 - 2024, covering different bright-\nness states of several UXORs, including deep minima. These\nobservations were possible thanks to the flexible Target-of-\nOpportunity mode offered by the NOT and to knowing when\nto trigger based on photometric monitoring from our network of\namateur astronomers. The first results, the spectra of the UXOR\nstar RR Tau, were analysed and presented together with the mod-\nelling of its dust eclipses in Grinin et al. (2023).\nIn the present paper (Part I) we give a detailed analysis of\nthe behaviour of the main spectral lines of UX Ori, the star that\ngives its name to this whole group of young stars. It should be\nmentioned that until now only one spectrum in the Hα region\nhas been observed at high spectral resolution when UX Ori was\nin the brightness minimum (Grinin et al. 1994). All other spec-\ntral observations of this star were made in its bright state. There-\nfore, the spectra obtained in the present project with the NOT are\nunique because they were obtained in different states of bright-\nness including the weakest ones. This permitted us for the first\ntime to compare the behaviour of the lines of different atoms at\nthe different ionisation stages. For such an analysis we selected\nthe lines that belong to both neutral and ionised atoms. In addi-\ntion, we selected the most interesting moments when the lines\ndemonstrate dramatic or unexpected profile changes and consid-\nered them separately.\nIn addition to the study of the main spectral lines we aimed\nto investigate the reaction of the diffuse interstellar band (DIB)\n6283 Å during brightness minima. Rodgers et al. (2002) reported\nchanges in the DIB in RR Tau spectra during eclipses. Thus, a\nsuspicion arose that the DIB can absorb the radiation of the star\nin the CS envelope. However, the spectra were not of high qual-\nity. Therefore, it was important to understand whether the DIB\nis strengthened during eclipses, and for this purpose UXORs\nare suitable because they are expected to display strong changes\nwith the eclipse amplitude.\nWe compared the results of these observations with those ob-\ntained for RR Tau. In Sect. 2 we describe the observations and\nthe data reduction. In Sect. 3 we present the spectra during the\nbright and faint phases, various special features are described in\nSect. 4, and a comparison of spectral behaviour during eclipses\nbetween UX Ori and RR Tau is shown in Sect. 5. In Sect. 6 we\ndiscuss the implications and possible interpretations of the re-\nsults. Modelling of the line profiles and eclipses for UX Ori will\nbe presented in the next paper of the series (Part II).\n2. Observations\nThe observations were obtained with the high-resolution FIber-\nfed Echelle Spectrograph (FIES) through its low-resolution fibre\n(Telting et al. 2014) at the Nordic Optical Telescope (Djupvik\n& Andersen 2010) over a period from 2019 February to 2024\nMarch. Most of the data was obtained through observing pro-\ngrammes at the Nordic Optical Telescope (NOT) that were\nawarded Target-of-Opportunity time, a scheduling flexibility\nneeded in order to catch the unpredictable variability of UXOR\nstars during their irregular fading events. Another necessary re-\nquirement was the frequent photometric monitoring and rapid\ncommunication of alerts when a fading was about to occur for\none of our target stars. This was provided by the Swedish Am-\nateur Astronomy Association (SAAF).1 The collaboration with\nSAAF and the observing strategy is described more in detail in\nGrinin et al. (2023).\nFIES can be used with different fibres to obtain different\nspectral resolutions up to R ∼67000, but we selected the low-\nresolution fibre, giving a resolving power of R ∼25000 in order\nto obtain a reasonable S/N even when the targets went into fad-\ning. For UX Ori a nominal exposure time of 1800 seconds was\nused initially and until re-coating of the spectrograph mirrors\ntook place in 2021 July, after which the typical exposure time\nwas lowered to 1200 s due to an increase in the spectrograph\nthroughput. The wavelength coverage is around 3700-9100 Å.\nData reduction was made with the pipeline FIEStool2 (Stempels\n& Telting 2017). We used the tool molecfit (Smette et al. 2015)\nin its version 1.5.9 to correct the spectra for telluric contamina-\ntion from the molecules H2O, O3, and O2. All the 1D spectra\nwere normalised and put on a heliocentric velocity grid for fur-\nther measurements and analysis using standard tasks in the IRAF\npackage.\nAn overview of the observations is given in Table A.1 to-\ngether with the quasi-simultaneous brightness obtained by pho-\ntometry supplied from various sources: 1) The SAAF V-band,\n2) NOT/ALFOSC or NOT/StanCam V-band, 3) AAVSO3 V-\nband, 4) ASASSN4 g-band, or 5) AAVSO Visual magnitudes,\nwhere the latter two were used when no proper V-band magni-\ntude was available within 1 day of the FIES spectrum. Figure 1\nshows the all collected V-band monitoring by SAAF, with the\n54 epochs of FIES spectra marked in blue. For spectra where\nquasi-simultaneous SAAF or NOT V-band photometry was not\nobtained, we searched the AAVSO database for the nearest (in\ntime) photometric point in either of the bands V, g, or Visual\n(see Table A.1).\n3. Spectra in the bright and faint states of the star\nThe young star UX Ori is a Herbig Ae star of spectral type\nA3III. We took into account the investigation by the Crimean\ngroup accumulated in the paper by Rostopchina (1999), who de-\ntermined the fundamental parameters of 11 UXOR stars (lumi-\nnosities, masses, radii and ages) on the basis of long-term photo-\nmetric monitoring, argueing that they are young stars, as well as\nthe corrected parameters of UX Ori from the latest GAIA data\n(Guzmán-Díaz et al. 2021). We adopt the following stellar pa-\nrameters: M∗= 2M⊙, R∗= 1.9R⊙, Te f f = 8500 K, and log g = 4.\nThe rotational velocity v sin i = 140 km s−1, the radial velocity\nRV = + 18 km s−1 (Grinin et al. 2001).\nIn this section we present and analyse the line profiles of the\nhydrogen (Hα, Hβ), helium (HeI 5876 Å), sodium (NaI D 5889\nÅ (D1), 5895 Å (D2)), calcium (CaII 8542 Å) and iron (FeII\n4925 Å) lines at different brightness states of the star over the\nlong-lasting observational period from 2019 to 2024. When the\nstar was in its normal (bright) state in 2019 is shown in Fig. 2. As\nthe star was entering a short brightness minimum in the begin-\nning of December 2020 and (possibly) going out of it is shown\nin Fig. A.1. The brightness minimum in January 2021 is shown\nin Fig. A.2. The last season of our observations (2023 - 2024)\nis presented in the following two figures. Fig. A.3 shows the\nbeginning of the minimum in November-December 2023, and\n1 Svensk AmatörAstronomisk Förening.\n2 FIEStool manual, Stempels 2005, Nordic Optical Telescope, see\nhttps://www.not.iac.es/instruments/fies/\n3 The American Association of Variable Star Observers.\n4 All Sky Automated Survey for Supernovae.\nArticle number, page 2 of 19\n\n\nTambovtseva et al.: Observations of UX Ori in deep minima. Analysis of spectra\nFig. 1. V-band observations of UX Ori (black small circles) obtained mainly from observers (e.g. SAAF) and with a few additional data points\nfrom the NOT, are shown together with the epochs of FIES spectroscopy (large blue circles). When quasi-simultaneous SAAF or NOT V-band is\nlacking (empty blue circles), the nearest photometric point found by searching the AAVSO database is shown in Table A.1.\nFig. A.4 presents the brightness minimum in January 2024. The\nline profiles are given in the star coordinate system.\nThe most prominent hydrogen lines Hα and Hβ are the most\ninformative lines regarding conditions in the close vicinity of\nthe young star. In the normal (bright) state, the Hα line has a\ndouble-peaked profile with a typical ratio V/R > 1 (Grinin et al.\n2001, and these observations). Earlier only once has a single-\npeaked Hα emission profile been obtained during the deep and\nlong-lasting brightness minima (Grinin et al. 1994). Our cur-\nrent observations demonstrate a single-peaked profile during the\neclipse in January 2021 (Fig. A.2) and the long-lasting (a month\nor more) eclipse in January 2024 (Fig. A.4). These observations\nsuggest that the single-peaked and almost symmetric Hα profile\nis a typical shape during the deep brightness minima.\nIn the normal state the Hβ line profile shows a red-shifted\nabsorption component; this profile becomes wider and shallower\nduring the brightness minima, an indication of accretion of the\nmaterial (see e.g. Figs. A.2 and A.4).\nThe HeI 5876 Å line does not disappear in the brightness\nminima as observed in the case of the RR Tau eclipses. The\nbehaviour of the sodium lines also does not correlate with the\nbrightness.\nIn Figs. 2, A.1, A.2, A.3 and A.4 the calcium lines\nCaII 8542 Å and iron FeII 4924 Å (one line of the multiplet) are\nalso shown. These lines are mainly photospheric, but they are in-\nteresting because they also contain a circumstellar line which can\nbe both in absorption and in emission (so-called CS veiling). An\nanalysis of the modification of these profiles is helpful to under-\nstand the physical processes in the nearest vicinity of the star. As\nis seen from Fig. 2, in the normal state, the lines of ionised cal-\ncium are of the inverse P Cygni type, which is typical for accret-\ning matter. In the faint state on the other hand Figs. A.2, A.3, and\nA.4 show that an additional emission appears and the absorption\nmay partially or completely disappear. Sometimes an additional\nabsorption appears on the red side (see Fig. A.1, and A.2). In\nthe latter case it is not connected with changes in brightness.5\nThe FeII line behaves in a similar way as the CaII line: when the\nstar is at maximum brightness it is in absorption and red-shifted,\n5 We observe the same in NaI D. In general, NaI D and CaII do not\ncorrelate in behaviour, except for a few days (Fig. 2)\nand during the minima an emission component is added, and the\nline becomes wider and shallower (see e.g. Fig. A.3 for the date\nNov 30, 2023). We can suggest the following explanation for the\nchanges observed in these line profiles during eclipses. When\nthe star enters minimum, the emission begins to reveal itself on\nthe background of the decreasing continuum. This emission is\nalways present and it forms in a region which is not obscured\nby the screen. In the case of RR Tau we estimated the velocity\nof the blue-shifted emission in the photospheric lines (e.g. FeII)\nand suggested that it is due to the disc wind on the periphery of\nthe disc (Grinin et al. 2023). The same may be suggested for UX\nOri but keeping in mind changes in the line profiles, the scale of\nthe lines variation is different and not as significant as in the case\nof RR Tau.\nFrom the Hα emission lines obtained in the bright state of\nthe star one can estimate a gas velocity of about 400 km s−1; the\nhelium and sodium lines indicate gas velocities ∼200 km s−1\n(see Fig. 2.)\n4. Special features of the spectra\n4.1. Deviation of the central dip in different epochs\nIn December of 2021 we observed that the symmetry of the Hα\nline profile is broken during the whole observational period, see\nFig. 3. Although the profile remains double-peaked, the central\nvelocity minimum (dip) is shifted by about 40 km s−1 to the red\nside, and the \"red\" emission component is noticeably narrower.\nTo illustrate this, we have selectively overplotted the Hα, Hβ and\nNaI D1 line profiles obtained on the same dates for the two peri-\nods in 2019 and 2021. All of these spectra were obtained during\nthe bright state of the star. In December 2021 the Hβ line has an\nadditional absorption that appears in the red-shifted absorption\nprofile, and the central dip of the Hα line coincides in velocity\nwith the absorption component of the sodium line. The sodium\ndoublet forms partially in the circumstellar medium, in the accre-\ntion zone, and partially in the interstellar medium. The Hβ line\nforms in a region that is a few times closer to the star than the\nHα formation region (Grinin & Tambovtseva 2011; Tambovt-\nseva et al. 2020).\nThe behaviour of the line profiles shown in Fig. 3 can be in-\nterpreted to suggest that in December 2021 we have caught the\nArticle number, page 3 of 19\n\n\nA&A proofs: manuscript no. uxastro\n1\n2\n3\n06.03\n10.60\nIntensity\nHα\n1\n2\n3\n03.03\n10.86\nIntensity\n1\n2\n3\n01.03\n10.82\nIntensity\n0\n1\n2\n3\n−400\n0\n400\n23.02\n10.56\nIntensity\nV, km s−1\n1\n2\n06.03\nHβ\n1\n2\n03.03\n1\n2\n01.03\n0\n1\n2\n−400\n0\n400\n23.02\nV, km s−1\n1\n2\n06.03\nHe + NaI D\n1\n2\n03.03\n1\n2\n01.03\n0\n1\n2\n−800\n−400\n0\n400\n23.02\nV, km s−1\n1\n2\n06.03\nCaII 8542\n1\n2\n03.03\n1\n2\n01.03\n0\n1\n2\n−400\n0\n400\n23.02\nV, km s−1\n1\n2\n06.03\nFeII 4924\n1\n2\n03.03\n1\n2\n01.03\n0\n1\n2\n−400\n0\n400\n23.02\nV, km s−1\nFig. 2. UX Ori line profiles of Hα, Hβ, NaI D, CaII 8542 Å, and FeII 4924 Å during normal bright states in 2019. The line profiles are shown with\nrespect to the stellar radial velocity (vertical line). The dates of the observations are shown in each plot. The left panel includes the values of the\nV-magnitudes, which are related to all the lines. The narrow emission components in the sodium lines are telluric lines (see text for details).\nstar in a moment of substantial infall of matter, in other words,\nan increase in the mass accretion rate. This explanation is ac-\nceptable if we take into account that instability of the line pro-\nfiles may be a reaction to the changes in the accretion rate. This\nalso leads us to suggest that for UX Ori, the disc wind does not\nhave enough power to mask the signature of an accretion burst in\nthe Hα line, like it does, for example, in the star RR Tau, another\nmember of the UXOR family (Grinin et al. 2023). We also note\nthat during the following dates, beginning of January 2022, the\ncentral dip has returned to its usual place, suggesting the mass\naccretion rate returned to its former value.\n4.2. Three-peaked Hα line profiles\nOn some dates we observed well-defined three-peaked Hα line\nprofiles (Fig. 4). All the three emission peaks have deep gaps be-\ntween them, and the two blue-shifted emission components are\nlocated at the same positions in all profiles, while the red-shifted\ncomponent varies. This gives the impression that we observe this\n‘three-peak event’ as mainly a transformation of the blue peak,\nforming an absorption dip in it, and thus being related to the mat-\nter moving towards the observer. We also note that in the Hβ line\nprofile a small blue-shifted absorption is seen.\nThe spectrum in the upper panel was obtained when the star\nwas in the normal bright state, while the two other were obtained\non 9 and 12 March 2020, in the fainter state of the star. On March\n12 the line HeI 5876 Å disappears, and the sodium lines become\nshallower. The latter could possibly be due to the presence of\nstrong telluric emission lines compared to the weaker ones three\ndays before, on March 9. We note that the narrow absorption\ncomponents of the sodium lines are formed in the circumstellar\nand interstellar medium.\nWe suggest that such a configuration of the profiles may be\na result of evolution of the blue peak due to non-stationary ac-\ncretion (i.e. an absorption feature forming in the blue peak). It\ncould also be explained by the appearance of emission arising\non the periphery of the disc wind that is not obstructed by the\ndust screen.\nThe three-peaked Hα line profiles may be one of the manifes-\ntations of a non-stationary accretion. Examples of such profiles,\nbut with red-shifted lines (in the Hα) and blue-shifted absorption\ncomponents (in the Hβ line) are shown by Bouvier et al. (2007,\ntheir Figs. 9 and 10). The authors considered the young TTS star\nAA Tau which is seen nearly edge-on. Investigating the accre-\ntion/ejection processes of this star the authors concluded that the\nreason of such lines may be the time variability of the magneto-\nspheric accretion flow on a timescale of a few rotational periods.\nArticle number, page 4 of 19\n\n\nTambovtseva et al.: Observations of UX Ori in deep minima. Analysis of spectra\nFig. 3. The line profiles of Hα (black), Hβ (blue), and HeI + NaI D (red) in 2019 (upper panel) and in 2021 (lower panel). The central dip in Hα\nis located at about 10 km s−1 in 2019, and it is red-shifted to about 50 km s−1 in 2021. The dates and V-band magnitudes are given in each panel.\n1\n2\n3\n30.01\n10.83\nIntensity\nHα\n1\n2\n3\n09.03\n11.35\nIntensity\n0\n1\n2\n3\n−400\n0\n400\n12.03\n11.22\nIntensity\nV, km s−1\n1\n2\n30.01\nHβ\n1\n2\n09.03\n0\n1\n2\n−400\n0\n400\n12.03\nV, km s−1\n1\n2\n30.01\nHeI + NaI D\n1\n2\n09.03\n0\n1\n2\n−800\n−400\n0\n400\n12.03\nV, km s−1\nFig. 4. Line profiles of Hα (left), Hβ (middle), and HeI 5876 Å +\nNaI 5889/5895 Å (right) in 2020. The dates of the observations are\nshown in each plot, and the left-hand panel includes the value of the\nV-band magnitude.\nAnother explanation is that a third emission peak is formed\nbetween the original blue and red peaks during obscuration of\nthe star by the dusty screen, where the periphery of the disc wind\nremains visible beyond the screen. The Keplerian velocity of this\ngas is low, and therefore one can observe a narrow emission at\nthe low velocities. In order to distinguish between the two possi-\nble explanations, it is required to sample with consecutive obser-\nvations the entering into (or going out of) a fading event, where\nsuch a three-peaked profile appears.\n4.3. Equivalent widths of HeI 5876 Å, NaI D1, D2, and\nOI 7774 Å\nIn this section we investigate in more detail the correlation of\nthe equivalent widths of such lines as HeI 5876 Å, NaI D2, 6\nand OI 7774 Å. Analysis of the behaviour of the HeI and OI\nlines is interesting because their formation requires high temper-\natures, because of the high excitation potential from the lower\nlevel, much larger than the temperature of the star or the disc\nwind. The latter may be about of 10000 K for young stars (Safier\n1993; Garcia et al. 2001). Such hot regions can appear near the\nstar where accreting matter creates shocks when reaching the\nstellar surface. When estimating the equivalent widths (EWs),\nwe took into account only the absorption part of these lines. We\nalso did not remove their photospheric components because they\nare negligibly small (see Grinin et al. 2001, Fig. 1 therein).\nFigure 5 demonstrates that the EWs of OI, HeI and NaI do\nnot depend on the observed V-band magnitude. Nevertheless, the\nEWs of HeI and NaI D lines correlate with the EWs of oxygen\n6 D1 is blended with the D2 component and is not able to give a real\ninformation\nArticle number, page 5 of 19\n\n\nA&A proofs: manuscript no. uxastro\nFig. 5. Equivalent widths of OI 7774 Å (black), HeI 5876 Å (red), and\nNaI D2 (blue) vs star brightness (V-band magnitudes) during different\nobservational dates.\nOI (Fig. 6), and the correlation coefficients are 0.94 and 0.64,\nrespectively. The correlation between the equivalent widths of\nsodium NaI (D2) and HeI is much weaker, it is 0.37. This im-\nplies that the changes in their line profiles are not caused by\nthe eclipses of the star and its nearest vicinity. However, this\ncontradicts the fact that many of the spectra are obtained dur-\ning eclipses, i.e. when dust is screening the region of the line\nformation partially or fully. We suggest that the behaviour of\nthese lines may be related to scattered light by the circumstellar\ndust. The contribution from scattered light to the stellar flux in\nthe V-band is substantial, about of 10% of the radiation of the\nstar in the bright state and almost 100% in the deepest minimum\n(Grinin 2000).\n5. Similarity and difference in the spectral lines of\ntwo stars of the UXOR family\nIn spite of the fact that UXOR stars belong to the same family\ndue to their similar evolutionary status and the orientation of the\nstar–disc system, there may be significant differences in the main\nstellar parameters and in the behaviour of their emission spec-\ntra, both in the normal state and during eclipses. We know from\nthe theoretical study of young stars what physical processes take\nplace in their environment and in which typical regions these var-\nious processes work (see e.g. Muzerolle et al. 2004; Kurosawa\net al. 2006; Grinin & Tambovtseva 2011; Tambovtseva et al.\n2014; Brittain et al. 2023). We can obtain important information\nfrom this region by monitoring the behaviour of main spectral\nlines in the normal bright state and the deep minima when the\nspectra are obtained with the same telescope/instrument setup.\nIn this section we study how the spectra of UX Ori change dur-\ning the fadings compared to those of RR Tau, analysed and pre-\nsented in Grinin et al. (2023). The main stellar parameters of RR\nTau (mass, radius, temperature and v sin i) are very close to those\nof UX Ori. The spectral type of RR Tau is A0 III-IV, log g = 3.5,\nRV = +11 km s−1 (Grinin et al. 2001). The contribution from\nthe scattered light to the V-band flux is 3% in the bright state\nfor this star (Grinin 2000), which is less than that from UX Ori,\nestimated to about 10%. We interpret this to indicate that the in-\nclinations of the star-disc systems are slightly different for the\ntwo stars, since the disc properties are similar based on their in-\nfrared excesses (Grinin et al. 1991; Natta et al. 1997), and thus\nsuggesting that the RR Tau disc is less tilted with respect to the\nLOS than that of UX Ori.\n5.1. He 5876 Å, NaI D 5889/5895 Å, and OI 7774 Å\nLet us compare the behaviour of UX Ori and RR Tau during\nbright and faint states by looking at the spectral region with the\nhelium line HeI 5876 Å , the sodium NaI D 5889/5895 Å lines,\nand the OI 7774 Å line. Figure 7 shows UX Ori in the upper pan-\nels and RR Tau in the lower panels. We have selected two typical\nexample spectra for both stars during bright states (blue) and dur-\ning deep minima (red).7 In the case of UX Ori in the bright state,\nthe neutral helium line is in absorption (panel a), like for RR Tau\n(panel c), while in the weak state, it does not disappear or en-\nter in emission, as in the case of RR Tau (Grinin et al. 2023).\nIn UX Ori only a slightly red-shifted and shallower line profile\nis seen, perhaps due to the appearance of some weak emission.\nIt should be noted that we also observed a few cases when the\nHeI line disappears during the bright state of the star. Thus, we\nfind that for UX Ori the disappearance of the HeI absorption line\ndoes not correlate with the star’s brightness, and may be instead\nrelated to a variable mass accretion rate. The same may be said\nabout the changes in the neutral oxygen line (Fig. 7b,d).\nAs for the sodium lines, their qualitative behaviour in UX\nOri and RR Tau spectra during bright and weak states are similar.\nNevertheless, it has to be kept in mind that the doublet sodium\nlines originate in different parts of the stellar envelope: in the CS\nand interstellar (IS) medium unlike the HeI and OI lines.\nAs mentioned above, the behaviour of the HeI and NaI D line\nprofiles in the spectra of UX Ori do not show an evident corre-\nlation with the star brightness in contrast to what occurs in the\nRR Tau spectra. There were only a few instances when the he-\nlium line disappeared and the sodium doublet merely consisted\nof the IS component (see e.g. Fig. A.1). In all those cases the star\nwas in its normal bright state, and this behaviour may be a con-\nsequence of decreasing temperature in the gas accreting on to the\nstar. During brightness minimum, on the other hand, the HeI ab-\nsorption line does not disappear, probably because the scattered\nlight dominates, since its contribution is greater for UX Ori than\nfor RR Tau, and scattered light does not make the absorption dis-\nappear. This explanation is not valid for RR Tau because the HeI\nand OI absorption lines disappear only during brightness minima\nwhen the magnetosphere is covered by the dust screen, and the\ncontribution from the scattered light is too small to prevent it.\n5.2. Forbidden oxygen lines [OI] 6300 Å\nFigure 8 presents the forbidden lines of the neutral oxygen [OI]\nat 6300 Å in the normal and weak states of UX Ori (a) and\nRR Tau (b). For each star we chose dates of maximum and min-\nimum brightness. For UX Ori we show the bright state in 2020\n(V = 9.98 mag) and the minimum in 2021 (V = 12.48 mag). Cor-\nrespondingly, for RR Tau these are in 2019 (V = 10.66 mag) and\n(V = 13.85 mag). In the normal state of UX Ori this line reveals a\nweak emission but in the brightness minima an additional emis-\nsion component appears with a peak ratio blue-to-red (V/R < 1).\nHowever, as an analysis of other line profiles during this mini-\nmum in Jan 2021 and in Jan. 2024 shows that this peak becomes\nstronger, its radial velocity remains approximately constant on\nthe different dates, ranging from -55 to -20 km s−1 in the stellar\nvelocity system. The reason for these almost similar radial ve-\n7 We mean \"deep minimum\" if V > 12 magnitude (mag) for UX Ori\nand V > 13 mag for RR Tau\nArticle number, page 6 of 19\n\n\nTambovtseva et al.: Observations of UX Ori in deep minima. Analysis of spectra\nFig. 6. Equivalent widths of HeI 5876 Å vs OI 7774 Å (left), NaI D2 vs OI 7774 Å (middle), and NaI D2 vs. HeI 5876 Å (right). The correlation\ncoefficients are 0.94, 0.64, and 0.37, respectively.\nFig. 7. Upper panel (a, b): HeI 5876Å + NaI D lines (left) and OI 7774Å (right) in the spectra of UX Ori in the normal state on Sep. 5, 2020, V =\n9.98 mag (blue) and brightness minimum on Jan. 18, 2021, V = 12.48 mag (red). Lower panel (c, d): The same as in the upper panel but for RR\nTau: in the normal state with V = 10.66 mag on Oct 5, 2019, and in the weak state with V = 13.85 mag on Mar. 15, 2019.\nlocities is that all these observations were made in January, and\nin the Earth’s system all peaks were at the same velocity, point-\ning directly to the most likely interpretation that they originated\nin the Earth’s atmosphere.\nWe can conclude that during eclipses, the intensity of the\n[OI] 6300 Å line increases and its profiles are slightly blue-\nshifted relatively to zero velocity reaching ∼75 km s−1 in the\nwings. It is seen from Fig. 9 where we show [OI] 6300 Å line\nprofiles in the deep minima of RR Tau (V = 13.85 mag on Mar.\n3, 2019) and UX Ori (V = 12.48 mag on Jan. 18, 2021). One can\nsee that in both stars the wings of the profiles reach the velocity\nof about ±75 km s−1.\n5.3. FeII multiplet 4924/5018/5069 Å\nThe behaviour of the FeII multiplet in UX Ori shown in\nFig. 10 a,b is analogous to that of oxygen OI 7774 Å and he-\nlium HeI 5876 Å in Fig. 7. In the bright state of the star these\nlines exhibit red-shifted absorption profiles (a), and in the faint\nstate a small emission appears at the blue side (b). In the spec-\ntra of RR Tau, these lines are red-shifted absorption lines in the\nbright state (see Fig. 10c) and blue-shifted emission lines in the\nfaint state of the star. The wings of the FeII lines reach values of\nabout 200 km s−1 in both stars.\nArticle number, page 7 of 19\n\n\nA&A proofs: manuscript no. uxastro\nFig. 8. Forbidden oxygen lines in the spectra of UX Ori and RR Tau.\nUpper panel (a): [OI] 6300 Å lines in the spectra of UX Ori in the\nnormal state with V = 9.98 mag on Sep. 5, 2020 (blue) and brightness\nminimum with V = 12.48 mag on Jan. 18, 2021 (red). Lower panel (b):\nThe same as in the upper panel but for RR Tau with V = 10.66 mag on\nOct. 5, 2019 (blue) and with V = 13.85 mag on Mar. 15, 2019 (red).\n5.4. SiII 6347/6371 Å\nInvestigation of the silicon lines in the spectra of young stars is\nespecially interesting because silicon is a part of the circumstel-\nlar dust. Until the dust evaporates, silicon is hardly found in gas\nphase, and this usually takes place at the dust sublimation radius\nwhich is at a distance of 0.3 - 0.5 AU from the star (e.g. Tan-\nnirkulam et al. 2007; Flock et al. 2017). In such a case one can\ndetect a circumstellar ’CS veiling’ in the spectra due to added\nCS emission. The classical veiling is not related to the emission\nin the CS envelope, but to processes on the star itself (e.g. an\nappearance of hot spots on the stellar surface).\nIn the case of the CS veiling, the line is seen not only in\nabsorption, but also in emission. Therefore, it is interesting to\nmonitor the behaviour of the SiII 6347/6371 Å lines during the\nFig. 9. Forbidden oxygen line [OI] 6300 Å during brightness minima.\na: [OI] 6300 Å profiles in the spectra of UX Ori during the minimum\nin 2021: Jan. 18, V = 12.48 mag (red); Jan. 20, V = 12.0 mag (blue);\nJan. 24, V = 12.36 mag (green); Jan. 27, V = 12.27 mag (magenta), and\nJan. 28, V = 12.37 mag (black). b: Comparison of [OI] 6300 Å profiles\nin the brightness minimum of UX Ori (Jan. 18, 2021, V = 12.48 mag,\nblack) and RR Tau (Mar. 15, 2019, V = 13.85 mag, blue). The arrow\npoints to the telluric lines.\nbright and weak states, and in the latter case the abundance of\ngas phase silicon can lead to CS veiling.\nPrevious observations of UXORs with the NOT (Grinin et al.\n2001), among them UX Ori and RR Tau, gave a rich material,\nbut unfortunately the stars were in their bright states except for\none observation of RR Tau. The SiII 6347/6371 Å changed in-\nsignificantly in comparison with other absorption lines. With the\ncurrent data set we are in the position to study the SiII 6347/6371\nÅ line stability through fading events. We compare the line pro-\nfiles of SiII 6347 Å (the strongest of the two) in the bright and\nweak states of the stars for UX Ori and RR Tau in Fig. 15. For\nreference, in each panel we overplot the profile of the same line\nobtained in the normal state of the star. For UX Ori we find the\nfollowing effect: sometimes, in the brightness minima, the SiII\nline profile becomes deeper than that in the normal state. We\ndid not find such an effect in other photospheric lines. Moreover,\nin the RR Tau spectra the silicon line goes in emission during\neclipses. The quantity of this emission may vary, but we did not\nfind any additional absorption as in the case of UX Ori. We sug-\ngest that this absorption is not related to mass accretion; but most\nlikely due to gas located just on the outer boundary of the mag-\nnetosphere where the gas velocity is still low.\nFigure A.5 shows other photospheric lines, such as\nMgI 5184 Å and FeII 5169 Å, of UX Ori during the same pe-\nriod, and for comparison again we add the line profile obtained\nin the bright state of the star. One can see from the figure that the\nArticle number, page 8 of 19\n\n\nTambovtseva et al.: Observations of UX Ori in deep minima. Analysis of spectra\nFig. 10. Changes in the FeII multiplet in the bright state and during\neclipses. Upper panel: UX Ori. The bright state (left), and the deep min-\nimum (right). Lower panel: RR Tau. The bright state (left), and the deep\nminimum (right). Brightness in the visible is shown in each plot. The\nmultiplet components are (in Å): 4924 (black), 5018 (red), and 5069\n(blue). The dates of the bright and weak states of stars are the same as\nin Fig. 7\nFig. 11. SiII 6347 Å line profiles averaged over five observational dates\nin the brightness minima (red) and maxima (blue) for UX Ori (a) and\nRR Tau (b).\nMgI lines have a very similar shape both in the bright and faint\nstates of the star, and we note that the FeII line is not deeper\nduring the minima than in the bright state of the star.\nFigure 11 presents the SiII 6347 Å line profiles averaged over\nfive different dates during maxima (blue) and minima (red) of\nthe stars for UX Ori (a) and RR Tau (b). It is seen that in the\ncase of UX Ori, the average silicon line profiles during eclipses\nare similar to those during the normal state. Another picture is\nobserved for RR Tau: in the brightness minima it looks like an\ninverse P Cygni line profile (red). During the minima, however,\nthe star and its magnetosphere are eclipsed, thus, the blue-shifted\nemission must refer to a wind component.\n5.5. Discrete narrow components\nFurther analysis of the UX Ori spectra reveal the appearance of\ndiscrete absorption components (DACs) in the sodium line pro-\nfiles which are seen when the star is in its normal state. Figure 12\n(upper panel) shows spectra obtained of UX Ori on two differ-\nent dates: Jan. 30, 2020 (V = 10.83 mag) and Sep. 12, 2022\n(V = 10.50 mag). The spectra are presented in the coordinate\nsystem of the star.\nThe observed DACs are marked in the figure with numbered\nlines, and their corresponding velocities in km s−1 are shown in\nTable 1. Taking into account the uncertainty in the measurement\nof the DAC velocities due to the presence of the telluric lines and\nnoise, we conclude that they are very similar in both components\nof the doublet D1 and D2.\nIn the spectra of RR Tau we also found such components\nin the NaI D lines for the two dates: Nov. 18, 2019 and Sep.\n5, 2020 as shown in the lower panel of Fig. 12. At those dates\nthe brightness of the star in the visible was 12.54 mag and 11.94\nmag, respectively. We determined the velocities of the absorption\ncomponents taking into account the radial velocity of RR Tau.\nWe consider the discrete character of the red-shifted absorptions\nin the NaI D lines in Sect. 6.\n6. Discussion\nLong-term spectral monitoring of UXORs (2019 - 2024) com-\nprising both dust eclipses of various degrees, as well as observa-\ntions of the stars in their bright states, has given a rich observa-\ntional material. In this section we discuss the analysis of several\nspectral lines of UX Ori, and we compare our conclusions for\nthis star with those made for RR Tau, another star of the UXOR\nfamily (Grinin et al. 2023).\n6.1. Hydrogen lines Hα and Hβ\nThe behaviour of the Hα emission line during the brightness\nminima of UX Ori is compatible with the model of eclipses\nwhere the dusty screen completely covers the star, but not com-\npletely the more extended line emission region, including part of\nthe magnetosphere and the disc wind (Tambovtseva et al. 2020;\nGrinin et al. 2023). Most of the emission in this line forms in the\ndisc wind, while the magnetosphere plays a smaller role. At the\nmoment of eclipses the intensity of the line increases relatively to\nthe decreasing continuum. As seen in Figs. A.2 and A.4 the line\nprofile predominantly becomes almost single-peaked, though in\nsome cases it retains a double-peak shape. A single-peaked pro-\nfile as the one observed in Jan. 2024 and shown in Fig. A.4 was\nobserved only once earlier (Grinin et al. 1994).\nUnlike for Hα, the role of the disc wind is less important with\nregards to the formation of the Hβ emission line. The main con-\ntribution comes from the magnetosphere which is almost com-\npletely obscured by the dust screen during the minima. This is\nnot surprising since the Hβ line forms in a region which is closer\nto the star compared to the Hα formation region (see e.g. Grinin\n& Tambovtseva 2011; Tambovtseva et al. 2020).\nWe estimated the equivalent widths of the Hα and Hβ lines\nafter having removed the photospheric component by extracting\nthe synthetic spectrum corrected for rotation. Figure 13 shows\nhow the equivalent width of the Hα line (left panel) increases\nas the star becomes fainter. As mentioned above, this is due to\nthe contrast between the emission line and the continuum. With\nthe three vertical panels we distinguish between the EWs of (a)\nArticle number, page 9 of 19\n\n\nA&A proofs: manuscript no. uxastro\nFig. 12. Line profiles of the sodium doublet NaI D1 and D2 (5889/5895 Å) with DACs in the spectra of UX Ori in 2020 (left) and 2022 (right)\n(upper panel) and RR Tau in 2019 (left) and 2020 (right) (lower panel). Spectra are shown in the stars’ coordinate systems. See details in the text\nand in Table 1.\nTable 1. Velocities of the discrete absorption components for UX Ori and RR Tau (in km s−1) in the coordinate system of the star.\nUX Ori date\nD1 1\nD1 2\nD1 3\nD2 1\nD2 2\nD2 3\nRR Tau date\nD1 1\nD1 2\nD2 1\nD2 2\nJan 30, 2020\n43\n94\n120\n40\n96\n121\nSep 5, 2020\n33\n114\n34\n111\nD1 1\nD1 2\nD2 1\nD2 2\nD1 1\nD2 1\nSep 12, 2022\n23\n64\n29\n65\nNov 18, 2019\n64\n60\nthe total line, (b) the red part of the double-peaked profile be-\nlonging to the positive radial velocities, and (c) the blue part\nwith negative radial velocities. It is seen that the EWs of both\nthe red and the blue components of the Hα line profiles increase\nwhen the brightness decreases. Observations of the RR Tau spec-\ntra (Rodgers et al. 2002) lead to the same conclusion. The be-\nhaviour of Hβ, however, shown in the right hand panels, does\nnot have the same trend. While the blue component clearly in-\ncreases when the star fades, the red component is more scattered\nwith no clear trend.\nWe compared the emission profiles of several Hα lines ob-\ntained in the normal state of the star and during the minima. For\nthis we shifted the observed spectra to the star’s coordinate sys-\ntem in the region of the line and subtracted a synthetic spectrum.\nAfter this we reduced the chosen profiles to the same energetic\nunits. In order to determine the reduction coefficient we calcu-\nlated the radiation flux in the continuum Fi at the observational\nmoment i as\nFi = 10−0.4∗∆V,\n(1)\nwhere ∆V = Vi −V0, and V0 is the star’s magnitude taken in\nthe bright state. The value of V0 was chosen by averaging over\nthe five magnitudes obtained in the bright states, getting a mean\nV0 = 10.43 mag. Then, the emission spectra of all chosen lines,\nincluding that taken in the bright state, were multiplied by the\nreduction coefficients defined from the above relation. The com-\nparisons are shown in Fig. 14 in panels a and b. The same pro-\ncedure was applied to spectra of RR Tau during bright and faint\nstates (panels c and d).\nWe see that during eclipses the Hα line profiles become nar-\nrower than in the bright states. This takes place because during\nthe brightness minima the dust screen covers the star and the re-\ngion near the star where the Keplerian velocity is the highest. De-\npending on the position of the screen, we can see the line profiles\neither nearly symmetric around the central velocity or slightly\nasymmetric (Fig. 14 b). Not only the position of the screen, but\nalso the non-homogeneous structure of the emitting region may\ncause such an asymmetry.\nArticle number, page 10 of 19\n\n\nTambovtseva et al.: Observations of UX Ori in deep minima. Analysis of spectra\nFig. 13. Changes in the equivalent widths (EW) of Hα (left panel) and\nHβ (right panel) as a function of the observed brightness of UX Ori\ngiven as V-band magnitudes. We distinguish between (a) the total EW\nof the profile, (b) the EW of the red part of the profile where velocities\nare positive, and (c) the EW of the blue part of the profile where the\nvelocity is negative.\n6.2. Special features of the line profiles. Comparison with\nRR Tau\nComparative analysis of the spectral variability of UX Ori and\nRR Tau reveal the following differences: the Hα line in the spec-\ntra of UX Ori demonstrate a greater variety of profiles than\nRR Tau, including the above mentioned three-peaked profiles\nthat never were observed in the spectra of RR Tau, but are\nepisodically observed in the spectra of T Tauri stars (Bouvier\net al. 2007). This suggests that the emission region of UX Ori\nmay differ from that of RR Tau. Our analysis permits us to con-\nclude that there is a different ratio between the power of the ac-\ncretion and disc wind (i.e. the disc wind of UX Ori is weaker\nthan that of RR Tau). This is consistent with the weaker mass\naccretion rate onto UX Ori compared to that onto RR Tau given\nby Guzmán-Díaz et al. (2021).\nLet us compare the influence of the accretion process on the\nline profiles. The Hα profile is typical for the disc wind structure,\nbut its asymmetry (the peak ratio V/R is always greater than one)\nis a sign of accretion (see e.g. Fig. 2). Such a profile may be\nobtained if the emission in the red component is reduced due\nto absorption by the accreting gas. The Hβ line profile supports\nthis interpretation because its asymmetry remains in the inverse\nP Cygni shape. Natta et al. (2000) show spectra of UX Ori where\nthe absorption features in the red wing of the Hα line correspond\nto the location of the absorption features in the sodium lines (see\nFig. 2 in their paper). This fact was used by the authors as an\nargument for the presence of magnetospheric accretion. In the\npresent observations the absorptions in the red components of\nthe NaI D lines is also at about the same velocities as in the Hα\nlines (see Fig. 3).\nWhen comparing changes in the different line profiles dur-\ning the eclipses, we note several differences between UX Ori\nand RR Tau. For RR Tau the Hα line shape stays double-peaked\nduring eclipses, while for UX Ori the profile may stay double-\npeaked or become single-peaked. In the case of RR Tau the Hβ\nFig. 14. Comparison of the Hα emission line profiles, scaled to the same\nenergetic units in the bright and faint states. Upper panel: The Hα emis-\nsion line profiles in the normal bright state (blue) at V = 10.55 mag and\ntwo different faint states (red) of UX Ori. The epochs of each profile are\ngiven in the plots. In the two faint states the photometric measurement\nare a) V = 12.48 mag and b) V = 11.70 mag. Lower panel: Same as in\nthe upper panel, but for bright and faint states of RR Tau observed in\n2019 (c) and 2022 (d). The photometric measurement in the bright and\nfaint states are V = 10.86 mag and V = 13.77 mag (c), and V = 10.66\nmag and V = 13.85 mag (d); see text for details.\nprofile takes the shape of inverse P Cygni during bright states\nand the double-peaked emission profile with changing V/R ratios\nduring eclipses. In UX Ori, on the other hand, we find that dur-\ning brightness minima an absorption feature appears bluewards\nof the inverse P Cygni Hβ line shape. At the line centre of Hβ an\nadditional emission feature may appear (see e.g. Fig. A.4).\nIn RR Tau the photospheric lines which are in absorption\nduring the bright states transform into the emission lines dur-\ning the minima, while in UX Ori only CaII 8642 Å enters in\nemission during the minima. Other lines either show presence of\na weak emission (the FeII triplet) or practically do not change\n(e.g. SiII 6347, 6371 Å, and MgI 5184 Å).\nWe did not find a clear correlation between absorption on the\nred side of the NaI D profile and the star’s brightness. The rea-\nson may be related to the fact that these lines form in different\nregions, which makes the analysis difficult. The NaI D line par-\ntially forms in the accreting region and partially on the CS or IS\nperiphery. The discrete character of the red-shifted absorptions\nin the NaI D lines in Fig. 12 testifies to the extremely irregu-\nlar distribution of the accreting matter in the magnetosphere of\nUX Ori and to the non-stationary character of the accretion. We\nobserved the DACs in both stars; their appearance may be ex-\nplained by either a gas stream that accretes on to the star and\ncircles the star several times with the different infall velocities,\nor a non-homogeneous gas (blob) which accretes directly onto\nthe star.\nArticle number, page 11 of 19\n\n\nA&A proofs: manuscript no. uxastro\nFig. 15. Si II 6347 Å in the spectra of UX Ori in 2021 (upper panel) and RR Tau in 2022 (lower panel, left) and in 2021 (lower panel, middle and\nright) during the brightness minima (red). The dates of the observations and V-band magnitudes are shown in each plot. The blue lines represents\nthe bright state reference SiII line profile. Shown are the observed profiles in the bright states on Feb. 20, 2019, with V = 10.59 mag for UX Ori,\nand on Jan. 7, 2022, with V = 10.58 mag for RR Tau.\n6.3. Lines of the high-excitation HeI 5876 Å and OI 7774 Å\nVery interesting differences are shown by the two absorption\nlines HeI 5876 Å and OI 7774 Å. Both of them originate in the\nhot gas of the stellar magnetosphere, because only there one can\nexpect sufficiently high temperatures for the excitation of these\nlines.\nThese absorption lines disappear during the brightness min-\nima of RR Tau due to filled in emission which is not seen in the\nnormal bright state. In the spectra of UX Ori, on the other hand\nthese absorption lines do not disappear, they become weaker but\nremain visible, as shown in Fig. 7. We propose that these differ-\nences are caused by the different level of scattered light from the\nprotoplanetary disc. In the case of UX Ori the contribution from\nscattered light is noticeably higher than in the case of RR Tau.\nThis follows from the differences in the photometric amplitudes\nat the minima, which are ∆V = 2-3 magnitudes for UX Ori and\n∆V = 3-4 magnitudes for RR Tau. During eclipses the relative\ncontribution from scattered light to the total brightness of the\nstar increases, and the amount of scattered light sets a limit to\nhow large the amplitude at minimum can be. In the bright state\nthe scattered light contributes 10% of the observed radiation in\nthe case of UX Ori, and only 3-4% of the observed radiation in\nthe case of RR Tau.\nFrom the analysis of the UX Ori spectral lines in the bright\nstate (Hα, HeI 5876 Å, NaI D and OI 7774 Å) we conclude that\nthe gas falls on to the star with a velocity of about 200 km s−1.\nThe outflow velocity is about of 400 km s−1. Approximately the\nsame values are valid for RR Tau. A detailed comparative anal-\nysis of parameters and features of emitting regions of these stars\nwill be given after modelling of the UX Ori hydrogen line pro-\nfiles in Part II.\n6.4. Photospheric lines\nInvestigation of photospheric lines (e.g. Fe, Si, Mg) plays an im-\nportant role in our understanding of the physical and geometrical\nstructure of the regions nearest to the star, and the processes tak-\ning place there, because they are not expected to be with CS ab-\nsorption or emission lines. The photospheric lines are used when\ndefining important parameters (e.g. the rotational velocity of the\nstar, log g).\nNevertheless, we observe that photospheric lines show line\nprofile changes during brightness minima due to the appearance\nof emission that is hard or impossible to see in the bright state.\nDuring brightness minima one can determine the possible place\nof the line formation and its intensity as we have done in the\ncase of RR Tau (Grinin et al. 2023). In the spectra of RR Tau\nthe appearance of the emission is clearly seen, while in UX Ori\nthese line changes are less clear (see Figs. 10, 15, and A.5). For\nboth stars we interpret the character and source of the additional\nemission to be that part of the disc wind which arises on the\nperiphery of the CS disc and is not obscured during an eclipse.\nOne can expect the appearance of CS veiling that is caused by\nprocesses occurring in the CS envelope.\nIt should be noted that the scattered radiation of the pro-\ntoplanetary disc can broaden the photospheric lines of T Tauri\nstars but only weakly influence the photospheric lines of UX-\nORs. Both UX Ori and RR Tau are rapidly rotating stars and for\nthem broadening of these lines is negligible (Grinin et al. 2022).\nHowever, the radiation of the young stars may be scattered, not\nonly in the dusty disc, but also in the magneto-centrifugal disc\nwind. The latter lifts small dust particles (Safier 1993). There-\nfore, the disc wind may be an additional source of scattered radi-\nation. In this case, the photospheric lines are both broadened due\nto a differential rotation of the disc wind and possibly red-shifted\n(Grinin et al. 2006, 2012).\nArticle number, page 12 of 19\n\n\nTambovtseva et al.: Observations of UX Ori in deep minima. Analysis of spectra\n6.5. Forbidden oxygen line [OI] 6300 Å\nWe compared the behaviour of the forbidden oxygen lines in the\nRR Tau and UX Ori spectra in Fig. 9 and concluded that the\nchanges in line profiles are identical, and differences are only in\nthe scale of the processes. The line profiles have the following\nstructure: they contain a low-intensity emission profile slightly\nblue-shifted relatively to zero velocity. The place of the forma-\ntion of the low-intensity emission in UX Ori is identical to that\nin RR Tau: these are regions of low density where matter outflow\nexists but rotation is small. Such characteristics fit well with the\nregion where the photoevaporative disc wind forms, in the pe-\nriphery of the protoplanetary disc (see e.g. Ercolano & Owen\n2010, 2016; McGinnis et al. 2018; Ballabio et al. 2020; Pas-\ncucci et al. 2023, and references therein). The line profiles are\nsymmetric relatively to zero velocity, the wind velocity reaches\n∼75 km s−1 that coincides with the velocity of the same line in\nthe RR Tau spectra.\n6.6. Summary data on the line formation regions and line\nproperties for both stars\nHaving analysed the lines in the spectra of UX Ori and RR Tau,\nwe have highlighted the main conclusions about their properties\nand regions of their formation as well as their similarity and dif-\nference.\nThe Hα line forms in the circumstellar (CS) region in the\naccretion and disc wind zones. In both stars the Hα line profiles\ndemonstrate the double-peaked profile in the bright state with a\ndeep gap at the velocity close to zero, with the blue-to-read peak\nratio V/R > 1 (UX Ori) and V/R ≤1 (RR Tau). During eclipses\nthe emission lines grow relatively to the decreasing continuum\nby a factor of 1.5 - 3 (UX Ori) and a factor of about 8 (RR Tau)\ncompared to their bright state. During the brightness minima the\nUX Ori line profiles can keep their double-peaked shape, but\nmore often they transform into a single-peaked profile, while for\nRR Tau the double-peaked line profiles are also retained during\nminima.\nThe Hβ line forms in the CS envelope (in accretion and disc\nwind zones) in a smaller area compared to that of the Hα line\nformation. In the bright state its line profiles are in absorption\nand a little red-shifted (UX Ori) and have an inverse P Cygni\nshape (RR Tau). In the brightness minima of UX Ori a weak\nemission is seen at the blue side: the line profiles become slightly\nwider and shallower. In the brightness minima of RR Tau the\nline profiles become intense and double-peaked with the wind\nfeatures: V/R < 1.\nThe HeI 5876 Å and OI 7774 Å form in the accretion region\nof CS envelope of both stars. In the bright state their line profiles\nare in absorption. In the brightness minima of UX Ori they do\nnot change. In the brightness minima of RR Tau the absorption\ndisappears.\nThe sodium doublet NaI D lines originate in the accretion\npart of the CS region and partially in the interstellar medium.\nIn both stars they are in absorption. In the brightness minima of\nRR Tau the emission can appear while in that of UX Ori the line\nprofiles remain in absorption.\nThe lines of the CaII (8498/8542/8662 Å) and FeII\n(4924/5018/5069 Å) triplets and SiII (6347/6371 Å) doublet\noriginate in the star and the accretion part of the CS envelope. In\nthe bright state of both stars the CaII and FeII lines are in absorp-\ntion and red-shifted, resembling the inverse P Cygni profile. In\nthe brightness minima the wind emission is added from the blue\nside: the profiles remain in absorption (UX Ori) and transform\ninto the emission ones (RR Tau). The SiII lines are in absorption\nin the bright state of both stars. They are almost symmetric rela-\ntively to the zero velocity (UX Ori) and they are red-shifted (RR\nTau). In the brightness minima they did not change (UX Ori) and\ntransforms to the profiles with the blue - side emission (RR Tau).\nThe forbidden oxygen [OI] (6300/6363 Å) lines have a\nsingle-peaked profile in the bright state for both stars, in the\nbrightness minima the profiles keep their shape and their in-\ntensity increases weakly (UX Ori) and significantly (RR Tau).\nThe luminosity of the lines remains constant during eclipses, this\nmeans that they are formed in a region beyond the dust screen.\nThe line profiles are practically symmetric relative to zero ve-\nlocity (UX Ori) and slightly blue-shifted (RR Tau). The source\nof their formation may be a photoevaporated disc wind on the\nperiphery of the disc (both stars) or a weak jet manifesting itself\nonly spectrally (RR Tau).\nWe can conclude more quantitatively about the regions of the\nhydrogen line formation and thus on the accretion and mass loss\nrate after modelling of the eclipses in UX Ori.\n7. Conclusion\nSpectral lines of young stars observed through the atmospheres\nof their protoplanetary discs, due to their specific orientation,\ngive important information about the physical processes occur-\nring in the vicinity of the star. We analysed the spectra of UX Ori\nobtained during the long-lasting (five years) period of monitor-\ning and Target-of-Opportunity observations with the NOT, and\ncompared them with those obtained for RR Tau with the same\ntelescope in the same period. We have made the following con-\nclusions:\n– During eclipses of the star by the gas and dust fragments\nacting as a screen, a strengthening of the Hα emission line\nrelative to the decreasing continuum occurs. At the same\ntime the line profile becomes narrower because the opaque\nscreen covers the star, and also that part of the moving gas\nof the Hα emitting regions where the Keplerian velocity\nis the highest. During eclipses the Hα line profiles may be\ndouble-peaked or single-peaked.\n– During eclipses additional emission appears at the frequen-\ncies of the photospheric lines (FeII, CaII, SiII and others).\nThis may lead to circumstellar veiling of these lines.\n– When determining fundamental parameters of UXORs (e.g.\nTeff, log g, v sin i) one has to use the spectra obtained in\nthe bright state of the stars because in brightness minima\nthe emission component of the disc wind lines that are not\nobscured by the dust screen is added to the photospheric\nlines. For the same reason, the radial velocity measurements\nof these stars may be red-shifted.\n– The two UXOR stars UX Ori and RR Tau display different\nbehaviours in some of the spectral lines during the brightness\nminima. The reason for these differences may be either a\ndifferent contribution of the scattered light component to the\ntotal stellar radiation during eclipses and/or a less intense\ndisc wind in the case of UX Ori.\n– Our observations showed that in the spectra of UX Ori and\nof RR Tau the diffusion interstellar band (DIB) at 6283 Å\nArticle number, page 13 of 19\n\n\nA&A proofs: manuscript no. uxastro\ndid not change, even when the brightness decreased signifi-\ncantly. This means that the CS extinction does not add any-\nthing to the DIB and that the DIB has a purely interstellar\norigin.\nBecause of the specific orientation of the star–disc system\nof young stars of the UX Orionis family, observations of these\nstars permits us to study details in the spectra that cannot be seen\nin other young stars. In this paper we have presented long-term\nspectral monitoring of UX Ori, and we have compared the results\nto those of RR Tau. Further spectroscopic studies of this star\ntype during their brightness minima will give information about\nthe location and structure of the emitting regions near the young\nstars due to the enhanced contrast between the line emission and\nthe star continuum provided by the eclipses.\nAcknowledgements. We thank the referee for helpful comments and suggestions\nconcerning this work. Based on observations made with the Nordic Optical Tele-\nscope, owned in collaboration by the University of Turku and Aarhus University,\nand operated jointly by Aarhus University, the University of Turku and the Uni-\nversity of Oslo, representing Denmark, Finland and Norway, the University of\nIceland and Stockholm University at the Observatorio del Roque de los Mucha-\nchos, La Palma, Spain, of the Instituto de Astrofisica de Canarias. AAD would\nlike to thank all the students and staff at the NOT for all the work in making the\nflexible scheduling possible and efficient. A special thanks is directed to John\nTelting for supporting and maintaining the FIEStool pipeline. A.A.D. and H.W.\nwould like to thank Jens Hoeijmakers and Nicholas Borsato for advice and help\nrelated to the installation and use of the molecfit program for FIES data. V.P.G.\nand L.V.T. would like to acknowledge the support of the Ministry of Science and\nHigher Education of the Russian Federation under the grant 075-15-2020-780\n(N13.1902.21.0039).\n8. Data Availability\nAll the FIES data used in this paper are available in the Nordic\nOptical Telescope online FITS archive.8 The FIEStool pipeline\nreduced spectra are also available in the NOT archive. Practically\nall the photometry observed by SAAF is available in AAVSO9\nor otherwise available by request to the authors.\nReferences\nAnsdell, M., Gaidos, E., Rappaport, S. A., et al. 2016, ApJ, 816, 69\nBallabio, G., Alexander, R. D., & Clarke, C. J. 2020, MNRAS, 496, 2932\nBouvier, J., Alencar, S. H. P., Boutelier, T., et al. 2007, A&A, 463, 1017\nBrittain, S. D., Kamp, I., Meeus, G., Oudmaijer, R. D., & Waters, L. B. F. M.\n2023, Space Sci. Rev., 219, 7\nDjupvik, A. A. & Andersen, J. 2010, in Astrophysics and Space Science Pro-\nceedings, Vol. 14, Highlights of Spanish Astrophysics V, 211\nErcolano, B. & Owen, J. E. 2010, MNRAS, 406, 1553\nErcolano, B. & Owen, J. E. 2016, MNRAS, 460, 3472\nFlock, M., Fromang, S., Turner, N. J., & Benisty, M. 2017, ApJ, 835, 230\nGarcia, P. J. V., Ferreira, J., Cabrit, S., & Binette, L. 2001, A&A, 377, 589\nGrinin, V. P. 2000, in Astronomical Society of the Pacific Conference Series, Vol.\n219, Disks, Planetesimals, and Planets, ed. G. Garzón, C. Eiroa, D. de Winter,\n& T. J. Mahoney, 216\nGrinin, V. P., Kiselev, N. N., Minikulov, N. K., Chernova, G. P., & Voshchin-\nnikov, N. V. 1991, Ap&SS, 186, 283\nGrinin, V. P., Kozlova, O. V., Natta, A., et al. 2001, A&A, 379, 482\nGrinin, V. P., Mitskevich, A. S., & Tambovtseva, L. V. 2006, Astronomy Letters,\n32, 110\nGrinin, V. P. & Rostopchina, A. N. 1996, Astronomy Reports, 40, 171\nGrinin, V. P. & Tambovtseva, L. V. 2011, Astronomy Reports, 55, 704\nGrinin, V. P., Tambovtseva, L. V., Djupvik, A. A., et al. 2023, MNRAS, 524,\n4047\nGrinin, V. P., Tambovtseva, L. V., & Dmitriev, D. V. 2022, Astronomy Reports,\n66, 314\nGrinin, V. P., Tambovtseva, L. V., & Weigelt, G. 2012, A&A, 544, A45\nGrinin, V. P., The, P. S., de Winter, D., et al. 1994, A&A, 292, 165\n8 http://www.not.iac.es/obsering/forms/fitsarchive/\n9 https://www.aavso.org/\nGuzmán-Díaz, J., Mendigutía, I., Montesinos, B., et al. 2021, A&A, 650, A182\nKreplin, A., Madlener, D., Chen, L., et al. 2016, A&A, 590, A96\nKreplin, A., Weigelt, G., Kraus, S., et al. 2013, A&A, 551, A21\nKurosawa, R., Harries, T. J., & Symington, N. H. 2006, MNRAS, 370, 580\nMcGinnis, P., Dougados, C., Alencar, S. H. P., Bouvier, J., & Cabrit, S. 2018,\nA&A, 620, A87\nMel’nikov, S. Y. 2001, Astronomy Reports, 45, 686\nMuzerolle, J., D’Alessio, P., Calvet, N., & Hartmann, L. 2004, ApJ, 617, 406\nNatta, A., Grinin, V. P., Mannings, V., & Ungerechts, H. 1997, ApJ, 491, 885\nNatta, A., Grinin, V. P., & Tambovtseva, L. V. 2000, ApJ, 542, 421\nNatta, A. & Whitney, B. A. 2000, A&A, 364, 633\nPascucci, I., Cabrit, S., Edwards, S., et al. 2023, in Astronomical Society of the\nPacific Conference Series, Vol. 534, Protostars and Planets VII, ed. S. Inut-\nsuka, Y. Aikawa, T. Muto, K. Tomida, & M. Tamura, 567\nRodgers, B., Wooden, D. H., Grinin, V., Shakhovsky, D., & Natta, A. 2002, ApJ,\n564, 405\nRoggero, N., Bouvier, J., Rebull, L. M., & Cody, A. M. 2021, A&A, 651, A44\nRostopchina, A. N. 1999, Astronomy Reports, 43, 113\nRostopchina-Shakhovskaja, A. N., Grinin, V. P., & Shakhovskoi, D. N. 2012,\nAstrophysics, 55, 147\nSafier, P. N. 1993, ApJ, 408, 115\nShakhovskoi, D. N., Rostopchina, A. N., Grinin, V. P., & Minikulov, N. K. 2003,\nAstronomy Reports, 47, 301\nShulman, S. G. & Grinin, V. P. 2019, Astronomy Letters, 45, 384\nSmette, A., Sana, H., Noll, S., et al. 2015, A&A, 576, A77\nStempels, E. & Telting, J. 2017, FIEStool: Automated data reduction for FIber-\nfed Echelle Spectrograph (FIES), Astrophysics Source Code Library, record\nascl:1708.009\nTambovtseva, L. V., Grinin, V. P., & Dmitriev, D. V. 2020, Astronomy Reports,\n64, 1026\nTambovtseva, L. V., Grinin, V. P., & Weigelt, G. 2014, A&A, 562, A104\nTannirkulam, A., Harries, T. J., & Monnier, J. D. 2007, ApJ, 661, 374\nTelting, J. H., Avila, G., Buchhave, L., et al. 2014, Astronomische Nachrichten,\n335, 41\nVioque, M., Oudmaijer, R. D., Baines, D., Mendigutía, I., & Pérez-Martínez, R.\n2018, A&A, 620, A128\nArticle number, page 14 of 19\n\n\nTambovtseva et al.: Observations of UX Ori in deep minima. Analysis of spectra\nAppendix A: FIES/NOT spectra of UX Ori\nArticle number, page 15 of 19\n\n\nA&A proofs: manuscript no. uxastro\n1\n2\n3\n21.12\n10.91\nIntensity\nHα\n1\n2\n3\n18.12\n11.56\nIntensity\n1\n2\n3\n12.12\n12.00\nIntensity\n0\n1\n2\n3\n−400\n0\n400\n07.12\n10.91\nIntensity\nV, km s−1\n1\n2\n21.12\nHβ\n1\n2\n18.12\n1\n2\n12.12\n0\n1\n2\n−400\n0\n400\n07.12\nV, km s−1\n1\n2\n21.12\nHe + NaI D\n1\n2\n18.12\n1\n2\n12.12\n0\n1\n2\n−800\n−400\n0\n400\n07.12\nV, km s−1\n1\n2\n21.12\nCaII 8542\n1\n2\n18.12\n1\n2\n12.12\n0\n1\n2\n−400\n0\n400\n07.12\nV, km s−1\n1\n2\n21.12\nFeII 4924\n1\n2\n18.12\n1\n2\n12.12\n0\n1\n2\n−400\n0\n400\n07.12\nV, km s−1\nFig. A.1. The same as in Fig. 2, but when entering the brightness minimum in December 2020.\n2\n4\n6\n28.01\n12.37\nIntensity\nHα\n2\n4\n6\n12.36\n25.01\nIntensity\n2\n4\n6\n20.01\n12.00\nIntensity\n0\n2\n4\n6\n−400\n0\n400\n18.01\n12.48\nIntensity\nV, km s−1\n1\n2\n28.01\nHβ\n1\n2\n25.01\n1\n2\n20.01\n0\n1\n2\n−400\n0\n400\n18.01\nV, km s−1\n1\n2\n28.01\nHe + NaI D\n1\n2\n25.01\n1\n2\n20.01\n0\n1\n2\n−800\n−400\n0\n400\n18.01\nV, km s−1\n1\n2\n28.01\nCaII 8542\n1\n2\n25.01\n1\n2\n20.01\n0\n1\n2\n−400\n0\n400\n18.01\nV, km s−1\n1\n2\n28.01\nFeII 4924\n1\n2\n25.01\n1\n2\n20.01\n0\n1\n2\n−400\n0\n400\n18.01\nV, km s−1\nFig. A.2. The same as in Fig. 2, but during brightness minimum in January 2021.\nArticle number, page 16 of 19\n\n\nTambovtseva et al.: Observations of UX Ori in deep minima. Analysis of spectra\n1\n2\n3\n08.12\n11.13\nIntensity\nHα\n1\n2\n3\n11.18\n03.12\nIntensity\n1\n2\n3\n11.51\n30.11\nIntensity\n1\n2\n3\n−400\n0\n400\n11.52\n26.11\nIntensity\nV, km s−1\n1\n2\n08.12\nHβ\n1\n2\n03.12\n1\n2\n30.11\n0\n1\n2\n−400\n0\n400\n26.11\nV, km s−1\n1\n2\n08.12\nHe + NaI D\n1\n2\n03.12\n1\n2\n30.11\n0\n1\n2\n−800\n−400\n0\n400\n26.11\nV, km s−1\n1\n2\n08.12\nCaII 8542\n1\n2\n03.12\n1\n2\n30.11\n0\n1\n2\n−400\n0\n400\n26.11\nV, km s−1\n1\n2\n08.12\nFeII 4924\n1\n2\n03.12\n1\n2\n30.11\n0\n1\n2\n−400\n0\n400\n26.11\nV, km s−1\nFig. A.3. The same as in Fig. 2 at the beginning of the brightness minimum in November-December 2023.\nArticle number, page 17 of 19\n\n\nA&A proofs: manuscript no. uxastro\n1\n2\n3\n29.01\n11.25\nHα\nIntensity\n1\n2\n3\n28.01\n11.32\nIntensity\n1\n2\n3\n27.01\n11.39\nIntensity\n1\n2\n3\n23.01\n11.70\nIntensity\n0\n1\n2\n3\n−400\n0\n400\n11.72\n17.01\nIntensity\nV, km s−1\n1\n2\n29.01\nHβ\n1\n2\n28.01\n1\n2\n27.01\n1\n2\n23.01\n0\n1\n2\n−400\n0\n400\n17.01\nV, km s−1\n1\n2\n29.01\nHe + NaI D\n1\n2\n28.01\n1\n2\n27.01\n1\n2\n23.01\n0\n1\n2\n−800\n−400\n0\n400\n17.01\nV, km s−1\n1\n2\n29.01\nCaII 8542\n1\n2\n28.01\n1\n2\n27.01\n1\n2\n23.01\n0\n1\n2\n−400\n0\n400\n17.01\nV, km s−1\n1\n2\n29.01\nFeII 4924\n1\n2\n28.01\n1\n2\n27.01\n1\n2\n23.01\n0\n1\n2\n−400\n0\n400\n17.01\nV, km s−1\nFig. A.4. The same as in Fig. 2, but during the brightness minimum in January 2024.\nFig. A.5. MgI 5184 Å and Fe II 5169 Å in the spectra of UX Ori during the brightness minima in 2021 (red). The dates of the observations and\nthe V-band magnitudes are shown in the each plot. The blue line represents the line profiles obtained in the bright state of the star on Sep. 5, 2020,\nwith V= 9.98 mag.\nArticle number, page 18 of 19\n\n\nTambovtseva et al.: Observations of UX Ori in deep minima. Analysis of spectra\nTable A.1. Spectra of UX Ori and quasi-simultaneous V-band photometry.\nDate (UT) FIES spectrum\nχ\nS/N\nV’\nσ\n∆t\nPhotometry observer\nmag\nmag\nd\n2019-02-20T23:04:15.0\n1.53\n49\n10.59\n0.10\n-0.09\nASAS-SN (g)\n2019-02-23T21:47:21.4\n1.28\n78\n10.51\n0.03\n-0.03\nSAAF (V)\n2019-03-01T20:25:02.2\n1.20\n66\n10.81\n0.03\n0.05\nSAAF (V)\n2019-03-03T21:18:07.2\n1.29\n37\n10.86\n0.10\n-0.10\nASAS-SN (g)\n2019-03-05T21:34:48.5\n1.36\n52\n10.82\n0.10\n-0.09\nASAS-SN (g)\n2019-03-06T22:01:13.8\n1.49\n58\n10.74\n0.10\n0.16\nASAS-SN (g)\n2020-01-30T01:27:28.0\n1.99\n34\n10.83\n0.10\n-0.21\nASAS-SN (g)\n2020-02-15T20:43:10.6\n1.19\n25\n11.90\n0.10\n-0.19\nAAVSO (Visual)\n2020-03-09T20:52:41.6\n1.29\n38\n11.35\n0.10\n0.29\nASAS-SN (g)\n2020-03-12T23:05:02.6\n2.39\n22\n10.98\n0.03\n-0.20\nSAAF (V)\n2020-09-05T05:55:17.8\n1.30\n88\n9.98\n0.10\n-0.72\nASAS-SN (g)\n2020-11-17T03:01:43.1\n1.19\n58\n10.89\n0.04\n0.01\nSAAF (V)\n2020-12-07T00:18:23.1\n1.24\n43\n10.91\n0.01\n0.19\nAAVSO (V)\n2020-12-12T03:12:57.1\n1.40\n26\n12.00\n0.10\n-0.01\nASAS-SN (g)\n2020-12-18T00:23:02.5\n1.19\n46\n11.56\n0.01\n0.16\nAAVSO (V)\n2020-12-21T01:05:00.0\n1.20\n59\n10.91\n0.02\n0.06\nSAAF (V)\n2021-01-18T23:41:36.0\n1.23\n23\n12.48\n0.01\n-0.07\nSAAF (V)\n2021-01-20T21:43:29.3\n1.21\n34\n12.00\n0.10\n0.36\nAAVSO (Visual)\n2021-01-24T21:23:19.5\n1.22\n26\n12.36\n0.04\n-0.75\nSAAF (V)\n2021-01-27T22:54:05.5\n1.22\n37\n12.27\n0.10\n0.23\nASAS-SN (g)\n2021-01-28T22:42:17.8\n1.21\n32\n12.37\n0.10\n0.23\nASAS-SN (g)\n2021-09-08T05:49:33.8\n1.29\n118\n10.30\n0.06\n0.16\nSAAF (V)\n2021-09-20T04:53:59.2\n1.31\n86\n11.29\n0.09\n0.17\nSAAF (V)\n2021-12-22T02:53:20.3\n1.48\n69\n11.28\n0.10\n1.14\nASAS-SN (g)\n2021-12-24T02:59:34.2\n1.55\n77\n10.61\n0.01\n0.66\nSAAF (V)\n2021-12-25T00:44:22.0\n1.19\n88\n10.61\n0.02\n-0.13\nAAVSO (V)\n2021-12-28T22:52:44.9\n1.24\n90\n10.65\n0.10\n0.31\nASAS-SN (g)\n2021-12-30T03:35:07.5\n2.09\n62\n10.32\n0.07\n0.17\nSAAF (V)\n2022-01-07T00:47:22.2\n1.30\n18a\n10.30\n0.05\n0.13\nSAAF (V)\n2022-01-15T21:37:03.2\n1.25\n83\n10.40\n0.01\n-0.07\nAAVSO (V)\n2022-02-14T20:42:20.8\n1.19\n69\n10.61\n0.05\n0.23\nSAAF (V)\n2022-09-12T05:23:25.2\n1.32\n52\n10.5\n0.10\n0.0\nV estimate from [OI] 6300 Å line.\n2023-01-23T21:45:43.8\n1.20\n50\n10.60\n0.01\n0.18\nAAVSO (V)\n2023-10-05T03:47:16.4\n1.33\n60\n10.43\n0.01\n-0.01\nNOT/ALFOSC (V)\n2023-10-17T02:22:45.6\n1.47\n55\n11.10\n0.01\n0.01\nNOT/ALFOSC (V)\n2023-10-29T05:38:12.7\n1.32\n47a\n10.86\n0.01\n0.04\nNOT/StanCam (V)\n2023-11-02T03:09:46.9\n1.20\n61\n11.30\n0.01\n-0.01\nNOT/ALFOSC (V-)\n2023-11-26T01:23:21.0\n1.21\n45\n11.52\n0.01\n0.12\nSAAF (V)\n2023-11-30T03:32:27.7\n1.31\n46\n11.51\n0.01\n-0.01\nNOT/ALFOSC (V)\n2023-12-03T02:22:34.9\n1.21\n59\n11.18\n0.01\n0.01\nNOT/ALFOSC (V)\n2023-12-09T00:08:29.6\n1.24\n51\n11.13\n0.01\n0.01\nNOT/ALFOSC (V)\n2024-01-11T22:32:32.7\n1.20\n33\n11.23\n0.01\n-0.01\nNOT/ALFOSC (V)\n2024-01-14T21:09:22.6\n1.32\n20\n11.72\n0.01\n0.01\nNOT/ALFOSC (V)\n2024-01-17T20:53:54.1\n1.33\n39\n11.72\n0.01\n0.01\nNOT/ALFOSC (V)\n2024-01-19T01:21:19.0\n1.60\n27\n11.67\n0.01\n0.02\nNOT/ALFOSC (V)\n2024-01-19T22:13:58.6\n1.19\n22\n11.84\n0.01\n0.01\nNOT/ALFOSC (V)\n2024-01-22T01:13:52.1\n1.64\n24a\n11.75\n0.01\n0.07\nAAVSO (V)\n2024-01-22T22:34:03.4\n1.19\n46\n11.77\n0.01\n-0.06\nNOT/StanCam (V)\n2024-01-23T22:54:14.9\n1.20\n41\n11.70\n0.01\n-0.04\nNOT/StanCam (V)\n2024-01-27T22:31:53.8\n1.20\n39\n11.39\n0.01\n-0.01\nNOT/ALFOSC (V)\n2024-01-28T22:21:18.3\n1.19\n51\n11.32\n0.01\n0.01\nNOT/ALFOSC (V)\n2024-01-29T21:45:24.0\n1.19\n62\n11.25\n0.01\n-0.01\nNOT/ALFOSC (V)\n2024-02-03T00:22:07.5\n1.60\n10\n11.38\n0.01\n0.01\nNOT/ALFOSC (V)\n2024-02-11T22:22:46.9\n1.27\n44\n11.87\n0.01\n0.01\nNOT/ALFOSC (V)\nNotes. The date refers to FIES spectrum, obtained at an airmass χ, and with a final S/N ratio measured ∼5300 Å. Quasi-simultaneous photometry\nis represented by the adopted V-band magnitude (V′), separated in time by ∆t fractional days from the FIES spectra. See Sect. 2 for further details.\n(a) FIES exposure time shorter than nominal.\nArticle number, page 19 of 19\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21261v1.pdf",
    "total_pages": 19,
    "title": "Observations of UX Ori in deep minima with the Nordic Optical Telescope. I. Analysis of spectral lines",
    "authors": [
      "L. V. Tambovtseva",
      "A. A. Djupvik",
      "V. P. Grinin",
      "H. Weber",
      "H. Bengtsson",
      "H. De Angelis",
      "G. Duszanowicz",
      "D. Heinonen",
      "L. Hermansson",
      "G. Holmberg",
      "T. Karlsson",
      "M. Larsson",
      "J. Warell",
      "T. Wikander"
    ],
    "abstract": "UX Orionis stars are the most active young stars; they undergo sporadic\nfadings of 2 - 4 magnitudes in the V-band, due to variable circumstellar\nextinction caused by a nearly edge-on star-disc system. The long-lasting\nmonitoring of a number of stars of this type with the Nordic Optical Telescope\nfrom 2019 to 2024 has given a rich collection of material of high-resolution (R\n~ 25000) spectra obtained during different brightness states of the stars. In\nthis paper, we present the results of observations for UX Ori itself. Until now\nonly one spectrum of high resolution had been obtained for this star during\nbrightness minimum, making it difficult to do a comprehensive analysis. Our aim\nis to analyse how different spectral lines change during such irregular fading\nevents, when the star is going in and out of eclipses, obscured by dust along\nthe line of sight. For this purpose we provide a comparative analysis of the\nprofiles and equivalent widths of the spectral lines belonging to the different\natoms and ions. In addition we compare the results for UX Ori with those made\nfor another target in our sample: RR Tau. Common features of variability are\nrevealed: 1) a strengthening of the H-alpha line relatively to the continuum\nduring eclipses; 2) the appearance of additional emission on the frequencies of\nphotospheric lines (e.g. Fe II, Ca II, Si II). The different behaviour of the\nspectral lines during fading found for UX Ori and RR Tau may be caused by two\neffects: a different contribution of the scattered light to the stellar flux\nduring eclipses or a less intense disc wind of UX Ori.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}