{
  "id": "arxiv_2502.21114v1",
  "text": "Software development projects as a way for\nmultidisciplinary soft and future skills education.\nKrzysztof Podlaski1, Micha l Beczkowski1, Katharina Simbeck2,\nKatrin Dziergwa2, Derek O’Reilly3, Shane Dowdall3, Joao\nMonteiro4, Catarina Oliveira Lucas4, Johanna Hautamaki5, Heikki\nAhonen5, Hiram Bollaert6, Philippe Possemiers6, and Zofia\nStawska7\n1University of Lodz, Poland\n2HTW University of Applied Science, Germany\n3Dundalk Institute of Technology, Ireland\n4Instituto Superior Polit´ecnico Gaya, Portugal\n5Centria University of Applied Science, Finland\n6AP University of Applied Science and Art, Belgium\n7Lodz University of Technology, Poland\nAbstract\nSoft and future skills are in high demand in the modern job market.\nThese skills are required for both technical and non-technical people. It is\ndifficult to teach these competencies in a classical academic environment.\nThe paper presents a possible approach to teaching in soft and fu-\nture skills in a short, intensive joint project. In our case, it is a project\nwithin the Erasmus+ framework, but it can be organized in many different\nframeworks.\nIn the project we use problem based learning, active learning and\ngroup-work teaching methodologies.\nMoreover, the approach put high\nemphasizes diversity. We arrange a set of multidisciplinary students in\ngroups. Each group is working on software development tasks. This type\nof projects demand diversity, and only a part of the team needs techni-\ncal skills. In our case less than half of participants had computer science\nbackground. Additionally, software development projects are usually in-\nteresting for non-technical students.\nThe multicultural, multidisciplinary and international aspects are very\nimportant in a modern global working environment. On the other hand,\nshort time of the project and its intensity allow to simulate stressful sit-\nuations in a real word tasks. The effects of the project on the required\ncompetencies are measured using the KYSS method.\n1\narXiv:2502.21114v1  [cs.CY]  28 Feb 2025\n\n\nThe results prove that the presented method increased participants\nsoft skills in communication, cooperation, digital skills and self reflection.\nkeywords:\nsoft-skills, future-skills, intensive, multidisciplinary, in-\nternational, intercultural, active-learing\n1\nIntroduction\nSoft and future skills are vital for graduates [35, 17].\nHowever, many\nstudents underestimate their importance and believe that domain com-\npetencies are sufficient [45]. Students who recognize the importance of\nsoft skills achieve higher salaries, while graduates with lower wages focus\nprimarily on hard skills [29].\nAdditionally, the authors of [21] predict\nthat after COVID-19, the changes in working conditions will further in-\ncrease the demand for soft skills of employees. Higher education institu-\ntions (HEIs) need not only to provide students with appropriate domain\ncompetencies, but also help them develop inter-domain and interpersonal\nskills. Therefore, HEIs have to modify teaching methodologies accord-\ningly. Many approaches have been proposed to address the mentioned\ndemands. Most of them are based on active learning, problem-solving,\nand group-work methods [49, 11, 18, 53].\nActive learning and problem-based methods are easily applicable in\nan educational institution, but these methods alone are not enough to in-\ncrease cooperation and communication skills like empathy. Moreover, in\nreal-life working environment, the IT specialists often have to cooperate\nwith non-technical persons [20]. Unfortunately, incorporation of multidis-\nciplinary and intercultural aspects into teaching in class environments is\nnot straightforward. In this paper we present an approach to teaching soft\nand future skills in an international cooperation project between HEIs and\nanalyse its effect on students’ self-assessed competencies with regards to\ncommunication, cooperation, flexibility, digital skills, creativity, critical\nthinking, willingness to learn and self-reflection. In the project, during a\n10-day intensive course, students worked in interdisciplinary teams with\nother students from different (academic) cultures, different languages and\ndifferent backgrounds. The result on increased soft and future skills in\nparticipating students is measured using the KYSS questionnaire [10, 15].\nThe development of KYSS (see Section 4) was focused on correspondence\nbetween survey questions, language and its understanding by participants\nas well as on measurement of soft and social skills.\nThe paper is structured as follows. In the Section 2 we discuss the\nproblem of soft- and future-skills in modern education. Next section is\ndedicated to description of the project. Later we introduce KYSS sur-\nvey. Sections 5 and 6 focus on results and interpretation of KYSS surveys\nconducted during the project. At the end of the paper we present Con-\nclusions.\n2\n\n\n2\nRelated Works\n2.1\nSoft and future skills\nThe importance of soft skills has long been established [28, 40]. While hard\nskills usually refer to domain specific competencies, such as databases, pro-\ngramming or operating systems, soft skills are complementary skills that\nare important for professional success and operating in a team in working\nenvironment [40, 12]. While there is no consensual definition of soft skills\nnor a finite list of single skills, soft skills usually include skills related to\ninterpersonal skills (communication, collaboration, empathy), reflection\n(critical thinking, problem solving) and self-development (learning, self-\nreflection) [40, 12]. Soft skills are hard to measure, they are best learned\nwhen they are integrated with hard skills [12].\nThe concept of future\nskills or 21st century skills extends the concept of soft skills towards skills\nthat help to cope with an ever changing professional environment. Future\nskills overlap with soft skills, but prioritize information management, crit-\nical thinking, creativity, problem solving, collaboration, communication,\nself-direction, lifelong learning, ethical awareness, cultural awareness and\nflexibility [51, 2]. Like soft skills, future skills are difficult to measure,\ntoo [2]. As additional requirement for future workforce is entrepreneurial\nreadiness. Entrepreneurship and its connection with computational think-\ning is important a much computer science as well as in social study disci-\nplines [27].\nThe soft skills most frequently addressed in curricula are communica-\ntion, teamwork, ethics and presentation skills [22]. However, skills such as\ncreativity and empathy are lacking in the curricula, even though they are\nrequired by industry [22]. Important future skills such as critical think-\ning and self-reflection were only found in 16% and 13% of the analysed\ncurricula respectively [22].\nProbably the most frequently cited soft skill is the ability to commu-\nnicate. This includes the ability to communicate in English as the lingua\nfranca (including the ability to communicate with non-native speakers), to\ncommunicate across disciplines, hierarchies, cultures and genders, in writ-\nten and oral form, and to listen and to visualize [38, 5]. Communications\nskills are often taught using presentations, peer review, role play or team\ntasks [38]. Communication skills are especially important in situations\nsuch as teamwork, negotiations, job interviews and mentoring [23].\nThe ability to jointly solve a task with others is referred to as coop-\neration skills. Problem based learning [37, 48] and portfolio projects [6]\nhave been documented to improve cooperation skills.\nFlexibility is the ability to adapt to changing circumstances.\nIt is\nespecially relevant for project management, for example in software de-\nvelopment [46].\nFlexibility includes the ability to change, to learn, to\naccept and to adjust [39, 5].\nDigital skills refer to the proficient but ciritical use of digital infor-\nmation, media and tools [43] as well as the attitude towards those [51].\nCreativity is the ability to generate new ideas or recombine existing ideas\ninto new concepts [25]. Learning creativity is associated with risk taking,\ndiversity of inputs, generation of ideas and evaluating/prioritizing them\n3\n\n\nlater [25].\nCritical thinking as a skill has been studied extensively since the 1990s\n[7]. Critical thinking is related to problem solving and requires domain\nknowledge and skills as a base for intellectual and cognitive analysis, inter-\npretation, argumentation and judgement [7, 1]. Critical thinking appears\nto be more difficult to teach and requires longer interventions in compari-\nson with other skills [7]. Because of the link to domain knowledge, critical\nthinking skills improve with time spent studying and books read [47].\nWillingness to learn is the skill that includes the notions of being\nresponsible for one’s own learning, self-management of learning and self-\nexpertise of learning [44]. Willingness to learn requires alertness, open-\nness and reflection, as learning does not always take place automatically,\nthrough experience [50].\nSelf-reflection involves the purposeful mental processing of one’s own\nlearning process and outcomes.\nIt is a pre-requisite for problem-based\nlearning [30].\nSelf-reflection is especially important when learners face\nanxiety in complex tasks in team projects [42].\nSelf-reflection is often\ntaught through reflective journal writing [8, 30].\nIn education, soft skills can be taught using didactic settings that\nrequire teamwork, reflection and diversity [24].\n2.2\nActive and problem based learning\nActive learning and problem based methods are commonly used in ed-\nucation, especially in education.\nMany classes end with real-life small\nprojects and probably all higher education institutions use project based\nclasses in their curricula. In ACM and IEEE Join Task Force documents\nwe can find explicit suggestions to enforce the growth of problem based\nand active learning methods at least with use of teamwork and group\nprojects in study programs [26, 19]. In many papers, we can see how peo-\nple use these approaches in teachings (see implementation review papers\n[49, 11, 18, 3] ). Problem based learning was also successfully applied in\ninternational contexts before [4].\nIt is, however, challenging to design collaborative learning settings\nbased on learning objectives, learner characteristics and contextual factors\nand to align the assessment [41].\nMost of the implementations are in-\nclass solutions. Therefore, they use homogeneous students, the students\nrepresent the same domain or institution. We are interested in approaches\nthat incorporate multidisciplinary and intercultural groups with active\nand problem based learning. In the literature not many methods fulfill\nthese requirements [34].\nIn previous years our group have participated in a few joint projects\n[36, 32, 33] that lead to the development of MIMI methodology [16]. In this\nproject we decided to continue work with this approach as it fits our needs.\nMIMI acronym comes from Multinational, Intercultural, Multidisciplinary\nand Intensive. It is developed especially for short term intensive projects\nfor diverse set of participants. It provide a schedule for such an event, with\ndetailed plan how to organize the work of teams. The organization of the\nevent is suited to enhance selected sills. The connection of activities with\nexpected pedagogical outcomes is sketched in the paper [16]. The method\n4\n\n\nwas recognized and recommended by the authors of [18]. Up to now no\nobjective measurements of the effects were conducted. The measurements\nof effectiveness of small didactic experiments is biased by the size of the\ngroup. On the other hand, the idea of organizing events outside of general\ncurricula leads to small number of participants, as such events can’t be\norganized in bigger scale.\n3\nIntensive project description\nWithin an Erasmus+ cooperation partnership, six European HEIs devel-\noped and implemented an intensive 10-day course to teach soft and future\nskills. The methodology implemented important elements of the MIMI\nmethodology[16] and developed it further. The participating 60 students\nand 10 lecturers met at one of the HEIs and represented different fields\nof study: less than half have computer science background, others were\npursuing degrees in management, tourism, chemistry and production en-\ngineering. Students were assigned to teams of 6 persons with members\nfrom the six participating HEIs and at least three disciplines. The task\nof the groups was to create a prototype of an application or service con-\nnected with the event theme: Digital Entrepreneurship and the Climate.\nAs a result, groups had to prepare a working prototype focused on a real\nlife local needs, create a business potential assessment, and present the\nidea to internal and external audience. The organizers assigned one staff\nmember for each group to be their mentor. The role of the mentor was to\nsupport the team and take the role of an advisor. The teams should be\nself-driven, and all the decisions were to be made by the student members.\nThe intensive course was split into three stages; each stage ended with a\ngroup presentation. The first two days are devoted to team building and\nbrainstorming. On the second day, the teams presented ideas as a pitch\nspeech. The second part was dedicated to the development of the idea.\nThe teams worked on prototypes and development of the application’s\ncontent and on business elements, such as stakeholders, user personas,\ncost assessments, Business Model Canvas, and SWOT analysis. On the\nfifth day of the event the groups presented their proposition again. During\nthe last stage, the teams polished their business ideas and prototypes. On\nthe ninth day of the project, more formal presentations took place with\ninvited external partners who also provided independent feedback to the\nteams. In all presentations during the project, every member of the team\nhad to take an active role. Soft and future skills were self-assessed by\nstudents using the KYSS questionnaire [10].\nStudents filled out the questionnaire on the first and the last day of the\nintensive course. An important difference to the MIMI methodology [16]\nwas that we did not conduct lectures and workshops during the intensive\ncourse. However, short motivating, interactive sessions, similar to TED\ntalks aligned the students’ knowledge on project goals, teamwork, software\nand service design as well as business potential assessment. These talks\nallowed participating students to get acquainted with staff members who\ncould help them later with specific problems in the course of the project.\nThe course was not set up as a contest, there was no winning team.\n5\n\n\nIt was explicitly suggested that teams help each other if possible.\nAt\nthe beginning of each day, the assigned mentor met with the team to\nconduct an assessment of tasks done, plan for the day and next days, and\ndiscuss the idea developed by the team. Often, mentors met with their\nteams several times per day. The frequency and length of the meetings\ndepended on the stage of the project and the needs of the team. In the\nfirst days, the mentor helped moderate brainstorming or improve focus on\nidea development. Later the mentor coached the team to finish the tasks\nthat allow the team to achieve its goals.\n4\nKYSS survey\nThe design and assessment of didactic methodologies requires qualitative\nand quantitative evaluation of the results [31]. In our project we need a\nmeasurement tool that can help to measure the impact on participant’s\nsoft and future skills. The measurement of soft and future skills is not\neasy and obvious. The KYSS survey [10] fits our needs. Therefore we\nhave decided to use this approach. The method allows to measure the\nlevel of soft and future skills in selected categories.\nKYSS comes from Kickstart Your Soft Skills and was developed within\nthe European Social Fund project under that name. The approach divides\nsoft skills into four domains: interaction, problem-solving, information\nprocessing, and personal. For each domain some categories, like commu-\nnication, cooperation, critical thinking, etc., were defined. The creators\nof KYSS survey developed a self-report questionnaire to estimate soft and\nfuture skills. It can be used as self-assessment tools for everyone. The\nquestionnaire results in a score that is recorded and described in an in-\ndividual feedback report. In addition to the scores, this feedback report\nalso contains score-based feedback for each of the recorded skills. In the\nprocess they used standardization and validation procedures to estimate\nimportance of the answers and correspondence to measured skills [10, 15].\nThe KYSS survey was prepared in dutch. At first the creators developed\na vocabulary that correspond with selected soft skills. On that base they\ncreated a set of questions, and measured if a survey participant understand\nthe question in a proper way. The work with local government institutions\nfor unemployed people as well as VDAB one of the biggest recruitment\ncompany in Belgium allowed to build adequate and verified questionnaire.\nAll questions are connected to selected soft-skills and the correlation was\nassessed in real-life environment. In our case we use translation of original\ndutch questions into English.\nKYSS allows respondents to self-assess those skill categories using a\nsurvey questionnaire. In this project, we have decided to measure seven\nselected categories: communication, cooperation, digital skills, creativity,\ncritical thinking, willingness to learn, and self-reflection.\nThe KYSS survey can be performed as an online survey. We asked\nall students to do the survey twice, at the beginning and at the end of\nthe 10-day intensive course. We applied statistical tests to to the data\nto determine if there was a significant statistical difference between pre-\nand post-tests. The difference would suggest that there is an effect on\n6\n\n\nparticipants’ skills. Moreover, we were interested to see if the post-test\nresults were better than the pre-test ones. Therefore, we used a one-side\nstatistical test in order to evaluate if improvement in selected skills can\nbe observed.\n5\nAssessment of project effects\nDuring the project, we assessed the project’s effects in two ways.\nWe\nasked the participants to fill out a simple questionnaire to map students’\nreception of the project.\nAdditionally, we used the KYSS method to\nmeasure the impact on students’ soft and future skills.\nIn the basic questionnaire, the participants generally expressed posi-\ntive reactions to the event (Tab. 1).\nQuestion\nYes [%]\nDo you feel that this project improved your com-\nmunication skills?\n96%\nDo you feel that this project improved your crit-\nical thinking?\n89%\nDo you feel that this project improved your cre-\nativity?\n83%\nDo you feel that the project improved your en-\ntrepreneurial skills?\n76%\nDo you feel this project promotes excellence in\nlearning, teaching and skills development?\n81%\nDo you feel that this project promotes interna-\ntionalization?\n96%\nTable 1: Students answers to basic questionnaire\nAs we can see, the students evaluated the learning experience and\nlearning gains very positively. The KYSS survey provides a deeper and\nmore reliable understanding of the project’s effects on participants’ soft\nskills.\nDuring the event, we measured students’ soft and future skills with\nthe use of KYSS surveys. One survey was filled out on the first day of the\nproject, the other on the last one. Both answers were connected, and we\nwere able to pair up the pre- and post-event answers. Students answered\nthe questions on a five-level Likert scale: ’Strongly agree’, ’Agree’, ’Neither\nagree nor disagree’, ’Disagree’, ’Strongly disagree’. We assign a value of\n2,1,0,-1, and -2 for each answer. This allows us to apply statistical tests\nand measure hypothesis if the project improves students’ skills.\nWe could have analyzed the effect on the basis of individual questions,\nbut we decided to work on categories, as the questions individually are less\ninformative than when combined together. In order to assess the effect on\na given category, we have summed up all the answers of a given student.\nWe can say that the students obtained some points for answers in each of\nthe categories for pre-and post-tests. For each category, we have the Null\n7\n\n\nHypothesis H0 that both sets of results for a given category have the same\nstatistics. Additionally, we believe that the results of post-event surveys\nare better than in pre-test. We test the hypothesis H1 that the results\nfor a given category of post-event tests are statistically better than those\nfrom pre-event tests. In all categories the results of post-tests have higher\nmean and median than in pre-test, but it is not enough to validate the\nincrease of skills. Therefore, we use statistical test to verify our hypothesis.\nOne-sided rank statistical tests are much more appropriate for hypothesis\ntesting in similar scientific problems [9, 13]. In this research, we use the\nWilcoxon one-side test [54, 14], implemented in python scipy library [52].\nFor all tests, we used significance level α equal to 0.05, which means if the\np-value obtained for a given statistical test is lower than the significance\nlevel, we can reject the null hypothesis in favor of hypothesis H1. On the\nother hand, if the p-value is higher than the significance level, we have no\nreason to reject the null hypothesis H0\nWe present results for all categories independently.\n5.1\nCategory: communication\nThis category contains eight questions. All answers for a student were\nsummed up and paired. The results of pre-and post-survey results and\nthe difference post-result minus pre-result are presented in Fig. 5.1. Pa-\nrameters of distribution of the results are in Table 2.\nParameter\npre\npost\nmean\n6.368\n7.763\nmedian\n7.000\n8.000\nσ (st. deviation)\n4.737\n4.386\nWilcoxon test results\np-value\n0.020\nTable 2: Results for the category: communication.\nUsing the Wilcoxon one-side test, we obtained a p-value equal to 0.020.\nAs this is lower than 0.05, we can reject H0 hypothesis. Therefore we\naccept the H1 hypothesis that the results of the post-event test are sta-\ntistically better than those obtained by a student in the pre-event test.\n5.2\nCategory: cooperation\nThe category cooperation contains six questions; we have proceeded in\nthe same way as in the previous category (see Fig. 5.2 and Tab. 3).\nThe Wilcoxon test returned a p-value equal to 0.012, and as before,\nwe can accept the H1 hypothesis for this category.\n5.3\nCategory: flexibility\nThe category flexibility contains six questions (results in Fig. 5.3, Tab. 4).\n8\n\n\nFigure 1: Results for category communication.\n.\nParameter\npre\npost\nmean\n5.447\n6.579\nmedian\n5.500\n6.000\nσ (st. deviation)\n3.118\n2.769\nWilcoxon test results\np-value\n0.012\nTable 3: Results for the category: cooperation.\nThe Wilcoxon test returned a p-value equal to 0.117, so we can’t accept\nthe H1 hypothesis for this category. The conclusion is that the distribution\nof pre and post-results are statistically similar and can represent the same\nbackground statistics.\n5.4\nCategory: digital skills\nThe category digital skills contains four questions (results in Fig. 5.4 and\nTab. 5). The Wilcoxon test returned a p-value equal to 0.013, and we can\naccept the H1 hypothesis for this category.\n9\n\n\nFigure 2: Results for category: cooperation.\nParameter\npre\npost\nmean\n4.763\n5.211\nmedian\n5.000\n6.000\nσ (st. deviation)\n3.638\n3.197\nWilcoxon test results\np-value\n0.117\nTable 4: Results for the category: flexibility.\nParameter\npre\npost\nmean\n2.605\n3.395\nmedian\n3.000\n4.000\nσ (st. deviation)\n2.651\n2.700\nWilcoxon test results\np-value\n0.013\nTable 5: Results for the category: digital skills.\n10\n\n\nFigure 3: Results for categories: flexibility.\n5.5\nCategory: creativity\nThe category creativity contains six questions; we have proceeded the\nsame way as in previous categories (see Fig. 5.5, Tab. 6).\nParameter\npre\npost\nmean\n4.974\n5.447\nmedian\n5.000\n5.500\nσ (st. deviation)\n2.748\n2.468\nWilcoxon test results\np-value\n0.095\nTable 6: Results for the category: creativity.\nThe Wilcoxon test returned a p-value equal to 0.095, so we cannot\naccept the H1 hypothesis for this category.\n5.6\nCategory: critical thinking\nThe category critical thinking contains five questions; we have proceeded\nin the same way as in previous categories (see Fig. 5.6 and Tab. 7).\n11\n\n\nFigure 4: Results for categories: flexibility and digital skills.\nParameter\npre\npost\nmean\n4.526\n5.263\nmedian\n5.000\n5.000\nσ (st. deviation)\n2.613\n2.244\nWilcoxon test results\np-value\n0.058\nTable 7: Results for the category: critical thinking.\nThe Wilcoxon test returned a p-value equal to 0.058, so we cannot\naccept the H1 hypothesis for this category. The conclusion is that the\ndistribution of pre and post-results are statistically similar.\n5.7\nCategory: willingness to learn\nThe category willingness to learn contains six questions (see Fig. 5.7 and\nTab. 8).\nThe Wilcoxon test returned a p-value equal to 0.073, so we cannot\naccept the H1 hypothesis for this category. The conclusion is that the\ndistribution of pre and post-results are statistically similar.\n12\n\n\nFigure 5: Results for categories: creativity.\nParameter\npre\npost\nmean\n5.632\n6.237\nmedian\n5.000\n6.000\nσ (st. deviation)\n2.630\n2.538\nWilcoxon test results\np-value\n0.073\nTable 8: Results for the category: willingness to learn.\n5.8\nCategory: self reflection\nThe category self reflection contains five questions (see Fig. 5.8, Tab. 9).\nThe Wilcoxon test returned a p-value equal to 0.003, and so we can\naccept the H1 hypothesis for this category.\n6\nDiscussion\nThe results obtained for each category are presented in Table 10. We can\ndeduce that for four categories: communication, cooperation, digital skills,\nand self-reflection, the test results prove the increase of appropriate skills\n13\n\n\nFigure 6: Results for categories: creativity and critical thinking.\nParameter\npre\npost\nmean\n3.974\n4.895\nmedian\n4.000\n5.000\nσ (st. deviation)\n2.253\n2.186\nWilcoxon test results\np-value\n0.003\nTable 9: Results for the category: self reflection.\nduring the event. There is no reason to deduce similar implications for\nother categories like willingness to learn, critical thinking, flexibility, and\ncreativity. In truth, the results are not very surprising. The event is only\nten days long, and not all measured skills can be influenced in the same\nway during such a short time. The skills connected with communication,\ncooperation, and digital skills can be trained in a relatively short time. We\nthink that self-reflection has increased as the participants discovered that\nthey can obtain good results in a real-life task. The students learned that\nthey can work and achieve required goals in a high-stress situation with\nemphasis on results. On the other hand, skills like creativity, flexibility,\ncritical thinking, and willingness to learn can’t be increased in short forms\n14\n\n\nFigure 7: Results for categories: willingness to learn.\nand require a longer process. It is worth to mention, that the applied tests\ndo not decide if the H1 hypothesis is improbable to be true. It shows that\nthere is no reason to reject H0. Additionally, all results are statistical, so\nin particular students the effects could be different.\nIt is worth mentioning that there are differences between KYSS results\nand results obtained from direct questions from participants (see Tables 1\nand 10). For example, about 89% of participants believe that their critical\nthinking was improved, but analysis of KYSS surveys did not prove that\nassessment. It could mean that the overall positive emotions to the event\nincrease the percentage of positive answers. Additionally, the students are\nnot always able to properly assess their skills.\n7\nConclusions\nThe method used in the project was expected to have a positive impact\non the participants. Moreover, the event we describe is the second event\nof this type organized together.\nStaff members who have worked with\nstudents on the previous event observed positive impact on students’ soft\nand future skills. The observations in the following academic year, suggest\nhigher increase in skills in the project participants when compared with\n15\n\n\nFigure 8: Results for categories: flexibility and digital skills.\nthe other students on the degree programme. This time during the event,\nwe have incorporated KYSS surveys as a measurement tool. The results\nsupport the expectations and previous observations. Not all aspects mea-\nsured with KYSS show similar growth. The different effects of the project\non different skill categories were expected. Moreover, the KYSS gives a\nmore reliable assessment of the project’s effects than simple direct ques-\ntionnaire. Based on the presented results, the consortium will conduct a\nsimilar effect and measure its impacts on the participants.\nThe effects, show that Software Develompment projects can be used\nfor multidisciplinary education. This type of team task allows to increase\ncommunication and cooperation in diverse group. Young people are eager\nto use and create new solutions that use modern technologies. What is\nimportant that this type of activities is very appreciated by non-technical\nstudents.\nThe results prove that the intensive international and multidisciplinary\nprojects can lead to significant impact on participants soft and future\nskills. Moreover, our research provide for the first time objective mea-\nsurements of the effects of the MIMI methodology.\n16\n\n\nCategory\nWilcoxon\nConclusion\ntest result\nCommunication\n0.020\naccept H1\nCooperation\n0.012\naccept H1\nFlexibility\n0.117\nreject H1\nDigital skills\n0.013\naccept H1\nCreativity\n0.095\nreject H1\nCritical thinking\n0.058\nreject H1\nWillingness to learn\n0.073\nreject H1\nSelf reflection\n0.003\naccept H1\nTable 10: Statistical results for all categories\nReferences\n[1] Nada J Alsaleh. Teaching critical thinking skills: Literature review.\nTurkish Online Journal of Educational Technology-TOJET, 19(1):21–\n39, 2020.\n[2] Katerina Ananiadou and Magdalean Claro. 21st century skills and\ncompetences for new millennium learners in oecd countries. oecd ed-\nucation working papers, no. 41. OECD Publishing (NJ1), 2009.\n[3] Maria Eftychia Angelaki, Fragkiskos Bersimis, Theodoros Karvouni-\ndis, and Christos Douligeris.\nTowards more sustainable higher\neducation institutions: Implementing the sustainable development\ngoals and embedding sustainability into the information and com-\nputer technology curricula. Education and Information Technologies,\n29(4):5079–5113, July 2023.\n[4] Alexandra Badets, Becky Grasser, and Stefan Peltier. Cross cultural\nproject based learning & soft skills practice. In Proceedings of the\n2017 ACM Conference on Innovation and Technology in Computer\nScience Education, pages 381–381, 2017.\n[5] KVA Balaji and P Somashekar. A comparative study of soft skills\namong engineers. IUP Journal of Soft Skills, 3, 2009.\n[6] M´aty´as B´anhegyi and Bal´azs Fajt. Improving university students’\ncooperation skills through portfolio projects: A pilot study. Journal\nof Adult Learning, Knowledge and Innovation, 2023.\n[7] Linda S Behar-Horenstein, Lian Niu, et al. Teaching critical thinking\nskills in higher education: A review of the literature.\nJournal of\nCollege Teaching & Learning (TLC), 8(2), 2011.\n[8] Rhonda S Black, Thomas W Sileo, and Mary Anne Prater. Learn-\ning journals, self-reflection, and university students’ changing per-\nceptions. Action in Teacher Education, 21(4):71–89, 2000.\n[9] R. Clifford Blair and James J. Higgins. A comparison of the power\nof wilcoxon’s rank-sum statistic to that of student’s t statistic under\nvarious nonnormal distributions. Journal of Educational Statistics,\n5(4):309, 1980.\n17\n\n\n[10] Siham Chaoui, Peter David, Ellen De Bruyne, Sabrina Govaerts,\nAmber Hoefkens, Elena Van Den Broeck, and Gert Vanthournout.\nPreparing for (future) work?\nsupporting soft skill development in\nthe context of higher education with a digital instrument for 360°\nfeedback. In EDULEARN22 Proceedings, EDULEARN22. IATED,\nJuly 2022.\n[11] Juebei Chen, Anette Kolmos, and Xiangyun Du. Forms of imple-\nmentation and challenges of pbl in engineering education: a review\nof literature. European Journal of Engineering Education, 46(1):90–\n115, February 2020.\n[12] Barbara Cimatti. Definition, development, assessment of soft skills\nand their role for the quality of organizations and enterprises. Inter-\nnational Journal for quality research, 10(1):97, 2016.\n[13] William Jay Conover. Practical nonparametric statistics, volume 350.\nJohn Wiley & sons, 1999.\n[14] Edward E. Cureton. The normal approximation to the signed-rank\nsampling distribution when zero differences are present. Journal of\nthe American Statistical Association, 62(319):1068–1069, September\n1967.\n[15] Ellen De Bruyne, Elena Van Den Broeck, Siham Chaoui, and Sabrina\nGovaerts. Designing a 360° learning environment for the development\nof soft skills. In INTED Proceedings, INTED2023. IATED, March\n2023.\n[16] Shane Dowdall, Artur H loba˙z, Piotr Milczarski, Derek O’Reilly,\nKrzysztof Podlaski, and Zofia Stawska. Multinational, intercultural,\nmultidisciplinary and intensive (MIMI) methodology to enrich soft\nskills development in computer science students. Informatics in Ed-\nucation, jul 2021.\n[17] Ulf-Daniel Ehlers and Sarah A Kellermann. Future skills: The future\nof learning and higher educationn. results of the international future\nskills delphi survey. Technical report, Karlsruhe, 2019.\n[18] Odiel Estrada-Molina. A systematic mapping of variables studied in\nresearch related to education in informatics and computing. Journal\nof Engineering Education Transformations, 36(2):109–125, October\n2022.\n[19] CC2020 Task Force.\nComputing Curricula 2020:\nParadigms for\nGlobal Computing Education. ACM, November 2020.\n[20] S. Frezza, M. Daniels, and A. Wilkin. Assessing students’ IT pro-\nfessional values in a global project setting. ACM Transactions on\nComputing Education, 19(2):1–34, feb 2019.\n[21] Giorgio Gnecco, Sara Landi, and Massimo Riccaboni. The emergence\nof social soft skill needs in the post covid-19 era. Quality &; Quantity,\nApril 2023.\n[22] Wouter Groeneveld, Brett A Becker, and Joost Vennekens. Soft skills:\nWhat do computing program syllabi reveal about non-technical ex-\npectations of undergraduate students?\nIn Proceedings of the 2020\n18\n\n\nACM Conference on Innovation and Technology in Computer Sci-\nence Education, pages 287–293, 2020.\n[23] Owen Hargie.\nThe handbook of communication skills.\nPsychology\nPress, 1997.\n[24] Orit Hazzan and Gadi Har-Shai. Teaching computer science soft skills\nas soft concepts. In Proceeding of the 44th ACM technical symposium\non Computer science education, pages 59–64, 2013.\n[25] Dennie Heye. Creativity and innovation: Two key characteristics of\nthe successful 21st century information professional. Business infor-\nmation review, 23(4):252–257, 2006.\n[26] Joint Task Force on Computing Curricula, Association for Comput-\ning Machinery (ACM) and IEEE Computer Society, editor. Computer\nScience Curricula 2013: Curriculum Guidelines for Undergraduate\nDegree Programs in Computer Science. ACM, Inc, jan 2013.\n[27] Younah Kang and Keeheon Lee. Designing technology entrepreneur-\nship education using computational thinking. Education and Infor-\nmation Technologies, 25(6):5357–5377, May 2020.\n[28] Konstantinos Kechagias, editor. Teaching and assessing soft skills.\nSecond Chance School of Thessaloniki, 2011.\n[29] Giuseppe Lamberti, Aluja-Banet Tomas, and Trinchera Laura. Uni-\nversity image, hard skills or soft skills: Which matters most for which\ngraduate students? Quality & Quantity, 57(S4):553–574, April 2021.\n[30] Magdeleine DN Lew and Henk G Schmidt. Self-reflection and aca-\ndemic performance: is there a relationship?\nAdvances in Health\nSciences Education, 16:529–545, 2011.\n[31] Susan McKenney and Thomas C. Reeves. Conducting Educational\nDesign Research. Routledge, September 2018.\n[32] Piotr Milczarski, Derek O’Reilly, Krzysztof Podlaski, Fernando L.\nAlmeida, Shane Dowdall, Artur Hlobaz, Hiram Bolaert, and Justino\nLouren¸co. How Participation in an Intensive Project Can Increase\n3rd Level Students’ Awareness of Entrepreneurship. In Vadim Ermo-\nlayev, Mari Carmen Su´arez-Figueroa, Agnieszka Lawrynowicz, Ra´ul\nPalma, Vitaliy Yakovyna, Heinrich C. Mayr, Mykola S. Nikitchenko,\nand Aleksander Spivakovsky, editors, Proceedings of the 14th Inter-\nnational Conference on ICT in Education, Research and Industrial\nApplications. Integration, Harmonization and Knowledge Transfer.\nVolume I: Main Conference, Kyiv, Ukraine, May 14-17, 2018, vol-\nume 2105 of CEUR Workshop Proceedings, pages 394–404. CEUR-\nWS.org, 2018.\n[33] Jo˜ao Carlos Monteiro, Jos´e Carlos Morais, Nelson Neves, Hiram Bol-\nlaert, Philippe Possemiers, and Derek O´Reilly. Project GENIUS:\nan experience on innovative interdisciplinary contextual education\nusing games development. In EDULEARN19 Proceedings. IATED,\njul 2019.\n[34] Yakhoub Ndiaye and Lucienne Blessing. Assessing performance in\nengineering design education from a multidisciplinary perspective:\n19\n\n\nan analysis of instructors’ course review reports. Proceedings of the\nDesign Society, 3:667–676, June 2023.\n[35] OECD. The future of education and skills: Education 2030. OECD\nEducation Working Papers, 2018.\n[36] Derek O’Reilly, Piotr Milczarski, Shane Dowdall, Artur H loba˙z,\nKrzysztof Podlaski, and Hiram Bollaert. Comparison between ap-\nproaches used in two walkabout projects. International Journal of\nComputer and Information Engineering, 9(1):140–147, 2015.\n[37] Kawita Panlumlers and Panita Wannapiroon. Design of cooperative\nproblem-based learning activities to enhance cooperation skill in on-\nline environment. Procedia-Social and Behavioral Sciences, 174:2184–\n2190, 2015.\n[38] Marc J Riemer. Communication skills for the 21st century engineer.\nGlobal J. of Engng. Educ, 11(1):89–100, 2007.\n[39] Marcel M Robles.\nExecutive perceptions of the top 10 soft skills\nneeded in today’s workplace.\nBusiness communication quarterly,\n75(4):453–465, 2012.\n[40] Bernd Schulz. The importance of soft skills: Education beyond aca-\ndemic knowledge. Journal of Language and Communication, 2008.\n[41] Sandra Schulz, Sarah Berndt, and Anja Hawlitschek. Exploring stu-\ndents’ and lecturers’ views on collaboration and cooperation in com-\nputer science courses-a qualitative analysis. Computer Science Edu-\ncation, 33(3):318–341, 2023.\n[42] Sandra Schulz, Rita Garcia, and Christoph Treude.\nSocial trou-\nbleshooting workshops: Upskilling students’ soft and self-reflection\nskills. In Proceedings of the 2023 Conference on Innovation and Tech-\nnology in Computer Science Education V. 2, pages 643–643, 2023.\n[43] Miguel-Angel Sicilia, Elena Garc´ıa-Barriocanal, Salvador S´anchez-\nAlonso,\nPrzemys law\nR´o˙zewski,\nMagdalena\nKieruzel,\nTomasz\nLipczy´nski, Carme Royo, Francesca Uras, and Canice Hamill. Digital\nskills training in higher education: insights about the perceptions of\ndifferent stakeholders. In Proceedings of the Sixth International Con-\nference on Technological Ecosystems for Enhancing Multiculturality,\npages 781–787, 2018.\n[44] Maarten Simons and Jan Masschelein.\nOur ‘will to learn’and the\nassemblage of a learning apparatus. Foucault and lifelong learning:\nGoverning the subject, pages 48–60, 2008.\n[45] Chiara Succi and Magali Canovi. Soft skills to enhance graduate em-\nployability: comparing students and employers’ perceptions. Studies\nin Higher Education, 45(9):1834–1847, March 2019.\n[46] Aneerav Sukhoo, Andries Barnard, Mariki M Eloff, John A Van der\nPoll, and Mahendrenath Motah. Accommodating soft skills in soft-\nware project management. Issues in Informing Science & Informa-\ntion Technology, 2, 2005.\n[47] Patrick T Terenzini, Leonard Springer, Ernest T Pascarella, and\nAmaury Nora. Influences affecting the development of students’ crit-\nical thinking skills. Research in higher education, 36:23–39, 1995.\n20\n\n\n[48] Harli Trisdiono, Siswandari Siswandari, Nunuk Suryani, Soetarno\nJoyoatmojo, et al. Development of multidisiplin integrated project-\nbased learning model to improve critical thinking and cooperation\nskills. JPI (Jurnal Pendidikan Indonesia), 8(1):9–20, 2019.\n[49] Antoine Van den Beemt, Miles MacLeod, Jan Van der Veen, Anne\nVan de Ven, Sophie van Baalen, Renate Klaassen, and Mieke Boon.\nInterdisciplinary engineering education: A review of vision, teach-\ning, and support. Journal of Engineering Education, 109(3):508–555,\nJune 2020.\n[50] Ilse M Van Eekelen, Jan D Vermunt, and HPA Boshuizen. Exploring\nteachers’ will to learn. Teaching and teacher education, 22(4):408–\n423, 2006.\n[51] Ester Van Laar, Alexander JAM Van Deursen, Jan AGM Van Dijk,\nand Jos De Haan. The relation between 21st-century skills and digital\nskills: A systematic literature review. Computers in human behavior,\n72:577–588, 2017.\n[52] Pauli Virtanen, Ralf Gommers, Travis E. Oliphant, Matt Haber-\nland, Tyler Reddy, David Cournapeau, Evgeni Burovski, Pearu Pe-\nterson, Warren Weckesser, Jonathan Bright, St´efan J. van der Walt,\nMatthew Brett, Joshua Wilson, K. Jarrod Millman, Nikolay May-\norov, Andrew R. J. Nelson, Eric Jones, Robert Kern, Eric Larson,\nC J Carey, ˙Ilhan Polat, Yu Feng, Eric W. Moore, Jake Vander-\nPlas, Denis Laxalde, Josef Perktold, Robert Cimrman, Ian Henriksen,\nE. A. Quintero, Charles R. Harris, Anne M. Archibald, Antˆonio H.\nRibeiro, Fabian Pedregosa, Paul van Mulbregt, and SciPy 1.0 Con-\ntributors. SciPy 1.0: Fundamental Algorithms for Scientific Com-\nputing in Python. Nature Methods, 17:261–272, 2020.\n[53] Emma Whewell, Helen Caldwell, Mark Frydenberg, and Diana An-\ndone. Changemakers as digital makers: Connecting and co-creating.\nEducation and Information Technologies, 27(5):6691–6713, January\n2022.\n[54] Frank Wilcoxon. Individual comparisons by ranking methods. Bio-\nmetrics Bulletin, 1(6):80, December 1945.\n21\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21114v1.pdf",
    "total_pages": 21,
    "title": "Software development projects as a way for multidisciplinary soft and future skills education",
    "authors": [
      "Krzysztof Podlaski",
      "Michal Beczkowski",
      "Katharina Simbeck",
      "Katrin Dziergwa",
      "Derek O'Reilly",
      "Shane Dowdall",
      "Joao Monteiro",
      "Catarina Oliveira Lucas",
      "Johanna Hautamaki",
      "Heikki Ahonen",
      "Hiram Bollaert",
      "Philippe Possemiers",
      "Zofia Stawska"
    ],
    "abstract": "Soft and future skills are in high demand in the modern job market. These\nskills are required for both technical and non-technical people. It is\ndifficult to teach these competencies in a classical academic environment.\n  The paper presents a possible approach to teaching in soft and future skills\nin a short, intensive joint project. In our case, it is a project within the\nErasmus+ framework, but it can be organized in many different frameworks.\n  In the project we use problem based learning, active learning and group-work\nteaching methodologies. Moreover, the approach put high emphasizes diversity.\nWe arrange a set of multidisciplinary students in groups. Each group is working\non software development tasks. This type of projects demand diversity, and only\na part of the team needs technical skills. In our case less than half of\nparticipants had computer science background. Additionally, software\ndevelopment projects are usually interesting for non-technical students.\n  The multicultural, multidisciplinary and international aspects are very\nimportant in a modern global working environment. On the other hand, short time\nof the project and its intensity allow to simulate stressful situations in a\nreal word tasks. The effects of the project on the required competencies are\nmeasured using the KYSS method.\n  The results prove that the presented method increased participants soft\nskills in communication, cooperation, digital skills and self reflection.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}