{
  "id": "arxiv_2502.21223v2",
  "text": "The IDEA detector concept for FCC-ee\nThe IDEA Study Group∗\nA detector concept, named IDEA, optimized for the physics and running conditions\nat the FCC-ee is presented. After discussing the expected running conditions and the\nmain physics drivers, a detailed description of the individual sub-detectors is given.\nThese include: a very light tracking system with a powerful vertex detector inside a\nlarge drift chamber surrounded by a silicon wrapper, a high resolution dual readout\ncrystal electromagnetic calorimeter, an HTS based superconducting solenoid, a dual\nreadout fiber calorimeter and three layers of muon chambers embedded in the magnet\nflux return yoke. Some examples of the expected detector performance, based on fast\nand full simulation, are also given.\n1 Introduction\nThe FCC-ee is a proposed e+e−collider that would give access to a large vari-\nety of unique physics measurements. In the following a full detector concept, named\nIDEA, is described. It attempts to provide optimal performance on most of the physics\naccessible, while dealing with the constraints required by the accelerator.\nIn section 2 the physics drivers on the detector design are reviewed after discussing\nthe specific features of the accelerator. A detector overview is given in section 3 followed\nby a description of all subdetectors and their expected performance.\n2 Requirements\n2.1 Running conditions\nThe FCC-ee is planned to operate at or around four center of mass energies: the\nZ boson mass, the WW production threshold, the Z-Higgs associated production and\nthe top quark pair production threshold. The luminosity, in excess of 1036 cm−2s−1,\nis highest at the Z resonance with a bunch spacing of only 20 ns. It then drops rapidly\nwhile the energy increases, as the beam currents are reduced to keep the maximum\nenergy radiated by the beams below 50 MW/beam. The bunch spacing grows as the\nenergy increases, reaching about 1 µs at the ZH associated production energy.\n∗Full list of authors is shown at the end of the paper\n1\narXiv:2502.21223v2  [physics.ins-det]  3 Mar 2025\n\n\nFigure 1: 3D cutout view of the IDEA baseline detector design with subdetector\nlabels.\nFigure 2: Event display of a sample ZZ event at an e+e−center of mass energy\nof 240 GeV with the IDEA baseline design in DD4hep differentiable full simulation.\nSubdetector hit markers are coded by color and shape. The first 100 simulated tracks\nby generation time are shown.\nThese running conditions are particularly challenging for the detectors at the Z\nenergy, due to the fast beam-related backgrounds and the rather high rate of interest-\ning physics, which is expected to be in the order of 100 kHz. Limitations also exist in\nthe current final focus configuration due to the magnetic field of the detector solenoid,\n2\n\n\nwhich contributes to increase the beam emittances. A field of 2 T is currently consid-\nered to be the maximum acceptable to avoid degrading the luminosity when running\nat the Z pole. This restriction becomes much weaker at higher energies, so magnets\nthat can provide up to 3 T when running above the Z resonance are being considered.\nThe beam structure at FCC-ee does not have significant gaps in time with no beam\nas foreseen at ILC or CLIC. This has a large impact on the detector design, because\npowering on and off the detectors to reduce power consumption is not an option, thus\nincreasing cooling requirements.\nRelative to linear colliders the beamstrahlung contribution [1, 2] to the center-\nof-mass energy uncertainty is much smaller, being in the order of 1‰\naround the\nZH energy scale, thus allowing tighter constraints from the beam energy. A notable\nexample where this helps significantly is the determination of the Higgs recoil mass.\n2.2 Physics drivers\nThe physics accessible at FCC-ee falls into a few major categories: detailed mea-\nsurement of the Higgs boson properties, high precision electro-weak and heavy flavor\nstudies at the Z boson center of mass energy, precision measurements of the W boson\nand top quark parameters, and searches for new physics.\nThe main objective for the tracking systems is to provide good momentum, an-\ngle and impact parameter resolution for tracks with pt below 100 GeV/c. At higher\nmomenta the requirement on the momentum resolution is driven mostly by the mea-\nsurement of the Higgs recoil mass in HZ events with Z→µ+µ−. The precision of this\nmeasurement depends on the center of mass energy spread due to beamstrahlung, that\nis ∼0.1% at FCC-ee, and the experimental error on the momentum measurement of\nthe two muons from the decay of the Z boson. A track momentum resolution, σpt/pt,\nof a few times 10−5 is required to preserve the precision driven by the beam energy\nspread. Given the constraints on the magnetic field of the detector solenoid this leads\nto a rather large tracking volume.\nHeavy flavor physics and flavor tagging, all profit from high accuracy in secondary\nvertex measurements implying the need for powerful vertex detectors with hit resolu-\ntions at the few micron level. Typical momenta are generally lower for these types of\nphysics, necessitating low mass tracking detectors. Particle identification, in particular\nseparation of pions from kaons up to a few tens of GeV, is also important to enhance\nthe signal over background for many specific rare processes and to allow some level of\nstrange flavor tagging.\nJet energy and angular resolution is of key importance to exploit final states in-\nvolving decays to high energy quarks. Typical examples are Z, W or Higgs boson\ndecays to two jets or hadronic decays of top quarks. A useful figure of merit is the sep-\naration of Z from W decays using the di-jet invariant mass, leading to a required jet\nenergy resolution ∼30-40%/\n√\nE. A new generation of calorimeters, based on particle\nflow and/or dual readout, is needed to achieve such precisions.\nExtreme electromagnetic resolutions, attainable only with crystals, can provide\nhigh quality neutral pion identification that is important for the measurement of many\nheavy flavor quark and tau final states. Resolved neutral pions also play a role in\nimproving the jet resolution. A good photon energy resolution is relevant in improving\n3\n\n\nthe signal over noise of the process H →γγ and in correcting the electron track energy\nfor bremsstrahlung radiation.\n3 Detector overview\nThe Innovative Detector for E+e−Accelerator (IDEA) is a new, innovative detector\nconcept, specifically designed for FCC-ee. It is based on a sophisticated tracker and\na crystal dual-readout (DR) electromagnetic calorimeter within a superconducting\nsolenoid magnet, followed by a DR fiber calorimeter and then completed by a muon\ndetection system placed within the iron yoke that closes the magnetic field.\nThe tracker is composed of a high resolution silicon pixel vertex detector, a\nlarge-volume and extremely low-mass drift chamber for central tracking and parti-\ncle identification, and a surrounding wrapper made from silicon sensors to ensure the\nbest overall momentum resolution. The wire chamber provides up to 112 space-point\nmeasurements along a charged particle trajectory with excellent particle identifica-\ntion capabilities provided by the cluster counting technique. An outstanding energy\nresolution for electrons and photons is provided by a finely segmented crystal elec-\ntromagnetic calorimeter. The particle identification capabilities of the drift chamber\nare complemented by a time-of-flight measurement provided either by LGAD tech-\nnologies in the Si wrapper or by a first layer of LYSO crystals in the ECAL. Outside\nan ultra-thin, low-mass superconducting solenoid the calorimeter system is completed\nby the dual-readout fiber calorimeter. The hybrid dual-readout approach promises an\noutstanding energy resolution for hadronic showers without loss of EM performance.\nThe muon detection system is based on µ-Rwell detectors, a new micro pattern gas\ndetector that will provide a space resolution of a few hundred of microns, giving the\npossibility of selecting muons with high precision and also reconstructing secondary\nvertices at a large distance from the primary interaction point.\nA 3-D view of the IDEA detector is shown in Figure 1 and its cross-section is shown\nin Figure 3. An event display from a GEANT4 simulation of the detector is displayed\nin Figure 2.\n4\n\n\nacceptance, 100 mrad\nMuon chambers\nReturn yokes\nDR Fibre Calo\nCoil\nDR Crystal Calo\nSilicon Wrapper\nDrift Chamber\nVertex Detector\nr (m)\nz (m)\nFigure 3: Overview of the IDEA detector layout.\n5\n\n\n4 Machine Detector Interface (MDI)\nThe FCC-ee interaction region (IR) design is based on the crab-waist collision\nscheme, whose main ingredients to reach the high luminosity are nano-beams at the\ninteraction point (IP), large crossing angle, and crab-waist sextupoles [3].\nThe IR magnet system includes, in addition to the detector solenoid, a compensat-\ning solenoid placed at 1.23 m from the interaction point (IP) that cancels the\nR\nBzdz\nbetween the IP and the faces of the final quadrupole, and a screening solenoid around\nthe final focus quadrupoles to produce an opposite field to that of the detector, thereby\ncanceling the detector field. The final superconducting quadrupole sits inside the de-\ntector, at 2.2 m where the distance between the magnetic centers of the two beams is\nonly a few centimeters.\nThe central vacuum chamber extends for ± 90 mm from the IP. It will be composed\nof a double layer of AlBeMet162, an alloy of 62 % of Beryllium and 38 % Aluminum,\nwith active liquid paraffin cooling inside through four inlets and outlets. The geometry\nis optimized to minimize the material budget, which is calculated to be 0.68% X0 at\nnormal incidence, and to guarantee a proper coolant flow to remove the heat generated\nby wakefields, estimated to be on the order of 60 W. The vacuum chamber, that\nextends between 90 mm and 1154.5 mm from the IP, has an ellipto-conical shape to\nminimize the material budget in front of the LumiCal (the calorimeter that monitors\nthe machine luminosity). This beam pipe is supported by a lightweight carbon-fiber\ntube that also holds the vertex detector. The engineered MDI layout is shown in Fig. 4.\nFigure 4: MDI layout with beam pipes, vertex detector, and LumiCal with the sup-\nport tube.\n4.1 Beam related backgrounds\nThe most relevant background source for the detector is Incoherent Pair Creation\n(IPC) [4]. The occupancies due to IPC were studied by applying a safety factor of 3\n6\n\n\nto the simulated rates. The largest effect occurs at the Z pole, and the resulting hit\nrate in the innermost layer of the IDEA vertex detector is about 200 MHz/cm2.\nThe Total Ionisation Dose (TID) and the 1 MeV neq fluence in the IDEA interaction\nregion have been estimated using FLUKA, considering the main radiation sources at\nthe Z pole operational mode, namely radiative Bhabha and IPC. The peak annual\ndose and fluence in the inner vertex detector are at the level of few tens of kGy and\na peak fluence of few 1013 cm−2 for the innermost layers.\nThe single beam backgrounds are mostly intercepted by the collimation system\nand absorbers which remove the bulk of the particles that would eventually hit the\ndetectors, however some effects may remain due to the scattering of those particles\noff these devices and contribute to detector backgrounds. Simulations of the beam-gas\ninteractions have been done with a residual gas pressure profile resulting from 1 hr\nbeam conditioning at a full nominal current of 1.27 A at the Z-pole. In the region of ±\n500 m from the IP the gas composition is 85% Hydrogen, 10% CO and 5% CO2 at an\naverage pressure of 10−11mbar and spikes of 10−8 at the synchrotron radiation (SR)\nabsorbers. The results indicate about 1 Gy/year in the tunnel downstream of the IP\nand 1 kGy/year in the SR absorbers and around the central vacuum chamber.\nFurther studies are needed to estimate the injection backgrounds.\n5 Tracking system\nThe tracking system of IDEA consists of a silicon vertex detector, a lightweight\ndrift chamber, and an enclosing silicon detector layer (Silicon Wrapper), that could\nalso provide timing information. The high granularity of the vertex detector enables\nthe precise measurement of the vertices. At the same time, the drift chamber allows\nthe tracks to be extended up to large radii to measure the charged particle momenta\naccurately. The Silicon Wrapper provides a last precise measurement before the Crystal\nECAL. A time resolution of about 100 ps in the Si wrapper or a LYSO layer would\ncomplement the dNclusters/dx information from the drift chamber to enable efficient\nparticle identification for particle momenta up to about 30 GeV/c.\n5.1 Vertex detector\nThe IDEA silicon vertex detector features two main subsystems, whose active\nelements are based on 50 µm thick monolithic active pixel sensors (MAPS):\n• an inner vertex detector, located close to the beam pipe, at radii between 13.7\nand 35.6 mm, covering an angular acceptance of about |cos(θ)| < 0.99;\n• an outer vertex detector, located at larger radii between 130 and 315 mm,\ncomposed of a barrel section and forward disks.\nTwo alternative layouts are being explored for the inner vertex detector. The first\nlayout uses a traditional approach, in which modules are mounted on a carbon fiber\nsupport, with overlapping structures to allow full coverage and alignment. The second,\nless advanced, layout is based on curved detectors, using a concept similar to the\nALICE ITS3 [5].\nThe baseline vertex detector layout is illustrated in Figure 5.\n7\n\n\nSection F-F\nSection G-G\nwithout \nOuter Vertex\nF\nF\nG\nG\n1\n1\n2\n2\n3\n3\n4\n4\n5\n5\n6\n6\nA\nA\nB\nB\nC\nC\nD\nD\nvertex_FCC 2_2\nFCC Vertex\nIstituto Nazionale di Fisica\nNucleare-Sezione di Pisa\nfbosi\n03/04/2023\nProgettato da\nControllato da\nApprovato da\nData\n1 / 1 \nEdizione\nFoglio\nData\nOUTER VERTEX= N.51 Staves\n16 Pixel detectors/stave\nSurface pixel detectors=42.2x40.6 mm2=17,21 cm2\nPower dissipated/pixel detector=1,72 W\nPower  dissipated/stave=27,52 W\nOUTER VERTEX POWER DISSIPATED\n=1403,52 W\n \nMIDDLE VERTEX=N.23 Staves\n8 Pixel detectors/stave\nSurface pixel detector=42.2x40.6 mm2=17,21 cm2\nPower dissipated/pixel detector=1,72 W\nPower  dissipated/stave=13,76 W\nMIDDLE VERTEX POWER DISSIPATED\n=316,48 W\n \nInner Vertex: N.3 layers of pixel detectors\nLayer 1: N.15 staves of 6 pixel detectors=90 pixel detectors\nLayer 2: N.24 staves of 10 pixel detectors=240 pixel detectors\nLayer 3: N.36 staves of 16 pixel detectors=576 pixel detectors\nSurface pixel detector=8,4x32mm2=2,68 cm2\nPower dissipated/pixel detector=0.134 W\nLayer 1: Power dissipated 12.06 W\nLayer 2: Power dissipated 32,16 W\nLayer 3: Power dissipated 77,18 W\nTotal power dissipated by the inner Vertex:121,4 W \n42,20\n42,20\n40,60\n8,40\n32,00\n193,00\n321,80\n515,00\n609,40\n1860,00\n652,60\n304,70\n304,70\n315,30\n310,00\n315,30\n310,00\n1240,00\nR=315.0\nR=130,0\nR=34,5 third layer\nR=23,7 second layer\nR=13,7 first layer\nOuter Vertex\nInner Vertex\nDisk 1\nDisk 2\nDisk 3\nDisk 1\nDisk 2\nDisk 3\n326,30\n326,30\nMiddle Vertex\n326,20\n40,60\nFigure 5: Engineered layout and main characteristics of the baseline vertex detec-\ntor. Dimensions are given in mm. Top left: cross sectional view showing the barrel\nlayers; top right: longitudinal view showing the outer barrel and disks; bottom right:\nlongitudinal view with the inner and middle barrels and disks. The left panel reports\nthe main elements for the outer, middle and inner barrel detectors together with the\npower dissipated.\n5.1.1 Baseline inner vertex\nThe inner vertex detector is composed of three concentric barrel layers mounted on\ncarbon fiber support structures. The elementary unit is a module of dimensions 32 (z)×\n8.4 (r–ϕ) mm2. Each module has two chips abutted in z inspired by the ARCADIA\nINFN R&D program [6]. The active area is made of 640 (z) × 256 (r–ϕ) pixels of 25 ×\n25 µm2 size. A 2 mm inactive space is envisaged in r–ϕ, which contains the periphery\nof the chip. The power consumption of the current ARCADIA prototype, read out\nat 100 MHz/cm2, is measured to be about 30 mW/cm2, and considering the higher\nexpected FCC-ee data rate and time resolution, 50 mW/cm2 has been conservatively\nassumed. To allow 2 mm radial clearance for its insertion, the first layer is located\nat a radius of 13.7 mm. The length is constrained by the central beam pipe cooling\nmanifolds. The first layer comprises 15 staves of 6 modules each along z, as shown in\nFigure 6. The staves overlap in ϕ, to allow internal alignment. A lightweight support\non each ladder provides rigidity and allows the mounting of the MAPS. The structure\nis made of thin carbon fiber walls interleaved with Rohacell, which holds the sensors\n8\n\n\nView C\nC\n1\n1\n2\n2\n3\n3\n4\n4\n5\n5\n6\n6\nA\nA\nB\nB\nC\nC\nD\nD\nComplete layout layer 1\nIDEA-INNER VERTEX\nIstituto Nazionale di Fisica\nNucleare-Sezione di Pisa\nfbosi\n02/02/2023\nProgettato da\nControllato da\nApprovato da\nData\n1 / 1 \nEdizione\nFoglio\nData\n1,40\n8,40\n4,20\n0,20\n0,05\nRadius=13.70\nRadius=13.70\nMisalignment 2.5\n1,40\n0,20\n0,20\n2,00\n2,20\nOverlap 0.504\nOverlap 0,477\n0,05\n0,05\n8,40\n227,40\n193,00 active part\n32,00\n32,00\n32,00\n32,00\n32,00\n32,00\n17,00\n17,00\n0,20\n0,20\n0,20\n0,20\n0,20\n0,20\n0,20\nInner Vertex\nLayer 1 : N.15 staves pinwheel of 6 pixel detectors = 90 \npixel detectors\nLayer 1 Power dissipated :\nN.1 pixel detector = 0.84x3.2 cm2 =2.69 cm2. \nPower dissipated /pixel= 50 mW/cm2\nPower dissipated /pixel detector=0.134,5 W\nTotal Power dissipated = 12.105 W\n5,00\n1,80\n0,20\n0.20\n1,80\n0,20\n5,00\n0,20\n1,00\nFigure 6: First layer of the baseline inner vertex detector. The top drawings show\nthe transverse (left) and longitudinal (right) cross sections of the assembly, shown in\nthree dimensions on the bottom left drawing. An enlarged view showing the overlaps\nand the different structures is given in the bottom right drawing. All measures are\nin mm. MAPS sensors of 50 µm thickness are facing the centre of the structure. The\nbrown structures are the buses, while the gold parts are the electronic hybrid circuits\nfor readout.\n(facing the beamline) and two buses (one for data and another for power) 1.8 mm\nwide each on the opposite side. The thickness of the bus comprises 200 µm kapton and\n50 µm aluminum for a total of 0.09 % of X0. The ladders are arranged in a pinwheel\ngeometry.\nThe second layer, with a structure similar to the first, is made of 24 ladders of 10\nmodules each, at a radius of 23.7 mm, arranged in a pinwheel geometry opposite in ori-\nentation to that of the first layer, in order to mitigate possible charge-dependent effects\non charged-particle track reconstruction. The third layer has 36 ladders each com-\nposed of 16 modules. The ladders are arranged in a ϕ-symmetric lampshade fashion:\nhalf of the ladders are located at 34 mm radius, the other half at 35.6 mm.\nTable 1 lists the properties of all the inner vertex layers. Each layer has a radiation\nlength of 0.25% at normal incidence. The overlap between same-layer staves increases\nthe average material budget by about 20%. The vertex detector layers are mounted\non the conical support using two rings of PEEK material to thermally isolate them\nduring bakeout.\nThe power dissipated by each layer is reported in Table 1. The inner vertex detector\nwill be cooled by gas passing through channels embedded in the conical carbon fiber\nsupport structure. Both atmospheric air and helium are considered as cooling gases.\nA system of carbon fiber cones is used to force gas convection inside the detector\n9\n\n\nTable 1: Main parameters of the baseline vertex detector.\nSubsystem\nLayer ID\nRadius [mm]\n|z| [mm]\nStaves\nModules/staves\nPower [W]\nInner barrel\n1\n13.7\n< 96.5\n15\n6\n12\nInner barrel\n2\n23.7\n< 160.9\n24\n10\n32\nInner barrel\n3\n34 and 35.6\n< 257.5\n36\n16\n77\nMiddle barrel\n1\n130\n< 163.1\n23\n8\n316\nOuter barrel\n2\n315\n< 326.3\n51\n16\n1400\nDisks\n1\n34.5 < r < 275\n304.7\n56\n2–6\n135\nDisks\n2\n70 < r < 315\n620\n48\n3–7\n420\nDisks\n3\n105 < r < 315\n930\n40\n4–7\n370\nFigure 7: View of the vertex detector middle barrel and disks together with the\ncooling cones. The blue parts are the two luminosity detector calorimeters.\nvolume, and to support power and readout circuits, as shown in Figure 7. The cooling\nperformance is analysed with a Computational Fluid Dynamics (CFD) simulation,\nresulting in the largest temperature difference between the modules along the stave of\nthe third layer of less than 15 ◦C. All other layers dissipate less power (see Table 1).\nA mechanical vibration analysis has been performed using a Finite Element Analysis\n(FEA) simulation in ANSYS, resulting in the magnitude of the maximum displacement\nof about 1.5 µm for a nominal airflow of 0.7 g/s.\n5.1.2 Ultra-light inner vertex\nAn alternative layout for the inner vertex is also explored, based on a similar\nconcept of the ALICE ITS3 curved sensor technology [5], which allows a self-supporting\nstructure with almost only silicon sensors in the acceptance, thus resulting in an ultra-\nlight vertex layout. ITS3 uses the stitching technique to form wafer-scale sensors from\nmultiple repeated sensor units (RSUs). Each ITS3 layer comprises two half-cylindrical\nsensors featuring ten RSUs in z and three, four, or five in ϕ for the first, second, and\nthird layers. Unlike ITS3, the vertex detector at FCC-ee must cover the largest polar\n10\n\n\nLayer 3\nLayer 4\nRSU\nFlex circuit\n(power & R/O)\nLongeron \nRing \nLayer 1\n281.7 mm \nR=20.35 mm\nLayer 2\n216.7 mm \nR=13.7 mm\n216.7 mm \n173.3 mm \n1.25 \nmm\nR= 27 mm\nR= 33.65 mm\nFigure 8: Ultra-light inner vertex detector layout (see text for detailed explanation).\nThe four half-layers are shown separately. On the top right hand side an assembled\nview of the first two layers is shown.\nangle possible for all detection layers. The layers cover more or less the same angular\nacceptance to fulfill this requirement. To reach the small radius of 13.7 mm, the first\nlayer only uses two rows in ϕ of 10 RSU in z as listed in Table 2. It is supported only\nby two carbon foam longerons and rings. The spacing between the two half-shells is\n1.25 mm, thus leaving a gap in the ϕ acceptance, which is partially compensated by\nthe second layer which is rotated in ϕ with respect to the first layer. It features one\nmore row of RSUs in ϕ and 13 RSUs along z. The first two layers are read out and\npowered by either side. For the third and fourth layers, using two sensors in z per\nhalf-layer is foreseen to circumvent the limitation of the 12-inch wafer diameter. The\nthird (fourth) layer uses 8 (10) layers on the −z side and 10 (8) on the +z side. In\nthis manner, the gap in acceptance in z in one layer is covered by the other. For these\nlayers, the readout only occurs on the far z sides.\nTable 2: Main parameters of the ultra-light inner vertex detector.\nLayer\nSensors\nRadius [mm]\nRSUs in ϕ\nRSUs in z\nLength [mm]\nCoverage\n1\n2\n13.7\n2\n10\n108.3\n|cos(θ)| < 0.992\n2\n2\n20.35\n3\n13\n140.8\n|cos(θ)| < 0.990\n3\n4\n27\n4\n8 (−z)/10 (+z)\n199.5\n|cos(θ)| < 0.990\n4\n4\n33.65\n5\n10 (−z)/ 8 (+z)\n199.5\n|cos(θ)| < 0.986\nFigure 8 shows the layout of this ultra-light vertex detector concept. Integration\nstudies are ongoing to validate the technical feasibility of such a layout.\n11\n\n\n0\n0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9\n1\n)\nθ\ncos(\n0\n1\n2\n3\n4\n5\n6\n [%] \n0\nMaterial budget x/X\nPCB\nSilicon\nKapton\nRohacell\nGlueEcobond45\nAluminum\nCarbonFiber\n(a) Flat inner vertex\n0\n0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9\n1\n)\nθ\ncos(\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n [%] \n0\nMaterial budget x/X\nPCB\nPEEK\nSilicon\nKapton\nRohacell\nWater\nGlueEcobond45\nAluminum\nCarbonFiber\nCarbonFleece\n(b) Complete flat vertex detector\n1\n−\n0.8\n−\n0.6\n−\n0.4\n−\n0.2\n−\n0 0.2 0.4 0.6 0.8\n1\n)\nθ\ncos(\n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\n1.4\n1.6\n1.8\n2\n [%] \n0\nMaterial budget x/X\nCarbonFiber\nSilicon\nKapton\nCarbonFoam\nAluminum\n(c) Ultra-light inner vertex detector\n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\n1.4\n1.6\n1.8\n2\n [%]\n0\nMaterial budget x/X\n1\n−\n0.8\n−\n0.6\n−\n0.4\n−\n0.2\n−\n0\n0.2 0.4 0.6 0.8\n1\n)\nθ\ncos(\n3\n−\n2\n−\n1\n−\n0\n1\n2\n3\nφ\n(d) 2D ultra-light inner vertex detector\nFigure 9: Material budget for the vertex detector. On the top row for the flat inner\nvertex (a) and complete vertex detector (b). On the bottom row for the curved inner\nvertex detector (c) and two-dimensional distribution (d).\nThe material budget is very much reduced with respect to using a classic design,\nas shown in Fig. 9. A single layer contributes about 0.075% of X0 at normal incidence,\nand the material budget is more uniformly distributed in ϕ due to the absence of\noverlapping structures in the same layer as shown in Fig. 9d.\n12\n\n\n5.1.3 Outer vertex and disks\nThe outer vertex detector is composed of two barrel layers and three disks on either\nside of the IP. The elementary unit is a module of dimensions 40.6(z)×42.2(r−ϕ) mm2.\nEach module has four hybrid pixel sensors inspired by the ATLASpix3 design [7].\nThe active area of the chip consists of 132 columns of 372 pixels each, with square\npixels of 150 × 50 µm2. The sensor thickness of the modules is 50 µm and their power\nconsumption is assumed to be 100 mW/cm2, half of the level observed at the current\nstage of development, but still too high (by at least a factor of two) to be handled by\nair cooling.\nThe same module type is used for the barrel layers and the disks. One barrel layer is\nplaced at 13 cm radius (middle barrel) and is made of 22 ladders, each with 8 modules,\nas shown in Fig. 10a.\n13\n\n\n(a) Outer vertex barrel\nVista B\nB\nELENCO PARTI\nDESCRIZIONE\nNUMERO PARTE\nQT¬\nELEMENTO\n \nstruttura supportoc1x652,6\n150\n1\n \ncolla struttura 36x652,6\n50\n2\n \nAssieme cold plate con detector e fanout \ncompleto outer tracker\n50\n3\n \nsupporto a c piano struttura triangolare pixel \nouter tracker\n900\n4\n \nParte terminale stave completa boccole_1\n100\n5\n1\n1\n2\n2\n3\n3\n4\n4\n5\n5\n6\n6\nA\nA\nB\nB\nC\nC\nD\nD\nAssieme completo outer tracker struttura triangolare\nIDEA- Outer Tracker\nIstituto Nazionale di Fisica\nNucleare-Sezione di Pisa\nfbosi\n16/01/2023\nProgettato da\nControllato da\nApprovato da\nData\n1 / 1 \nEdizione\nFoglio\nData\n42,20\n315.050\n0,05\n1,00\n1,00\n1,00\n36,00\n36,00\n36,00\n42,20\nN.50 stave triangolar truss \nN.16 single pixel detector/stave\nTotal pixel detector N.800 single pixel detector\nEach stave composed by 16 pixel detector dimension 4.22x4.06 cm2 = 17.13 cm2\nPower dissipated single pixel detector = 100 mW/cm2\nTotal Power dissipated  detector: 17,13x0.1W = 1.713 W/single detector\nTotal Power dissipated 800x1.713 W = 1370.4 W\n1.90\n1.90\nR=315.050\n36,00\n36,00\n36,00\n1,00\n1,00\n1,00\n1,00\n1,00\n693,60\n1\n4\n2\n3\n5\n652,60\n652,60\n693,60\n0,28\n0,28\n(b) Disk 1\nFigure 10: Details of the outer vertex barrel (a) and first disk (b).\n14\n\n\nThe outermost layer (outer barrel) is placed at 31.5 cm and is composed of 51\nladders of 16 modules each. The outer layer is supported by a flange that is attached\nto the external support tube. The flange also supports the middle barrel as well as the\nfirst disks.\nThe modules are placed on top of a lightweight triangular truss structure. The\nstaves are mechanical structures holding the modules. Each stave is composed of a\ncarbon fibre multilayered structure, comprising 120 µm thick carbon fibre KDU13,\nand two carbon fleeces of 65 µm in total, to support two polyamide tubes of 2.2 mm\ndiameter and 90 µm thick, in which demineralised water will be circulating.\nAn electronic bus, bringing the power distribution and the readout and control signals,\nruns along the entire stave length and is put on top of the modules. It is terminated\nat the end of both sides of the stave by a hybrid circuit. Three disks per side, located\nat z=±29.25, ±62 and ± 93 cm, complete the outer vertex tracker. The inner disk is\nlocated inside the barrel. Each disk comprises four front and backward petals, made\nof modules of the same type as those of the barrels, as shown in Fig. 10b. The support\nstructure of each disk is made of a sandwich of thin carbon fibre walls (each of 0.3 mm\nthickness) interleaved with Rohacell (5.4 mm thick).\n15\n\n\n5.2 Drift chamber\nThe drift chamber for the IDEA detector concept is designed to provide precise\ntracking, high-precision momentum measurement and excellent particle identification\nby adopting the “cluster counting” technique [8]. The main peculiarity of this drift\nchamber is its high transparency, which is a crucial feature for the charged particle\nmomentum range, from several tens of GeV/c to a few hundred of MeV/c, where the\nMultiple Scattering (MS) contribution is far from being negligible, but also to limit\nγ conversions and hadronic interactions. This high transparency is obtained mainly\nthanks to a novel approach adopted for the wiring and assembly procedures [9]. The\ntotal amount of material in terms of radiation lengths is about 1.6% X0 in the radial\ndirection towards the barrel calorimeter, mostly due to the outer wall. In the forward\ndirection it is about 5.0% X0, with 75% of this located in the end plates, which is\ninstrumented with front-end electronics.\nThe chamber design inherits some aspects of drift chambers previously built and\noperated, like the ones of the KLOE experiment [10] and the MEG2 experiment [11].\nHowever it also presents fully innovative features, aimed to combine granularity and\ntransparency needs.\nThe IDEA drift chamber is a single-volume, cylindrical wire chamber, co-axial with\nthe 2 T solenoidal field and operated with a very light gas mixture, 90% He–10%\nC4H10 (in addition to the excellent quenching properties, relatively low cost and ease\nof production, isobutane has a low global warming potential, GWP) . It extends from\nan inner radius Rin = 350 mm to an outer radius Rout = 2000 mm, for a length of\nL = 4000 mm. Coverage in polar angle extends down to ∼13◦. The chamber is a full-\nstereo wire device, and it consists of 14 co-axial super-layers with 8 layers each, for a\ntotal of 112 layers, strung at alternating sign stereo angles ranging from 50 to 250 mrad.\nWires are arranged azimuthally in 24 identical angular sectors, 15◦wide. The cells are\napproximately square, since this geometry ensures a more uniform cell distribution\ninside the chamber volume for a full stereo configuration. The cell size ranges between\n12.0 and 14.5 mm, thus implying a maximum drift time of about 400 ns, assuming a\ndrift velocity of 2.2 cm/µs in a typical 90% He–10% C4H10 gas mixture [10]. The total\nnumber of drift cells is 56,448, and the field to sense wires ratio is 5:1 (see Fig. 11).\nFigure 11: Detail of the cross-section at the middle of the drift chamber (z=0),\nshowing the cell layout. Field wires are indicated with full dots, blue or red depending\non the sign of the stereo angle, while sense wires are indicated with the symbol “x”.\nThe cells are approximately square, and the field to sense wires ratio is 5:1.\n16\n\n\nThe larger number of field wires per sense wire with respect to other large drift\nchambers (e.g. the KLOE drift chamber) allows the use of thinner field wires (40-50 µ\nm diameter, in silver plated Al), benefiting the chamber granularity, the electric field\nisotropy inside the cell and the total load of the wires on the chamber end plates, at\nthe price of wiring about 350,000 wires in total in the chamber. This large number of\nwires requires a nonstandard wiring procedure and needs a feed-through-less wiring\nsystem. A novel wiring procedure, successfully exploited during the recent construction\nof the MEG2 drift chamber [12], relies on anchoring the wires on carbon fiber supports\nplaced on a cage structure mainly based on carbon fiber as well (shown in Fig. 12).\nThe wire support boards and the spacers, both defining the cell geometry, are\nplaced in between each pair of the 24 spokes, 1650 mm long, at each chamber end.\nThe deformation of the spokes due to the wire load is constrained to be below 200 µm\nby applying a tension recovery system based on a system of 15 stays per spoke (as\nschematically shown in Fig. 13).\nFigure 12: Schematic drawing of the drift chamber, showing the mechanical structure,\nconsisting of the gas envelope and the wire cage.\nFig. 14 (left) shows the almost-trapezoidal (with major base, minor base and height\nrespectively of 34, 17 and 34 mm) cross section of the spoke, while in Fig. 14 (right) a\n500,mm long fabricated prototype of a spoke is shown. The gas envelope surrounding\nthe chamber is separated from the wire cage, and it can freely deform without affecting\nthe internal wire position and tension.\nThe mean number of ionization clusters per cm generated by a minimum ionizing\nparticle in the drift chamber gas mixture is about 12.5 at atmospheric pressure. By\ncounting the number of ionization events per unit length (dN/dx) [8] particles can\nbe separated and identified with superior resolution compared to the conventional\nmethod based on ionization loss per unit length (dE/dx). Since in Helium-based gas\nmixtures the signals generated by ionization events and collected at the anode are\n17\n\n\nFigure 13: Schematic layout (not in scale) of the tension recovery system of the drift\nchamber spokes, obtained through a set of 15 stays per each spoke.\nseparated in time from a few nanoseconds to a few tens of nanoseconds (depending\non the drift distance from the anode), fast read-out electronics (∼GHz sampling) and\nsophisticated peak-finding algorithms are required to efficiently identify the ionization\nclusters by acquiring and analyzing the chamber signal waveforms, an example of\nwhich is shown in Fig. 15.\nFigure 14: Almost-trapezoidal cross-section of a spoke, showing the core and the\nexternal skin in composite materials (left). Fabricated prototype of a spoke, 500 mm\nlong, together with the insertion ends in PEEK (right).\nAssuming an empirical parametrization of the dE/dx resolution obtained with\nthe truncated mean technique [13] and a Poisson distribution for the number of the\nionization clusters in a 90% He–10% iC4H10 gas mixture at atmospheric pressure, the\nresolution expected with the cluster counting method is about 2 times better than\nthe usual dE/dx method. Analytical calculations assuming 2 m long tracks predict\nexcellent K/π separation for momenta up to ∼30 GeV/c except in the 0.85 < p <\n1.05 GeV/c range, where separation could be recovered by a timing layer with a modest\n100 ps resolution.\nIn order to verify these expectations, several muon beam tests have been performed\nat CERN. The performance of drift tubes of different sizes, sense wire diameters and\n18\n\n\n0\n100\n200\n300\n400\n500\ntime [ns]\n0.02\n−\n0\n0.02\n0.04\n0.06\n0.08\n0.1\n0.12\nVolt [V]\nWaveform\nIdentified Electron Peaks\nPrimary Ionization Clusters\nFigure 15: Typical signal waveform collected in Helium-Isobutane gas mixtures. Ion-\nization clusters (marked in blue) can be counted after a clustering algorithm identifies\nindividual ionization electrons (marked in red) belonging to the same cluster. The\npeaks of individual electrons are recognized by peak-finding algorithms.\noperated with different He-based gas mixtures was studied using muons of different\nmomenta and crossing angles. The collected signal waveforms have been acquired and\nanalyzed with several algorithms, providing results compatible within the uncertain-\nties. Fig.16 shows preliminary results from a beam test performed at CERN with high\nmomentum muons (40-180 GeV/c). The particle separation power with dN/dx out-\nperforms the traditional dE/dx truncated mean technique by about a factor of two.\nThe analysis refers to the same set of tracks, made of the same hits, analyzed both\nwith a 20% truncated dE/dx mean (left) and with a still not optimized cluster recon-\nstruction algorithm (right). Data analysis of two beam tests performed at CERN with\nmuons in a 1-12 GeV/c momentum range is ongoing, in order to confirm these results\nin the region of the relativistic rise of the most probable energy loss.\nThe cluster counting and timing techniques can also be exploited to improve\nthe spatial resolution (σxy < 100 µm). A spatial resolution around 110 µm has been\nachieved in the 7 mm cell size MEG2 drift chamber with the same gas mixture and\nvery similar electrostatic configuration [14]. However, an improved spatial resolution\nis expected in the IDEA drift chamber, because of longer drift distances and the ap-\nplication of the cluster timing techniques. Indeed, for any given “first cluster”, the\ncluster timing technique could potentially exploit the drift time distribution of all suc-\ncessive clusters in determining the most probable impact parameter, thus reducing the\nbias and the average drift distance resolution with respect to those obtained by the\nmethod using only the first cluster.\n19\n\n\ndE/dx resolution\ndN/dx resolution\nTrack length [cm]\nTrack length [cm]\nFigure 16: dE/dx resolution as a function of the track length (left). dN/dx resolution\nas a function of the track length (right). The superimposed red curves refer to a\nfit assuming a L−0.37 (from an empirical parametrization) dependence and a L−0.5\n(Poissonian) dependence, respectively. An improvement of about a factor of two in the\nresolution is visible using the dN/dx technique. Details of the analysis are described\nin the text.\n5.3 Silicon wrapper\nThe Silicon Wrapper is the last piece of the IDEA tracking system. It surrounds\nthe drift chamber (|z| ≤2.25 m and r < 2 m), covering an area of more than 100 m2.\nThe Silicon Wrapper provides full hermeticity (with the exception of sensor periphery\nregions) down to cos(θ) ≲0.989.\nFigure 17: Visualisation of the Silicon Wrapper implementation in DD4hep, with\nthe compensating solenoids, beam pipe and the vertex detector in the middle (drift\nchamber not shown).\n20\n\n\nTable 3: Main parameters of the current IDEA Silicon Wrapper layout, assuming ATLASpix3-sized\nsensors (42.2 × 40.2 cm2). The numbers for the disks are per side.\nLayer\nRadius [m]\nz [m]\nNumber of sensors\nSilicon area [m2]\nCoverage\nBarrel 1\n2.04\n|z| < 2.4\nO(20, 000)\n≈32\n|cos(θ)| < 0.762\nBarrel 2\n2.08\n|z| < 2.4\nO(20, 000)\n≈32\n|cos(θ)| < 0.756\nDisk 1\n0.35 – 2.04\n±2.30\nO(7, 500)\n≈12 × 2\n0.748 < |cos(θ)| < 0.989\nDisk 2\n0.35 – 2.04\n±2.32\nO(7, 500)\n≈12 × 2\n0.751 < |cos(θ)| < 0.989\nTotal\nO(70, 000)\n≈112\nThe sensor technology for the Silicon Wrapper has not been fixed yet. Candidates\nare, for example, two layers of silicon microstrip detectors or one layer of MAPS or\nlow-gain avalanche diodes (LGADs). In case the LGAD option is chosen, the goal\nwould be to reach a time resolution per track of ∼100 ps for time-of-flight particle\nidentification which, together with the cluster counting from the drift chamber, ensures\na K −π separation power of more than three sigma up to momenta of ∼30 GeV/c.\nThe time-of-flight measurement will also be crucial for long-lived particle searches at\nthe FCC-ee [15]. The other options do not provide timing within the tracking system;\nin this case timing would be supplied by a LYSO layer in front of the EM calorimeter.\nThe requirement on the spatial resolution of the Silicon Wrapper is O(10 µm).\nThis enables enables a precise momentum measurement, especially for high-momenta\nparticles and in the forward region where the drift chamber only provides a limited\nnumber of hits. The reasoning behind this small spatial resolution in θ is to allow\nthe Silicon Wrapper to act as a precise and stable ruler for the detector acceptance\ndefinition (< O(10 µrad), which is critical for cross-section measurements.\nThe current implementation of the Silicon Wrapper is based on MAPS. It is shown\nin Fig. 17 and consists of two barrel layers and two disks per side that overlap at\ntheir interface. Table 3 lists the properties of the current layout. The barrel layers\n(disks) are made up of staves (modules) with sensors on both sides, flex circuits on\ntop, and a support and cooling structure in the middle. The sensors have a thickness of\n50 µm. Each stave/module has a 1.4 mm carbon fiber support, the same cooling pipes,\nand four readout flex circuits as for the outer vertex detector described in Sec. 5.1.\nThe stave/module is inspired by the ATLASpix3 tile proposed for the CEPC tracker\n[16, 17], and the global layout of the disks follows the one of the CMS endcap timing\nlayer [18]. The current implementation of the Silicon Wrapper features a material\nbudget of ≈0.7% of X0 per barrel layer/disk as shown in Fig. 18.\nThe Silicon Wrapper will feature a number of challenges that need to be addressed\nin the next years. The area to cover (112 m2 in the current implementation) is very\nlarge and should be minimised to limit the number of sensors needed. An updated\nlayout is being developed that targets only one barrel layer and disk per side. In the\nbarrel, long longerons holding the sensors will be attached to support rings going\naround the drift chamber. For the disks, a design with two D-shaped half-endcaps per\nside will be pursued so that the Silicon Wrapper can be installed after insertion of\nthe support tube holding the beam pipe, vertex detector, and luminosity calorimeters.\n21\n\n\n0\n0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9\n1\n)\nθ\ncos(\n0\n0.5\n1\n1.5\n2\n2.5\n3\n [%] \n0\nMaterial budget x/X\nSilicon\nWater\nGlueEcobond45\nKapton\nCarbonFiber\nAluminum\n(a) Barrel\n0\n0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9\n1\n)\nθ\ncos(\n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\n1.4\n1.6\n1.8\n2\n [%] \n0\nMaterial budget x/X\nWater\nSilicon\nGlueEcobond45\nKapton\nCarbonFiber\nAluminum\n(b) Disks\nFigure 18: Material budget in the DD4hep Silicon Wrapper implementation for the\ntwo barrel layers (a) and the two disks per side (b).\nThese half-endcaps will be mounted onto the sides of the drift chamber, but it is\nnecessary to ensure that all the drift chamber services can be guided out of the detector\nwithout creating a crack in the wrapper acceptance.\nGiven the large area and high granularity, the aggregation of the signals, powering,\nand cooling will need to be addressed in an early design stage.\n22\n\n\n6 Idea Calorimetry System\nTo fully exploit the physics landscape of the FCC-ee, the performances of the\ncalorimetry must be improved in several aspects compared to the solutions adopted\nso far. Both energy and angular resolution must be optimized for different physics\ncases. For IDEA, we chose to aim for a detector with excellent energy resolution\nfor both electromagnetic and hadronic showers, and high granularity, to enhance the\nfinal-state particle identification performance. We focused on dual-readout calorimetry,\nprimarily to be able to resolve, in the 2-jet final states, events generated by W bosons,\ninstead of Z bosons or Higgs bosons. The hadronic showers generated in the three\ncases are very hard to separate by current detectors. An energy resolution (really an\ninvariant mass resolution) for hadronic showers of about 3% at 100 GeV is required.\nThe major problem is due to the presence, in hadronic showers, of two components,\nan electromagnetic one (electrons and photons) and a hadronic one, which produce\ndifferent signals for the same energy loss. Each hadronic shower develops a different\nelectromagnetic fraction, thus contributing to the energy shower measurement error.\nDual-readout (DR) calorimetry addresses this problem by sampling the showers\nwith two processes that are differently sensitive to the passage of non-relativistic par-\nticles (essentially the hadronic component) and relativistic particles (essentially the\nelectromagnetic component). A scintillating material produces a signal in both cases,\nwhile a material that emits Cherenkov light is activated only by relativistic particles.\nFrom the ratio between the two signals, it is possible to reconstruct the electromagnetic\nfraction of each shower, event by event, and cancel the effects of its fluctuation.\nA simple way to implement a dual-readout calorimeter is to use a scintillating mate-\nrial (for example, scintillating fibers) alternating with a material that emits Cherenkov\nlight (for example, clear fibers). Alternatively, one can try to isolate and measure the\nCherenkov light that is emitted in a scintillating material.\nBoth approaches are proposed for IDEA calorimetry. A homogeneous electro-\nmagnetic crystal calorimeter, where the aim is to separate scintillating light from\nCherenkov light, is followed by a fiber-sampling calorimeter, where scintillating fibers\nand clear fibers are placed on alternating lines and measured separately.\nIn order to assess the performance, several R&D projects, for both crystal and\nfiber-sampling DR calorimeters, are being carried out within the Work Package 3 (on\noptical calorimeters) of the DRD-on-Calorimetry (DRD6) Collaboration [19].\n23\n\n\n7 Crystal calorimeter\nThe IDEA Dual-Readout Crystal calorimeter section is designed to achieve an\nelectromagnetic energy resolution better than 3%/\n√\nE ⊕1% and includes the simulta-\nneous readout of scintillation and Cherenkov photons which, integrated with the DR\nfiber hadronic calorimeter section, can provide a hadronic energy resolution of about\n30%/\n√\nE ⊕3% [20, 21].\nAnother key feature compared to state-of-the-art homogeneous electromagnetic\ncalorimeters is the increased transverse granularity and longitudinal segmentation\nwhich constitute powerful handles for particle identification and global event recon-\nstruction based on the particle flow approach. The calorimeter can provide a time\nresolution at the level of 30 ps for electromagnetic showers with energy above 30 GeV.\nAn additional layer consisting of a 6 mm thick LYSO crystal grid can be added in\nfront of the calorimeter to provide cost-effective time resolution at the level of 20 ps for\nall charged particles, as described in [20], and exploiting a technology similar to that\nof the CMS MTD barrel [22, 23]. The baseline technological choices and calorimeter\nlayout are presented below with a short overview of ongoing R&D and prototyping\nefforts.\n7.1 Detector layout and technology\nThe crystal calorimeter is located between the tracking system and the solenoid\nwith a radial envelope of 2150-2500 mm, and is divided into a central barrel section and\ntwo endcaps. The ϕ profile of the barrel is segmented as a regular polyhedron by a fixed\nnumber of global ϕ segments to allow for flat surfaces upon which a precision timing\nlayer may later be instrumented. All crystal towers are initially oriented as projective\ntrapezoids with respect to the interaction point; to mitigate projective cracks, the\ndetector is then split into two halves and a displacement in z is applied with the\naddition of non-projective spacer rings as shown in Fig. 19 and Fig. 21. Each crystal\ntower has nominal front face dimensions of 10 × 10 mm2 and is composed of two\nlongitudinal segments of 6 X0 (front, E1) and 16 X0 (rear, E2) for a total depth of\n22 X0.\nThe barrel has a z-length of 4.8 m and the center point of the crystal front faces are\nlocated at a radius of 2250 mm. The endcaps connect continuously with the barrel and\nare therefore also segmented in ϕ with an outermost rear crystal radius of ≈2386 mm\nand nominal pseudorapidity of 2.60 designed to coincide with the Silicon Wrapper\nendcap disks, corresponding to an inner radius of ≈360 mm. The number of crystals\nper global ϕ segment in the endcap is adjusted with the radius as shown in Fig. 20 to\nmaintain the nominal crystal face dimensions.\nThe geometry construction routine in the Key4hep framework [24] is configured\nto generate the individual crystal volumes dynamically from the input dimensions as\nshown in Tables 4 and 5, therefore allowing the crystal dimensions to be perturbed\neasily for optimization studies. The total count of crystal towers and readout channels\nare reported in Table 6. More details on the differentiable geometry and simulation\nimplementation in the Key4hep framework are provided in [25].\n24\n\n\nFigure 19: 3D cutout view of the dual-readout crystal calorimeter showing (dark\nblue) front crystal segments and (light blue) rear crystal segments. A nominal crystal\nfront face size of 50 × 50 mm2 is used for visibility. Three non-projective spacer rings,\nused to mitigate projective cracks by displacing either half of the detector in z, are\nshown in purple (front segments) and yellow (rear segments).\nThe two-layer segmentation represents a tool for particle identification based on\nthe longitudinal energy deposit pattern with the front segment measuring the e.m.\nshower before it reaches its maximum lateral development thus effectively reducing the\nMoli`ere radius for separation of neighboring e.m. showers. At the same time, limiting\nthe segmentation to two layers allows for no dead material inside the detector volume\nand maintains the calorimeter to be as homogeneous as possible in proximity to the\nshower maximum, while simplifying the signal readout and integration aspects.\nTable 4: Input parameters for parameterized geometry construction.\nDescription\nVariable Name\nValue\nHalf Z-extent of the barrel\nZB\n2.40 m\nInner radius of the barrel\nRinner\n2.25 m\nGlobal number of phi segments\nNΦ\n128\nNominal square face width of the front crystals\nCfw\n10 mm\nFront crystal length\nFdz\n50 mm\nRear crystal length\nRdz\n150 mm\nNumber of projective spacer rings\nNProj\n3\nSiPM module thickness\nSth\n0.5 mm\n25\n\n\nFigure 20: (left) Endcap view of the crystal calorimeter showing the polyhedral struc-\nture. (right) Corner view of the barrel-endcap junction showing the varying number\nof crystals as a function of radius to maintain the nominal crystal face dimensions.\nFigure 21: View of a global ϕ slice of the crystal calorimeter showing projective\nfront and rear electromagnetic segments (E1, E2) displaced in z by non-projective\nsegments (yellow, purple) to mitigate projective gaps. A nominal crystal front face\nsize of 50 × 50 mm2 is used in this image for visibility.\nThe light is read out from the crystals using Silicon PhotoMultipliers (SiPMs)\nwhich are located on the front face of the front crystal segment (E1) and at the rear face\nof the rear segment (E2), where the respective front-end boards, cooling system and\n26\n\n\nTable 5: Secondary parameters calculated from input parameters.\nDescription\nVariable Name\nFormula\nAngular size of a single phi segment\ndΦ\n2π/ NΦ\nAngular size of barrel region\nΘB\natan(ZB/Rinner)\nAngular size of endcap region\nΘE\natan(Rinner/ZB)\nNumber of barrel segments in θ\nNθB\nfloor(2 ZB/Cfw)\nNumber of endcap segments in θ\nNθE\nfloor(Rinner/Cfw)\nAngular size of a single barrel segment in θ\ndθB\n(π −2 ΘE)/NθB\nAngular size of a single endcap segment in θ\ndθE\nΘE/NθE\nNumber of barrel segments in ϕ in a single phi segment\nNϕB\nfloor(2πRinner/(NΦCfw))\nNumber of endcap segments in ϕ in a single phi segment∗\nNϕ∗\nE\nfloor(2πR∗\ninner/(NΦCfw))\nAngular size of barrel segments in ϕ\ndϕB\ndΦ/NϕB\nAngular size of endcap segments in ϕ\ndϕ∗\nE\ndΦ/Nϕ∗\nE\nTable 6: Final crystal/readout counts and endcap dimensions from the parameterized\ngeometry construction using input values from Table 4.\nQuantity\nValue\nNumber of total barrel crystals\n1,360,128\nNumber of barrel front crystal readout channels (1 SiPM per crystal)\n680,064\nNumber of barrel rear crystal readout channels (2 SiPMs per crystal)\n1,360,128\nNumber of total endcap crystals\n251,136\nNumber of endcap front crystal readout channels (1 SiPM per crystal)\n125,568\nNumber of endcap rear crystal readout channels (2 SiPMs per crystal)\n251,136\nEndcap innermost radius (center point of innermost front crystal face)\n360.2 mm\nEndcap outermost radius (center point of outermost rear crystal face)\n2386.8 mm\nEndcap maximum pseudorapidity\n2.595\nother services will also be located. One SiPM (S1) with active area of about 6×6 mm2\nis glued on the front crystal segmented and two SiPMs (S2 and C2) of the same size\nare glued to the rear crystal as shown in Fig. 22. The protective window of one of the\ntwo rear SiPMs is replaced with a thin optical filter (thickness ∼0.1 mm) designed\nto filter out optical photons with wavelength around the scintillation maximum while\nletting pass other optical photons originating from Cherenkov radiation. In this way\na dual readout of the light, i.e. a scintillating (S) signal and a Cherenkov (C) signal,\nis performed on the rear crystal, which is then used in energy corrections for early\nshowering hadrons. It was demonstrated elsewhere [20] that the dual-readout in the\nfront crystal segment is not required given the negligible probability for hadrons to\nstart showering in the first 6 X0 (i.e. about 0.25λI).\nThe baseline crystal choice consists of lead tungstate crystals, PbWO4, which have\na long history in previous calorimeters at high energy physics colliders [26] due to their\nexcellent calorimetric properties (mainly a small Moliere radius, RM, of 2.0 cm and\na short radiation length, X0, of 0.89 cm). Other crystal candidates under study are\nBGO and BSO crystals which, given their higher light output, slower decay time and\n27\n\n\nFigure 22: Simulated EM shower display from a 10 GeV electron em shower (left)\nand schematic drawing of a segmented crystal calorimeter prototype cell and module\nwith SiPM based dual-readout (right).\nTable 7: Properties of scintillating crystal can-\ndidates.\nPWO\nBGO\nBSO\nDensity [g/cm3]\n8.3\n7.1\n6.8\nRM [cm]\n2.00\n2.23\n2.33\nX0 [cm]\n0.89\n1.12\n1.15\nλI [cm]\n20.7\n22.7\n23.4\nRefractive index at 420 nm\n2.20\n2.15\n2.68\nLight yield [ph/MeV]\n130\n7500\n1500\nScintillation decay time [ns]\n10\n300\n100\nEmission peak [nm]\n420\n480\n470\ndifferent emission peak of scintillation light can offer a complementary approach for\nthe development of such a calorimeter. More details on the key parameters of these\ncrystals are given in Table 7.\nTwo complementary strategies for implementation of dual-readout are being\nexplored:\n• The former which is optimal for PWO crystals is mostly wavelength-based, and\nconsists in filtering out at least 99% of the scintillation photons with a high-pass\nfilter with cut-off wavelength around 580 nm as shown in the left plot of Fig.23.\nBased on preliminary calculations and crystal measurements it is expected that\nabout 50 photoelectrons from Cherenkov radiation are detected per GeV of de-\nposited energy with a contamination from scintillation photons smaller than 15%\n[20]. In this way two separate signals proportional to scintillation and Cherenkov\nlight are measured integrating the charge of two independent SiPMs.\n• The latter method also leverages the difference in the emission time profile be-\ntween scintillation and Cherenkov photons and is more suited for BGO and BSO\ncrystals. For these crystals, in fact, the number of scintillation photons is about\n60 and 10 times higher than in PWO, respectively, and more difficult to filter ef-\nficiently given their emission being more shifted to 50 nm longer wavelengths. On\nthe other hand, the scintillation decay time constants of BGO and BSO crystals\n28\n\n\nFigure 23: Strategy for implementation of dual-readout in PWO crystals (left), which\nconsists of filtering out scintillation photons based on wavelength discrimination, and\nin BGO crystals (right) which consists in isolating Cherenkov light based on the time\ndistrubution of optical photons (prompt for Cherenkov and with a long decay for\nscintillation).\nare respectively of about 300 and 100 ns (thus a factor 10 slower than PWO) mak-\ning it possible to distinguish them from the Cherenkov photons which are instead\nemitted promptly with the e.m shower development. An example of measuring\nthe S and C signal simultaneously from the same SiPM based on pulse shape\nanalysis is shown in the right plot of Fig. 23. Preliminary calculations and test\nbeam results [27] show that the target light yield > 50 phe/GeV from Cherenkov\nradiation can be achieved.\nSiPM technology is in continuous evolution with a trend to develop devices with\nlarger active area, smaller cell size and in particular with enhanced sensitivity in the\nnear infrared region (> 780 nm) driven by LIDAR applications [28]. To achieve a\nlight yield of 50 phe/GeV with Cherenkov photons with wavelength in the range 550-\n900 nm an effective PDE (weighed over this range) of 15% is required and can be\nachieved with state-of-the-art SiPMs such as the S13360-6050 HPK model [29].\nFor what concerns the detection of scintillation light the main challenge is the\ndynamic range intrinsically linked to the total number of cells of the SiPM. To be able\nto measure energy deposits from minimum ionizing particles (MIPs) up to 200 GeV\nelectrons (which can deposit about half of their energy in a single crystal rear segment),\nassuming a light output of 2000 phe/GeV it is required to detect without saturation\nup to 2×105 photoelectrons, thus requiring SiPMs with a number of cells at least two\ntimes larger. This is within reach using 6 × 6 mm2 active area SiPMs with 10 µm cell\nsize that feature 3.6 × 105 cells (e.g. model S14160-6010 from Hamamatsu [29]).\nThe filtering of scintillation light can be achieved for instance in PWO with high-\npass filters with a cut-off wavelength around 580 nm as shown in Fig. 23 (left).\nAbsorptive filters of this kind are available off-the-shelf (e.g. from Kodak or Everix\ncompanies) with a variety of transmittance spectra and can feature a thickness be-\ntween 100 and 300 µm which makes them particularly suitable for integration in front\n29\n\n\nof the SiPM window or even as a replacement of the usual silicon/epoxy layer used for\nprotection of the silicon active area. Filters of this kind which can filter more than 99%\nof the scintillation light have been identified (e.g. Kodak 24 and Kodak 25 Wratten\nfilters [30]).\nSimilarly in the case of BGO a notch-type filter can be used to select longer wave-\nlengths beyond 650 nm and also NUV light (< 400 nm), taking advantage of the fact\nthat the emission spectrum of BGO is offset farther from the absorption cutoff. Filters\nwith these characteristics, such as the Schott UG11 [31] are readily available. For large\nscale production filters can be further optimized to enhance the overall light collection\nand S/C separation.\n30\n\n\n8 Detector Solenoid\nBoth the CLD [32] and IDEA particle detector concepts utilize a 2 T solenoidal\nsuperconducting magnet, based on the reliable and well-established technology of alu-\nminum stabilized NbTi Rutherford cables, satisfying all physics requirements for the\ncollider operating points from the Z pole to the t¯t center-of-mass collision energy. The\nelectromagnetic design of the superconducting coil for the IDEA detector, originally\npositioned in front of a single-layer dual read-out fiber calorimeter, has been optimized\nto minimize the material along the particle trajectories. However, the recent conceptual\ndesign, implementing two separate dual readout calorimeters (a crystal calorimeter for\nthe electromagnetic shower and a fiber calorimeter for the hadronic shower) increases\nthe internal radius of the superconducting coil, now placed between the two calorime-\nters, see Fig. 3, reducing the constraint on the solenoid transparency. In this context,\na new preliminary design for a high-temperature superconducting (HTS) solenoid de-\nveloped by the INFN LASA [33] superconducting magnet group is able to provide up\nto a 3 T central magnetic field operating at T > 20 K. We summarize R&D on the\nelectromagnetic design, the mechanical stability, and magnet protection, while dis-\ncussing the main challenges of the implementation of this technology compared to a\nconventional low-temperature superconductor (LTS) based approach.\n8.1 HTS Solenoid Design\nThe use of high-temperature superconductors for next-generation particle detec-\ntors has the primary advantage of operating at a temperature of 20 K, gaining a factor\nfive in operational cost reduction of the cryogenic plant compared to the classical\n4 K operation (and a further factor two, by operation at 40-50 K, might be consid-\nered). Moreover, the use of HTS can reduce conductor volume by leveraging their\nhigher operating current density compared to conventional low-temperature supercon-\nductors, which minimizes uninstrumented material and relaxes mechanical support\nrequirements for the entire solenoid. High-temperature superconductors currently re-\nmain more expensive than low-temperature superconducting cables, however, in recent\nyears the development and manufacture of many thousands of high-quality HTS con-\nductors by various vendors all over the world, driven by fusion R&D, has substantially\ndecreased its cost. At present, the “classical” aluminum-stabilized Nb-Ti Rutherford\ncable technology via co-extrusion, a widely exploited technology also by the INFN\nteams [34–39], is no longer commercially available with only limited efforts underway\nin research laboratories to revive this expertise. The use of Nb-Ti relies on soft sol-\ndering between the superconductor and a pure aluminum matrix, a technology that\nis also well-suited for HTS tapes. R&D programs will be needed to implement either\nof these types of conductors for next-generation particle detectors, and we think that\ngiven the intrinsic advantage of HTS, it is worthwhile to make an effort in that di-\nrection. To dimension the superconducting magnet volume, an analytical formula for\nthe maximum stress on thin cylinders under uniform pressure can be used. The rela-\ntionship between the coil thickness and the average hoop stress on the conductor is a\nfunction of the central magnetic field value of the solenoid and the internal radius of\n31\n\n\nthe winding, see Equation 1:\ntcoil =\n\u0012Rin\nσh\n\u0013 \u0012 B2\nz\n2µ0\n\u0013\nwith Bz (z = 0) = µ0\n2\nNI\nq\nR2\nin +\n\u0000 L\n2\n\u00012\n(1)\nA maximum value of hoop stress σh = 100 MPa is considered in this analysis, with\nthe target central field of 3 T, resulting in a minimum coil thickness of 89.5 mm. The\nelectromagnetic design of the HTS solenoid is presently optimized to produce a 3\nT central field leading to improved particle tracking resolution of the detector at\nparticle collision energies above the Z resonance while being able to provide a 2 T\nsolenoidal magnetic field within the requirements on field quality and superconducting\ncoil stability.\nUsing the equation for the magnetic field produced by a finite length solenoid\nwith L = 5.3 m, Rin = 2.5 m, to generate a magnetic field value of Bz = 3 T, a\ntotal of NI = 17.4 MAturns or, equivalently, an average engineering current density\nof Jeng = 37 A/mm2 (Jeng = 25 A/mm2 in case of Bz = 2 T) is required, see Fig.\n24. Using these scaling laws, a 2D electromagnetic axi-symmetrical FEM model for\nFigure 24: Scaling law of the solenoidal field (right) and current density (left) for\na finite length solenoid assuming a thin solenoid approximation. Values of maximum\nhoop stress on the solenoid conductor under Lorentz forces are reported (110 MPa\nbeing the present reference value).\na 3 T solenoid has been reconstructed in Comsol multi-physics [40] considering also\nthe effect of the iron detector yoke and the ferromagnetic (considering a 60% filling\nfactor of iron in the total volume, see Section 9) dual read-out fiber calorimeter. The\nfield map of the superconducting coil and the shape of the produced magnetic field\nover the detector volume without considering the presence of the shielding solenoids\nand final focusing quadrupole of the interaction region (IR) are shown in Fig. 25. The\ngeometrical parameter of the cable considered for the electromagnetic design and the\nsuperconducting coil main features are reported in Table 8.\nA classical approach using “U-shaped” channel, see Fig. 26 (left), made of alu-\nminum alloy Al-2.0%Ni is presently considered for the cable stabilizer offering high\nmechanical strength (E = 70 [GPa], yield strength = 170 [MPa] ) compared to other\n32\n\n\nFigure 25: Magnetic Field maps produced by the 3 T HTS superconducting solenoid.\nPeak magnetic field at nominal current on the superconducting coil (left) and cross-\nsection view of the particle detector (right).\nTable 8: Solenoid and Superconducting Cable Main Parameters\nBore field\n3\n[T]\n# of tapes in a cable\n7\nNominal current\n8168\n[A]\nCable thickness\n11.47\n[mm]\nCoil thickness\n91.7\n[mm]\nCable height\n24.0\n[mm]\nNumber of turns\n220×8\nStabilizer thickness\n9\n[mm]\nInductance\n12.7\n[H]\nStabilizer edge height\n5\n[mm]\nStored energy\n412\n[MJ]\nInsulation thickness\n1\n[mm]\nHeight\nThickness\nHTS Tapes\nStabilizer\nInsulation\nFigure 26: Cable design considered for the superconducting coil with the 7 HTS tapes\nhighlighted in red on the upper part of the cable. On the right: map of the operating\npoint of half solenoid compared to the cable critical current at T = 20 K, tape current\ndensity as a function of the field orientation and angle of the field compared to the\nbroad side of the tape.\naluminum alloys and high thermal stability during a quench event with a still accept-\nable value of RRR (Residual-Resistivity-Ratio) = 170. The number of superconducting\n12 mm tapes within the cable has been optimized to maximize the operating mar-\ngin at the peak field on the coil volume. A maximum of I/Ic = 51.5% at the edge of\nthe solenoid has been obtained from the electromagnetic optimization of the solenoid\ndimension with most of the coil volume operating below 25% of the critical current\n(Ic) of the superconducting tape, see Fig. 26 (right). The electromagnetic design can\n33\n\n\nbe further optimized achieving more uniform temperature margin operation, allow-\ning for significant reductions in HTS conductor usage in the central region, leading\nto a substantial cost decrease in the total solenoid assembly. The calculated margin\nvalues account for the angular dependence of the tape’s critical current, based on mea-\nsured data from samples manufactured by Faraday Factory [41], considering the field’s\norientation relative to the tape’s broad surface aligned to the magnet rotational axis.\n8.2 Mechanical and Thermal Stability\nThe cable geometry and the material fractions have been optimized to achieve\nhigh thermal stability of the superconducting solenoid in case of a quench event. To\nevaluate the enthalpy margin of the superconducting coil, the electromagnetic stored\nenergy density of 19.12 kJ/kg can be assumed to dissipate uniformly over the entire\nwinding volume obtaining a safe maximum temperature value equal to 122 K. Instead,\nconventional detection and discharge magnet protection schemes must be considered\nto protect the magnet during the quench development in the case of localized en-\nergy deposition. Depending on the aluminum alloy considered as stabilizer material,\na maximum hot spot temperature of around 160 K is foreseen during a quench event\nassuming a conservative 10 s quench detection time to activate the protection scheme\nand a maximum 2 kV peak voltage to ground during the magnet discharge. An ad-\nditional detailed quench propagation simulation at the cable geometry level will be\nperformed to fully characterize the magnet protection technology and method required\nto avoid superconductor degradation and magnet safety. Even if the maximum hot\nspot temperature obtained is acceptable and the peak voltage to ground is within the\nadmissible voltage range, an early detection scheme must be studied to avoid temper-\nature rise in the winding. In addition, to avoid degradation of the superconducting\nHTS Cables\nRadial Layers\nSupport Shell\nFigure 27: Maximum average hoop stress and displacement amplitude on the con-\nductor volume under e.m. forces at nominal current of the magnet energization (left).\nSketch of conductor assembly with representation of the restraining cylinder outside\nof coil volume in the radial direction (right).\nlayers in the cable, 2D axisymmetric simulations considering, as a first step, only the\ncontribution of the e.m. forces acting on the coil volume, have been performed evaluat-\ning the maximum stress on the conductor. Using equivalent anisotropic homogenized\n34\n\n\nmaterial properties (see [42] for the HTS tape properties) and an additional 25 mm\nthick aluminum 5083 alloy restraining cylinder (see Fig. 27), already considered as\nsupporting structure in existing solenoids for particle detectors [43, 44], a maximum\ntensile hoop stress on the coil of 97 MPa and longitudinal strain of 0.18% on the con-\nductor are obtained. Even if these values are within the material performance limits\n(maximum yield stress of 170 MPa at 4 K for the Al2.0%wtNi alloy and 0.3% of maxi-\nmum strain for the high-temperature superconducting layer) finer detailed model will\nbe used to address the overall mechanical performance of the coil volume during all op-\nerating conditions (magnet assembly, cryogenic cool-down, and magnet energization).\nConsidering the total thickness of the cold mass equals 116.7 mm and the normalized\nradiation lengths for each material reported in Table 9,the thickness of the cold mass,\nTable 9: Coil Transparency\nMaterial\nThickness\nX/X0\nHTS tape\n4.0 [mm]\n0.296\nAl2.0%wtNi\n72 [mm]\n0.862\nInsulation\n16 [mm]\n0.056\nShell\n25 [mm]\n0.278\nTOTAL\n117.3 [mm]\n1.492\nequivalent to X/X0= 1.492, is within the superconducting coil design constraints and\ndoes not affect the detector energy resolution. Preliminary mechanical structure and\ncryostat dimensioning evaluations are under development at LASA where research and\ndevelopment activities will be carried out to enhance the technological readiness level\n(TRL) of HTS superconducting magnets supporting sustainable solutions for future\ncollider projects.\n35\n\n\n9 Hadronic calorimeter\nThe proposed hadronic section for the IDEA calorimeter is based on a fiber-\nsampling dual-readout calorimeter [45], consisting of alternate rows of scintillating\nand clear (Cherenkov) fibers inserted in a metal absorber. In the initial design of\nthe IDEA detector, the full calorimetric system was built with a single, compact and\nunsegmented, fiber-sampling calorimeter. Only recently the electromagnetic crystal\nsection has been added as baseline option and included in the full simulation. As a\nconsequence, the present understanding of the hadronic calorimeter performance is\nmainly based on a standalone fiber-sampling solution. This standalone fiber-sampling\ndesign will be validated in detail in simulation and test beam studies since it will pro-\nvide the reference benchmarks for hadronic shower measurements which should not\nbe degraded by the presence of the electromagnetic crystal section.\nThe hadronic energy resolution was estimated, following a full simulation of\nthe IDEA (standalone) fiber-sampling calorimeter [46], at about 30%/\n√\nE, with a\nsmall constant term. The expected achievable separation for the W/Z/H →jj\npeaks is shown in Fig. 28 for an ideal fiber-sampling calorimeter. Simulation studies\nshow that this detector can also provide excellent standalone particle-identification\ncapabilities [47].\nThe geometrical description of the present implementation is provided in\nSection 9.1. Here it is useful to underline that longitudinally unsegmented scintillating\nand clear fibers are inserted in metal capillary tubes oriented with a quasi-pointing\ngeometry towards the interaction vertex. This way, they can provide a highly granular\nshower sampling in the transverse direction, i.e. an excellent 2-D imaging capability.\nLongitudinal shower information could only be accessible through signal time-of-arrival\nmeasurements as discussed in Section 9.5. The sampling granularity is presently de-\nsigned for a standalone calorimeter (without crystals in front), i.e. it is driven by the\nrequirement to allow the separation of the showers from the two γ of a π0 decay.\nThis granularity needs to be differently tuned given the EM crystal section in front.\nHowever, a highly granular sampling can provide very powerful input to deep neural\nnetworks and particle-flow algorithms.\nBoth iron and brass tubes are considered for the absorber material, where iron\nhas the advantage of providing most flux return of the magnetic field and is therefore\nour current baseline. Small prototypes, capable of containing electromagnetic showers,\nwere built With both materials and tested with beams.\n9.1 Hadronic calorimeter design\nThe IDEA capillary tube dual-readout calorimeter consists of optical fibers inserted\nin metallic tubes arranged to projective towers. The capillary-tube technology was\npioneered in recent years by a consortium of European Institutes led by INFN and\nrepresents the chosen solution to evolve from a conceptual design to a technical design.\nIn this configuration the tube material acts as the absorber component; currently, two\nmaterials are considered: brass and iron. The tubes are stacked together in a hexagonal\npattern to form towers, which are trapezoids pointing to the interaction point. This\ngeometry was implemented recently in the new IDEA full simulation, for both the\n36\n\n\nFigure 28: Reconstructed invariant mass distributions for W/Z/H →jj fully-\nsimulated events in a highly granular DR fiber-sampling calorimeter [46].\nbarrel and the endcap regions, implemented as DD4hep sub-detectors. An image of\nthe barrel and endcap geometries can be seen in Figure 29 and Figure 30, respectively.\nThe barrel and endcap geometries are implemented as two separate sub-detectors,\nwhich can be simulated independently from one another. In the baseline design, the\ntransition from one to the other is assumed to occur at a 45◦angle with respect to\nthe beam axis. The inner radius (lowest z coordinate) of the barrel (endcap) is 2.8 m,\nand the tower length is 1.8 m. The tube outer radius is 1 mm and the fiber radius is\n0.5 mm. The current geometry implementation is modular and scales according to such\nparameters. The endcap calorimeter is designed to form a 90◦angle with the barrel\none. Due to the symmetry in ϕ, the barrel and endcap are both created by multiple\nplacings of one ”stave”. Each stave is populated with towers in the θ direction, where\neach tower is different, apart from a forward-backward symmetry. In total, 72 ϕ-staves\nare considered and this defines the tower granularity in the ϕ direction. Inside a barrel\nstave, 45 towers are positioned along the θ direction for the barrel calorimeter. The\nendcap calorimeter uses 35 towers in the θ direction in each stave. In total, around\n80 million tubes are placed in this geometry, roughly divided into 60 million for the\nbarrel and 20 million for the two endcaps.\n9.2 Mechanical construction\nOver the past two decades [48], DR prototypes have been developed by the\nDREAM/RD52 Collaboration using scintillating and clear fibers embedded in an ab-\nsorber structure, oriented approximately parallel to the direction of incoming particles.\nThese two fiber types were read out separately using either PMTs or SiPMs.\nThe fibers typically had a 1-mm diameter. For Cherenkov signal detection, the\nfiber cores were made of fused silica or PolyMethyl MethAcrylate (PMMA), with a\nfluorinated polymer single cladding. Several vendors manufacture such fibers, includ-\ning Polymicro (FSHA-type fibers), Toray (Raytela PJR-FB750), Mitsubishi (ESKA\n37\n\n\nFigure 29: Barrel region of the dual-readout calorimeter, with a few towers taken\nout for visualization purposes (left). Backside of one tower with the assembly of tubes\nand the support structure around them, forming one tower (right).\nFigure 30: Endcap region of the dual-readout calorimeter, considering 35 η-towers\nand 36-rotations around the beam pipe. The trapezoidal structure (a ϕ-slice) contain-\ning the η-towers is displayed in light blue (left). A single ϕ-slice populated with 35\nη-towers (right).\nSK40-1500), and Kuraray (Clear-PS). Scintillating fibers, on the other hand, featured\na polystyrene core with PMMA single or double cladding, emitting in the blue region\n38\n\n\nName\nValue\nInner Radius\n2.8 m\nOuter Radius\n4.6 m\nTower ∆θ (barrel/endcap)\n1◦/1.125◦\nTower ∆ϕ\n5◦\nBarrel Support Thickness\n1 mm\nTube Radius\n1 mm\nFibre Radius\n0.5 mm\nTable 10: Geometry parameters for\nthe dual-readout calorimeter.\n(wavelength 400–450 nm, depending on the manufacturer), with examples including\nBCF-12 from Saint-Gobain, SCSF-81J and SCSF-78 from Kuraray. Key performance\nparameters include light yield, trapping efficiency, and optical attenuation. While\nscintillating fibers generally provide sufficient light yield, lower yield of Cherenkov\nradiation presents a more challenging optimization. Emerging fiber and waveguide\nstructures with larger numerical apertures and higher refractive indices offer advan-\ntages for Cherenkov light production. For example, a numerical aperture of 0.72 is\nachievable using a multi-clad structure around a polystyrene core, leading to a light\ntrapping efficiency of 5.5%. Although, it is still in an R&D stage, even higher trap-\nping efficiencies are possible with air-clad fused-silica core fibers where the numerical\naperture approaches 0.9.\nThe absorber structure design has evolved alongside increasingly capable proto-\ntypes. The fiber positioning within the absorber affects the stochastic term via the\nsampling fraction and frequency, while the precision of fiber placement contributes to\nthe constant term. The choice of absorber material significantly influences the produc-\ntion rate of secondary particles in hadronic showers, impacting signal generation and\ndefining transverse and longitudinal containment dimensions. Additionally, the ab-\nsorber must provide adequate structural integrity for the multi-ton-scale calorimeter\nin the IDEA detector.\nCurrently, two techniques are under investigation, both promising for full-scale\nexperiment construction. The first, developed under the INFN-approved HiDRa R&D\nproject, employs capillary tubes. The second, advanced by a consortium of Korean\ninstitutes, utilizes finned plates produced by skiving, where fibers and copper rods are\nembedded to form a granular structure. At present the former looks able to provide\nbetter mechanical precision, while the latter provides a simpler and faster construction\ntechnique. 3D-printing was also investigated, but it is still not suitable due to cost and\nmanufacturing time.\n9.2.1 Capillary Tubes Technique\nIn the past years, we built a prototype for a dual-readout calorimeter based on the\ncapillary tube technique as the absorber structure. The construction of a prototype,\n10 × 10 cm2 in cross section and 1 m long, is described in a technical paper [49], and its\nperformance when exposed to a beam of positrons is described in Ref. [50], and further\n39\n\n\nFigure 31: Left: The handling tool with one layer of tubes already engaged and ready\nfor glue distribution. Right: The high precision assembly tool.\ndetailed in Section 9.4. Based on the experience gained with this prototype, we decided\nto base the construction technique for the HiDRa calorimeter on the capillary tubes.\nStainless steel capillary tubes for the full-hadronic containment prototypes are 2.5 m\nlong, with 2 ± 0.03 mm outer diameter and 1.1 +0.1\n−0.0 mm inner diameter. Mechanical\ntolerances on the diameters, length (±1 mm ), straightness1 and quality of both ends\nwere set and the producer was able to provide capillary tubes within the specification\nat an affordable price.\nThanks to the high quality of the capillary tubes, the tooling for the module\nassembly was simplified, with respect to what was used for the EM-size prototype. The\nmodule is built by gluing layers of capillary tubes in a reference tool machined at high\nprecision, as shown in Fig. 31. The tubes are prepared and aligned in the reference\ntool. A handling tool, suspended from a crane using chains attached to rotating pins,\nallows for engaging the tube layer through a vacuum system and moving it for glue\ndistribution and piling up. This technique has proved to be fast and to guarantee both\nexcellent precision and good reproducibility.\nOnce the module is built, the fibers are manually inserted in each tube, in alter-\nnate rows of scintillating and clear fibers. At present, the construction rate is time\nconsuming, and needs to be made more efficient for the construction of a full size\ncalorimeter.\n1tube should be able to rotate smoothly on a flat surface\n40\n\n\n9.2.2 Alternative mechanical options: Skived Fin Heat Sink, 3D\nmetal printing, and Drilling Techniques\nIn the RD52 project multiple methods were explored to form the metal absorber.\nAfter extensive mechanical R&D, the initial solution was the machining of grooves\nin the cooper sheets. This technique was used to successfully build two modules. For\nthe IDEA calorimetry system new fabrication options have been considered on top\nof the RD52 studies, in addition to the capillary tube technique described above. A\nconsortium of Korean institutes has studied various copper forming options such as the\nskived fin heat sink (SFHS) manufacturing and 3D metal printing. Advanced drilling\ntechniques are also being evaluated for the construction of the 4π detector.\nThe SFHS process is a precision copper-forming method to create fine structures\nfor the DR calorimeter. Thin, closely spaced fins are sliced and bent from a solid\ncopper block without any bonding and soldering. This technique ensures excellent\nmechanical stability and mass-production manufacturing capability. The skived copper\nfins provide precise channels for the placement of optical fibers and are closed by\nadding rectangular-shaped copper plates. The Korean consortium has built 50 cm\nlong prototype modules and a large (30x30x250 cm3) prototype detector used in 2023\n(CERN PS T9) and 2024 test-beams (CERN SPS H8), respectively [51].\n3D metal printing is an advanced copper-forming technique that enables the fabri-\ncation of complex geometries with high precision. Using methods such as laser power\nbed fusion or binder jetting, pure copper can be printed layer by layer, allowing for\nintricate structures that would be difficult to achieve with traditional machining. A\n50 cm long prototype module was built in 2022 and tested in 2023 [52].\nEach manufacturing option (shown in Fig. 32) was also evaluated by measuring\nquantities such as air volume, radiation/nuclear interaction lengths, and sampling\nfraction. In particular the 3D metal printing provides excellent performance achieving\nsmaller air volume and λI. However it is the most expensive solution at the moment,\ntherefore more investigation into manufacturing options is warranted. Drilling is also\nbeing considered as an alternative and more cost effective option to replace the 3D\nmetal printing. The drilling technique was also observed to reduce the air volume up\nto 3.6%, reducing λI to 22.26 cm.\nTable 11: Parameters of alternative mechanical options\nMethod\nCu (%)\nfibers (%)\nAir (%)\nX0 (cm)\nλI (cm)\nSampling fraction (%)\nIdeal\n65.1\n34.9\n0\n2.16\n21.16\nS(4.02) C(4.54)\nMachining\n54.1\n32.7\n13.2\n2.59\n25.10\nS(4.48) C(5.07)\nSFHS\n48.1\n33.6\n18.3\n2.91\n27.77\nS(5.10) C(5.77)\n3D printing / drilling\n57.8\n34.9\n7.3\n2.43\n23.54\nS(4.48) C(5.06)\n9.3 Signal readout and feature extraction\nThe light produced inside the calorimeter is transported via optical fibers to light\nsensors located on the back side of the absorber material, simplifying the services\n41\n\n\nFigure 32: DR prototypes using alternative mechanical options: 3D metal printing\n(left) and skiving fin heat sink (right). The two bottom modules on the right figure\nare based on the groove machining technique.\nrequired for the operation of the whole detector. A series of prototypes previously\nequipped with PMTs were replaced by MicroChannel Plate PhotoMultiplier Tubes\n(MCP-PMTs) or solid-state light detectors (SiPM). The latter are of great interest\nbecause they have single-photon sensitivity, high Photon Detection Efficiency (PDE),\nexcellent timing resolution with magnetic field immunity and benefit from the fast\nevolution of silicon technology and investments by multiple companies to achieve high-\nquality mass production.\nThe use of SiPMs in fiber DR calorimetry also offers the possibility to sample the\nlateral shower profile with high granularity, improving particle ID performance and\nthe identification of complex final states containing non-isolated objects (each SiPM\nis coupled to a single fiber). R&D is ongoing in order to exploit the time profile of\ndeveloping showers as additional information, providing an effective 3D segmentation\nas described in Section 9.5.\nAn extensive R&D program is being carried out within the collaboration with the\naim of qualifying the different strategies in beam tests. In this phase, different readout\narchitectures and light sensors are used to balance complexity with the possibility to\nstudy the calorimetric performance and calibration techniques. The results are then\nused to fine-tune Monte Carlo simulations and better constrain requirements for the\nlight sensors and the readout scheme. The main R&D programs are briefly discussed\nin next subsection, along with more prospective strategies that are now at an early\nstage but are in line with the timeline of the physics programs.\n42\n\n\nFigure 33: The schematic view of HiDRa is shown in the center, the segmentation\ninto modules and minimodules on the left and details of the mechanical integration\nof part of a highly granular minimodule on the right. The output signals from each\ngroup of 8 SiPMs are connected in parallel to feed a single readout channel.\n9.3.1 Front-end and readout electronics for hadronic prototypes\nA recent prototype was qualified on beam in 2021 and 2023 (see Section 9.4). It was\ndivided into 9 modules; the central one (highly granular) was equipped with 320 SiPMs\n(one per fiber). Among other results (see subsection 9.4), this prototype was used to\ndefine a calibration procedure and to measure the number of photoelectrons (p.e.)\nper GeV produced by the Cherenkov and scintillating light generated in the shower(\n≈60 p.e./GeV for Cherenkov and ≈280 p.e./GeV for scintillating light ([53])). These\nnumbers were used as references for the SiPM and readout electronics specification.\nA new generation of fiber DR prototype (HiDRa) is under construction to achieve\nhadronic containment and identify a true-scalable design for the central module\nequipped with SiPMs. The sensors used to equip the previous prototype were not me-\nchanically compliant with the detector since the package (2.63 × 2.1 mm2) did not fit\nin the space available in the rear part of the absorber (the tube outer diameter was\n2 mm). This requirement is even more strict because we need to avoid contamination\nbetween the scintillating and Cherenkov light collected by neighboring SiPMs. For\nthis reason, we are using SiPMs with a sensitive area of 1 × 1 mm2 and an overall\npackaging of 1.1 × 1.1 mm2, that reduces the extra space to only 100 µm. A custom\nPCB board will be equipped with 8 SiPMs with closely selected breakdown voltages\n(within 100 mV) mounted to match the spacing of the fibers (2 mm) and all SiPMs in\nthe PCB will feed the same readout channel (see Fig. 33).\nThe identified SiPM is customized by Hamamatsu to precisely fit the fiber spacing\ngeometry. In Table 12, we compare the main characteristics of the S14160-1315PS\nSiPM (sensor used in the EM-size prototype) with the two devices considered for the\nHAD-size prototype. The S16676-15(ES1) SiPM will be used for the Cherenkov signals\n(which have a much lower light yield and need a high PDE) and the S16676-10(ES1)\nfor the scintillation signals (that cover a wider dynamic range and need a lower gain\nto avoid saturation). This choice, based on light yield measurements with beam, will\nallow us to operate the sensor(s) in a linear regime over a large energy range. As shown\nin the table, by reducing the photosensitive area we have a reduction in the number\nof pixels which limits the linearity range by a factor of 2. This is not expected to be a\n43\n\n\nTable 12: Main parameters of the SiPM used for the EM-size prototype compared\nwith the SiPMs considered for the HiDRa prototype. The values are extracted from\nthe vendor’s specifications and are relative to an operating temperature T = 25◦C.\nParameter\nS14160-1315PS\nS16676-15(ES1)\nS16676-10(ES1)\nEffective photosensitive area (mm2)\n1.3 × 1.3\n1 × 1\n1 × 1\nPixel pitch (µm)\n15\n15\n10\nNumber of pixels\n7284\n3443\n7772\nRecommended operating voltage (Vop)\n+4 V\n+4 V\n+5 V\nPDE at the Vop (%)\n32\n32\n18\nDirect cross-talk at the Vop (%)\n< 1\n< 1\n< 1\nDark count rate (kHz)\n120 (360 max)\n60 (200 max)\n60 (200 max)\nGain (105)\n3.6\n3.6\n1.8\nproblem for the Cherenkov light (more than 5 times less intense than the scintillating\nlight) but it could be problematic for the scintillating light. This brought us to the\nconclusion to use SiPMs with a different microcell pitch.\nReadout electronics can use different strategies i.e. charge integration or waveform\nsampling. The implementation of the charge integration with a precise time stamp\n(O(10-100) ps) is probably easier and could satisfy most of the requirements set by\nthe dual-readout fiber calorimetry although additional information on timing and sig-\nnal shape may provide a powerful input for event reconstruction, likely improving the\nperformance of Particle Flow Algorithms (PFAs) applied to dual-readout calorime-\ntry. The highly granular module of the HiDRa prototype will be read out with the\nCITIROC 1A by Weeroc [54] integrated on front-end readout boards (FERS - A5202)\nproduced by CAEN [55]. A highly granular DR prototype (HG-DREAM) developed\nby TTU employs the DRS waveform digitizer (CAEN V1742) as well a 10-14 GS/s\nwaveform digitizer (AARDVARC) by NALU Scientific. Alternative solutions continue\nto be considered (9.3.3).\n9.3.2 Alternative front-end and readout electronics based on\nMCP-PMTs\nIn the current design, one photosensor is connected to each fiber, exploiting the\nmaximum possible granularity of the DR calorimeter and the SiPM is considered the\nbest solution. The MCP-PMT is an advanced photon detection device that combines\nthe high sensitivity of a traditional PMT with fast timing and spatial resolution.\nThe SiPMs are compact, solid-state devices with high photon detection efficiency, low\noperating voltage, and immunity to magnetic fields, however, they suffer from higher\ndark noise and limited timing resolution. In contrast, MCP-PMTs offer superior time\nresolution at picosecond scale, excellent single-photon detection capability, and lower\nnoise.\nThe Korean consortium has explored not only SiPM-based (400 channels) but also\nMCP-PMT based (128 channels) signal readouts for high granularity detector systems\nin the DR prototype used in the 2024 test-beam experiment. Figure\n34 shows the\ninstalled MCP-PMT and SiPM readout systems in the prototype [51].\n44\n\n\nFigure 34: High granularity system installed in the DR prototype that has been\ntested at CERN SPS H8 in 2024, built by Korean consortium.\nThe weaknesses of the MCP-PMTs are that they are more fragile, expensive, and\nsusceptible to magnetic fields. Such problems can be addressed by recent R&D per-\nformed by the Argonne National Laboratory (ANL) group [56] in collaboration with\nthe Korean consortium. New MCP-PMT fabrication methods led to a 10 × 10 cm2\nlarge area picosecond photosensor device. This R&D program uses 3D printed MCP\ntechnology to provide low-cost, highly-pixelated MCP-PMTs working in high radia-\ntion and magnetic field environments. The customized design will be produced and\ntested in the near future.\nA data acquisition (DAQ) readout electronics system with fast timing resolution\nis essential to reconstruct the longitudinal profile of a hadronic shower in the unseg-\nmented DR calorimeter. A customized DAQ system developed with NOTICE Korea\ndigitizes and records analog signals from the readout system using 20 DAQ boards and\na Trigger Clock Board (TCB). Each DAQ board contains 32 channels, 640 channels\nin total, and utilizes the Domino Ring Sampler 4 (DRS4) chip, developed at PSI [57],\nto digitize signals with 12-bit ADC resolution in 1024 time bins. The TCB board syn-\nchronizes all DAQ boards, allowing simultaneous signal digitization upon receiving a\ntrigger signal. It has archived under 100 ps of timing resolution on the data process-\ning with multiple channels. Further studies and upgrades will be performed in the\nfuture [58].\n9.3.3 Perspectives for readout architectures\nSingle Photon Avalanche Diodes (SPADs) are highly sensitive photodiodes capa-\nble of detecting single photons by operating beyond breakdown voltage, and SPAD\narrays (SiPMs) offer a valid alternative to PMTs. While the optimal performance is\ntypically achieved through the independent optimization of sensors and readout elec-\ntronics, CMOS technologies have recently gained ground for SPAD implementations.\nThis trend is driven by commercial applications, such as laser ranging, which have\n45\n\n\nFigure 35: Modular structure for a dSiPM in dual-readout calorimetry.\nprompted semiconductor companies to optimize CMOS technologies for SPADs. As\na result, more foundries are offering SPAD-compatible processes, which allow for im-\nproved detector performance: peak photon detection probability (PDP) nearing 50%,\ndark count rates below 1 MHz/mm2, timing jitter of a few tens of picoseconds ([59]).\nSeveral manufacturers are developing 3-D integrated SPADs designed for consumer\napplications. These technologies further improve the trade-off between fill factor and\nembedded sensor functionality, although the costs can be significant for the field of\nhigh-energy physics.\nASPIDES is a two-year INFN project, approved in 2025, which aims to develop a\nplanar detector using standard CMOS technology, naturally suited for a monolithic\nsensor in which the front-end electronics and sensing element share the same substrate.\nThe 2-D monolithic sensors will feature:\n• an all-digital output via a digital processing chain or analogue-to-digital conver-\nsion;\n• asynchronous counting over a dynamic range of three decades of the fired micro-\ncell;\n• time-of-arrival and duration measurements with a resolution better than 100 ps;\n• adjustable thresholds for noise rejection.\nThese capabilities meet the requirements of various applications, including dual-\nreadout calorimetry.\nThe fabrication process selected for the sensor implementation is based on 110 nm\nCMOS image sensor technology. The technology offers SPADs with a Dark Count Rate\n(DCR) of few hundreds of kHz/mm2, a Photon Detection Probability (PDP) close to\n50% at 450 nm [60] and a sufficient integration density to encapsulate all necessary\nfunctions in the available area without unacceptably degrading the PDE of the sen-\nsor. A simplified block diagram of the dSiPM to be developed by ASPIDES illustrates\nhow the sensing area can be subdivided into several macrocells to optimize electronic\nprocessing. In applications where detector geometry allows this, the processing elec-\ntronics will be positioned outside the sensitive area to maximize the fill factor and\nPDE. For dual-readout calorimetry, ASPIDES aims for a linear array of 8 SiPMs,\n1 × 1 mm2 each and a pitch of 2 mm (see Fig. 35). This layout allows inter-SiPM re-\ngions to accommodate processing circuits, enhancing integration without impacting\ndetection efficiency.\n46\n\n\n9.4 Test beam results\nA dual-readout calorimeter prototype using the capillary tube technique described\nin Section 9.2.1 was tested with beam in 2021 and 2023. Nine identical modules with\nsize 3.3 × 3.3 × 100 cm3 were glued together, yielding a prototype with size of about\n10 × 10 × 100 cm3. Each module was assembled by gluing together 320 100-cm long\nbrass capillary tubes, each enclosing a 100-cm long optical fiber, in alternate rows of\nscintillating and clear (Cherenkov) fibers. The effective radiation length was estimated\nto be 22.7 mm, while the Moli`ere radius was 23.8 mm.\nEach of the external eight modules was instrumented with two Hamamatsu R8900\nPMTs [61], one optically connected with the bundle of Cherenkov fibers, the other\nwith that of scintillation fibers. In the central module, each fiber was instead read out\nby an individual SiPM, as described in Section 9.3.1, connected to the commercial\nFERS system produced by CAEN [55].\nBased on the experience with the RD52 dual-readout prototypes, a set of auxiliary\ndetectors placed on the H8 beam line at the CERN SPS, were used to assess the\nquality of the beam and to identify positrons among the beam particles. Particularly\nrelevant for the results shown in this section are (moving in the direction of the beam):\na set of three gas Cherenkov counters, where the H2 pressure was set to optimize the\nseparation between π/µ and e for beam energies up to about 40 GeV; a set of three\nthin plastic scintillators used to build a particle trigger signal; a pair of delay wire\nchambers, used to select particles from the center of the beam; a preshower detector,\nformed by a 1 X0 of lead glued to a scintillator, which aided in the selection of high-\nenergy electrons. All these detectors were upstream along the beam with respect to\nthe prototype. Downstream with respect to the prototype, and behind a thick concrete\nshielding, was a plastic scintillator dedicated to the identification of muons.\nAfter a first gain-equalization step based on the SiPM multiphoton spectrum, the\nresponse from the nine modules was equalized by exposing them to a 20 GeV beam\naimed at their geometrical center: after the application of a positron selection, the\nresponse of each module was set to be equal to that of the central module. After the\nequalization step, the overall calorimeter scale was set by aiming a 20 GeV positron\nbeam to the geometrical center of the prototype front face, and imposing that the\ncalorimeter response was equal to the beam energy corrected for the detector shower\ncontainment. While doing this, a set of fine energy corrections for the external towers\nwas also estimated.\nThe calorimeter response obtained with the 2023 test beam campaign is illustrated\nin Fig. 36. The calorimeter response to positrons is linear in the range 10 −100 GeV.\nThe combined energy resolution of the Cherenkov and scintillation channels displays\na stochastic term of 15%. The constant term (1.1%) is affected by an intrinsic energy\nspread of the H8 beam line, which was estimated by the beam physicists to be of the\norder of 1%.\nThanks to the single fiber readout of the central module and the small distance\nof 2 mm between the individual fibers, a highly granular measurement of the lateral\ndevelopment of electromagnetic showers could be performed and compared to the\npredictions of Geant4 test-beam simulations. The details of the measurements are\ndiscussed in Ref. [50]. The lateral shower profile was defined as the fraction of energy\n47\n\n\n(a) Linearity of the response.\n(b) Resolution of the response.\nFigure 36: Performance of the energy measurement when exposing the fibre calorime-\nter prototype to beams of positrons of various energies.\ndeposited in a single fiber at a distance r from the shower axis, identified as the\nthe x −y barycenter of the shower. The measurement is compared to the simulation\npredictions in Fig. 37.\n0\n5\n10\n15\n20\n25\nDistance from shower axis [mm]\n3\n−\n10\n2\n−\n10\nFraction of total SiPM signal in fiber\nScintillation, 20 GeV e+ (CERN-SPS)\nCherenkov, 20 GeV e+ (CERN-SPS)\nScintillation, GEANT4.10.7.p03\nCherenkov, GEANT4.10.7.p03\nFigure 37: Lateral shower profile of positrons with an energy of 20 GeV. The black\ncircles (triangles) refer to the scintillation (Cherenkov) signal in the central prototype\nmodule. The red and blue bands correspond to the simulation predictions for the\nscintillation and Cherenkov signal, respectively.\nThe shower profile of the Cherenkov signal is wider than the one measured with\nthe scintillation light. This observation confirms those of Refs. [62] (for a different\ncalorimeter setup) and [63]. This is understood to be due to the fact that the early\n48\n\n\ncomponents of electromagnetic showers are collimated with the incoming positron di-\nrection and the Cherenkov emitted light falls outside the numerical aperture of the\nfiber. Overall, the result is a good display of the possibilities opened by a highly granu-\nlar readout of the prototype, and a proof of the excellent description of electromagnetic\nshowers in Geant4 simulations.\nDR prototype detectors built by alternative mechanical options to form fine copper\nstructures have been tested in beam experiments in 2023 at CERN PS T9 with low-\nenergy positron beams from 1 to 5 GeV, which has never been explored in previous\ntests, including those reported by RD52. The modules and DAQ systems are described\nin section 9.2.2 and 9.3.2 and experimental setups are similar to the descriptions\nabove. The calorimeter response obtained with the low-energy test beam is shown in\nFig. 38. The calorimeter response to positrons is mostly linear in the range 1−5 GeV.\nThe combined energy resolution of the Cherenkov and scintillation channels displays\na stochastic term of 15% and a constant term of 2.0%, which is similar to the higher\nenergy tests [52].\nFigure 38: Performance of the energy measurement using alternative prototypes with\nlow energy positron beams: (left) resolution and (right) linearity.\n9.5 Future R&D\nThe fiber calorimeter described here is longitudinally unsegmented. However, longi-\ntudinal segmentation can be achieved by timing the trains of Cherenkov photon pulses\ndetected by the SiPMs at the fiber ends. This approach requires fast SiPMs, high-rate\nsampling waveform digitizers, and potentially on-detector intelligence to process and\nreduce data volume. For instance, a time resolution of 200 ps corresponds to an effec-\ntive longitudinal segmentation of approximately 4 cm. Figure 39 shows the results of\na feasibility test.\nLongitudinal segmentation combined with fine transverse segmentation enables\nthe calorimeter to “image” showers, facilitating particle identification in jets through\ncorrelation with tracker information and providing access to jet substructure for iden-\ntifying boosted W, Z, H, and top quarks [64]. Incorporating time (t) as an additional\nmeasurement dimension for hadronic showers, along with neural network regression\n49\n\n\n0\n12\n4\n8\n16  (ns)\n0\n12\n4\n8\n16  (ns)\n0\n12\n4\n8\n16  (ns)\n40 cm (2 ns)\n20 cm (1 ns)\n10 cm (0.5 ns)\na)\nb)\n(ns)\n(ns)\n(ns)\n10 cm\n20 cm\n40 cm\nFigure 39: (a) The pulse doublets plotted in the left column were generated by an electron\nbeam on fused-silica fibers that differed by lengths of 40, 20, and 10 cm, but read out by the\nsame SiPM (MicroFC 3×3 mm2 with Mini-Circuit TB-409-S66+ amplifier), and digitized by\nCAEN V1742. The speed of light in fuse-silica fibers is approximately 20 cm/ns. It is clear\nthat a 20-40 cm separation between energy deposits could be identified. (b) When the energy\ndeposition was separated by 10 cm or less, however, the identification of the individual pulses\nin a train becomes possible when a convolutional neural network (CNN) algorithm is applied\nas illustrated by the bottom plot on the right column of pulse trains. The vertical axes are\nin units of ADC counts where one photon approximately corresponds to 10 counts.\ntechniques such as Graph Neural Networks (GNNs) [65], enhances energy measure-\nment accuracy [66, 67]. The development of digital SiPMs (dSiPMs), as discussed\nin Section 9.3.3, offers significantly improved timing resolution over analog SiPMs,\nunderscoring the need for continued R&D in this area.\nFurther improvements to the DR technique may be achieved by selecting clear\nfibers with different refractive indices. By using a higher index material (e.g., 1.77\nfor sapphire instead of 1.46 for fused silica), the Cherenkov threshold for protons can\nbe reduced from 350 MeV to 200 MeV, thereby capturing more abundant spallation\nprotons and improving energy resolution. Additionally, the time delay between signals\nfrom fibers with different refractive indices provides a method for determining the\nenergy deposit location within the calorimeter without requiring a reference timing\nsignal from the accelerator [68].\nAdvancements in 3-D metal printing and drilling indicate that the intricate\ncalorimeter absorber structure could be manufactured in the near future. Several pro-\ntotypes have already been produced and tested [52] and new prototype with the drilling\ntechnique will be followed up.\n50\n\n\n10 Muon system\nThe Muon detection system will follow the IDEA geometry, featuring a central\ncylindrical barrel region closed at both ends by two endcaps to ensure hermeticity\n(Figs. 40 and 41). This apparatus will consist of three or more layers of detectors cov-\nering the barrel and endcap regions, housed within the iron yoke that encloses the\nsolenoidal magnetic field. Preliminary simulation studies indicate that the multiple\nscattering of muons originating from Z0 boson decays introduces a loss of positional\naccuracy of a few millimeters upon reaching the first muon detection layer. Conversely,\nmuons decaying from long-lived particles within the calorimeter apparatus exhibit a\nsignificantly smaller loss of accuracy, of the order of hundreds of microns, at the first\ndetection layer. In addition to the effects of multiple scattering, momentum measure-\nment performance is also considered. A spatial resolution of a hundred microns is\nrequired to achieve the precision necessary for accurate momentum reconstruction of\nlong-lived particles.\nTo fulfill the required spatial resolution, the muon apparatus will utilize µ-RWELL\ndetectors [69], innovative, single-stage, and compact gaseous detectors belonging to the\nMicro-Pattern Gaseous Detector (MPGD) family. To take advantage of the industrial\nproduction capabilities of this technology, a modular design has been adopted for the\nmuon detection layers. Each basic µ-RWELL tile features an active area of 50×50 cm2\nwith a two dimensional strip readout. A strip pitch of approximately 0.4÷1.5 mm\nprovides a typical spatial resolution in the range of 100÷500 µm, which corresponds\nin 2,500÷640 readout channels per tile.\nThe choice of detector tile size, strip pitch, and strip width represents a compro-\nmise among several factors: the largest µ-RWELL detector that can be industrially\nmass-produced, the maximum input detector capacitance tolerable by the Front-End\nElectronics (FEE) to maintain an adequate signal-to-noise ratio, the spatial resolu-\ntion required by the IDEA experiment, and the costs of electronics for the readout\nchannels, which need to remain within reasonable budget constraints.\nSince the µ-RWELL technology has not yet been used to realize a full detector\nsystem, a rigorous R&D program will be undertaken in the coming years to address\nintegration issues. R&D on the µ-RWELL is performed in synergy with Working Pack-\nage 1 (WP1) of the Detector R&D Collaboration for Gaseous Detectors (DRD1) [70].\nAnother key aspect of the R&D program will be the design and development of a\ndedicated FEE system based on a custom-made ASIC.\n10.1 Technology choice and detector design\nThe µ-RWELL, Fig. 42, is a single-amplification stage resistive MPGD [69, 71–\n73], uniquely combining the advancements and innovations achieved in the MPGD\nfield over recent years. The R&D on µ-RWELL aims to enhance stability under high\nirradiation while simplifying the construction procedures in view of an easy technology\ntransfer to industry: an essential milestone for large-scale applications in fundamental\nresearch at the future colliders.\nThe detector is composed of two main components: the cathode, a simple Printed\nCircuit Board (PCB) with a thin copper layer on one side, and the µ-RWELL PCB,\n51\n\n\nFigure 40: Geant4 visualiza-\ntion of 50×50 cm2 µ-RWELL\ntiles in the muon apparatus.\nFigure 41: The barrel muon\ndetection system for the IDEA\ndetector.\nFigure 42: Layout of the µ-RWELL.\nFigure 43: Principle of operation of the\nµ-RWELL.\nFigure 44: Sketch of the Single-Resistive\nlayout.\nFigure 45: Sketch of the PEP layout.\n52\n\n\nthe core of the detector. The µ-RWELL PCB is a multi-layer circuit realized using\nstandard photo-lithography techniques. It is composed of a WELL-patterned single\ncopper-clad polyimide (Apical®) foil2 that acts as the detector amplification element;\na resistive layer, realized with a Diamond-Like-Carbon (DLC) film sputtered onto\nthe bottom side of the polyimide foil, that acts as discharge limitation stage, and a\nstandard PCB for readout purposes, segmented into strip, pixel or pad electrodes.\nBy applying a suitable voltage between the copper layer and the DLC, the WELL\nacts as a multiplication channel for the ionization produced in the drift gas gap\n(Fig.43). The charge induced on the resistive stage spreads with a time constant [74]\ndetermined by the DLC surface resistivity and the distance between the resistive layer\nand the readout plane.\nThe spark suppression mechanism, similar to that of Resistive Plate Counters\n(RPCs) [75, 76], relies on a localized voltage drop caused by the streamer-induced\ncurrent in the resistive layer, quenching the multiplication processes. This allows the\ndetector to operate at high gains (≥104) with a single amplification stage. A drawback,\ncorrelated with the Ohmic behavior of the detector, is the reduced capability to stand\nhigh particle fluxes. This effect is correlated to the average resistance faced by the\ncharge produced in the avalanche which depends on the distance between the particle\nincidence position and the detector grounding line. In a µ-RWELL, the Single-Resistive\nLayout (SRL) (Fig. 44) uses a single resistive layer with a grounding line around the\nactive area. However, for large devices, the current path to the ground can be long\nand depends on the particle’s incidence point. This issue is mitigated by introducing\na denser grounding network as shown in the new high rate PEP layout3 (Fig. 45),\nrecently introduced for the Phase II Upgrade of the Muon apparatus in the LHCb\nexperiment [77]. The PEP layout involves creating conductive grooves etched through\nthe Cu/Kapton foil to the DLC, forming a 2D high-density current evacuation grid.\nFor the IDEA muon system, with rates up to 1 kHz/cm2, PEP grooves are planned\nevery 10 cm.\nAs an alternative to the baseline solution for the muon system based on the uR-\nWELL technology, we are also considering ongoing developments based on resistive\nMicromegas [78] [79], which offer potential synergies and shared advancements.\n10.2 Layouts description and results\nIn recent years, the R&D program has focused on two main objectives: optimizing\nthe DLC resistivity and strip pitch to minimize the number of electronics channels\nwhile achieving the required spatial resolution for the muon apparatus; and devel-\noping a 2-D layout capable of efficient and stable operation. The study on DLC\nresistivity demonstrated stable and consistent performance within the resistivity range\nof 40÷80 MΩ/□. This finding relaxes any strict homogeneity requirement for DLC\nresistivity over a large-area µ-RWELL and enhances the reliability of performance\n250 µm thick polyimide covered on one side with 5 µm thick copper, similar to the GEM base material.\n3The name PEP is the acronym of the three main processes involved in the production of this layout:\nPatterning-Etching-Plating.\n53\n\n\nuniformity across such an area. At lower DLC resistivity (≤10 MΩ/□), the effi-\nciency plateau is reached at higher HV due to a slightly increased charge spread and\nthreshold-related effects.\nThe study on strip pitch from 0.4 to 1.6 mm shows that as the pitch increases,\nthe collected signal charge decreases due to geometric and threshold effects, requir-\ning higher gain for full efficiency. Additionally, the number of fired strips decreases,\nbringing spatial resolution closer to the pitch/\n√\n12 limit.\nBesides the tuning of the parameters (resistivity, strip pitch and strip width) still\nin progress, the first ideas for the two-dimensional readout of a µ-RWELL have been\ndesigned. A commonly used 2-D layout involves embedding two parallel layers of strips\nin the readout plane at a defined angle (e.g., XY or XV), as implemented in COMPASS\ntriple-GEM detectors [80]. However, this approach, which equally shares the charge\nbetween the two views, requires a high detector gain and is therefore not optimal for a\nsingle-stage amplification detector such as the the µ-RWELL, as discussed in Ref [81].\nAlternative 2-D readout designs are being explored, with three layouts currently under\nstudy:\n• two one-dimensional detectors, coupled through a common cathode. This is the\nsimplest solution as it consists of using two standard detectors. They can operate\nat the usual gas gain with the readout strips completely separated. This layout\nis a feasible option thanks to the µ-RWELL overall small thickness, due to the\ncompactness of the µ-RWELL PCB.\n• a single two-dimensional µ-RWELL, with the standard 1-D readout on the PCB\nplus a strip patterned top electrode for the second coordinate. The main advan-\ntage of this layout is that it does not require an increase of the detector gas\ngain.\n• a single two-dimensional µ-RWELL based on the capacitive-sharing anode read-\nout as described in Ref [82]. This layout offers high spatial performance with a\nsignificant reduction of electronics channels required to read out a very large area\napparatus.\nThe first versions of these designs were produced between 2022 and 2023. A dedicated\ntest beam campaign evaluated the performance of the three layouts using a muon\nbeam at the SPS-H8 beamline at CERN. The results, shown in Fig. 46, demonstrate\ngood spatial resolution for all three layouts. However, the efficiency results reveal an\nefficiency plateau of approximately 70% for the second layout (blue lines), due to dead\nareas on the amplification electrode required for segmentation. The third layout (red\nlines) delivers very good performance despite requiring a higher high voltage (HV)\non the amplification stage. The R&D for this activity will continue to optimize the\nlayout configurations, ensuring 2-D readout performance while maintaining detector\noperational stability.\n10.3 Electronics\nThe results shown in the previous section are evaluated with APV-25 electronics\nand SRS readout system [83, 84]. This readout system is widely used in the gas detector\nR&D community but it can not be used in experiments such as LHC or FCC due to\na maximum trigger rate of about 1 kHz. Alternatives are needed to profit from the\n54\n\n\n(a) Tracking efficiency for different HV.\n(b) Residuals width for different HV.\nFigure 46: Results of the 2D layouts test campaign.\nperformance of the ASIC and a design optimized for the µ-RWELL and its final layout.\nA possible solution is identified in the TIGER/GEMROC system which is a compact,\nmodular, scalable, and highly customizable [85]. TIGER is versatile for the readout of\nradiation sensors up to 50 fC and for high rates up to 60 kHz. Its output is passed to\ntwo shapers optimized for time and charge measurement. The peak time of the shaper\nfor the time branch was set to the expected charge collection time (60 ns) to enable\nmeasurements with low jitter. The shaper for the energy branch has a slower peak\ntime (170 ns) for better charge resolution and ENC optimization. A first integration\ntest between µ-RWELL and TIGER was performed on a 10×10 cm2 prototype. The\naverage noise is 0.3-0.4 fC allowing the detector to operate at a threshold of about 1 fC.\nFurther studies between TIGER and µ-RWELL integration are ongoing to confirm the\nexpected performance achieved with APV/SRS system. In the future, an optimization\nof the TIGER parameters is planned to match the needs of the µ-RWELL layout\nchosen to optimize the performance of the 2-D readout.\n55\n\n\n11 Simulation and Performance\nThe specific FCC-ee experimental environment and its rich electroweak, QCD, and\nflavour physics programme offered by the very large event samples anticipated at the\nZ boson resonance (the so-called Tera-Z run), bring entirely new challenges to the\ndetector requirements previously driven by the needs of a Higgs factory at a linear col-\nlider. The statistical uncertainties expected on key electroweak measurements, both at\nthe Z resonance and at the WW threshold, call for a superb control of the systematic\nuncertainties, and put commensurate demands on the acceptance, construction qual-\nity and stability of the detectors. The specific discovery potential of feebly coupled\nparticles in the huge FCC-ee event samples should also be kept in mind when design-\ning the detectors. The IDEA detector concept has been used as a baseline for several\nphysics benchmark analyses to understand the needs of the detector performance for\nthe FCC-ee physics program.\nThe FCC software fully adopts Key4hep[24], a comprehensive data processing\nframework that support all phases of research, including event generation, detector\nsimulation, data analysis, and visualization of simulated data. Such a comprehensive\napproach is necessary to explore and maximize the physics reach of the proposed\ndetector solutions.\nThe physics studies conducted during the Feasibility Study phase[86] have been\nbased mainly on a parameterized response of the detector, using Delphes, which pro-\nvides a flexible tool for many purposes. However, several applications, like the study\nof the effects from the various backgrounds, require a more detailed simulation of the\ndetector response. Within the Key4hep framework, the detector description is han-\ndled by DD4hep[87] (Detector Description for High Energy Physics), which has been\nused to model the geometry of the sub-detectors composing the IDEA spectrometer.\nOnce the full simulation of the detector is available, the digitization step needs to\nbe implemented to allow the development of the reconstruction algorithms. Finally,\na full event reconstruction with particle flow needs to be available to perform more\ncomplete physics performance studies. In the meantime, several approaches have been\ntaken to be able to extract meaningful information with the available software tools.\nA summary of the most relevant performance estimates for the IDEA components\nfollows.\n11.1 IDEA tracking system performance and Particle\nIdentification\nSince the IDEA tracking system, track reconstruction and track refit, still needs to\nbe fully implemented in Key4hep, a compromise solution has been chosen to estimate\nits performance. This includes modifying of the structure of the DELPHES Fast\nSimulation package in order to allow a full determination of the track covariance\nmatrix that takes into account the detector geometry with the specific point resolutions\nand the presence of multiple scattering from the material contained in the tracking\nvolume. This fast tracking simulation is equivalent to performing a full fit of the\ntracks in the proposed detectors. The expected transverse impact parameter resolution\nas a function of polar angle, θ, for some values of the transverse momentum, pt, is\n56\n\n\nshown in Fig. 47, indicating an asymptotic resolution for high momenta of ∼2 µm\nover most of the polar angle range. The transverse momentum resolution is shown in\nFig. 48 reaching σ(pt)/pt ≃0.3% for pt = 100 GeV/c. The figure also shows how this\nresolution degrades if the silicon wrapper is removed. The high transparency of this\ntracking system is clearly understood from the small multiple scattering contribution\nas shown by the (red) dotted line.\n10\n20\n30\n40\n50\n60\n70\n80\n90\n (degrees)\nθ\n1\n10\n2\n10\nTrack momentum 1 GeV\nTrack momentum 10 GeV\nTrack momentum 100 GeV\nTrack momentum 1 GeV\nTrack momentum 10 GeV\nTrack momentum 100 GeV\nm\nµ\n(D) \nσ\nFigure 47: Transverse impact parameter resolution for different θ and muon momenta\n(Delphes)\nThe IDEA tracking system also provides excellent particle identification perfor-\nmance with cluster counting in the drift chamber and possibly timing in the silicon\nwrapper.\nThe cluster counting/timing technique provides a π/K separation better than three\nstandard deviations up to momenta about 30 GeV, except in a narrow gap between\n0.9 and 1.6 GeV, where the Bethe–Bloch energy-loss curves for the two particle types\ncross. These values are obtained with a fast simulation study performed with Delphes,\nparametrizing Garfield++ [88] results. As illustrated in Fig. 49, the gap can be\nadequately covered with a time-of-flight measurement over a distance of 2 m, with a\nnon-challenging resolution of O(100) ps.\nComprehensive studies of jet flavor tagging with the IDEA detector are shown in\nRef [89] along with detailed descriptions of these fast tracking and PID algorithms.\n57\n\n\n20\n40\n60\n80\n100\npt (GeV)\n0\n0.0005\n0.001\n0.0015\n0.002\n0.0025\n0.003\n0.0035\n0.004\n0.0045\n0.005\n °\n = 90\nθ\nIDEA full tracker - \nMultiple scattering only \nIDEA no Si wrapper \n/pt\npt\nσ\nIDEA tracker resolution \nFigure 48: Transverse momentum resolution as a function of transverse momentum\nfor the IDEA tracking system (Delphes). The (red) continuous line is the resolution\nof the baseline detector, while the (blue) dashed line shows the resolution without\nthe silicon wrapper. The (red) dotted horizontal line shows the multiple scattering\ncontribution.\n10−1\n100\n101\npT [GeV]\n0.8\n0.9\n1.0\nTracking eﬃciency\nZ/γ∗→q¯q(q = u, d)\n10 < θ < 170,\nvertex R < 50 mm\n∆MC > 0.02 rad\nCLD ML\nIDEA ML\nFigure 50: Tracking efficiency in IDEA as a function of pT\n58\n\n\n1\n10\n50\nmomentum [GeV/c]\n0\n2\n4\n6\n8\n10\n12\n14\nsigniﬁcance (K/π)\ntime of ﬂight (σt = 100 ps)\ndN/dx (He 90% −Isobutane 10%)\ncombined\nFigure 49: K/π separation significance (in standard deviations) of the IDEA drift\nchamber, from a fast Delphes simulation study, with cluster counting and using a\ndrift chamber performance parametrised from Garfield++ results. A better than 3 σ\nseparation is obtained up to momenta ∼30 GeV. The p < 1.6 GeV region is covered by\na time-of-flight system, extending over a distance of 2 m and having a timing resolution\nassumed to be 100 ps.\nIn order to exploit the characteristics of the specific tracking system for the IDEA\ndetector, a novel approach to tracking and full event reconstruction based on graph\nneural network (GNN) methods has been implemented [90] in full simulation. A pre-\nliminary look at the tracking efficiency for the IDEA tracking system is shown in\nFig. 50 where we can appreciate how IDEA, with its superior number of track mea-\nsurements, can reconstruct much lower transverse momentum tracks4. This is also a\ncrucial component for optimal Particle Flow reconstruction since a significant portion\nof the visible jet energy is carried by soft charged particles.\n11.2 IDEA calorimeter combined performance\nAn electromagnetic energy resolution at the level of 3%/\n√\nE is a unique asset for\nstudies of heavy-flavor physics with low-energy photons in their final state [91, 92]\nand to improve the resolution of the Z →ee recoil mass in Higgsstrahlung events by\nrecovering Bremsstrahlung photons. Furthermore, it enables an efficient clustering of\nphoton pairs from π0 decays which can effectively reduce π0 photon splitting across\njets in multi-jet events [20]. To meet its performance target on electromagnetic energy\nresolution a signal of at least 2000 phe/GeV is required to maintain the impact of\nphotostatistics on the stochastic term below 3%/\n√\nE. Other contributions to the EM\nenergy resolution are shown in Fig. 51 and consist of shower fluctuations (e.g. due\nto front and rear leakage or to dead material upstream of the calorimeter). Noise\nsources from either the SiPM dark counts or electronic noise are estimated to be\n4The definition of efficiency used here is the percentage of reconstructable charged particles that match\nwith a reconstructed track with at least four hits\n59\n\n\nsubdominant contributions as discussed in [20]. Overall, the electromagnetic energy\nresolution can be reasonably parametrized as a function of the electron energy as\nσE/EEM = 3.0%/\n√\nE ⊕0.5%.\n0.006\n−\n0.004\n−\n0.002\n−\n0\n0.002\n0.004\n0.006\n [rad]\ntruth@VTX\nθ\n - \nreco\nθ\n0\n1000\n2000\n3000\n4000\n5000\n6000\n7000\n8000\nCounts\n=0.97 mrad\nθ\nσ\nSeed:~\n=0.41 mrad\nθ\nσ\nCoG:~~\n, 0T\n-\nµ\nBarrel: 100 GeV \nFigure 51: Left: Electromagnetic energy resolution as a function of the electron\nenergy. Right: difference between the θ angle estimated with crystal barrel PWO seg-\nments and the true particle θ for photons with flat energy distribution in the 5-100\nGeV range. The black distribution used the center of the crystal with the highest en-\nergy hit as position estimator while the green distribution calculated the center of\ngravity of the energy hits due to the electromagnetic shower developing in neighbor-\ning crystals.\nThe two electromagnetic segments of PWO crystals provide a good angular reso-\nlution for photons as well as for electrons. The center of the gravity of the shower can\nbe calculated to improve the actual resolution. The right panel in Fig. 51 show the θ\nangular resolution for photons with flat energy distribution in the 5-100 GeV range\nat the level of about 0.4 mrad (i.e. about 1 mm).\nIn addition to the state-of-the-art EM energy resolution, the IDEA crystal elec-\ntromagnetic calorimeter provides an optimal integration with the fiber sampling\ndual-readout hadronic section of the calorimeter.\nThe crystal calorimeter can also provide a time resolution better than 30 ps for EM\nshowers with energy of 20 GeV or higher as demonstrated on beam tests with similar\ncalorimeter prototypes [93] provided that adequate readout electronics are used. In\naddition, two thin and highly segmented layers of LYSO:Ce crystals (or a fast plastic\nscintillator) could be added in front of the calorimeter for time tagging of minimum\nionizing particles with a time resolution of 20 ps, exploiting a technology similar to that\nused by the CMS MTD [22]. Such a timing detector could be used for time-of-flight\nmeasurements as well as to reconstruct the time of collision vertices with a precision at\n60\n\n\nthe level of 5 ps by combining charged tracks from the same vertex and offering a tool\nto mitigate the dispersion of center of mass energy in particular collision schemes [94].\nA complete simulation of the dual-readout crystal calorimeter integrated with the\nother IDEA sub-detectors within the Key4hep framework has recently been com-\npleted [95] to enable more detailed physics studies and overall optimization of the\nIDEA detector.\nTo study the calorimeter performance detailed full simulations of the dual-readout\ncrystal section combined with the optical-fiber hadronic section have been performed\nbefore in standalone Geant4 simulations. The main objective was to study the possibil-\nity of performing particle-flow-like reconstruction of hadronic jets in such an innovative\ndesign. The results showed a good improvement in the hadronic jet energy concerning\na standard configuration for which only the scintillating channel was used. We found\na significant improvement in the energy and angular resolution when the dual-readout\ntechnique was used to compensate for the intrinsic shower fluctuations. An additional\nbenefit by combining calo-clusters and tracks in a particle-flow-inspired reconstruc-\ntion was achieved, as shown in Fig. 52. The reconstruction algorithm was designed to\nexploit the correct estimation of the true hadron jet, on average, thanks to the dual-\nreadout correction of hadronic signals on an event-by-event basis and is described\nin [21].\n20\n40\n60\n80\n100\n120\n [GeV]\n〉 \njet\n E\n〈\n0.3\n−\n0.2\n−\n0.1\n−\n0\n0.1\n0.2\n0.3\n〉 \njet,truth\n)/E\njet,truth\n - E\njet,reco\n (E\n〈\nw/o DRO, w/o pPFA\nw/ DRO, w/o pPFA\nw/ DRO, w/ pPFA\n jj\n→\n \nγ\n Z*/\n→\n -\ne\n+\ne\nJet energy scale\n0\n20\n40\n60\n80\n100\n120\n140\n [GeV]\n〉 \njet\n E\n〈\n0.02\n0.04\n0.06\n0.08\n0.1\n0.12\n0.14\n/E\nE\nσ\n 0.027\n⊕\n \nE\n/E = 0.34/\nDRO\nE\nσ\n 0.015\n⊕\n \nE\n/E = 0.29/\nPFA\nE\nσ\n 0.042\n⊕\n \nE\n/E = 0.36/\nRAW\nE\nσ\nw/o DRO, w/o pPFA\nw/ DRO, w/o pPFA\nw/ DRO, w/ pPFA\n jj\n→\n \nγ\n Z*/\n→\n -\ne\n+\ne\nJet energy resolution\nFigure 52: Hadronic jet energy linearity (left) and resolution (right) as measured\nwith the scintillation signal only (red), the dual-readout corrected calorimeter signal\n(green), and the dual-readout plus particle-flow corrected estimation of the jet energy\n(blue). Figures from Ref [21].\nRecently, a new full simulation of the IDEA dual-readout fiber calorimeter ex-\nploiting the capillary-tubes technology has been developed within the FCC Key4hep\nsoftware. This new simulation will allow us to repeat these studies with an updated\ndescription of all the IDEA subdetectors.\n61\n\n\n11.3 An example of new capabilities: tau Particle Identification\nEfficient and accurate reconstruction and categorization of particle decays consti-\ntute a pivotal undertaking within the ambit of measurement and searches strategies\nfor the IDEA detector. To gauge dual-readout calorimeter capabilities in this respect\nwe have developed innovative techniques for identifying tau decays using advanced\nneural network architectures based on geometrical deep learning, which aptly recog-\nnize leptonic and hadronic decay modes, whilst effectively discriminating them from\nQCD jets originating from Z decays.\nStarting from the ParticleNet idea [96] developed for jet tagging, where jets are re-\ngarded as unordered sets of particles (Particle Cloud) and neural networks operate on\ndynamically constructed graphs, we have extended this approach for the task of tau\ndecay identification [97]. In this study, the deep neural network model, Dynamic Graph\nConvolutional Neural Network (DGCNN) proposed by Wang et al. [98], extended to\nprovide an assessment of the uncertainty on the tau-identification prediction, has been\ntrained on full simulation data of the IDEA detector of leptonic and hadronic tau lep-\nton decays, and QCD jet events. One assumed advantage of dual-readout technology\nis the distinctiveness of patterns generated in the calorimeter, owing to the differ-\ning properties of the constituent fibers, which is shown by an 88.3% accuracy when\nincorporating fiber type information, compared to the 73.7% of the geometrical infor-\nmation only. In Fig. 53 the normalized confusion matrix obtained with and without\nthe specific fiber type information is reported.\nFigure 53: Confusion matrices of DGCNN on test dataset, using geometric only (left)\nand geometric+fiber type information (right). Matrices are normalized per row.\nThis preliminary study highlights the enormous potential of dual-readout technol-\nogy combined with advanced machine learning strategies for precise, event-by-event\nparticle identification, while also contributing to the overall particle flow recon-\nstruction. The synergy between innovative deep learning techniques and the unique\ninformation provided by the fiber structure significantly enhances discrimination\n62\n\n\npower. However, even greater performance improvements can be achieved by incor-\nporating information from the crystal electromagnetic calorimeter and the central\ntracker. This would further strengthen the capabilities of the IDEA detector in tau-\nidentification, underscoring the critical role of tau leptons in the FCCee physics\nprogram, from precision tau polarization measurements to searches for new physics.\n12 Summary\nRecent progress and design updates for the Innovative Detector for E+e−Ac-\ncelerator (IDEA) concept are presented. Our design efforts aim to provide optimal\nperformance for the majority of the physics goals at the proposed FCC-ee e+e−col-\nlider. A full complement of sub-detectors is described including a very low mass\ntracking system comprising a powerful vertex detector, a large drift chamber and outer\na silicon wrapper, a high resolution dual-readout crystal electromagnetic calorimeter,\nan HTS based superconducting solenoid, a dual readout fiber calorimeter and three\nlayers of muon chambers embedded in the magnet flux return yoke. Simulation and\nR&D efforts leading to the design choices for meeting the machine requirements and\ndemanding precision of the physics drivers at the FCC-ee are summarized along with\nplans for future R&D efforts advancing the technical design of each detector subsys-\ntem. Detailed simulations of the physics performance of the full detector concept are\nsupported in the Key4hep framework with the geometry of the sub-detectors mod-\neled using DD4hep. The IDEA detector concept and associated R&D programs build\nupon available technologies to satisfy the demanding performance requirements to ex-\nploit the unprecedented level of precision physics measurements made possible by the\nFCC-ee.\n63\n\n\nReferences\n[1] A.K. Datta, K. Kong, K.T. Matchev, The Impact of beamstrahlung on precision\nmeasurements at CLIC. eConf C050318, 0215 (2005). arXiv:hep-ph/0508161\n[2] D. Jeans, Beamstrahlung backgrounds in ILD at linear (ILC) and circular (FC-\nCee) colliders.\nEPJ Web Conf. 315, 02017 (2024).\nhttps://doi.org/10.1051/\nepjconf/202431502017\n[3] P. Raimondi, D.N. Shatilov, M. Zobov. Beam-beam issues for colliding schemes\nwith large piwinski angle and crabbed waist (2007)\n[4] C. Rimbault, P. Bambade, K. Monig, D. Schulte, Incoherent pair generation in\na beam-beam interaction simulation.\nPhys. Rev. ST Accel. Beams 9, 034402\n(2006). https://doi.org/10.1103/PhysRevSTAB.9.034402\n[5] The ALICE collaboration, Technical Design report for the ALICE Inner Tracking\nSystem 3 - ITS3 ; A bent wafer-scale monolithic pixel detector. Tech. rep., CERN,\nGeneva (2024). URL https://cds.cern.ch/record/2890181. Co-project Manager:\nMagnus Mager, magnus.mager@cern.chds\n[6] L. Pancheri, R.A. Giampaolo, A.D. Salvo, S. Mattiazzo, T. Corradino, P. Giubi-\nlato, R. Santoro, M. Caccia, G. Margutti, J.E. Olave, M. Rolo, A. Rivetti, Fully\ndepleted maps in 110-nm cmos process with 100–300µm active substrate. IEEE\nTransactions on Electron Devices 67(6), 2393–2399 (2020). https://doi.org/10.\n1109/ted.2020.2985639. URL http://dx.doi.org/10.1109/TED.2020.2985639\n[7] I. Peric, A. Andreazza, H. Augustin, M. Barbero, M. Benoit, R. Casanova,\nF. Ehrler, G. Iacobucci, R. Leys, A.M. Gonzalez, P. Pangaud, M. Prathapan,\nR. Schimassek, A. Schoning, E.V. Figueras, A. Weber, M. Weber, W. Wong,\nH. Zhang, High-voltage cmos active pixel sensor. IEEE Journal of Solid-State Cir-\ncuits 56(8), 2488–2502 (2021). https://doi.org/10.1109/jssc.2021.3061760. URL\nhttp://dx.doi.org/10.1109/JSSC.2021.3061760\n[8] F.G. G. Cataldi, S. Spagnolo, Cluster counting in helium based gas mixtures.\nNuclear Instruments and Methods in Physics Research Section A: Accelerators,\nSpectrometers, Detectors and Associated Equipment 386, 458 (1997).\nhttps:\n//doi.org/https://doi.org/10.1016/S0168-9002(96)01164-3.\nURL https://www.\nsciencedirect.com/science/article/pii/S0168900296011643?via%3Dihub\n[9] G. Chiarello, C. Chiri, A. Corvaglia, F. Grancagnolo, A. Miccoli, M. Panareo,\nA. Pepino, C. Pinto, P. Primiceri, M. Spedicato, G. Tassielli, A new construc-\ntion technique of high granularity and high transparency drift chambers for\nmodern high energy physics experiments.\nNuclear Instruments and Methods\nin Physics Research Section A: Accelerators, Spectrometers, Detectors and As-\nsociated Equipment 824, 512–514 (2016).\nhttps://doi.org/https://doi.org/10.\n1016/j.nima.2015.12.021.\nURL https://www.sciencedirect.com/science/article/\n64\n\n\npii/S0168900215015922. Frontier Detectors for Frontier Physics: Proceedings of\nthe 13th Pisa Meeting on Advanced Detectors\n[10] M. Adinolfi, F. Ambrosino, A. Andryakov, A. Antonelli, M. Antonelli, C. Bacci,\nR. Baldini-Ferroli, A. Bankamp, F. Bellini, G. Bencivenni, S. Bertolucci, C. Bini,\nC. Bloise, V. Bocci, F. Bossi, P. Branchini, S. Bulychjov, G. Cabibbo, A. Cal-\ncaterra, R. Caloi, P. Campana, G. Capon, A. Cardini, M. Casarsa, V. Casavola,\nG. Cataldi, F. Ceradini, F. Cervelli, G. Chiefari, P. Ciambrone, E. De Lucia, R. De\nSangro, P. De Simone, S. Dell’Agnello, A. Denig, A. Di Domenico, C. Di Donato,\nS. Di Falco, A. Doria, E. Drago, G. Felici, A. Ferrari, M. L. Ferrer, G. Finocchiaro,\nG. Fischer, C. Forti, A. Franceschi, P. Franzini, C. Gatti, P. Gauzzi, S. Gio-\nvannella, V. Golovatyuk, E. Gorini, F. Grancagnolo, E. Graziani, M. Incagli,\nL. Ingrosso, Y. Jiang, W. Kluge, V. Kulikov, C. Kuo, F. Lacava, G. Lanfranchi,\nJ. Lee-Franzini, T. Lomtadze, C. Luisi, M. Martemianov, M. Matsyuk, W. Mei,\nA. Menicucci, R. Messi, S. Moccia, M. Moulson, S. M¨uller, F. Murtas, M. Napoli-\ntano, A. Nedosekin, L. Pacciani, P. Pag`es, M. Palutan, M. Panareo, L. Paoluzi,\nE. Pasqualucci, L. Passalacqua, M. Passaseo, A. Passeri, V. Patera, E. Petrolo,\nG. Petrucci, D. Picca, M. Piccolo, G. Pirozzi, M. Pollack, L. Pontecorvo, M. Pri-\nmavera, E. Santovetti, G. Saracino, F. Sch¨onleber, B. Sciascia, A. Sciubba,\nI. Sfiligoi, T. Spadaro, S. Spagnolo, E. Spiriti, U. von Hagel, P. Valente, B. Vale-\nriani, G. Venanzoni, S. Veneziano, A. Ventura, The tracking detector of the kloe\nexperiment. Nuclear Instruments and Methods in Physics Research Section A:\nAccelerators, Spectrometers, Detectors and Associated Equipment 488(1), 51–73\n(2002).\nhttps://doi.org/https://doi.org/10.1016/S0168-9002(02)00514-4.\nURL\nhttps://www.sciencedirect.com/science/article/pii/S0168900202005144\n[11] M. Chiappini, A. Baldini, H. Benmansour, G. Cavoto, F. Cei, G. Chiarello,\nA. Corvaglia, F. Cuna, G.D. Maso, M. Francesconi, L. Galli, F. Grancagnolo,\nM. Grassi, M. Hildebrandt, F. Ignatov, M. Meucci, A. Miccoli, W. Molzon,\nD. Nicol`o, A. Oya, D. Palo, M. Panareo, A. Papa, F. Raffaelli, F. Renga,\nP. Schwendimann, G. Signorelli, G. Tassielli, Y. Uchiyama, A. Venturini, B. Vi-\ntali, C. Voena, The cylindrical drift chamber of the meg ii experiment. Nuclear\nInstruments and Methods in Physics Research Section A: Accelerators, Spectrom-\neters, Detectors and Associated Equipment 1047, 167740 (2023). https://doi.org/\nhttps://doi.org/10.1016/j.nima.2022.167740.\nURL https://www.sciencedirect.\ncom/science/article/pii/S0168900222010324\n[12] A. Baldini, G. Cavoto, F. Cei, M. Chiappini, G. Chiarello, A. Corvaglia,\nM. Francesconi, L. Galli, F. Grancagnolo, M. Grassi, M. Hildebrandt, M. Meucci,\nA. Miccoli, D. Nicol´o, A. Papa, M. Panareo, C. Pinto, F. Raffaelli, F. Renga,\nG. Signorelli, G. Tassielli, C. Voena, The ultra light drift chamber of the meg ii\nexperiment. Nuclear Instruments and Methods in Physics Research Section A:\nAccelerators, Spectrometers, Detectors and Associated Equipment 958, 162152\n(2020). https://doi.org/https://doi.org/10.1016/j.nima.2019.04.106. URL https:\n//www.sciencedirect.com/science/article/pii/S0168900219306035.\nProceedings\nof the Vienna Conference on Instrumentation 2019\n65\n\n\n[13] P. Reak, A. Walenta, Relativistic rise measurement by cluster counting method in\ntime expansion chamber. IEEE Transactions on Nuclear Science 27.1, 54 (1980).\nhttps://doi.org/10.1109/TNS.1980.4330801\n[14] K. Afanaciev, A.M. Baldini, S. Ban, V. Baranov, H. Benmansour, M. Bia-\nsotti, G. Boca, P.W. Cattaneo, G. Cavoto, F. Cei, M. Chiappini, G. Chiarello,\nA. Corvaglia, F. Cuna, G.D. Maso, A. De Bari, M. De Gerone, L.F. Barusso,\nM. Francesconi, L. Galli, G. Gallucci, F. Gatti, L. Gerritzen, F. Grancagnolo,\nE.G. Grandoni, M. Grassi, D.N. Grigoriev, M. Hildebrandt, K. Ieki, F. Igna-\ntov, F. Ikeda, T. Iwamoto, S. Karpov, P.R. Kettle, N. Khomutov, S. Kobayashi,\nA. Kolesnikov, N. Kravchuk, V. Krylov, N. Kuchinskiy, W. Kyle, T. Libeiro,\nV. Malyshev, A. Matsushita, M. Meucci, S. Mihara, W. Molzon, T. Mori,\nF. Morsani, M. Nakao, D. Nicol`o, H. Nishiguchi, A. Ochi, S. Ogawa, R. Onda,\nW. Ootani, A. Oya, D. Palo, M. Panareo, A. Papa, V. Pettinacci, A. Popov,\nF. Raffaelli, F. Renga, S. Ritt, M. Rossella, A. Rozhdestvensky, P. Schwendimann,\nK. Shimada, G. Signorelli, A. Stoykov, M. Takahashi, G.F. Tassielli, K. Toy-\noda, Y. Uchiyama, M. Usami, A. Venturini, B. Vitali, C. Voena, K. Yamamoto,\nK. Yanai, T. Yonemoto, K. Yoshida, Y.V. Yudin, M.I. Collaboration, Opera-\ntion and performance of the meg ii detector. The European Physical Journal\nC 84(2), 190 (2024).\nhttps://doi.org/10.1140/epjc/s10052-024-12415-3.\nURL\nhttps://doi.org/10.1140/epjc/s10052-024-12415-3\n[15] C.B. Verhaaren, J. Alimena, M. Bauer, P. Azzi, R. Ruiz, M. Neubert, O. Miku-\nlenko, M. Ovchynnikov, M. Drewes, J. Klaric, A. Blondel, C. Rizzi, A. Sfyrla,\nT. Sharma, S. Kulkarni, A. Thamm, A. Blondel, R.G. Suarez, L. Rygaard,\nSearches for long-lived particles at the future fcc-ee.\nFrontiers in Physics 10\n(2022).\nhttps://doi.org/10.3389/fphy.2022.967881.\nURL http://dx.doi.org/10.\n3389/fphy.2022.967881\n[16] T. Jones. Cepc silicon /lhcb mt tile (2020). https://indico.ph.ed.ac.uk/event/\n65/contributions/814/Presentation at the First UK workshop on HV-CMOS\ntechnology for future e+e−colliders, University of Edinburgh\n[17] H. Zhu. A large tracking system with novel HV-CMOS sensors for the CEPC\n(2021).\nhttps://indico.inp.nsk.su/event/42/contributions/2186/attachments/\n1355/1777/CEPC Silicon Tracker AFAD.pdfPresentation at the Asian Forum for\nAccelerators and Detectors (AFAD), BINP\n[18] M. Tornago.\nDetector optimization and physics performance of the CMS\nPhase-2 Endcap Timing Layer (2023). URL https://cds.cern.ch/record/2848200.\nPresented 13 Feb 2023\n[19] M. Aleksa, et al. DRD on Calorimetry - Proposal. https://cds.cern.ch/record/\n2886494/files/DRD6-cdscern.pdf\n66\n\n\n[20] M.T. Lucchini, W. Chung, S.C. Eno, Y. Lai, L. Lucchini, M.T. Nguyen, C.G.\nTully, New perspectives on segmented crystal calorimeters for future collid-\ners. JINST 15(11), P11005 (2020). https://doi.org/10.1088/1748-0221/15/11/\nP11005. arXiv:2008.00338 [physics.ins-det]\n[21] M. Lucchini, L. Pezzotti, G. Polesello, C. Tully, Particle flow with a hybrid seg-\nmented crystal and fiber dual-readout calorimeter. Journal of Instrumentation\n17(06), P06008 (2022). https://doi.org/10.1088/1748-0221/17/06/P06008. URL\nhttps://dx.doi.org/10.1088/1748-0221/17/06/P06008\n[22] C. Collaboration, A mip timing detector for the cms phase-2 upgrade.\nTech.\nRep. CERN-LHCC-2019-003. CMS-TDR-020, CERN, Geneva (2019). URL https:\n//cds.cern.ch/record/2667167\n[23] F. Addesa, et al., Optimization of lyso crystals and sipm parameters for the\ncms mip timing detector.\nJournal of Instrumentation 19(12), P12020 (2024).\nhttps://doi.org/10.1088/1748-0221/19/12/P12020. URL https://dx.doi.org/10.\n1088/1748-0221/19/12/P12020\n[24] G. Ganis, C. Helsens, V. V¨olkl. Key4hep, a framework for future hep experiments\nand its use in fcc (2021). URL https://arxiv.org/abs/2111.09874\n[25] W. Chung. Differentiable full detector simulation of a projective dual-readout\ncrystal electromagnetic calorimeter with longitudinal segmentation and precision\ntiming (2024). URL https://arxiv.org/abs/2408.11027\n[26] The CMS electromagnetic calorimeter project: Technical Design Report. Technical\ndesign report. CMS (CERN, Geneva, 1997).\nURL http://cds.cern.ch/record/\n349375\n[27] R. Hirosky, et al., in 20th International Conference on Calorimetry in Particle\nPhysics (2024)\n[28] R. Yang, Y. Tang, Z. Fu, J. Qiu, K. Liu, A Method of Range Walk Error Correc-\ntion in SiPM LiDAR with Photon Threshold Detection. Photon. 9(1), 24 (2022).\nhttps://doi.org/10.3390/photonics9010024\n[29] Hamamatsu.\nMppcs.\nhttps://www.hamamatsu.com/us/en/product/\noptical-sensors/mppc/mppc mppc-array.html\n[30] Kodak.\nWratten\nfilters.\nhttps://www.kodak.com/en/motion/page/\nwratten-2-filters/\n[31] Schott.\nUg11 filter.\nURL https://www.schott.com/shop/advanced-optics/en/\nMatt-Filter-Plates/UG11/c/glass-UG11\n67\n\n\n[32] N. Bacchetta, J.J. Blaising, E. Brondolin, M. Dam, D. Dannheim, K. Elsener,\nD. Hynds, P. Janot, A.M. Kolano, E. Leogrande, L. Linssen, A. N¨urnberg, E.F.\nPerez, M. Petriˇc, P. Roloff, A. Sailer, N. Siegrist, O. Viazlo, G.G. Voutsinas, M.A.\nWeber. Cld – a detector concept for the fcc-ee (2019). URL https://arxiv.org/\nabs/1911.12230\n[33] Laboratorio\nAcceleratori\ne\nSuperconduttivit`a\nApplicata,\n(LASA),\nIstituto\nNazionale di Fisica Nucleare, Via Fratelli Cervi 201, 20054 Segrate, MI, Italy.\nURL https://homelasa.mi.infn.it/it/\n[34] E. Acerbi, F. Alessandria, G. Baccaglioni, E. Fabrici, L. Rossi, R. Bruzzese,\nG. Pasotti, M.V. Ricci, N. Sacchetti, M. Spadoni, O. Dormicchi, P. Fabbricatore,\nR. Penco, Thin and compensating solenoids for zeus detector. IEEE Transactions\non Magnetics 24, 1354–1357 (1988). https://doi.org/10.1109/20.11490\n[35] P. Fabbricatore, S. Farinon, R. Parodi, E. Baynham, S.F. Carr, D.A. Cragg, R.J.\nGreenhalgh, P.L. Sampson, The superconducting magnet for the babar detector\nof the pep-ii b factory at slac. IEEE Transactions on Magnetics 32, 2210–2213\n(1996). https://doi.org/10.1109/20.508606\n[36] L. Rossi, M. Sorbi, G. Volpini, D. Pedrini, C. Berriaud, I.L. Horvath, Production\nand qualification of the 60-ka, aluminum-stabilized conductor for the atlas bo\ncoil. IEEE Transactions on Applied Superconductivity 9, 209–212 (1999). https:\n//doi.org/10.1109/77.783273\n[37] F. Kircher, P. Bro´edy, A. Calvo, B. Cur´e, D. Campi, A. Desirelli, P. Fabbrica-\ntore, S. Farinon, A. Herv´e, I. Horvath, V. Klioukhine, B. Levesy, M. Losasso,\nJ.P. Louin, R. Musenich, Y. Pabot, A. Payn, C. Pes, C. Priano, F. Rondeaux,\nS. Sgobba, Final design of the cms solenoid cold mass. IEEE Transactions on\nApplied Superconductivity 10, 407410 (2000). https://doi.org/10.1109/77.828259\n[38] P. Fabbricatore, S. Farinon, F.P. Juster, R. Musenich, C. Priano, Experimental\nstudy of cms conductor stability. IEEE Transactions on Applied Superconduc-\ntivity 10, 424–427 (2000). https://doi.org/10.1109/77.828263\n[39] E. Acerbi, G. Baccaglioni, G. Drago, P. Gagliardi, A. Laurenti, A. Leone,\nR. Penco, L. Rossi, M. Sorbi, G. Volpini, Experience report of the manufac-\nture of the 25 meter long double pancakes for the atlas barrel toroidal magnet.\nIEEE Transactions on Applied Superconductivity 16, 541–544 (2006).\nhttps:\n//doi.org/10.1109/TASC.2005.864341\n[40] COMSOL Multiphysics v. 6.3. www.comsol.com. COMSOL AB, Stockholm,\nSweden.\n[41] Faraday Factory Japan LLC, Sagamihara City, Kanagawa Prefecture. URL https:\n//www.faradaygroup.com/en/\n68\n\n\n[42] S. Hahn, K. Kim, K. Kim, X. Hu, T. Painter, I. Dixon, S. Kim, K.R. Bhattarai,\nS. Noguchi, J. Jaroszynski, D.C. Larbalestier, 45.5-tesla direct-current magnetic\nfield generated with a high-temperature superconducting magnet. Nature 2019\n570:7762 570, 496–499 (2019). https://doi.org/10.1038/s41586-019-1293-1. URL\nhttps://www.nature.com/articles/s41586-019-1293-1\n[43] ATLAS magnet system: Technical Design Report, 1.\nTechnical design report.\nATLAS (CERN, Geneva, 1997). https://doi.org/10.17181/CERN.9O5C.VDTM.\nURL https://cds.cern.ch/record/338080\n[44] The CMS magnet project: Technical Design Report.\nTechnical design report.\nCMS (CERN, Geneva, 1997). https://doi.org/10.17181/CERN.6ZU0.V4T9. URL\nhttps://cds.cern.ch/record/331056\n[45] S. Lee, et al., Hadron detection with a dual-readout fiber calorimeter.\nNucl.\nInstrum. Meth. A 866, 76–90 (2017). https://doi.org/10.1016/j.nima.2017.05.025\n[46] L. Pezzotti, Particle detectors r&d: Dual-readout calorimetry for future colliders\nand micromegas chambers for the atlas new small wheel upgrade. Ph.D. thesis,\nUniversity of Pavia (2021). URL https://iris.unipv.it/handle/11571/1429275\n[47] N. Akchurin, et al., Particle identification in the longitudinally unsegmented RD52\ncalorimeter. Nucl. Instrum. Meth. A 735, 120–129 (2014). https://doi.org/10.\n1016/j.nima.2013.09.024\n[48] D. Collaboration. Dream/rd52 experiment. http://www.phys.ttu.edu/∼dream/\n[49] A. Karadzhinova-Ferrer, J. Agarwala, N. Ampilogov, V. Chmill, R. Ferrari,\nA. Freddi, G. Gaudio, S. Gigli, v. Samec, R. Santoro, C. Scagliotti, F. Vercellati,\nNovel prototype tower structure for the dual-readout fiber calorimeter. Journal\nof Instrumentation 17(09), T09007 (2022). https://doi.org/10.1088/1748-0221/\n17/09/T09007. URL https://dx.doi.org/10.1088/1748-0221/17/09/T09007\n[50] N. Ampilogov, et al., Exposing a fibre-based dual-readout calorimeter to a\npositron beam.\nJINST 18(09), P09021 (2023).\nhttps://doi.org/10.1088/\n1748-0221/18/09/P09021. arXiv:2305.09649 [physics.ins-det]\n[51] H.\nYoo.\nDual-readout\ncalorimeter\nactivities\nin\nasia\n(2024).\nURL\nhttps://indico.ihep.ac.cn/event/22089/contributions/169182/attachments/\n83331/105675/HDYOO CEPC 10232024.pdf. The 2024 Internatiional Workshop\non the High Energy Circular Electron Positron Collider\n[52] S. Kim.\nPerformance of the dual-readout calorimeter for low-energy elec-\ntromagnetic\nparticles\n(2024).\nURL\nhttps://indico.cern.ch/event/1339557/\ncontributions/5898549/attachments/2862196/5007879/CALOR2024 DRC TB\nresult SungwonKim.pdf.\n20th International Conference on Calorimetry in\nParticle Physics (CALOR 2024)\n69\n\n\n[53] R.S.\non\nbehalf\nof\nthe\nIDEA\nDual-Readout\nGroup,\nSipms\nfor\ndual-\nreadout calorimetry.\nInstruments 6(4) (2022).\nhttps://doi.org/10.3390/\ninstruments6040059\n[54] Citiroc-1A,\nWeeroc.\nhttps://www.weeroc.com/products/sipm-read-out/\ncitiroc-1a, accessed on 18 January 2023\n[55] FERS A5202, CAEN S.p.A., FERS A5202.\nhttps://www.caen.it/products/\na5202/, accessed on 18 January 2023\n[56] J. Xie, K. Attenkofer, M. Demarteau, A. Paramonov, A. Ronzhin, R. Wag-\nner, Z. Yusof, Large area planar photocathode for MCP-based photodetectors.\nNucl. Instrum. Meth. A 995, 163234 (2020).\nhttps://doi.org/10.1016/j.nima.\n2019.163234\n[57] CAEN.\nDrd4 manual.\nhttps://www.psi.ch/sites/default/files/import/drs/\nDocumentationENmanual rev50.pdf\n[58] G. Cho, S. Kim, et al., Beam tests of the copper-based Dual-Readout calorimeter\nto measure electromagnetic performance for future e+e−colliders. Journal of Sub-\natomic Particles and Cosmology 3, 100021 (2025). https://doi.org/10.1016/j.jspc.\n2025.100021\n[59] F. Gramuglia, M.L. Wu, C. Bruschini, M.J. Lee, E. Charbon, A low-noise cmos\nspad pixel with 12.1 ps sptr and 3 ns dead time. IEEE Journal of Selected Topics\nin Quantum Electronics 28(2: Optical Detectors), 1–9 (2022). https://doi.org/\n10.1109/JSTQE.2021.3088216\n[60] M. Moreno-Garcia, H. Xu, L. Gasparini, M. Perenzoni, in 48th European Solid-\nState Device Conference (ESSDERC) 3-6 Sep. 2018, Dresden, Germany (2018).\nhttps://doi.org/10.1109/ESSDERC.2018.8486883\n[61] HAMAMATSU\nR8900.\nhttps://www.hamamatsu.com/content/dam/\nhamamatsu-photonics/sites/documents/99 SALES LIBRARY/etd/R8900(U)\n-00-C12 TPMH1299E.pdf, accessed on 14 March 2023\n[62] N. Akchurin, K. Carrell, H. Kim, R. Thomas, R. Wigmans, J. Hauptman,\nA. Penzo, Comparison of high-energy electromagnetic shower profiles measured\nwith scintillation and Cherenkov light. Nucl. Instrum. Meth. A 548, 336–354\n(2005). https://doi.org/10.1016/j.nima.2005.03.169\n[63] M. Antonello, et al., Tests of a dual-readout fiber calorimeter with SiPM light\nsensors. Nucl. Instrum. Meth. A 899, 52–64 (2018). https://doi.org/10.1016/j.\nnima.2018.05.016. arXiv:1805.03251 [physics.ins-det]\n[64] N. Akchurin.\nHigh-granularity dual-readout calorimeter: Evolution of a clas-\nsic prototype (2024). URL https://indico.cern.ch/event/1339557/contributions/\n70\n\n\n5898541/attachments/2862080/5007661/CALOR2024 V3.pdf.\n20th Interna-\ntional Conference on Calorimetry in Particle Physics (CALOR 2024)\n[65] M.M. Bronstein, J. Bruna, Y. LeCun, A. Szlam, P. Vandergheynst, Geometric\ndeep learning: Going beyond euclidean data. IEEE Signal Processing Magazine\n34(4), 18–42 (2017). https://doi.org/10.1109/MSP.2017.2693418\n[66] N. Akchurin, C. Cowden, J. Damgov, A. Hussain, S. Kunori, On the use of neural\nnetworks for energy reconstruction in high-granularity calorimeters. Journal of\nInstrumentation 16(12), P12036 (2021). https://doi.org/10.1088/1748-0221/16/\n12/P12036. URL https://dx.doi.org/10.1088/1748-0221/16/12/P12036\n[67] N. Akchurin, C. Cowden, J. Damgov, A. Hussain, S. Kunori, The (un)reasonable\neffectiveness of neural network in cherenkov calorimetry.\nInstruments 6(4)\n(2022). https://doi.org/10.3390/instruments6040043. URL https://www.mdpi.\ncom/2410-390X/6/4/43\n[68] S. Kunori.\nVertex Imaging Calorimetry using AI/ML Tools (2024).\nURL\nhttps://indico.cern.ch/event/1339557/contributions/5898556/attachments/\n2860707/5004971/s kunori calore2024.pdf.\n20th International Conference on\nCalorimetry in Particle Physics (CALOR 2024)\n[69] G. Bencivenni, R.D. Oliveira, G. Morello, M.P. Lener, The micro-resistive WELL\ndetector: a compact spark-protected single amplification-stage MPGD.\nJour-\nnal of Instrumentation 10(02), P02008–P02008 (2015).\nhttps://doi.org/10.\n1088/1748-0221/10/02/p02008. URL https://doi.org/10.1088/1748-0221/10/02/\np02008\n[70] A. Colaleo, et al. DRD1 Extended R&D Proposal. https://cds.cern.ch/record/\n2885937/files/DRDC-P-DRD1.pdf\n[71] G. Bencivenni, C. Capoccia, G. Cibinetto, R. de Oliveira, R. Farinelli, G. Felici,\nM. Gatta, M. Giovannetti, L. Lavezzi, G. Morello, M.P. Lener, E. Tskhadadze,\nOn the space resolution of the µ-RWELL. Journal of Instrumentation 16(08),\nP08036 (2021). https://doi.org/10.1088/1748-0221/16/08/p08036. URL https:\n//doi.org/10.1088/1748-0221/16/08/p08036\n[72] G. Bencivenni, R. De Oliveira, G. Felici, M. Gatta, M. Giovannetti, G. Morello,\nA. Ochi, M. Poli Lener, E. Tskhadadze, The µ-RWELL layouts for high particle\nrate. JINST 14(05), P05014 (2019). https://doi.org/10.1088/1748-0221/14/05/\nP05014. arXiv:1903.11017 [physics.ins-det]\n[73] G. Bencivenni, R. De Oliveira, G. Felici, M. Gatta, G. Morello, A. Ochi, M.P.\nLener, E. Tskhadadze, Performance of µ-RWELL detector vs resistivity of the\nresistive stage. Nucl. Instrum. Meth. A 886, 36–39 (2018). https://doi.org/10.\n1016/j.nima.2017.12.037\n71\n\n\n[74] M. Dixit, A. Rankin, Simulating the charge dispersion phenomena in micro pat-\ntern gas detectors with a resistive anode. Nuclear Instruments and Methods in\nPhysics Research Section A: Accelerators, Spectrometers, Detectors and Asso-\nciated Equipment 566(2), 281–285 (2006). https://doi.org/https://doi.org/10.\n1016/j.nima.2006.06.050.\nURL https://www.sciencedirect.com/science/article/\npii/S0168900206011399\n[75] M. Anelli, G. Bencivenni, G. Felici, L. Magro, Glass electrode spark counters.\nNuclear Instruments and Methods in Physics Research Section A: Acceler-\nators, Spectrometers, Detectors and Associated Equipment 300(3), 572–574\n(1991).\nhttps://doi.org/https://doi.org/10.1016/0168-9002(91)90392-4.\nURL\nhttps://www.sciencedirect.com/science/article/pii/0168900291903924\n[76] V. Parkhomchuck, Y. Pestov, N. Petrovykh, A spark counter with large area.\nNuclear Instruments and Methods 93(2), 269–270 (1971). https://doi.org/https:\n//doi.org/10.1016/0029-554X(71)90475-7. URL https://www.sciencedirect.com/\nscience/article/pii/0029554X71904757\n[77] C.M. LHCb Collaboration, Framework TDR for the LHCb Upgrade II - Oppor-\ntunities in flavour physics, and beyond, in the HL-LHC era. Tech. rep., CERN,\nGeneva (2021). URL https://cds.cern.ch/record/2776420\n[78] M. Alviggi, et al., Resistive fine granularity Micromegas: characterization and per-\nformance for different spark protection resistive schemes. JINST 20(01), P01012\n(2025).\nhttps://doi.org/10.1088/1748-0221/20/01/P01012.\narXiv:2411.17202\n[physics.ins-det]\n[79] M. Della Pietra, et al., Resistive High Granularity Micromegas for Future Detec-\ntors (2025). URL https://indico.cern.ch/event/1386009/contributions/6279031/\n[80] C. Altunbas, M. Cap´eans, K. Dehmelt, J. Ehlers, J. Friedrich, I. Konorov,\nA. Gandi, S. Kappler, B. Ketzer, R. De Oliveira, S. Paul, A. Placci, L. Ro-\npelewski, F. Sauli, F. Simon, M. van Stenis, Construction, test and commissioning\nof the triple-gem tracking detector for compass. Nuclear Instruments and Meth-\nods in Physics Research Section A: Accelerators, Spectrometers, Detectors and\nAssociated Equipment 490(1), 177–203 (2002). https://doi.org/https://doi.org/\n10.1016/S0168-9002(02)00910-5.\nURL https://www.sciencedirect.com/science/\narticle/pii/S0168900202009105\n[81] L.e.a. Shekhtman, Development of µ-rwell detectors for the upgrade of the track-\ning system of cmd-3 detector.\nNuclear Instruments and Methods in Physics\nResearch Section A: Accelerators, Spectrometers, Detectors and Associated\nEquipment 936(05), 401–404 (2019). https://doi.org/https://doi.org/10.1016/j.\nnima.2018.11.033\n72\n\n\n[82] K. Gnanvo, N. Liyanage, B. Mehl, R. de Oliveira, Performance of a resistive\nmicro-well detector with capacitive-sharing strip anode readout. Nuclear Instru-\nments and Methods in Physics Research Section A: Accelerators, Spectrometers,\nDetectors and Associated Equipment 1047, 167782 (2023).\nhttps://doi.org/\nhttps://doi.org/10.1016/j.nima.2022.167782.\nURL https://www.sciencedirect.\ncom/science/article/pii/S0168900222010749\n[83] S. Martoiu, H. Muller, A. Tarazona, J. Toledo, Development of the scalable read-\nout system for micro-pattern gas detectors and other applications. Journal of\nInstrumentation 8(03), C03015 (2013). https://doi.org/10.1088/1748-0221/8/03/\nC03015. URL https://dx.doi.org/10.1088/1748-0221/8/03/C03015\n[84] M. Raymond, M. French, J. Fulcher, G. Hall, L. Jones, K. Kloukinas, L.K. Lim,\nG. Marseguerra, P. Moreira, Q. Morrissey, A. Neviani, E. Noah, in 2000 IEEE\nNuclear Science Symposium. Conference Record (Cat. No.00CH37149), vol. 2\n(2000), pp. 9/113–9/118 vol.2. https://doi.org/10.1109/NSSMIC.2000.949881\n[85] A. Amoroso, R.B. Ferroli, I. Balossino, M. Bertani, D. Bettoni, F. Bianchi,\nA. Bortone, R. Bugalho, A. Calcaterra, S. Cerioni, S. Chiozzi, G. Cibinetto,\nA.C. Ramusino, F. Cossio, M.D.R. Rolo, F.D. Mori, M. Destefanis, A.D.\nFrancesco, F. Evangelisti, R. Farinelli, L. Fava, G. Felici, S. Garbolino, I. Garzia,\nM. Gatta, G. Giraudo, S. Gramigna, M. Greco, L. Lavezzi, M. Maggiora,\nR. Malaguti, A. Mangoni, S. Marcello, P. Marciniewski, M. Melchiorri, G. Mez-\nzadri, M. Mignone, S. Morgante, E. Pace, S. Pacetti, P. Patteri, A. Rivetti,\nM. Scodeggio, S. Sosio, S. Spataro, J. Varela, R. Wheadon, The cgem-it read-\nout chain. Journal of Instrumentation 16(08), P08065 (2021). https://doi.org/\n10.1088/1748-0221/16/08/P08065. URL https://dx.doi.org/10.1088/1748-0221/\n16/08/P08065\n[86] B.e.a. Auchmann.\nFcc mid term report (2024).\nhttps://doi.org/10.17181/\nmhas5-1f263\n[87] F. Gaede, M. Frank, M. Petric, A. Sailer, DD4hep a community driven detector\ndescription for HEP. EPJ Web Conf. 245, 02004 (2020). https://doi.org/10.\n1051/epjconf/202024502004\n[88] R. Veenhof, GARFIELD, recent developments.\nNucl. Instrum. Meth. A 419,\n726–730 (1998). https://doi.org/10.1016/S0168-9002(98)00851-1\n[89] F. Bedeschi, L. Gouskos, M. Selvaggi, Jet flavour tagging for future colliders with\nfast simulation. Eur. Phys. J. C 82(7), 646 (2022). https://doi.org/10.1140/epjc/\ns10052-022-10609-1. arXiv:2202.03285 [hep-ex]\n[90] D. Garcia, B. Francois, M. Selvaggi, A. De Vita, Geometric graph neural network\nbased track finding. Tech. rep., CERN (2024). https://doi.org/https://doi.org/\n10.17181/pwrx1-wvn43\n73\n\n\n[91] R. Aleksan. Use cases for an extreme electromagnetic resolution. 4th FCC Physics\nand Experiments Workshop (2020). URL https://indico.cern.ch/event/932973/\n[92] M. Ciuchini, A. Stocchi, Physics opportunities at the next generation of preci-\nsion flavor physics experiments. Annual Review of Nuclear and Particle Science\n61(1), 491–517 (2011).\nhttps://doi.org/10.1146/annurev-nucl-102010-130424.\nURL http://dx.doi.org/10.1146/annurev-nucl-102010-130424\n[93] F. Ferri, The cms ecal phase-2 upgrade for high precision energy and timing\nmeasurements. Nuclear Instruments and Methods in Physics Research Section A:\nAccelerators, Spectrometers, Detectors and Associated Equipment 958, 162159\n(2020). https://doi.org/https://doi.org/10.1016/j.nima.2019.04.113. Proceedings\nof the Vienna Conference on Instrumentation 2019\n[94] Use cases for precise timing information at fcc-ee.\nhttps://indico.cern.\nch/event/932973/contributions/4080458/attachments/2140587/3607516/\n2020 11 11 Timing.pdf\n[95] W. Chung. Differentiable full detector simulation of the idea new baseline with\ncrystals (2024). URL https://indico.slac.stanford.edu/event/9297/contributions/\n10987/attachments/4972/13279/WChung Dec2024 %20SLAC.pdf\n[96] H. Qu, L. Gouskos, Jet tagging via particle clouds. Physical Review D 101(5),\n056019 (2020). https://doi.org/10.1103/PhysRevD.101.056019\n[97] S. Giagu, L. Torresi, M. Di Filippo, Tau lepton identification with graph neural\nnetworks at future electron–positron colliders. Frontiers in Physics, 10, 909205\n(2022). https://doi.org/https://doi.org/10.3389/fphy.2022.909205\n[98] Y. Wang, Y. Sun, Z. Liu, S.E. Sarma, M.M. Bronstein, J.M. Solomon, Dynamic\ngraph cnn for learning on point clouds. Acm Transactions On Graphics (tog)\n38(5), 1–12 (2019). https://doi.org/https://dl.acm.org/doi/10.1145/3326362\n74\n\n\nThe IDEA Study Group\nM. Abbrescia1, S. Ajmal2, N. Akchurin3, M. Al-Thakeel4, M. Alviggi5, B. Argiento5,\nP. Azzi6, P. Azzurri7, A. Bacci8, G. Baldinelli2, R. Bartek9, F. Bedeschi7, L.\nBellagamba10, A. Benaglia11, G. Bencivenni12, M. Biglietti13, G. BILEI2, D.\nBoccanfuso14, L. Borriello14, L. Borriello 14, D. Boscherini10, M. Boscolo12, F. Bosi7,\nA. Braghieri15, S. Braibant4, F. Brizioli2, A. Burdyko16, S. Busatto17, M. Caccia16,\nY. Cai4, M. Campajola5, L. Capriotti18, E. Carquin19, C. Cecchi20, P. Cenci2,\nF. Cetorelli21, D. Chiappara22, F. Chiapponi4, G. Chiarello23, P. Christoph24, W.\nChung25, S. Ciarlantini 6, A. Ciarma12, G. Cibinetto26, F. Cirotto5, M. Cobal27, A.\nCoccaro28, F. Conventi 29, T. Croci2, G. Cummings30, F. Cuna31, M. D’Alfonso24,\nB. D’Anzi1, A. D’Avanzo5, N. De Filippis32, M. De Gerone28, E. De Lucia12, G. De\nNardo5, E. Delfrate33, M. Della Pietra5, E. Di Fiore26, C. Di Fraia5, B. Di Micco13, R.\nDi Nardo34, A. Dominguez9, I. Drebot8, W. Elmetenawee31, S. Eno35, A. Etiennette36,\nL. Fan`o20, A. Farilla13, R. Farinelli10, M. Farino25, L. Favilla37, Y. Feng3, R. Ferrari15,\nF. Ferro28, A. Fondacci2, H. Fox38, M. Francesconi14, B. Francois36, F. Fransesini12, Y.\nGao39, I. Garzia18, S. Gascon-Shotkin40, M. Gatta12, G. Gaudino37, G. Gaudio15, P.\nGiacomelli10, S. Giagu41, M. Giovannetti12, P. Giubilato6, E. Gorini42, S. Gramigna43,\nF. Grancagnolo44, S. Grancagnolo44, F. Gravili44, L. Guan45, G. Guerrieri36, R.\nHirosky46, J. Hirschauer30, G. Iakovidis47, P. Iengo36, A. Ilg48, M. Iodice13, A. Iorio5,\nV. Izzo14, A. Jung49, H. Khanpour50, M. Kim51, S. Ko52, L. Lavezzi53, K. Lee54,\nS.W. Lee55, S. Lee3, J.S.H. Lee56, Y. Lee56, A. Loeschcke Centeno57, M. Louka31, M.\nLucchini21, A. Lusiani58, C. Madrid3, M. Maggiora59, G. Manco15, E. Manoni2, L.\nMarafatto27, S. Mariotto60, G. Martelli2, S. Mattiazzo22, F. Melendi26, L. Meng38,\nA. Messineo61, G. Mezzadri62, A. Miccoli44, M. Migliorati41, P. Miller35, S. Moneta2,\nG. Morello12, A. Morozzi2, F. Moscatelli63, L. Nasella33, S. Pacetti20, F. Palla 7,\nM. Panareo44, O. Panella2, G. Panizzo27, P. Paolucci14, A. Pareti64, F. Parodi65, D.\nPasseri20, L. Pezzotti10, M. Piccini2, M. Pinamonti27, L. Pintucci27, G. Polesello15, M.\nPoli Lener12, A. Polini10, M. Primavera44, F. Procacci31, L. Ratti64, E. Robutti28, M.\nRossetti Conti66, L. Rossi60, E. Rossi5, F. Salvatore57, R. Santoro16, J. Scamardella14,\nC. Schiavi65, M. Scodeggio26, G. Sekhniaidze14, B. Singhal9, M. Sorbi60, S. Sorti60,\nM. Statera 66, G. Tassielli67, R. Tenchini7, L. Toffolin27, L. Toffolin68, C. Tully25, R.\nTurra8, C. Turrioni2, F. Ustuner69, N. Valle15, A. Ventura42, I. Vivarelli4, I. Watson56,\nJ. Wyss70, H.D. Yoo71, S. Yu9, D. Yu72, A. Zingaretti6,\n1 INFN Sezione di Bari and Universit`a di Bari, Italy\n2 INFN Sezione di Perugia, Italy\n3 Texas Tech University, USA\n4 INFN Sezione di Bologna and Universit`a di Bologna, Italy\n5 INFN Sezione di Napoli and Universit`a di Napoli Federico II, Italy\n6 INFN Sezione di Padova, Italy\n7 INFN Sezione di Pisa, Italy\n8 INFN Sezione di Milano, Italy\n75\n\n\n9 The Catholic University of America, USA\n10 INFN Sezione di Bologna, Italy\n11 INFN Sezione di Milano-Bicocca, Italy\n12 INFN Laboratori Nazionali di Frascati, Italy\n13 INFN Sezione di Roma Tre, Italy\n14 INFN Sezione di Napoli, Italy\n15 INFN Sezione di Pavia, Italy\n16 INFN Sezione di Milano and Universit`a dell’Insubria, Italy\n17 INFN Sezione di Milano - LASA and Universit`a di Roma La Sapienza, Italy\n18 INFN Sezione di Ferrara and Universit`a of Ferrara, Italy\n19 Universidad T´ecnica Federico Santa Mar´ıa - Departamento de f´ısica, Chile\n20 INFN Sezione di Perugia and Universit`a di Perugia, Italy\n21 INFN Sezione di Milano-Bicocca and Universit`a di Milano-Bicocca, Italy\n22 INFN Sezione di Padova and Universit`a di Padova, Italy\n23 INFN Sezione di Lecce (now UNIPA), Italy\n24 Massachusetts Institute of Technology, USA\n25 Princeton University, USA\n26 INFN Sezione di Ferrara, Italy\n27 INFN Gruppo collegato di Udine and Universit`a di Udine, Italy\n28 INFN Sezione di Genova, Italy\n29 INFN Sezione di Napoli and Universit`a di Napoli Parthenope, Italy\n30 Fermi National Accelerator Laboratory, USA\n31 INFN Sezione di Bari, Italy\n32 INFN Sezione di Bari and Politecnico di Bari, Italy\n33 INFN Sezione di Milano and Universit`a di Milano, Italy\n34 INFN Sezione di Roma Tre and Universit`a Roma Tre, Italy\n35 University of Maryland, USA\n36 CERN, Switzerland\n37 INFN Sezione di Napoli and Scuola Superiore Meridionale, Italy\n38 Lancaster University, United Kingdom\n39 University of Edinburgh, United Kingdom\n40 IP2I Lyon/Universit´e Claude Bernard Lyon 1, France\n41 INFN Sezione di Roma 1 and Universit`a di Roma La Sapienza, Italy\n42 INFN Sezione di Lecce and Universit`a del Salento, Italy\n43 INFN Sezione di Roma Tor Vergata, Italy\n44 INFN Sezione di Lecce, Italy\n45 University of Michigan, USA\n46 University of Virginia, USA\n47 Brookhaven National Laboratory, USA\n48 University of Zurich, Switzerland\n49 Purdue University, USA\n50 AGH University of Krakow, Poland\n51 Gangneung-Wonju National University, South Korea\n52 Seoul National University, South Korea\n53 INFN Sezione di Torino, Italy\n76\n\n\n54 Chung-ang University, South Korea\n55 Kyungpook National University, South Korea\n56 University of Seoul, South Korea\n57 University of Sussex, United Kingdom\n58 INFN sezione di Pisa and Scuola Normale Superiore, Italy\n59 INFN Sezione di Torino and Universit`a di Torino, Italy\n60 INFN Sezione di Milano - LASA and Universit`a di Milano, Italy\n61 INFN Sezione di Pisa and Universit`a di Pisa, Italy\n62 INFN Sezione di Ferrara and Institute of High Energy Physics Beijing, Italy -\nPRC\n63 INFN Sezione di Perugia and IOM-CNR, Italy\n64 INFN Sezione di Pavia and Universit`a di Pavia, Italy\n65 INFN Sezione di Genova and Universit`a di Genova, Italy\n66 INFN Sezione di Milano - LASA, Italy\n67 Universit`a LUM , Italy\n68 INFN Sezione di Trieste and CERN, Italy\n69 The University of Edinburgh, United Kingdom\n70 INFN Sezione di Padova and Universit`a di Cassino, Italy\n71 Yonsei University, South Korea\n72 University at Buffalo - State University of New York, USA\n77\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21223v2.pdf",
    "total_pages": 77,
    "title": "The IDEA detector concept for FCC-ee",
    "authors": [
      "The IDEA Study Group"
    ],
    "abstract": "A detector concept, named IDEA, optimized for the physics and running\nconditions at the FCC-ee is presented. After discussing the expected running\nconditions and the main physics drivers, a detailed description of the\nindividual sub-detectors is given. These include: a very light tracking system\nwith a powerful vertex detector inside a large drift chamber surrounded by a\nsilicon wrapper, a high resolution dual readout crystal electromagnetic\ncalorimeter, an HTS based superconducting solenoid, a dual readout fiber\ncalorimeter and three layers of muon chambers embedded in the magnet flux\nreturn yoke. Some examples of the expected detector performance, based on fast\nand full simulation, are also given.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}