{
  "id": "arxiv_2502.21199v1",
  "text": "Negative correlations in Ising models of credit\nrisk\nChiara Emonti1 and Roberto Fontana2\n1 Politecnico di Torino, Corso Duca degli Abruzzi 24, Torino, Italy\ns316686@studenti.polito.it\n2 Politecnico di Torino, Corso Duca degli Abruzzi 24, Torino, Italy\nroberto.fontana@polito.it\nAbstract. We analyze a subclass of Ising models in the context of credit\nrisk, focusing on Dandelion models when the correlations ρ between the\ncentral node and each non-central node are negative. We establish the\npossible range of values for ρ and derive an explicit formula linking the\ncorrelation between any pair of non-central nodes to ρ. The paper con-\ncludes with a simulation study.\nKeywords: Ising model, Negative correlation, Credit risk, Distribution\nof the portfolio loss\n1\nCredit Risk\nCredit risk arises in the context of financing and is one of the most important\nfactors in determining the price of financial securities. It is also considered a\nkey element in the daily investment decisions of investors, whether banks or\nprivate individuals. As highlighted in [5], credit risk refers to the possibility that\na counter-party fails to fully meet its obligations, both in terms of interest and\nprincipal. In such cases, the counter-party is said to be in default. A higher credit\nrisk leads to a higher required interest rate. We consider a portfolio of N credits.\nFor each credit i, i = 1, . . . , N, three key quantities are defined: Probability of\nDefault (PD), Loss Given Default (LGD), and Exposure at Default (EAD). By\ncombining these quantities, we obtain the random variable L′\ni, which represents\nthe loss associated with the i-th credit, L′\ni = EADi·LGDi·Li, where Li ∈{0, 1}\nis a Bernoulli-distributed variable with parameter PDi, indicating whether a\ndefault occurs for the i-th credit. The total credit portfolio loss L′ is then given\nby L′ = L′\n1 + . . . + L′\nN. In this work, we assume that both EADi and LGDi\nare constant. Under this assumption, the total loss L′, apart from a negligible\nconstant term, simplifies to\nL =\nN\nX\ni=1\nLi\n(1)\nAs stated in [3], a credit portfolio model is a theoretical construct that out-\nputs the probability distribution of losses for a given credit portfolio. The con-\ntinuous evolution of financial methodologies has exposed the limitations of tra-\nditional models in accurately assessing risks. In particular, none of these models\narXiv:2502.21199v1  [stat.AP]  28 Feb 2025\n\n\n2\nChiara Emonti and Roberto Fontana\nwas able to adequately capture extreme risks during the US subprime crisis.\nThis shortcoming arises because traditional portfolio models fail to account for\ncontagion effects. In this work, we study a class of models that incorporate con-\ntagion effects, [3]. Financial contagion is defined as ”a significant increase in\nco-movements of prices and quantities across markets, conditional on a crisis oc-\ncurring in one market or group of markets”, [4]. Readers interested in the subject\ncan refer to [3] and [2] and the references therein.\n2\nJungle Model\nIn the literature, the Jungle model is known as the Ising model, originally derived\nfrom statistical mechanics. This model is used to model credit contagion by\ngenerating double-peak probability distributions for credit loss and endogenously\nproducing quasi-phase transitions, which are examples of systemic credit crises\nthat arise suddenly without an apparent cause, [3].\nThe Jungle model provides the optimal probability distribution for modeling\nlosses in a general credit portfolio, based on two assumptions: (i) the principle of\nMaximum Entropy (MaxEnt) and (ii) the premise that all empirical information\nof a given credit portfolio can be summarized by the probability of default and\nthe correlations among defaults of its components, [3]. This approach demon-\nstrates how probability distributions can be determined from partial information.\nBy utilizing the available data and ensuring that the unknown distribution maxi-\nmizes Shannon entropy, the probability distribution that best describes the given\nscenario can be derived. Following [3], the MaxEnt principle seeks to find the\nprobability distribution P(x), defined over a finite state space Ω, that maximizes\nentropy while satisfying m constraints, given by:\nX\nx∈Ω\nP(x)fk(x) = Fk\n(2)\nwhere fk(x) is a function defined on Ω, and Fk is a given constant, for k =\n1, . . . , m, with m < #Ω. In addition, the standard constraint P\nx∈ΩP(x) = 1\nmust be satisfied. The solution to this problem is given by\nP(x) =\n1\nZ(λ1, . . . , λm) exp\n \n−\nm\nX\ni=1\nλifi(x)\n!\n(3)\nwhere Z is the partition function Z(λ1, . . . , λm) = P\nx∈Ωexp(Pm\ni=1 λifi(x)). The\nparameters λ1, . . . , λm are determined by solving the equations Fk = −∂log Z\n∂λk ,\nk = 1, . . . , m.\n2.1\nThe Dandelion Model\nThe Dandelion model is a member of the Jungle model class and represents a\nsituation in which a central element of the credit portfolio is linked to each of\n\n\nNegative correlations in credit risk\n3\nthe other non-central nodes. When the correlation between the default indicator\nof the central node and the default indicator of each non-central node is positive,\nthe model mimics the relationship between a bank and its borrowers, or between\na central bank and the rest of the economy.\nThe probability function of the Dandelion model is given by:\nP(l0, l1, . . . , lN) = 1\nZ exp\n \nα0l0 + α\nN\nX\ni=1\nli + β\nN\nX\ni=1\nl0li\n!\n(4)\nwhere the parameters α0, α, and β are determined to satisfy the requirements\nE[L0] = p0, E[Li] = pd, and E[L0Li] = q for i = 1, . . . , N, and Z = Z(α0, α, β)\nis the normalizing function. In the case where all default probabilities are equal,\np0 = pd = p, using [3], we obtain:\nα = log\n\u0012\np −q\n1 −2p + q\n\u0013\n, α0 = (N −1) log\n\u00121 −p\np\n\u0013\n+ Nα, β = log\n\u0012\nq\np −q\n\u0013\n−α,\nZ = (1 + exp(α))N + exp(α0)(1 + exp(α + β))N\n(5)\nFrom Eq.(4) we can derive the expression of the probability mass function of\nthe loss L = L1 + . . . + LN:\nP(L = l) = 1\nZ\n\u0012N\nl\n\u0013\n(exp(αl) + exp(α0 + l(α + β))) , l = 0, . . . , N\n(6)\nWe recall the relation between the second order moment q = E[L0Li] and the\ncorrelation ρ = ρ(L0, Li): ρ =\nq−p2\np(1−p), q = ρp(1 −p) + p2, i = 1, . . . , N.\n2.2\nNegative correlations in Dandelion model\nIn this work, we explore the case where the correlation ρ between the default\nindicator of the borrower L0 and the default indicator of the i-th creditor Li\nis negative, i = 1, . . . , N. The paper [3] considers the Dandelion model only\nin the case of ρ greater than zero. The status of non-central nodes may be\nnegatively correlated with that of the central node. For example, consider a\ncase where the central node represents an oil-trading company aiming to expand\nby acquiring N companies in the renewable energy sector. In this scenario, it\nseems reasonable that the statuses of the central and non-central nodes would\nbe negatively correlated.\nWe know that the second-order moment q can take values in the interval\n[0, p], i.e., 0 ≤q ≤p. It follows that ρ is bounded:\n−\np\n1 −p ≤ρ ≤1\n(7)\nIn addition, the parameters α, α0, and β are defined using the logarithm.\nProposition 1 provides the range of admissible values for the correlation ρ.\n\n\n4\nChiara Emonti and Roberto Fontana\nProposition 1. Given 0 < p < 1 and 0 < q < p, the correlation ρ must satisfy\nthe constraints\nρ > max(−\np\n1 −p, −1 −p\np\n),\nρ < 1\nProof. Let us consider α = log(\np−q\n1−2p+q). Since p −q > 0, it must be that 1 −\n2p + q > 0. We obtain\n1 −2p + q > 0 ⇔q > 2p −1 ⇔ρp(1 −p) + p2 > 2p −1 ⇔ρ > −1 −p\np\nIt is easy to verify that α0 and β do not impose additional constraints. Therefore,\nfrom Eq.(7), the thesis follows.\nWe know that E[L0] = E[Li] = p and E[L0Li] = q, i = 1, . . . , N. Now we\nstudy the second-order moment E[LiLj] and the correlation ρi,j between two\nnon-central creditors i and j, with i ̸= j and i, j ∈1, . . . , N.\nProposition 2. Let ρ (ρi,j) denote the correlation between L0 and Lk (Li and\nLj, respectively) where, i, j, k ∈{1, . . . , N}, i ̸= j. It follows that\nρi,j = ρ2\nProof. From Eq.(4) we obtain\nP ′(l1, . . . , lN) =\n1\nX\nl0=0\nP(l0, l1, l2, ..., lN) = 1\nZ\n\"\nexp\n \nα\nN\nX\ni=1\nli\n!\n+ exp\n \nα0 + (α + β)\nN\nX\ni=1\nli\n!#\nWithout loss of generality, we consider i = 1 and j = 2. We obtain\nE[L1L2] = P ′(L1 = 1, L2 = 1) =\nX\n(l3,...,lN)∈VN−2\nP ′(1, 1, l3, . . . , lN) =\nX\n(l3,...,lN)∈VN−2\n1\nZ\n\"\nexp\n \n2α + α\nN\nX\ni=3\nli\n!\n+ exp\n \nα0 + 2(α + β) + (α + β)\nN\nX\ni=3\nli\n!#\nwhere VN−2 = {0, 1}(N−2). Using the parameter expressions from Eq. (5), the\nfirst addendum of the above expression becomes\nX\n(l3,...,lN)\n1\nZ\n\"\nexp\n \n2α + α\nN\nX\ni=3\nli\n!#\n= 1\nZ e2α\nX\n(l3,...,lN)∈VN−2\neα(l3+...+lN) =\n= 1\nZ e2α\n1\nX\nl3=0\neαl3 . . .\n1\nX\nlN=0\neαlN = 1\nZ e2α(1 + eα)N−2 = (p −q)2\n1 −p\nWith similar computations for the second addendum, we obtain\nX\n(l3,...,lN)∈VN−2\n1\nZ\n\"\nexp\n \nα0 + 2(α + β) + (α + β)\nN\nX\ni=3\nli\n!#\n= . . . = q2\np\n\n\nNegative correlations in credit risk\n5\nIt follows\nρ12 = E[L1L2] −p2\np(1 −p)\n= (p2 −q)2\np2(1 −p)2\nSince ρ =\nq−p2\np(1−p) the proof is completed.\nIt follows that the correlation between two non-central nodes is always positive\nand smaller than |ρ|.\n3\nSimulation\nWe consider the case with p = 0.4 and N = 100. The probability of default is\nhigh and somewhat unrealistic, but as in [3], it is a good example for illustrative\npurposes. From Proposition 1, we find that the range of correlations covered by\nthe model is −2\n3 < ρ < 1. From Proposition 2, we obtain that in the case of\nnegative (positive) correlations, ρ < 0 (ρ > 0), the correlation ρij will lie in the\nrange (0, 4\n9) (or (0, 1)), respectively. The loss distribution presents two peaks in\nthe case of both negative and positive correlation ρ. Figure 1 shows two loss\ndistributions: one with positive correlation ρ = ρ0 and the other with negative\ncorrelation ρ = −ρ0 with ρ0 = 0.26. The distribution for positive ρ has the\nfirst (highest) peak at low losses and the second (lowest) peak at high losses. In\ncontrast, for negative ρ, the opposite is true. Therefore, it appears that when\nthe correlations are negative, a serious portfolio loss has a high probability of\noccurring.\nFig. 1. Probability Loss Distribu-\ntion for ρ = ρ0 and ρ = −ρ0 with\nρ0 = 0.26\nFig. 2. Value at Risk (99%) vs\nCorrelation\nIn Figure 2, the relationship between the Value at Risk (99%) and the corre-\nlation is shown. The graph is not perfectly symmetrical, even though it appears\nto be mirrored around zero. To further study this phenomenon, we considered\nthe modes of the loss distributions. The graph in Figure 3 shows the relationship\nbetween the mode of the loss distribution and the default correlation ρ. It is ev-\nident that a discontinuity exists: there is a jump at the value ρ⋆≈−0.4. Upon\n\n\n6\nChiara Emonti and Roberto Fontana\nfurther analysis of the mode’s trend, we observe that initially, when ρ is close to\nthe lower bound (ρ ≈−2\n3), the mode is almost zero. As ρ increases, the mode\nstarts to increase, and when ρ is close to ρ⋆it jumps to its maximum value,\naround 60. After reaching this maximum, it decreases almost linearly to 0. This\nsudden change in the mode can be interpreted as a quasi-phase transition. It is\nnoteworthy that a small change in the default correlation between credits leads\nto a drastic and sudden change in the mode’s behavior. We also observe that at\nρ = 0, the mode appears to stabilize. The mode’s stationarity at ρ = 0 occurs\nbecause the loss distribution approaches that of the binomial distribution when\nthe default correlations are close to zero. When ρ = 0, the loss distribution is\nexactly binomial with parameters N and p. In Figure 4 the mode probability is\nshown. We notice that it’s high at extreme values of correlation and when the\ncorrelation is close to zero; for the other values of correlation it has a low value.\nFig. 3. Mode vs Correlation\nFig. 4. Mode Probability vs Cor-\nrelation\n4\nAcknowledgments\nThis work extends some of the results presented in the master’s thesis [1].\nReferences\n1. Emonti, C.: Jungle statistical models applied to credit risk: focus on types dande-\nlion and diamond. Master’s thesis, Politecnico di Torino (2025). Supervisor: Prof.\nR.Fontana\n2. Fontana, R., Luciano, E., Semeraro, P.: Model risk in credit risk. Mathematical\nFinance 31(1), 176–202 (2021)\n3. Molins, J.: Model risk on credit risk. Risk and Decision Analysis 6(1), 65–78 (2016)\n4. Pericoli, M., Sbracia, M.: A primer on financial contagion.\nJournal of economic\nsurveys 17(4), 571–608 (2003)\n5. Porretta, P.: Integrated risk management: regole, rischi, capitale, liquidit`a e nuove\nopportunit`a strategiche. Egea (2021)\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21199v1.pdf",
    "total_pages": 6,
    "title": "Negative correlations in Ising models of credit risk",
    "authors": [
      "Chiara Emonti",
      "Roberto Fontana"
    ],
    "abstract": "We analyze a subclass of Ising models in the context of credit risk, focusing\non Dandelion models when the correlations $\\rho$ between the central node and\neach non-central node are negative. We establish the possible range of values\nfor $\\rho$ and derive an explicit formula linking the correlation between any\npair of non-central nodes to $\\rho$. The paper concludes with a simulation\nstudy.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}