{
  "id": "arxiv_2502.21296v1",
  "text": " \nLei & Sornette: Pre-print at arXiv \n1 \n \nOscillatory finite-time singularities in rockbursts \nQinghua Lei1,, Didier Sornette2 \n1Department of Earth Sciences, Uppsala University, Uppsala, Sweden \n2Institute of Risk Analysis, Prediction and Management, Academy for Advanced Interdisciplinary \nStudies, Southern University of Science and Technology, Shenzhen, China \nAbstract \nForecasting violent rockbursts remains a formidable challenge due to significant uncertainties \ninvolved. One major uncertainty arises from the intermittency of rock failure processes, typically \ncharacterised by a series of progressively shorter quiescent phases punctuated by sudden accelerations, \nrather than a smooth continuous progression towards the final breakdown. This non-monotonic \nevolution of rock mass deformation complicates rockburst prediction, challenging conventional time-\nto-failure models that often assume a smooth power law accelerating behaviour. Here, we introduce \na generalised time-to-failure model called log-periodic power law singularity (LPPLS) model to \neffectively capture the intermittent dynamics of damage and rupture processes in rock leading up to \nviolent rockbursts. We perform parametric and nonparametric tests on 11 historical rockburst events \nat three underground mines, documenting empirical evidence and providing theoretical arguments to \ndemonstrate the significance of log-periodic oscillatory power law finite-time singularities. Log-\nperiodicity in these rockburst events is likely driven by the interaction of subparallel propagating \ncracks, the diffusion of stress-triggering processes, or the interplay between stress drop and stress \ncorrosion. Our results and insights obtained have significant implications for not only understanding \nbut also forecasting rockbursts, as recognising and characterising log-periodicity can help transform \nintermittency from traditionally perceived noise into valuable predictive information. \nKeywords \nRockbursts; Catastrophic failure; Log-periodicity; Power law; Discrete scale invariance \n \n Corresponding author: qinghua.lei@geo.uu.se \n\n\n \nLei & Sornette: Pre-print at arXiv \n2 \n \n1. Introduction \nRockbursts have long been a major challenge in rock mechanics and mining sciences1–5 and their \nimportance continues to grow as the extraction of Earth’s resources (e.g. metals, rare earth elements, \ncoal) as well as the construction of infrastructures (e.g. tunnels and caverns) extends to ever greater \ndepths6. Rockbursts can be in general classified into two major types7,8: (i) strainbursts, which result \nfrom the accumulation and sudden release of strain energy in local rock under high stress \nconcentrations, and (ii) fault-slip bursts, which are caused by shear slip along remote faults. Reliable \nrockburst forecast is essential for mining or construction companies to inform underground workers \nabout potential rockburst events and their timing, enabling timely evacuations and the implementation \nof necessary safety measures. Great efforts have been dedicated to developing and deploying high-\nprecision monitoring technologies to record rock mass deformations and associated seismic activities \nduring deep underground excavations9,10, aiming to detect and characterise potential precursors of \nimpending rockburst events. However, the current practice of rockburst hazard analysis largely relies \non empirical criteria11. For example, rockburst liability is often defined based on the ratio of stress \nlevel to rock strength against empirically defined thresholds12; many early warning systems are based \non in-situ microseismic monitoring and empirically obtained relations between microseismicity \nparameters and rockburst occurrences13. However, the underlying physical mechanisms behind these \nempirical relationships usually remain elusive such that their application is often plagued by large \nuncertainties. Moreover, these approaches are akin to drawing conclusions from static snapshots, \nwhereas a more effective strategy would be a movie-like approach, capturing the full temporal \nevolution of the process leading to rupture. On the other hand, extensive studies have been conducted \nto understand the physical processes driving rockbursts based on high-fidelity numerical \nsimulations14–19, but the complexity of computational modelling and the difficulty in model \ncalibration against observational data hinder their practical application for rockburst forecasting. \nOver the past decades, significant advances have been made to forecast catastrophic failures with \nmore physically based models proposed and tested. For example, the power law time-to-failure model, \nwhich was originally developed based on empirical observations20–22 but later backed by physical \narguments23–28, has been widely adopted to predict the timing of various catastrophic events such as \nlandslides29 and volcanic eruptions30 as well as rockbursts31. This model exemplifies the movie-like \n\n\n \nLei & Sornette: Pre-print at arXiv \n3 \n \napproach by incorporating the complete acceleration history leading up to rupture. Several physical \nmechanisms have been proposed to explain this commonly-observed power law time-to-failure \ndynamics. One is based on the analogy drawn between catastrophic material failures and critical \npoints in thermodynamics, heuristically linking the emergence of power laws during material rupture \nto those near critical phase transitions32,33. Other possible mechanisms include stress corrosion \ndamage23–26 and frictional sliding instability27,28. However, large uncertainties have been found in \napplying this power law model for time-to-failure prediction34,35, primarily due to the sporadic nature \nof rupture phenomena, which challenges the underlying assumption of a smooth, monotonic power \nlaw acceleration behaviour. \nThe Log-Periodic Power Law Singularity (LPPLS) model extends the conventional power law \nframework by incorporating log-periodic components, enabling it to capture the intermittent rupture \ndynamics in heterogeneous systems36–38, as demonstrated for earthquakes39, rockbursts40, and glacier \nbreakoffs41. By extensively testing on a global dataset of various geohazard events including \nlandslides, rockbursts, glacier breakoffs, and volcanic eruptions, we have recently proven that the \nLPPLS model significantly outperforms the conventional power law model42. This is because the \nLPPLS model can leverage the unsteady, non-monotonic signals inherent in rupture dynamics to \nrefine its description and prediction of material failure. These signals of intermittency—traditionally \nperceived as noise—intrinsically arise from the localised and threshold nature of the mechanics of \nrupture in heterogeneous materials38,43. \nThis technical note aims to present further empirical evidence regarding the significance of log-\nperiodicity in rockbursts and develop theoretical insights into the underlying mechanisms that drive \nrockbursts. The remainder of this note is organised as follows. In section 2, we introduce the \nmathematical formulation of the LPPLS model together with the procedures for parametric \ncalibration and nonparametric examination. In section 3, we perform both parametric and \nnonparametric tests on 11 historical rockburst events documented at 3 underground mines. Finally, \nin section 4, we assess the statistical significance of log-periodicity in rockbursts, explore the \nunderlying physical mechanisms, and discuss the implications for rockburst prediction. \n2. Methodology \nThe rate-dependent rock failure behaviour often obeys the following nonlinear relation21,22: \n\n\n \nLei & Sornette: Pre-print at arXiv \n4 \n \n2\n2\nd\nd\nd\nd\nt\nt\n\n\n\n\n\n\n=\n\n\n\n\n, with \n1\n, \n(1) \nwhere Ω is an observable quantity (e.g. displacement, strain, and energy release), t is time, μ > 0 is a \nconstant, and α is an exponent measuring the degree of nonlinearity. The condition of α > 1 guarantees \nthe appearance of a finite-time singularity, which becomes evident by integrating equation (1) to \nhave: \nc\nd\nd\n(\n)\nt\nt\nt \n\n=\n−\n, \n(2) \nwhere γ = (β/μ)β, β = 1/(α‒1), with β > 0 (for α > 1) ensuring a singular behaviour as the critical time \ntc is approached. A further integration of equation (2) yields the so-called power law time-to-failure \nmodel23,44: \nc\n( )\n(\n)m\nt\nA\nB t\nt\n\n=\n+\n−\n, with \n1\nm , \n(3) \nwhere m = 1‒β = (α‒2)/(α‒1) is the critical exponent, and A and B = ‒γ/m are constants. This power \nlaw relationship shows continuous scale invariance, meaning that scaling tc‒t by an arbitrary factor λ \ncauses the difference between the observable and the value A to scale by a factor of λm, independent \nof tc‒t. \nLet us now consider a generalised scenario, where the critical exponent is extended from real to \ncomplex numbers, written as m+iω. This generalisation, anticipated in dissipative systems with out-\nof-equilibrium dynamics and quenched disorder45, is evident from the general solution of Ω to \nrenormalization group equations near critical points39,46. Keeping the first Fourier expansion of this \ngeneral solution leads to the following LPPLS formula36,37: \n\n\n\n\nc\nc\n( )\ncos\nln(\n)\n(\n)m\nt\nA\nB\nC\nt\nt\nt\nt\n\n\n\n=\n+\n+\n−\n−\n−\n, with \n1\nm . \n(4) \nwhich introduces a log-periodic component associated with a relative amplitude of C/B, an angular \nlog frequency ω, and a phase shift ϕ, oscillating around the overall power law characterised by the \namplitude factor B. The local maxima of this log-periodic component form a geometric time series \n{t1, t2, …, tk, …} satisfying tc‒tk = λ-kexp(ϕ/ω), where λ = exp(2π/ω) > 1 is a fundamental scaling ratio \nand k is an integer. In this way, the LPPLS formula captures the intermittent accelerations and \nquiescences, with their alternating frequency increasing geometrically as tc is approached. The \nexistence of log-periodic oscillations is a hallmark of discrete scale invariance39,47, which represents \n\n\n \nLei & Sornette: Pre-print at arXiv \n5 \n \na partial break of continuous scale invariance, such that the observable remains invariant only when \nscaling tc‒t by a set of specific factors that are integer powers of λ. Log-periodicity indicates that the \nsystem and/or the underlying physical mechanisms are associated with characteristic length/time \nscales, arising from the localised and threshold nature of the mechanics of rupture in heterogeneous \nmaterials38,43. It is worth noting that the LPPLS formula includes only the first-order correction to the \nmonotonous power law, since higher-order terms with progressively smaller amplitudes are generally \nless significant48. \nWe implement a two-step parametric calibration scheme to fit the LPPLS equation against the \ntime series data of the observable quantity, briefly summarised as follows (see Appendix A for \ndetails). First, we define an optimal time window for the LPPLS fitting by employing the Lagrange \nregularisation method49 to detect the starting time t0, with the final time fixed at the last available data \npoint prior to the final event. Second, we estimate the LPPLS model parameters using the ordinary \nleast squares method to minimise the cost function defined as the sum of the squares of the differences \nbetween the model and observation50. \nWe also perform a nonparametric test to qualify further the existence of log-periodic oscillations \nin time series data. First, we remove the power law trend in time series by applying the following \ntransformation51: \nc\nc\n( )\n(\n)\n( )\n(\n)\nm\nm\nt\nA\nB t\nt\nt\nC t\nt\n\n\n−\n−\n−\n=\n−\n, \n(5) \nwhere ε is the normalised residual that ideally obeys a pure cosine function of the logarithm of the \nnormalised time τ = (tc‒t)/(tc‒t0), if the LPPLS formula matches the data perfectly. As the data Ω(t) \nis usually sampled regularly in time, the corresponding ε signals are usually unevenly spaced when \nusing the log time scale lnτ, making the standard fast Fourier transform unsuitable for our analysis. \nThus, we employ the Lomb spectral method52, which does not require equidistant sampling (see \nAppendix B), making it well-suited here to detect periodicity on a logarithmic time scale approaching \na singularity. From the Lomb periodogram, we can derive a set of parameters to quantitatively \ncharacterise log-periodicity and assess its statistical significance, including the dominant angular log \nfrequency ω, the fundamental scaling ratio λ, the maximum peak height Pmax, the false-alarm \nprobability pFA, and the signal-to-noise ratio κ (see Appendix B). \n\n\n \nLei & Sornette: Pre-print at arXiv \n6 \n \n3. Results \nThe first case is an underground coal mine located at a depth of ~250 m in Australia53. This mine \nwas developed using the long wall mining method. The roof displacement of a gateroad—a \nrectangular tunnel of 5.2 m wide and 3 m high providing access to the longwall face—was monitored \nusing multipoint extensometers at an accuracy of 0.5 mm. Two catastrophic failure events that \noccurred on 4th and 11th June 2004 (denoted respectively as event 1 and 2) were recorded at two \ndifferent locations along the gateroad. A clear precursory accelerating and oscillating pattern in the \ndisplacement time series is observed prior to the failure event 1, for which the LPPLS model gives \nan excellent fit to the data with the intermittency being well captured (Fig. 1a). One can see that this \nlog-periodic behaviour lasted for about 2.5 days before the tunnel roof collapse. Log-periodic \noscillations are evident in the ϵ-lnτ plot that in general well described by a cosine function (Fig. 1a, \ninset), while some minor discrepancies might arise from the effects of higher-order harmonics of the \noscillations. From the Lomb periodograms (Fig. 1b), we can clearly identify a dominant peak at the \nangular log frequency ω = 4.84 (with the corresponding scaling ratio λ = 3.67). Regarding event 2, \nthe LPPLS model also effectively captures the tunnel roof displacement evolution (Fig. 1c), while the \npresence of log-periodicity is confirmed by the cyclic ϵ-lnτ pattern (Fig. 1c, inset). On the Lomb \nperiodogram, a peak is also observed at ω = 4.84 corresponding to λ = 3.67 (Fig. 1d), which is highly \nconsistent with that for event 1 (Fig. 1b). Interestingly, a harmonic can be found at an angular log \nfrequency of 9.32 (Fig. 1d), which corresponds approximately to the second harmonic 2ω, further \nindicating the importance of log-periodicity in this data. \nThe second example is a rockburst event that occurred on 4th April 2007 in a deep platinum mine \nat South Africa54. The time-dependent deformational behaviour of the tabular stope has been \nmonitored by mechanical clockwork meters with an accuracy of 0.3 mm. The existence of log-\nperiodicity is demonstrated by the excellent fit of the LPPLS model to the time series of stope closure \n(Fig. 2a) and the sinusoidal-like signals in the ϵ-lnτ plot (Fig. 2a, inset). The Lomb periodogram \nreveals a dominant peak at ω = 4.74, with the corresponding λ = 3.76 (Fig. 2b). \n\n\n \nLei & Sornette: Pre-print at arXiv \n7 \n \n \nFig. 1. Monitoring data showing the temporal evolution of roof displacement prior to violent failure \nevents on (a) 4th June 2004 (event 1) and (c) 11th June 2004 (event 2) at an underground coal mine \nin Australia. Insets in the left panel display the variation of normalised residual ε as a function of the \nlogarithm of normalised time τ = (tc‒t)/(tc‒t0). The Lomb periodogram analysis for detecting log-\nperiodic oscillatory components in the data for (b) event 1 and (d) event 2. \n(a)\n(b)\nω = 4.84 (λ = 3.67)\n(c)\n(d)\nω = 4.84 (λ = 3.67)\nEvent 1\nEvent 1\nEvent 2\nEvent 2\n\n\n \nLei & Sornette: Pre-print at arXiv \n8 \n \n \nFig. 2. (a) Time series of stope closure measured by a clock meter in a deep platinum mine at South \nAfrica, where a violent rockburst event occurred on 4th April 2007. Inset displays the variation of \nnormalised residual ε as a function of log normalised time τ = (tc‒t)/(tc‒t0). (b) The Lomb periodogram \nanalysis for detecting log-periodic oscillatory components in the data. \nThe third study case is a deep gold mine at South Africa40, where eight major rockburst events \nwere documented in 1997. The precursory temporal evolution of Benioff strain release is computed \nfor each of these major events based on the catalogue recorded by a local seismic network40. For event \n1, the existence of log-periodicity in the Benioff strain data is demonstrated by the LPPLS fit (Fig. \n3a, left) and the cyclic ϵ-lnτ pattern (inset of Fig. 3a, left), with the Lomb periodogram yielding ω = \n7.13 and λ = 2.41 (Fig. 3a, right). For event 2, the LPPLS formula also gives a good description of \nthe data (Fig. 3b, left), while the log-peridicity is somewhat still visible in the ϵ-lnτ plot (inset of Fig. \n3b, left), in spite of the scarcity of the data; the Lomb spectral analysis reveals a dominant peak at ω \n= 12.07 with λ = 1.68 (Fig. 3b, right). For event 3, the significance of log-periodicity is well supported \nby the excellent LPPLS fit (Fig. 3c, left) and the cyclic ϵ-lnτ signals (inset of Fig. 3c, left), while the \nLomb periodogram indicates ω = 9.42 with λ = 1.95 (Fig. 3c, right). For event 4, the LPPLS model \nin general tracks well the time series data (Fig. 3d, left), with log-periodic structures having significant \nirregularities in the ϵ-lnτ plot (inset of Fig. 3d, left) and a Lomb peak clear observed at ω = 9.59 \ncorresponding to λ = 1.93 (Fig. 3d, right). For event 5, the precursory log-periodic power law \naccelerating behaviour is very clear in the data, as reflected by the close match by the LPPLS model \n(a)\n(b)\nω = 4.74 (λ = 3.76)\n\n\n \nLei & Sornette: Pre-print at arXiv \n9 \n \n(Fig. 3e, left) and the sinusoidal-type signals in the ϵ-lnτ plot (inset of Fig. 3e, left); the Lomb \nperiodogram reveals a dominant peak at ω = 8.81 with λ = 2.04 (Fig. 3e, right). For event 6, the \nexistence of log-periodicity is also demonstrated by the LPPLS fit (Fig. 3f, left) and the ϵ-lnτ pattern \n(inset of Fig. 3f, left), while the Lomb periodogram reveals one dominant peak at ω = 8.42 and another \npeak at around 2ω that can be interpreted as the second harmonic, so that the fundamental scaling \nratio is λ = 2.11 (Fig. 3f, right). For event 7, the LPPLS model also provides a good description of the \ndata (Fig. 3g, left), though some scatter is evident, likely due to uncertainties associated with the \nseismic data, which is also reflected in the ϵ-lnτ plot (inset of Fig. 3g, right); on the Lomb periodogram, \na major peak is found at ω = 5.04 corresponding to λ = 3.48 (Fig. 3g, right). For event 8, despite of \nthe data scarcity, the log-periodicty is still evident, as demonstrated by the LPPLS fit to the data (Fig. \n3h, left) and the cyclic ϵ-lnτ pattern that closely follows a cosine function (inset of Fig. 3h, left), with \na dominant Lomb peak identified at ω = 5.74 indicating λ = 2.99 (Fig. 3h, right). \nIn Table 1, we provide a summary of the key parameters derived from the LPPLS parametric \ncalibration and the Lomb nonparametric test for all the 11 rockburst events studied in this work. We \ncan see that the critical exponent m in general varies from -1 to 0.6 correspond to α ranging from 1.5 \nto 3.5. The angular log-periodic frequency ω falls between 4.5 and 12, with the fundamental scaling \nratio λ ranging from 1.6 to 3.6 (with six cases around 2 and the other five cases around 3.5), for which \nthe values derived from the LPPLS calibration are in a good consistency with those from the Lomb \nperiodogram. The relative amplitude C/B of log-periodic oscillations varies from 0.5% to 15% (with \nfive cases larger than 5%). For the two events at the Australian coal mine as well as the event at the \nSouth African platinum mine, the significance of log-periodicity is demonstrated by the large values \nfor the Lomb peak height Pmax, the first-to-second highest peak ratio η, and the signal-to-noise ratio \nκ, in addition to their (near-)zero values for the false-alarm probability pFA. For event 1, although the \nidentified ω is close to the noise-related one ωnoise, the high signal-to-noise ratio of 2.27 suggests that \nthe detected log-periodicity is unlikely to originate from noise. For the South African gold mine, \namong the eight events, three have Pmax larger than 15, five have η greater than 2, and five have pFA \nnot exceeding 0.1, three have κ larger than 1.5, and most have the identified ω far from ωnoise, which \ncollectively indicates the presence of genuine log-periodicity. \n\n\n \nLei & Sornette: Pre-print at arXiv \n10 \n \n \nFig. 3. Temporal evolution of Benioff strain release at a deep gold mine at South Africa prior to eight \nmajor rockburst events together with the Lomb periodogram analysis for detecting log-periodic \noscillatory components in the data. Insets display the variation of normalised residual ε as a function \nof logarithm of normalised time τ = (tc‒t)/(tc‒t0). \nω = 9.59 (λ = 1.93)\na\nω = 7.13 (λ = 2.41)\nEvent 1\nω = 9.42 (λ = 1.95)\nb\nEvent 3\nc\nEvent 4\nd\nEvent 2\nω = 12.07 (λ = 1.68)\nEvent 5\ne\nEvent 6\nf\nω = 8.81 (λ = 2.04)\nω = 8.42 (λ = 2.11)\nEvent 7\ng\nEvent 8\nh\nω = 5.04 (λ = 3.48)\nω = 5.74 (λ = 2.99)\n\n\n \nLei & Sornette: Pre-print at arXiv \n11 \n \nTable 1. Parameters derived from the parametric and nonparametric tests for the 11 rockburst events. \nEvent \nmLPPLS ωLPPLS λLPPLS C/B (%) ωLomb λLomb Pmax \nη \npFA \nκ \nωnoise \nCoal mine (event 1) -0.12 \n4.94 \n3.57 \n2.08 \n4.83 3.67 25.03 10.85 0.00 2.68 2.26 \nCoal mine (event 2) \n-1.1 \n4.94 \n3.57 \n8.17 \n4.84 3.67 23.07 4.18 0.00 2.27 5.15 \nPlatinum mine \n-0.08 \n4.94 \n3.57 \n0.44 \n4.74 3.76 50.62 5.86 0.00 2.75 5.09 \nGold mine (event 1) \n0.5 \n7.26 \n2.38 \n6.90 \n7.13 2.41 6.70 1.85 0.03 1.88 2.01 \nGold mine (event 2) -0.44 12.12 \n1.68 \n6.13 \n12.07 1.68 2.89 2.31 0.55 1.19 3.52 \nGold mine (event 3) \n0.07 \n11.61 \n1.72 \n0.48 \n11.71 1.71 29.02 2.28 0.00 1.52 4.78 \nGold mine (event 4) \n0.59 \n9.14 \n1.99 \n1.38 \n9.59 1.93 17.41 2.24 0.00 0.88 4.08 \nGold mine (event 5) -0.10 \n8.78 \n2.05 \n0.83 \n8.81 2.04 20.95 3.09 0.00 1.55 3.90 \nGold mine (event 6) \n0.42 \n8.37 \n2.12 \n5.22 \n8.40 2.11 3.83 1.01 0.20 0.70 1.88 \nGold mine (event 7) \n0.43 \n4.98 \n3.53 \n3.80 \n5.04 3.48 6.34 1.40 0.08 0.87 3.27 \nGold mine (event 8) \n0.64 \n5.65 \n3.04 \n15.71 \n5.74 2.99 4.58 1.30 0.21 1.15 2.39 \nNote: m is the critical exponent, ω is the angular log-periodic frequency, λ is the fundamental scaling \nratio, Pmax is the Lomb peak height, η is the first-to-second highest peak ratio, pFA is the false-alarm \nprobability, κ is the signal-to-noise ratio, and ωnoise is the most probable artificial angular log-periodic \nfrequency. The subscripts “LPPLS” and “Lomb” denote the values obtained from the LPPLS \nparametric calibration and the Lomb nonparametric test, respectively. \n4. Discussion \nOur analysis of 11 historical rockburst events indicate that the dynamics of observable quantities \n(displacement, strain, and energy release) characterised by accelerated increase with log-periodic \noscillations seem to be a common precursor to violent rockbursts. We have used the log-periodic \npower law finite-time singularity (LPPLS) model to represent these characteristics and find good \nagreements between the LPPLS model and the monitoring data across multiple events and mines \n(Figs. 1-3). Note that, in our previous study, we have carefully ruled out the possibility of overfitting \nby the LPPLS model as informed by the use of the Akaike and Bayesian information criteria42. The \nsignificance of log-periodic oscillations is qualified by the sinusoidal shape of residuals (after \n\n\n \nLei & Sornette: Pre-print at arXiv \n12 \n \nremoving the power law trend) on a logarithmic time scale to the time of the singularity for all the \nevents studied (see insets of Figs. 1-3). In some cases, discrepancies can be observed, which may be \neither related to the scarcity of data or caused by the presence of higher-order harmonics. These \nhigher-order harmonics are not accounted for in the LPPLS formula that incorporates only the first-\norder log-periodic correction to the pure power law, but they are identifiable in the Lomb \nperiodograms. The significance of log-periodicity is independently demonstrated by the results of \nnonparametric Lomb tests. For example, the high Lomb peaks for most rockburst cases, with more \nthan half exceeding 15 and only one marginally below 3 (Table 1), support the statistical significance \nof log-periodic components55. If the data are associated with Gaussian noise, only three events have \na false-alarm probability exceeding 0.1 (Table 1). For non-Gaussian noise, the false alarm probability \nis affected by the distributional and dependence properties of the noise and is in general higher48, \npotentially weakening the evidence for genuine log-periodicity. However, the evidence is \nstrengthened by examining the first-to-second Lomb peak ratio (where more than half exceed 2) and \nby observing consistently high signal-to-noise ratios (mostly above 1), confirming the presence of \ngenuine log-periodicity48,55. For most cases, the detected angular log-periodic frequency is very \ndifferent from the most probable log frequency that can appear from pure noise (Table 1) which, \ntogether with the high signal-to-noise ratios, excludes the possible noise origin of the detected log-\nperiodic components. \nWe further utilise the detected log-periodic characteristics to gain insigthts into the underlying \nmechanisms that drive rockburst occurrence. As already mentioned in section 2, log-periodicity is a \nhallmark of discrete scale invariance39,47, which is the observable signature of by complex critical \nexponents generically emerging in nonunitary (dissipative) systems with out-of-equilibrium \ndynamics and quenched disorder45. One possible mechanism for discrete scale invariance is the \ncascade of ultraviolet Mullins-Sekerka instabilities that could spontaneously emerge in subparallel \ncrack propagation and interaction, where smaller cracks grow more slowly due to stress shadowing \neffect exerted by nearby fractures, while larger fractures are less affected and grow faster56. This \nstress shadowing effect and fracture interaction phenomenon has been previously reported for an \noutcrop of a subparallel joint set in a granitic rock at Sierra Nevada57, while the evidence of log-\nperiodicity has also been discovered in the spacing distribution of an outcrop in granitic rock at Saudi \n\n\n \nLei & Sornette: Pre-print at arXiv \n13 \n \nArabia58. This theory formulated for a system of parallel cracks56 predicts λ = 2, which may explain \nthe observed λ ≈ 2 for six rockburst events that occurred in the South African gold mine (Table 1). \nThis aligns with the general view that rockbursts (especially strainbursts) are caused by mode I wing \ncrack propagation, driven by tensile failure along the maximum principal stress direction, subparallel \nto the excavation boundary2,12. This mechanism is expected to dominate in relatively intact rocks, \nconsistent with the competent rock condition in this hard rock mine40. Even though rocks inevitably \ncontain some pre-existing flaws, the system may still be approximated as a growing set of subparallel \ncracks59,60. \nAn alternative mechanism (more relevant for fault-slip bursts) to explain λ ≈ 2 is the theory \nof diffusion-limited aggregation61,62, which may characterise the diffusive migration of microseismic \nevents in the mine40, potentially resulting from stress triggering effects63. Another potential \nmechanism involves the interaction between stress drop during seismic phases and stress corrosion \nduring the aseismic periods64, with a mean-field prediction of λ = 3.6, which may explain the observed \nλ ≈ 3.5 for five other rockburst events (see Table 1). This is consistent with another commonly adopted \nconceptual picture that strainbursts are driven by nonplanar wing crack propagation (driven by stress \ncorrosion) that emanate from the tips of pre-existing fractures experiencing frictional sliding \n(associated with stress drop) and eventually connect them to form a system-sized rupture plane65. For \nfault-slip bursts, this could correspond to the interplay of stress drop along fault sliding patches and \nstress corrosion in fault asperities66. Some other mechanisms could also contribute to the emergence \nof log-periodicity, including the interplay of inertia, damage, and healing67,68 and the interaction of \nstructural heterogeneities and stress concentrations69. The pre-existing fracture network in rock may \nalso exhibits a hierarchical pattern70,71, which may affect log-periodic properties, but discrete scale \ninvariance can spontaneously arise in the absence of any pre-defined hierarchies47. \nFinally, we highlight the potential practical use of log-periodic signals for forecasting \nrockbursts. By “locking” into the oscillatory rock mass response when approaching catastrophic \nfailure, the LPPLS model can leverage the information of intermittency—traditionally perceived as \nnoise—to constrain and improve the prediction of the timing of rockbursts42,43. Moreover, early \nwarning criteria may also be developed for rockburst hazard management based on log-periodic \nsignatures, a method that has been tested in the context of financial bubbles72. \n\n\n \nLei & Sornette: Pre-print at arXiv \n14 \n \nAcknowledgement \nD.S. acknowledges partial support from the National Natural Science Foundation of China (Grant \nNo. U2039202, T2350710802), from the Shenzhen Science and Technology Innovation Commission \n(Grant No. GJHZ20210705141805017) and the Center for Computational Science and Engineering \nat the Southern University of Science and Technology. \nAppendix A. Parametric LPPLS model calibration \nWe implement a stable and robust scheme for calibrating the LPPLS parameters against time \nseries data49,50. First. by introducing C1 = Ccosϕ and C2 = Csinϕ, we rewrite the LPPLS formula as: \n\n\n\n\nc\n1\nc\nc\n2\nc\nc\n( )\n(\n)\n(\n) cos\nln(\n)\n(\n) sin\nln(\n)\nm\nm\nm\nt\nA\nB t\nt\nC t\nt\nt\nt\nC t\nt\nt\nt\n\n\n\n=\n+\n−\n+\n−\n−\n+\n−\n−\n, \n(A1) \nwhere the new parameter set θLPPLS = {A, B, C1, C2, tc, m, ω} has seven parameters but with the first \nfour being linear and the last three being nonlinear. This greatly simplifies the calibration by reducing \nthe number of nonlinear parameters from four in the original formula, i.e. equation (4), to three. We \nthen define a cost function as the sum of squared errors: \n\n\n\n\n\n\n2\nLPPLS\nc\n1\nc\nc\n2\nc\nc\n1\n(\n;\n, )\n(\n)\n(\n) cos\nln(\n)\n(\n) sin\nln(\n)\nN\nm\nm\nm\ni\ni\ni\ni\ni\ni\ni\nF\nA\nB t\nt\nC t\nt\nt\nt\nC t\nt\nt\nt\n\n\n=\n=\n−\n−\n−\n−\n−\n−\n−\n−\n−\n\nθ\nΩ t\n, (A2) \nwhere Ω = {Ω1, Ω2, …, ΩN} are N measurements recorded at a series of time stamps t = {t1, t2, …, \ntN} within a time window [t0, tf]. We minimise this cost function based on the ordinary least squares \nmethod to estimate the LPPLS parameters: \nLPPLS\nLPPLS\nLPPLS\nˆ\narg min\n(\n;\n, )\nF\n=\nθ\nθ\nθ\nΩ t . \n(A3) \nWe enslave the four linear parameters, A, B, C1, and C2, to the three nonlinear ones, tc, m, and ω, to \nreduce this minimisation problem to: \nc\nc\n1\nc\n,\n,\nˆ\nˆ\nˆ\n{ ,\n, }\narg min\n( ,\n,\n)\nt m\nt m\nF t m\n\n\n\n=\n, \n(A4) \nwith \n1\n2\n1\nc\n1\n2\nc\nc\n1\n2\n, ,\n,\nˆ\nˆ\nˆ\nˆ\n( ,\n,\n)\nmin\n( , ,\n,\n, ,\n,\n)\n( ,\n,\n, , ,\n,\n)\nA B C C\nF t m\nF A B C C t m\nF t m\nA B C C\n\n\n\n=\n=\n. \n(A5) \nThe estimates for the linear parameters for fixed tc, m, and ω can be obtained from the following \nminimisation problem for fixed values of the nonlinear ones: \n1\n2\n1\n2\n1\n2\nc\n, ,\n,\nˆ\nˆ\nˆ\nˆ\n{ , ,\n,\n}\narg min\n( , ,\n,\n, ,\n, )\nA B C C\nA B C C\nF A B C C t m \n=\n, \n(A6) \n\n\n \nLei & Sornette: Pre-print at arXiv \n15 \n \nwhich can be analytically solved from the following system of equations: \n2\n2\n1\n2\n2\nˆ\nˆ\nˆ\nˆ\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\nA\nN\nf\ng\nh\nB\nf\nf\nf g\nf h\nf\ng\nf g\ng\ng h\ng\nC\nh\nf h\ng h\nh\nh\nC\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n=\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n, \n(A7) \nwith fi = (tc‒ti)m, gi = (tc‒ti)mcos[ωln(tc‒ti)], and hi = (tc‒ti)msin[ωln(tc‒ti)]. A filter of 4.94 ≤ ω ≤ 15 is \napplied during the parametric calibration to exclude physically less relevant oscillation scenarios46,50. \nTo determine the optimal time window [t0, tf] for the LPPLS calibration, we detect the best start \ntime t0 based on the Lagrange regularisation method49, with the end time tf fixed at the last available \nmeasurement before the final failure. More specifically, the following cost function is minimised: \n0\n0\n0\n( )\n( )\n( )\n7\nt\nt\nt\nF\nF\nN\nN\n\n\n=\n−\n−\n, \n(A8) \nwhere F is given by equation (A2), 7 corresponds to the number of LPPLS parameters, and χ is the \nLagrange multiplier that may be approximated via a linear regression. \nThere is a possibility that log-periodicity identified from the parametric calibration arises as an \nartifact due to noise in the data, which can be assessed by examining the calibrated angular log \nfrequency against the most probable artificial one calculated as73: \nnoise\nc\n0\nc\nf\n2\n1.5\nln(\n)\nln(\n)\nt\nt\nt\nt\n\n\n\n=\n−\n−\n−\n. \n(A9) \nAppendix B. Nonparametric Lomb spectral analysis \nThe Lomb method performs locally least-squares fits to data points of a time series with sinusoids \ncentered at each data point52. Given a time series of normalised residual εi sampled at log times lnτi, \nwhere i = 1, 2, …, N, and τi = (tc‒ti)/(tc‒t0), the normalised Lomb periodogram is computed as55: \n(\n)\n(\n)\n2\n2\nm\nm\n1\n1\n2\n2\n2\n1\n1\ncos (ln\n)\nsin\n(ln\n)\n1\n( )\n2\ncos\n(ln\n)\nsin\n(ln\n)\nN\nN\ni\ni\ni\ni\nN\nN\ni\ni\nP\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n−\n−\n−\n−\n\n\n\n\n\n\n\n\n\n\n\n\n=\n+\n\n\n\n\n−\n−\n\n\n\n\n\n\n\n\n, \n(B1) \nwith \n\n\n \nLei & Sornette: Pre-print at arXiv \n16 \n \n1\n1\nsin 2 ln\n1 arctan\n2\ncos2 ln\nN\ni\nN\ni\n\n\n\n\n\n\n\n\n\n\n\n\n=\n\n\n\n\n\n\n\n\n, \n(B2) \nwhere ω = 2πf is the angular log frequency, and εm and σ2 are respectively the mean and variance of \nε. The dominant angular log frequency ω can be identified in the Lomb periodogram by searching for \nthe maximum peak height Pmax. For data corrupted with independently and normally distributed \nGaussian noise, the false-alarm probability pFA for the detected highest peak is given by55: \n\n\nFA\nmax\n1\n1\nexp(\n)\nM\np\nP\n= −\n−\n−\n. \n(B3) \nwhere M is the effective number of independent frequencies that can be scanned. The value of M \ngenerally depends on the number of sampled frequencies, the number N of data points and the spacing \nof the data points. However, M ≈ N when the data points are approximately equally spaced and the \nsampled frequencies oversample the available frequency range74. Furthermore, the signal-to-noise \nratio κ can also be computed as55: \n1/2\nmax\nmax\n4\n2\nP\nN\nP\n\n\n\n= \n\n−\n\n\n, \n(B4) \nwhich is in general valid for different types of noise48,55. \nReferences \n1. Cook NGW. A note on rockbursts considered as a problem of stability. Journal of the Southern \nAfrican Institute of Mining and Metallurgy. 1965;65(8):437-446. \n2. Ortlepp WD, Stacey TR. Rockburst mechanisms in tunnels and shafts. Tunnelling and \nUnderground Space Technology. 1994;9(1):59-65. doi:10.1016/0886-7798(94)90010-8 \n3. Linkov AM. Rockbursts and the instability of rock masses. International Journal of Rock \nMechanics \nand \nMining \nSciences \n& \nGeomechanics \nAbstracts. \n1996;33(7):727-732. \ndoi:10.1016/0148-9062(96)00021-6 \n4. Mazaira A, Konicek P. Intense rockburst impacts in deep underground construction and their \nprevention. Can Geotech J. 2015;52(10):1426-1439. doi:10.1139/cgj-2014-0359 \n5. Vardoulakis I. Rock bursting as a surface instability phenomenon. International Journal of Rock \nMechanics \nand \nMining \nSciences \n& \nGeomechanics \nAbstracts. \n1984;21(3):137-144. \ndoi:10.1016/0148-9062(84)91531-6 \n\n\n \nLei & Sornette: Pre-print at arXiv \n17 \n \n6. Ranjith PG, Zhao J, Ju M, De Silva RVS, Rathnaweera TD, Bandara AKMS. Opportunities and \nchallenges \nin \ndeep \nmining: \nA \nbrief \nreview. \nEngineering. \n2017;3(4):546-551. \ndoi:10.1016/J.ENG.2017.04.024 \n7. Kaiser PK. Canadian Rockburst Support Handbook. Geomechanics Research Centre; 1996. \n8. Li CC, Mikula P, Simser B, et al. Discussions on rockburst and dynamic ground support in deep \nmines. Journal of Rock Mechanics and Geotechnical Engineering. 2019;11(5):1110-1118. \ndoi:10.1016/j.jrmge.2019.06.001 \n9. Feng XT, Liu J, Chen B, Xiao Y, Feng G, Zhang F. Monitoring, warning, and control of rockburst \nin deep metal mines. Engineering. 2017;3(4):538-545. doi:10.1016/J.ENG.2017.04.013 \n10. Malan DF, Napier JAL. A review of the role of underground measurements in the historical \ndevelopment of rock engineering in South Africa. J S Afr Inst Min Metall. 2021;121(5):201-216. \ndoi:10.17159/2411-9717/1443/2021 \n11. Askaripour M, Saeidi A, Rouleau A, Mercier-Langevin P. Rockburst in underground excavations: \nA review of mechanism, classification, and prediction methods. Underground Space. \n2022;7(4):577-607. doi:10.1016/j.undsp.2021.11.008 \n12. He M, Cheng T, Qiao Y, Li H. A review of rockburst: Experiments, theories, and simulations. \nJournal of Rock Mechanics and Geotechnical Engineering. 2023;15(5):1312-1353. \ndoi:10.1016/j.jrmge.2022.07.014 \n13. Feng GL, Feng XT, Chen B rui, Xiao YX, Yu Y. A microseismic method for dynamic warning \nof rockburst development processes in tunnels. Rock Mech Rock Eng. 2015;48(5):2061-2076. \ndoi:10.1007/s00603-014-0689-3 \n14. Vazaios I, Diederichs MS, Vlachopoulos N. Assessment of strain bursting in deep tunnelling by \nusing the finite-discrete element method. Journal of Rock Mechanics and Geotechnical \nEngineering. 2019;11(1):12-37. doi:10.1016/j.jrmge.2018.06.007 \n15. Gao F, Kaiser PK, Stead D, Eberhardt E, Elmo D. Strainburst phenomena and numerical \nsimulation of self-initiated brittle rock failure. International Journal of Rock Mechanics and \nMining Sciences. 2019;116:52-63. doi:10.1016/j.ijrmms.2019.03.021 \n16. Gao F, Kang H, Li J. Numerical simulation of fault-slip rockbursts using the distinct element \nmethod. \nTunnelling \nand \nUnderground \nSpace \nTechnology. \n2021;110:103805. \n\n\n \nLei & Sornette: Pre-print at arXiv \n18 \n \ndoi:10.1016/j.tust.2020.103805 \n17. Li X, Li XF, Zhang QB, Zhao J. A numerical study of spalling and related rockburst under \ndynamic disturbance using a particle-based numerical manifold method (PNMM). Tunnelling and \nUnderground Space Technology. 2018;81:438-449. doi:10.1016/j.tust.2018.08.026 \n18. Manouchehrian A, Cai M. Analysis of rockburst in tunnels subjected to static and dynamic loads. \nJournal \nof \nRock \nMechanics \nand \nGeotechnical \nEngineering. \n2017;9(6):1031-1040. \ndoi:10.1016/j.jrmge.2017.07.001 \n19. Manouchehrian A, Cai M. Numerical modeling of rockburst near fault zones in deep tunnels. \nTunnelling \nand \nUnderground \nSpace \nTechnology. \n2018;80:164-180. \ndoi:10.1016/j.tust.2018.06.015 \n20. Fukuzono T. A method to predict the time of slope failure caused by rainfall using the inverse \nnumber \nof \nvelocity \nof \nsurface \ndisplacement. \nLandslides. \n1985;22(2):8-13_1. \ndoi:10.3313/jls1964.22.2_8 \n21. Voight B. A method for prediction of volcanic eruptions. Nature. 1988;332(6160):125-130. \ndoi:10.1038/332125a0 \n22. Voight B. A relation to describe rate-dependent material failure. Science. 1989;243(4888):200-\n203. doi:10.1126/science.243.4888.200 \n23. Bufe CG, Varnes DJ. Predictive modeling of the seismic cycle of the Greater San Francisco Bay \nRegion. J Geophys Res. 1993;98(B6):9871-9883. doi:10.1029/93JB00357 \n24. Cornelius RR, Scott PA. A materials failure relation of accelerating creep as empirical description \nof \ndamage \naccumulation. \nRock \nMech \nRock \nEngng. \n1993;26(3):233-252. \ndoi:10.1007/BF01040117 \n25. Kilburn CRJ, Voight B. Slow rock fracture as eruption precursor at Soufriere Hills Volcano, \nMontserrat. Geophys Res Lett. 1998;25(19):3665-3668. doi:10.1029/98GL01609 \n26. Main IG. A damage mechanics model for power-law creep and earthquake aftershock and \nforeshock \nsequences. \nGeophys \nJ \nInt. \n2000;142(1):151-161. \ndoi:10.1046/j.1365-\n246x.2000.00136.x \n27. Helmstetter A, Sornette D, Grasso J ‐R., Andersen JV, Gluzman S, Pisarenko V. Slider block \nfriction model for landslides: Application to Vaiont and La Clapière landslides. J Geophys Res. \n\n\n \nLei & Sornette: Pre-print at arXiv \n19 \n \n2004;109(B2):2002JB002160. doi:10.1029/2002JB002160 \n28. Noda H, Chang C. Tertiary creep behavior for various rate- and state-dependent friction laws. \nEarth and Planetary Science Letters. 2023;619:118314. doi:10.1016/j.epsl.2023.118314 \n29. Intrieri E, Carlà T, Gigli G. Forecasting the time of failure of landslides at slope-scale: A literature \nreview. Earth-Sci Rev. 2019;193:333-349. doi:10.1016/j.earscirev.2019.03.019 \n30. Tárraga M, Carniel R, Ortiz R, García A. The Failure Forecast Method: Review and Application \nfor the Real-Time Detection of Precursory Patterns at Reawakening Volcanoes. In: Developments \nin Volcanology. Vol 10. Elsevier; 2008:447-469. doi:10.1016/S1871-644X(07)00013-7 \n31. de Beer W, Mendecki AJ. Rockburst prediction - case studies using a kinematics of failure \napproach. Journal of the Southern African Institute of Mining and Metallurgy. 1998;98(2):65-74. \n32. Ausloos M. Phase transition theory approach to fracture of materials. Solid State Communications. \n1986;59(6):401-404. doi:10.1016/0038-1098(86)90572-7 \n33. Sornette D. Critical Phenomena in Natural Sciences - Chaos, Fractals, Selforganization and \nDisorder: Concepts and Tools. Springer; 2006. doi:10.1007/3-540-33182-4 \n34. Bell AF, Naylor M, Heap MJ, Main IG. Forecasting volcanic eruptions and other material failure \nphenomena: \nAn evaluation of the failure forecast \nmethod. \nGeophys \nRes \nLett. \n2011;38(15):2011GL048155. doi:10.1029/2011GL048155 \n35. Bell AF, Greenhough J, Heap MJ, Main IG. Challenges for forecasting based on accelerating \nrates of earthquakes at volcanoes and laboratory analogues. Geophys J Int. 2011;185(2):718-723. \ndoi:10.1111/j.1365-246X.2011.04982.x \n36. Anifrani JC, Le Floc’h C, Sornette D, Souillard B. Universal log-periodic correction to \nrenormalization group scaling for rupture stress prediction from acoustic emissions. J Phys I \nFrance. 1995;5(6):631-638. doi:10.1051/jp1:1995156 \n37. Sornette D, Sammis CG. Complex critical exponents from renormalization group theory of \nearthquakes: Implications for earthquake predictions. J Phys I France. 1995;5(5):607-619. \ndoi:10.1051/jp1:1995154 \n38. Johansen A, Sornette D. Critical ruptures. Eur Phys J B. 2000;18(1):163-181. \ndoi:10.1007/s100510070089 \n39. Saleur H, Sammis CG, Sornette D. Discrete scale invariance, complex fractal dimensions, and \n\n\n \nLei & Sornette: Pre-print at arXiv \n20 \n \nlog‐periodic fluctuations in seismicity. J Geophys Res. 1996;101(B8):17661-17677. \ndoi:10.1029/96JB00876 \n40. Ouillon G, Sornette D. The concept of “critical earthquakes” applied to mine rockbursts with \ntime-to-failure \nanalysis. \nGeophys \nJ \nInt. \n2000;143(2):454-468. \ndoi:10.1046/j.1365-\n246X.2000.01257.x \n41. Faillettaz J, Pralong A, Funk M, Deichmann N. Evidence of log-periodic oscillations and \nincreasing icequake activity during the breaking-off of large ice masses. J Glaciol. \n2008;54(187):725-737. doi:10.3189/002214308786570845 \n42. Lei Q, Sornette D. Generalized failure law for landslides, rockbursts, glacier breakoffs, and \nvolcanic eruptions. Published online 2024. doi:10.48550/ARXIV.2409.11455 \n43. Sornette D. Predictability of catastrophic events: Material rupture, earthquakes, turbulence, \nfinancial crashes, and human birth. Proc Natl Acad Sci. 2002;99(suppl_1):2522-2529. \ndoi:10.1073/pnas.022581999 \n44. Main IG. Applicability of time-to-failure analysis to accelerated strain before earthquakes and \nvolcanic eruptions. Geophys J Int. 1999;139(3):F1-F6. doi:10.1046/j.1365-246x.1999.00004.x \n45. Saleur H, Sornette D. Complex exponents and log-periodic corrections in frustrated systems. J \nPhys I France. 1996;6(3):327-355. doi:10.1051/jp1:1996160 \n46. Saleur H, Sammis CG, Sornette D. Renormalization group theory of earthquakes. Nonlinear \nProcess Geophys. 1996;3(2):102-109. doi:10.5194/npg-3-102-1996 \n47. Sornette D. Discrete-scale invariance and complex dimensions. Phys Rep. 1998;297(5):239-270. \ndoi:10.1016/S0370-1573(97)00076-8 \n48. Zhou WX, Sornette D. Generalized q analysis of log-periodicity: Applications to critical ruptures. \nPhys Rev E. 2002;66(4):046111. doi:10.1103/PhysRevE.66.046111 \n49. Demos G, Sornette D. Comparing nested data sets and objectively determining financial bubbles’ \ninceptions. Physica A Stat Mech Appl. 2019;524:661-675. doi:10.1016/j.physa.2019.04.050 \n50. Filimonov V, Sornette D. A stable and robust calibration scheme of the log-periodic power law \nmodel. Physica A Stat Mech Appl. 2013;392(17):3698-3707. doi:10.1016/j.physa.2013.04.012 \n51. Johansen A, Sornette D. Finite-time singularity in the dynamics of the world population, \neconomic and financial indices. Physica A: Statistical Mechanics and its Applications. \n\n\n \nLei & Sornette: Pre-print at arXiv \n21 \n \n2001;294(3-4):465-502. doi:10.1016/S0378-4371(01)00105-4 \n52. Lomb NR. Least-squares frequency analysis of unequally spaced data. Astrophys Space Sci. \n1976;39(2):447-462. doi:10.1007/BF00648343 \n53. Shen B, King A, Guo H. Displacement, stress and seismicity in roadway roofs during mining-\ninduced \nfailure. \nInt \nJ \nRock \nMech \nMin \nSci. \n2008;45(5):672-688. \ndoi:10.1016/j.ijrmms.2007.08.011 \n54. Malan DF, Napier JAL, Janse van Rensburg AL. Stope deformation measurements as a diagnostic \nmeasure of rock behaviour: A decade of research. J South Afr Inst Min Metall. 2007;107:743-765. \n55. Zhou WX, Sornette D. Statistical significance of periodicity and log-periodicity with heavy-tailed \ncorrelated noise. Int J Mod Phys C. 2002;13(02):137-169. doi:10.1142/S0129183102003024 \n56. Huang Y, Ouillon G, Saleur H, Sornette D. Spontaneous generation of discrete scale invariance \nin growth models. Phys Rev E. 1997;55(6):6433-6447. doi:10.1103/PhysRevE.55.6433 \n57. Segall P, Pollard DD. Joint formation in granitic rock of the Sierra Nevada. Geol Soc America \nBull. 1983;94(5):563. doi:10.1130/0016-7606(1983)94<563:JFIGRO>2.0.CO;2 \n58. Ouillon G, Sornette D, Genter A, Castaing C. The imaginary part of rock jointing. J Phys I France. \n1996;6(8):1127-1139. doi:10.1051/jp1:1996119 \n59. Ashby MF, Sammis CG. The damage mechanics of brittle solids in compression. PAGEOPH. \n1990;133(3):489-521. doi:10.1007/BF00878002 \n60. Brantut N, Baud P, Heap MJ, Meredith PG. Micromechanics of brittle creep in rocks. J Geophys \nRes. 2012;117(B8):2012JB009299. doi:10.1029/2012JB009299 \n61. Johansen A, Sornette D. Evidence of discrete scale invariance in DLA and time-to-failure by \ncanonical averaging. Int J Mod Phys C. 1998;09(03):433-447. doi:10.1142/S0129183198000339 \n62. Sornette D, Johansen A, Arneodo A, Muzy JF, Saleur H. Complex fractal dimensions describe \nthe hierarchical structure of diffusion-limited-aggregate clusters. Phys Rev Lett. 1996;76(2):251-\n254. doi:10.1103/PhysRevLett.76.251 \n63. Helmstetter A, Sornette D. Foreshocks explained by cascades of triggered seismicity. J Geophys \nRes. 2003;108(B10):2003JB002409. doi:10.1029/2003JB002409 \n64. Lee MW, Sornette D. Novel mechanism for discrete scale invariance in sandpile models. Eur \nPhys J B. 2000;15(1):193-197. doi:10.1007/s100510051115 \n\n\n \nLei & Sornette: Pre-print at arXiv \n22 \n \n65. Nemat‐Nasser S, Horii H. Compression‐induced nonplanar crack extension with application to \nsplitting, \nexfoliation, \nand \nrockburst. \nJ \nGeophys \nRes. \n1982;87(B8):6805-6821. \ndoi:10.1029/JB087iB08p06805 \n66. Scholz CH. The Mechanics of Earthquakes and Faulting. 3rd ed. Cambridge University Press; \n2019. doi:10.1017/9781316681473 \n67. Ide K, Sornette D. Oscillatory finite-time singularities in finance, population and rupture. Physica \nA: Statistical Mechanics and its Applications. 2002;307(1-2):63-106. doi:10.1016/S0378-\n4371(01)00585-4 \n68. Sornette D, Ide K. Theory of self-similar oscillatory finite-time singularities. Int J Mod Phys C. \n2003;14(03):267-275. doi:10.1142/S0129183103004462 \n69. Sahimi M, Arbabi S. Scaling laws for fracture of heterogeneous materials and rock. Phys Rev \nLett. 1996;77(17):3689-3692. doi:10.1103/PhysRevLett.77.3689 \n70. Lei Q, Wang X. Tectonic interpretation of the connectivity of a multiscale fracture system in \nlimestone. Geophys Res Lett. 2016;43(4):1551-1558. doi:10.1002/2015GL067277 \n71. Ouillon G, Castaing C, Sornette D. Hierarchical geometry of faulting. J Geophys Res. \n1996;101(B3):5477-5487. doi:10.1029/95JB02242 \n72. Demirer R, Demos G, Gupta R, Sornette D. On the predictability of stock market bubbles: \nevidence from LPPLS confidence multi-scale indicators. Quantitative Finance. 2019;19(5):843-\n858. doi:10.1080/14697688.2018.1524154 \n73. Huang Y, Johansen A, Lee MW, Saleur H, Sornette D. Artifactual log‐periodicity in finite size \ndata: Relevance for earthquake aftershocks. J Geophys Res. 2000;105(B11):25451-25471. \ndoi:10.1029/2000JB900195 \n74. Horne JH, Baliunas SL. A prescription for period analysis of unevenly sampled time series. ApJ. \n1986;302:757. doi:10.1086/164037 \n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21296v1.pdf",
    "total_pages": 22,
    "title": "Oscillatory finite-time singularities in rockbursts",
    "authors": [
      "Qinghua Lei",
      "Didier Sornette"
    ],
    "abstract": "Forecasting violent rockbursts remains a formidable challenge due to\nsignificant uncertainties involved. One major uncertainty arises from the\nintermittency of rock failure processes, typically characterised by a series of\nprogressively shorter quiescent phases punctuated by sudden accelerations,\nrather than a smooth continuous progression towards the final breakdown. This\nnon-monotonic evolution of rock mass deformation complicates rockburst\nprediction, challenging conventional time-to-failure models that often assume a\nsmooth power law accelerating behaviour. Here, we introduce a generalised\ntime-to-failure model called log-periodic power law singularity (LPPLS) model\nto effectively capture the intermittent dynamics of damage and rupture\nprocesses in rock leading up to violent rockbursts. We perform parametric and\nnonparametric tests on 11 historical rockburst events at three underground\nmines, documenting empirical evidence and providing theoretical arguments to\ndemonstrate the significance of log-periodic oscillatory power law finite-time\nsingularities. Log-periodicity in these rockburst events is likely driven by\nthe interaction of subparallel propagating cracks, the diffusion of\nstress-triggering processes, or the interplay between stress drop and stress\ncorrosion. Our results and insights obtained have significant implications for\nnot only understanding but also forecasting rockbursts, as recognising and\ncharacterising log-periodicity can help transform intermittency from\ntraditionally perceived noise into valuable predictive information.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}