{
  "id": "arxiv_2502.20047v1",
  "text": "Connecting the Persian-speaking World through\nTransliteration\nRayyan Merchant1, Akhilesh Kakolu Ramarao2, and Kevin Tang1, 2\n1Department of Linguistics, University of Florida, Gainesville, Florida,\n32611-5454, United States of America\n2Department of English Language and Linguistics, Institute of English and\nAmerican Studies, Heinrich-Heine-University, Düsseldorf, 40225, Germany\nFebruary 26, 2025\nAbstract\nDespite speaking mutually intelligible varieties of the same language, speakers of Tajik\nPersian, written in a modified Cyrillic alphabet, cannot read Iranian and Afghan texts writ-\nten in the Perso-Arabic script. As the vast majority of Persian text on the Internet is written\nin Perso-Arabic, monolingual Tajik speakers are unable to interface with the Internet in any\nmeaningful way. Due to overwhelming similarity between the formal registers of these di-\nalects and the scarcity of Tajik-Farsi parallel data, machine transliteration has been proposed\nas more a practical and appropriate solution than machine translation. This paper presents\na transformer-based G2P approach to Tajik-Farsi transliteration, achieving chrF++ scores of\n58.70 (Farsi to Tajik) and 74.20 (Tajik to Farsi) on novel digraphic datasets, setting a compa-\nrable baseline metric for future work. Our results also demonstrate the non-trivial difficulty\nof this task in both directions. We also provide an overview of the differences between\nthe two scripts and the challenges they present, so as to aid future efforts in Tajik-Farsi\ntransliteration.\nKeywords: Persian, Tajik, Transliteration, Orthography, Computational Linguistics\n1\nIntroduction\nTajik Persian (henceforth, Tajik) is the formal variety of Modern Persian spoken in Tajikistan.\nAs such, it retains an extremely high level of mutual intelligibility with formal Persian as spoken\nin Iran and Afghanistan (henceforth referred to as Farsi). Unlike these two countries which use\nthe centuries-old Perso-Arabic script, Tajikistan uses the relatively new Tajik-Cyrillic script due\nto Tajikistan’s Soviet heritage (Perry 2005).\nWhile proposals have been made to shift the script back to Perso-Arabic, any significant\nshift will likely not occur in the near future, with Tajikistan’s former Minister of Culture stat-\ning in 2008 that “...some 90-95% of Tajikistan’s population is not familiar with Arabic script...”\n1\n\n\n(Ghufronov 2008). As a result, the vast majority of the 10 million Persian speakers in Tajikistan\nare unable to read written Persian media produced by the 100 million Persian speakers in Iran and\nAfghanistan. This restriction extends to the Internet, where Farsi dominates. As of September\n2023, the Tajik Wikipedia had 269,857 articles and 10.5 million words across all content pages\ncompared to the Farsi Wikipedia’s 5.5 million articles and 194 million words (Wikimedia Foun-\ndation 2023b). Moreover, despite Afghan Persian (known as Dari) being similarly divergent, the\nFarsi Wikipedia is the most popular Wikipedia in Afghanistan and there currently exists no Dari\nWikipedia (Wikimedia Foundation 2023a).\nThese two scripts are highly incongruous (Perry 2005). The Perso-Arabic script, as an impure\nabjad, often omits vowels, and those that are written are ambiguous. Meanwhile, the Tajik-\nCyrillic script, as an alphabet, writes out all vowels, making it a phonetic representation of the\nlanguage. Example 1 demonstrates how a Persian phrase is written in both Tajik and Farsi.\nWhile proprietary tools such as Google Translate1 are capable of translating between the two\nvarieties, they have limitations. As translation quality largely depends on the amount of data\navailable, low-resource language pairs like Tajik and Farsi suffer from a lack of large amounts of\ndiverse data (Haddow et al. 2022). Furthermore, as these are two varieties of the same language,\nmachine translation (which does not preserve exact wording) between the two is absolutely fatal\nto reading poetry (a beloved piece of Persian-speaking culture) and also renders direct quotations\nof text impossible. On a finer level, this prevents the communication of lexical subtleties.\n(1)ﺯﺑﺎﻥﻓﺎﺭﺳﯽ\nзабони форcӣ\nzaboni forsī\n‘The Persian language’\nDue to their mutual intelligibility in spoken form and the small amount of parallel Tajik-Farsi\ndata, machine transliteration has been proposed as a practical alternative. Early work includes a\nproof-of-concept system by Megerdoomian & Parvaz (2008) for Tajik to Farsi conversion incor-\nporating a Finite-State Transducer (FST) and lexical lookup. Later, Davis (2012) then introduced\na statistical machine transliteration model for transliteration in both directions. Both of these\nmethods lacked corpora made up of sentences with the exact same wording, instead opting for\nunrelated Tajik and Farsi corpora and a medium-size word list. While functional, such data does\nnot allow for straightforward evaluation metrics on the sentence level (such as sequence accuracy)\nand cannot capture features that span across several words (such as the Persian Ezafe).\nGrapheme to Phoneme Conversion (G2P) is a task that converts letters (grapheme sequence)\nto their corresponding pronunciations (phoneme sequence) (Yolchuyeva et al. 2019). As a pair of\nnon-phonetic and phonetic representations of the same language, transliteration between Tajik\nand Farsi resembles G2P. We base our transliteration method on this and treat the task as one of\nG2P conversion. The main goal of this chapter is to present the current findings of this approach.\nThe preliminary results of our ongoing investigation, drawn from the novel digraphic corpus we\ncreated, also provide a benchmark for future work. As a secondary goal, this chapter aims to\nprovide a detailed walkthrough of the many challenges involved in Tajik-Farsi transliteration for\nothers who may attempt similar work in the future.\n1https://translate.google.com (Date of Access: 09/30/2023)\n2\n\n\nThe chapter is organized as follows: we first provide an overview of the many differences\nbetween Tajik and Farsi (Section 2). Following this, we provide a substantial description of the\nchallenges in transliteration between the two (Section 3) and describe previous (Section 4) and\nrelated work (Section 5). We then discuss our parallel dataset (Section 6). Finally, we describe\nhow we trained our model (Section 7) and analyze the results (Section 8) before ending with our\nconcluding remarks (Section 9).\n2\nTajik and Farsi\n2.1\nOrthographic Differences\nFarsi uses the Perso-Arabic script, an impure abjad which often omits vowels. To better reflect\nPersian phonology, it includes the letters/ﭖp/,/ﭺʧ/,/ﮊʒ/, and/ﮒɡ/. As a result of these\nfactors, the script itself is quite consonant-heavy and rather vowel-deficient (Perry 2005).\nIn contrast, the Tajik-Cyrillic script is an alphabet, meaning that it does not omit any sound\nand so more accurately reflects Persian phonology. Like Perso-Arabic, it includes several letters\nthat are nonexistent in its source orthography. These letters are ҳ /h/, ҷ /ʤ/, қ /q/, ғ /ʁ/,\nӯ /ɵ/, ӣ /i/. As the Tajik-Cyrillic script does not include Arabic-specific characters, ambiguity\nand homonymy for Arabic loanwords has been maximized (Megerdoomian & Parvaz 2008). This\ncan be seen in the two Farsi wordsﺳﺘﺮandﺳﻄﺮboth pronounced /satr/ and written as сатр in\nTajik.\n2.2\nPhonological Differences\nWhile the formal languages have retained mutual intelligibility, they have nonetheless evolved\nseparately for several centuries and noticeably diverged in pronunciation (Perry 2005). For ex-\nample, Tajik retains the Classical Persian distinction between ʃir “milk” and ʃer “lion” (written\nas шир and шер, respectively). In Farsi, these are homonyms, both pronounced as /ʃir/ and\nwritten as.ﺷﯿﺮOn the other hand, Farsi distinguishes between/ﭘﻮﻝpul/ (“money”) andﭘﻞ\n/pol/ (“bridge”) (both written as пул /pul/ in Tajik). The widespread merger of /q/ and /ɣ/\n(in Tajik /ʁ/) into [ɣ~ɢ] in many varieties of Farsi is also significant, although the distinction is\npreserved in both orthographies asﻕand,ﻍin Farsi and in Tajik as қ and ғ.\n2.2.1\nLoanwords\nThe two varieties have also adopted words from different sources, particularly in the realm of\nscience and technology (Perry 2005). Some of the most common examples include the word\nfor “thank you” (French-derived Farsi “mersi” vs. native Tajik “rahmat”) and “potato” (native\nFarsi “seb-e zamin” vs. Russian-derived Tajik “kartoshka”). Due to recent efforts to remove\nRussian influence in Tajikistan, many words in the formal Tajik standard are shared with Farsi,\nbut continue to differ in colloquial form, such as “airplane” (Farsi and Tajik “havopaimo” vs.\nRussian-derived Tajik “samalyot”). Owing to the aforementioned “Persianization” and prevalence\nof Iranian media, Farsi-specific terms present much less of an issue to Tajiki-speakers than the\nother way around.\n3\n\n\n3\nChallenges in Transliteration\nAs previously described, Farsi and Tajik diverge in a number of ways which render one-to-one\nletter conversion largely ineffective. An example transliteration employing such a technique can\nbe seen in Table 1.\nTable 1: One-to-one Transliteration of Farsi and Tajik\nFarsi\nFarsi Translit.\nTajik\nTajik Translit.\nﻣﻦﮐﺘﺎﺏﺭﺍﺧﻮﺍﻧﺪﻡmn ktob ro xwondm\nман китобро хондам\nman kitobro xondam\n3.1\nOne to Many, Many to One\nOwing to the incongruous natures of the two scripts, there exist several challenges in ambiguity\nwhen transliterating in either direction. This results in many characters mapping to a single\ncharacter, and vice versa. This difficulty is pronounced particularly in vowels but extends to\nconsonants as well.\n3.1.1\nVowels\nThe character,ﺍknown as alef, can represent several different vowels. If in word medial or terminal\nposition, the alef typically maps to the Tajik о. In word start position, it only represents о if\nwritten with the maddah diacritic, making it.ﺁOtherwise, it can map to several different vowels.\nThis behavior is demonstrated in Table 2.\nTable 2: Examples of(ﺍalef ) mapping to various vowels\nFarsi\nFarsi Translit.\nTajik\nTajik Translit.\nEnglish\nﺍﻧﺠﻤﻦanjmn\nанҷуман\nanjuman\n‘organization’\nﺍﻧﺘﺨﺎﺏantxob\nинтихоб\nintixob\n‘choice’\nﺍﻣﯿﺪamyd\nумед\numed\n‘hope’\nﺍﻭaw\nӯ\nü\n‘(s)he’\nﺁﻫﻨﮓohng\nоҳанг\nohang\n‘song’\nﺧﺎﺭﺩﻥxoridn\nхоридан\nxoridan\n‘to itch’\nThe letter,ﻭknown as vav, can map to the vowels у and ӯ, or the consonant в, as shown\nin Table 3.\nThe letter,ﯼknown as ye, maps to several different vowels, depending on its position in the\nword. In addition, in some words of Arabic origin, the character can map to when in word final\nposition. Table 4 provides examples of the character in various positions.\nAlthough not a vowel, the consonant,ﻩknown as he (do cheshm), maps to either the consonant\nҳ or to vowels when in word final position. This occurs in a large number of common words, as\nshown in Table 5.\nThe character,ﻉor ayn, displays not one, but two separate challenges. The first is that it\ncan map to any vowel (see Table 6), and the second is that after the mapped vowel the glottal\n4\n\n\nTable 3: Examples of(ﻭvav) mapping to vowels and consonants\nFarsi\nFarsi Translit.\nTajik\nTajik Translit.\nEnglish\nﻭﻟﺎﯾﺖwlayt\nвилоят\nviloyat\n‘province’\nﺁﻭﺭﺩowrd\nовард\novard\n‘brought’\nﮔﺎﻭgaw\nгов\ngov\n‘cow’\nﺑﻮﺩbwd\nбуд\nbud\n‘was’\nﺍﻣﺮﻭﺯamrwz\nимрӯз\nimrüz\n‘today’\nTable 4: Examples of(ﯼye) mappings\nFarsi\nFarsi Translit.\nTajik\nTajik Translit.\nEnglish\nﯾﺮﺍﻕyraq\nяроқ\nyaroq\n‘weapon’\nﺩﺭﯾﺎdrya\nдарё\ndaryo\n‘river/sea’\nﭼﺎﯼçay\nчой\nçoy\n‘tea’\nﺍﯾﺮﺍﻥayran\nЭрон\nEron\n‘Iran’\nﺧﯿﻠﯽxyly\nхеле\nxele\n‘very’\nﻋﺎﻟﯽ\n’aly\nолӣ\nolī\n‘great’\nﺣﺘﯽhty\nҳатто\nhatto\n‘even’\nstop sign ъ is inconsistently written. Moreover, the glottal stop sign also denotes actual glottal\nstops, and so can be written in words in the absence of ayn. However, the erroneous omission or\naddition of the glottal stop character rarely leads to difficulties in comprehension.\nThe,ﺀor hamza, exhibits similar behavior to ayn by mapping to both vowels and the Tajik\nglottal stop sign. It can be written as a standalone letter, or over alif, vav, or ye. However, this\ncharacter is often replaced with a ye or simply removed from the letter it is written over.\nVowel diacritics are also often unwritten in the Perso-Arabic script, further obfuscating short\nvowel determination. Without vowel diacritics, the wordﮔﺮﺩmay represent either гард /gard/\n(’dust’), гирд /gird/ (’round’), or гурд /gurd/ (’hero’).\n3.1.2\nConsonants\nAs the Perso-Arabic script retains many redundant consonants from Arabic, some Cyrillic letters\neach have multiple Perso-Arabic letters equivalents. Table 7 provides an overview of these sounds\nand the corresponding letters in each script.\nOutside of these redundant consonants and the vowels mentioned previously, consonant to\nconsonant mapping between the two scripts is one-to-one and can be considered trivial.\n3.2\nCapitalization\nAs a modified Cyrillic alphabet, Tajik-Cyrillic capitalizes proper nouns and the beginning of\nsentences while the Perso-Arabic script does not capitalize at all. When transliterating from\nFarsi to Tajik, a complete system will need employ a named-entity recognition step, while no\nadditional step is required in the other direction.\n5\n\n\nTable 5: Examples of(ﻩhe) Mapping\nFarsi\nFarsi Translit.\nTajik\nTajik Translit.\nEnglish\nﺑﻪbh\nба\nba\n‘to’\nﮐﻪkh\nки\nki\n‘that (conj.)’\nﭼﻪçh\nчи\nçi\n‘what’\nﻗﺎﻋﺪﻩqa’dh\nқоида\nqoida\n‘rule’\nﺳﯿﺎﻩsyah\nсиёҳ\nsiyoh\n‘black’\nﺩﻩdh\nдаҳ\ndah\n‘ten’\nﻓﺮﺑﻪfrbh\nфарбеҳ\nfarbeh\n‘fat’\nTable 6: Examples of(ﻉayn) Mapping mapping\nFarsi\nFarsi Translit.\nTajik\nTajik Translit.\nEnglish\nﻋﻀﻮ\n’zw\nузв\nuzw\n‘limb’\nﻋﻠ؝ﻣﺖ\n’lamt\nаломат\nalomat\n‘sign’\nﻓﻌﺎﻟﯿﺖf’alyt\nфаъолият\nfa’oliyat\n‘activity’\nﺳﺎﻋﺖsa’t\nсоат\nsoat\n‘hour’\nﺗﺎﺭﯾﺦtaryx\nтаърих/торих\nta’rix/torix\n‘history’\nﻗﺮﺁﻥqron\nҚуръон\nQur’on\n‘Quran’\n3.3\nPersian Ezafe/Izofat Detection\nThe Persian Ezafe (known as izofat in Tajik) is a Persian grammatical feature that links an modi-\nfier to a preceding head noun (or preceding modifier) through the unstressed affix /-i/ (or /-yi/)\nin Tajik, and /-e/ (or /-ye/) in Farsi (Perry 2005). Example 2 demonstrates its usage to link an\nadjective to a head noun, and Example 3 demonstrates its usage to denote possession.\nThis affix manifests itself in different ways in both scripts. In accordance with its phonetic\nnature, the Tajik standard always writes the Ezafe as an -и attached to the previous word. When\nit is added to a word that ends with -ӣ, the accent is dropped and it becomes -ии. However,\nwhen it is added to a word with -й, either the accent is dropped and it becomes -и or it is\npreserved.\nIn contrast, the Perso-Arabic script almost always omits the Ezafe, so the reader must infer\nits location from the surrounding context. Typically, the Ezafe is only always written as aﯼwhen\nadded to the plural marker /-ho/.ﮬﺎThis behavior can be seen in Examples 4 and 5. Otherwise,\nif it is absolutely needed to disambiguate a phrase, it is written as a a diacritic at the end of the\nhead noun.\n(2)ﺧﺎﻧﻪﺯﯾﺒﺎ\nхонаи зебо\nxona-i zebo\nhouse-EZ beautiful\n‘The beautiful house’\n6\n\n\nTable 7: One to many mappings of consonants from Tajik to Farsi\nPhoneme\nTajik\nFarsi\n/z/\nзﺯ\nﺫ\nﺽ\nﻅ\n/s/\nсﺱ\nﺹ\nﺙ\n/t/\nтﺕ\nﻁ\n/h/\nҳﺡ\nﻩ\n(3)ﺧﺎﻧﻪﻣﺮﺩ\nхонаи мард\nxona-i mard\nhouse-EZ man\n‘The man’s house’\n(4)ﺧﺎﻧﻪ ﮬﺎﯼ ﻣﺮﺩ\nхонаҳои мард\nxona-ho-i mard\nhouse-PL-EZ man\n‘The man’s houses’\n(5)ﺧﺎﻧﻪ ﮬﺎﯼﺯﯾﺒﺎ ﻣﺮﺩ\nхонаҳои зебои мард\nxona-ho-i zebo-i mard\nhouse-PL-EZ beautiful-EZ man\n’The man’s beautiful houses’\nThe Ezafe has the potential to drastically change a given sentence’s phrasal boundaries, and\nsubsequently, its meaning (Doostmohammadi et al. 2020). As such, a given sentence in Farsi\ncan be written one way but interpreted in several, as demonstrated in Examples 6 and 7 (with\nexplicitly marked Ezafe).\n(6)ﺩﺭﭘﯽِﺍﺗﻔﺎﻗﺎﺕِﺩﯾﺮﻭﺯﺍﻭﺍﺳﺘﻌﻔﺎﺩﺍﺩ\nДар пайи иттифоқоти дирӯз ӯ истеъфо дод\n7\n\n\ndar pay-i ittifoqot-i dirüz ü iste’fo dod\nFollowing-EZ events-EZ yesterday (s)he resign did\n‘Following yesterday’s events, he/she resigned’\n(7)ﺩﺭﭘﯽِﺍﺗﻔﺎﻗﺎﺕﺩﯾﺮﻭﺯﺍﻭﺍﺳﺘﻌﻔﺎﺩﺍﺩ\nДар пайи иттифоқот дирӯз ӯ истеъфо дод\ndar pay-i ittifoqot dirüz ü iste’fo dod\nFollowing-EZ events yesterday (s)he resign did\n‘Following the events, (s)he resigned yesterday’\nWhile the word-final -и can simply be ignored when converting from Tajik to Farsi, the\nopposite direction is another matter. When converting from Farsi to Tajik, a complete system\nmust infer the Ezafe’s location, which can only be determined from semantic - rather than ortho-\ngraphic - context. Unfortunately, despite the dearth of literature on the Ezafe, to our knowledge\nthere exists only one publicly available Ezafe detection tool by Etezadi et al. (2022). Moreover,\nits Ezafe detection accuracy has not been measured and verified.\n3.4\nThe Conjunction “va”\nThe conjunction “and” also presents a unique set of problems. In Tajik, its two equivalents are\nthe independent ва /va/ and the enclitic -y/-u/ (Perry 2005). However, in Farsi both forms are\nwritten as.ﻭThere is no way to distinguish between the two possibilities when transliterating\nfrom Farsi to Tajik. An exception to this rule may be poetry, where the surrounding context\nwould guide a reader’s pronunciation. Examples 8 and 9 demonstrate these different forms with\na single Farsi phrase from our dataset.\nThis causes several issues for transliteration from Farsi to Tajik. The first is that it presents\nour models with two equally-valid transliterations of the same word. This could act as “noise”\nfor our model, and result in a completely invalid transliteration. It also complicates efforts to\nevaluate the word-level and character-level accuracy of our model.\n(8)ﺗﺎﺟﯿﮏﻭﺍﯾﺮﺍﻧﯽﻭﺍﻓﻐﺎﻥ\nтоҷик ва эронӣ ва афғон\ntojik va eronī va afghon\nTajik and Iranian and Afghan\n(9)ﺗﺎﺟﯿﮏﻭﺍﯾﺮﺍﻧﯽﻭﺍﻓﻐﺎﻥ\nтоҷику эрониву афғон\ntojik-u eroni-vu afghon\nTajik-AND Iranian-AND Afghan\n8\n\n\n3.5\nZero-width Non-joiner\nThe Zero-width Non-joiner (ZWNJ) is a very common yet invisible (non-printing) character\nused solely when writing Farsi with a keyboard. Placing it between two Farsi characters causes\nthem to be written as if they were separated, meaning in their initial and final forms, respectively.\nIn informal texts, it is common to see the ZWNJ either simply removed or replaced with a space.\nAs a general rule, words written with a ZWNJ in Farsi are also written as single words in Tajik.\nThere are several situations in which the ZWNJ is used: affixes, verbal auxiliaries, the Persian\nobject marker ro, the present tense conjunction, and compound nouns.\nTable 8 and Table 9 demonstrate the ZWNJ with examples for the present tense conjunc-\ntion and the following affixes: the plural marker, the Persian object marker “ro”, and the verbal\nauxiliary.\nTable 8: Different Ways to Separate Affixes\nFarsi with ZWNJ\nFarsi without ZWNJ\nFarsi with Space\n ﻣﻮﺿﻮﻉ ﺭﺍ\nﻣﻮﺿﻮﻋﺮﺍ\nﻣﻮﺿﻮﻉﺭﺍ\nﺧﺎﻧﻪ ﻫﺎ\nﺧﺎﻧﻬﻬﺎ\nﺧﺎﻧﻪﻫﺎ\nﻣﯽ ﺧﻮﺍﻫﻢ\nﻣﯿﺨﻮﺍﻫﻢ\nﺧﻮﺍﻫﻢﻣﯽ\nﮐﺘﺎﺏ ﻓﺮﻭﺵ\nﮐﺘﺎﺑﻔﺮﻭﺵ\nﻓﺮﻭﺵﮐﺘﺎﺏ \nTable 9: Separated Affixes in Farsi\nFarsi\nFarsi Translit.\nTajik\nTajik Translit.\nEnglish\nﮐﺮﺩﮦﺍﺳﺖkrdh ast\nкардааcт\nkardaast\n‘has done’\nﺧﺎﻧﻪ ﻫﺎxanh ha\nхонаҳо\nxonaho\n‘houses’\nﻣﻮﺿﻮﻉ ﺭﺍmwzw’ ra\nмавзӯъро\nmavzü’ro\n‘the subject’\nﻣﯽ ﺧﻮﺍﻫﻢmyxwahm\nмехоҳам\nmexoham\n‘I want’\nﮐﺘﺎﺏ ﻓﺮﻭﺵktabfrwš\nкитобфурӯш\nkitobfurüš\n‘book seller’\n3.6\nThe Glottal Stop ‘ъ’\nThis character ъ represents the glottal stop and typically corresponds to an instance of Farsi ’ayn\n.ﻉHowever, it often presents inconsistencies, occurring in the absence of ’ayn or disappearing\nwhen ’ayn is present. The most common example of this is the word cоат/ﺳﺎﻋﺖmeaning ‘hour’.\nAn incorrect transliteration of this word would result in cоъат instead. This character can even\nbe duplicated, such as in the word фаъолият which is sometimes written as фаъъолият.\nAlthough the character is extremely common, omission of this character does not hinder com-\nprehension on a sentence level.\n9\n\n\n3.7\nThe Dash Character in Tajik\n4\nPrevious Work\n4.1\nFinite-State Transducer\nMegerdoomian & Parvaz (2008) developed the first-ever system designed to tackle Tajik to Farsi\ntransliteration, creating a proof-of-concept system based on a finite-state transducer (FST). The\nFST converts Tajik to Farsi, overgenerating a number of possible transliterations for the input\ndata based on a number of given contextual rules. All results are then subject to morphological\nanalysis and a dictionary lookup. If the system finds morphological match or lexical match, then\nthat match is used (in that order of testing). If no match is found, it selects the most-likely\nform using “rules of thumb” based letter frequencies. Their system achieved 89.8% accuracy in\ntransliterating a document from Tajik to Farsi, and generated 6.27 alternative spellings for the\naverage token.\n4.2\nStatistical Machine Transliteration\nDavis (2012) introduced a phrase-based statistical machine transliteration model for Tajik-Farsi\ntransliteration. In this model, the transliteration model translates at the word-level using character-\nbased n-grams, rather than at the word-level using word-based n-grams. This work created\ncharacter-level language models based on Tajik and Farsi corpora made from online news sources\nand a training corpus of 3,503 pairs. Due to a lack of parallel corpora, evaluation of model’s ac-\ncuracy was conducted using two tasks: part of speech (POS) tagging and machine translation.\nFor part of speech tagging, a Tajik POS tagger was trained on transliterated text and its accuracy\nwas compared to a subset of the corpus to the reported accuracy of other Farsi POS taggers on\nthe unrelated Bijankhan corpus. The SMT model achieved an accuracy of 92.52%. In the ma-\nchine translation task, he transliterated Tajik to Farsi, and then translated the resulting Farsi into\nEnglish using Google Translate. The system achieved a BLEU score of 0.2349. As this BLEU\nscore was ≈90% within Google’s BLEU score for Farsi to English, the system’s raw accuracy was\napproximated at ≈90%. However, as both BLEU score and PoS tagger accuracy are not meant\nto be compared across datasets without recalculation, we consider these results invalid and do\nnot reference them.\n5\nRelated Work\nAs stated earlier, machine transliteration is typically used for the transcription of named entities,\nrather than translation to a highly related dialect. However, that does not mean that Tajik and\nFarsi are in a singular situation. Several other languages present similar levels of intelligibility\nand digraphia, and machine transliteration has been investigated in these cases as well. Ahmadi\n(2019) presented a rule-based approach for Sorani Kurdish transliteration between an Arabic-\nbased and a Latin-based orthography. Talafha et al. (2021) describe a model based on Recurrent\nNeural Networks (RNN) for transliteration between Jordanian Arabic written in the Arabic script\nand in a non-standard romanization known as Arabizi. For the extinct Ottoman Turkish, Jaf\n& Kayhan (2021) explored rule and lexicon-based transliteration to aid documentation efforts.\nDurrani et al. (2010) trained conditional and joint probability models for Hindi-Urdu, also two\n10\n\n\nclosely-related varieties of one macrolanguage. Following recent orthography reforms, Salaev\net al. (2022) explored rule-based transliteration for Uzbek.\n6\nDataset\n6.1\nDataset Compilation\nTo effectively train and evaluate our model, we require Tajik-Farsi parallel data aligned on a word-\nto-word basis. Unfortunately, due to lexical and grammatical differences and translator bias, par-\nallel texts sourced from organizations such as the United Nations or Jehovah’s Witnesses gener-\nally contain extremely divergent sentence pairs. This renders usage of such texts inappropriate\nfor our purposes. To amass as much data as possible, we collected data from various sources on\nthe Internet. Our efforts created the very first digraphic Tajik-Farsi corpus (Merchant & Tang\n2024). On top of this data, we include a digraphic dataset released by another group after our\nown. Tables 10 and 11 provide comparison of the two corpora. We note that the second cor-\npus consists of both a dictionary and poetry collection, so we do not include sentence statistics.\nTo our knowledge, both datasets have not undergone in-depth analysis from native speakers and\ntherefore may occasionally contain incorrect correspondences. We note that creation of digraphic\ndataset checked by native speakers presents another avenue for research.\nWe determined combined usage of these two datasets to be sufficient for our purposes based\non related work in transliteration. In the case of Tajik and Farsi, Davis (2012) used a list of only\n3,503 words. In the NEWS 2018 Shared Task on Machine Transliteration (Chen et al. 2018),\nthe submitted neural models achieved F-scores of almost 80% or more on language pairs with\ndatasets ranging in same from 6,000 to 41,318 individual names per language pair. Taking this\ninto account we judge our dataset to be more than adequate, especially considering the fact that\nour model operates at the character level.\nTable 10: Our Corpus Statistics *Note we did not consider the whitespace character\nStatistics\nFarsi\nTajik\n# of sentences\n2,813\n2,813\n# of word tokens\n43,846\n42,226\n# of characters*\n186,414\n222,986\nAvg. # of tokens in a sentence\n15.59\n15.01\nAvg. # of characters* in a sentence\n66.27\n79.27\nTable 11: Stibiumghost Corpus Statistics *Note we did not consider the whitespace character\nStatistics\nFarsi\nTajik\n# of word tokens\n403,829\n392,924\n# of word tokens (excl. dictionary)\n360,294\n349,389\n# of characters*\n1,555,580\n1,862,938\n# of characters* (excl. dictionary)\n1,258,628\n1,533,549\n11\n\n\n6.1.1\nOnline Blogs and BBC Articles\nAfter an extensive search, we found two main sources of parallel data online: blogs and British\nBroadcasting Corporation (BBC) News. The two blogs we found were written by Persian-\nspeakers who knew both scripts and dealt with a wide variety of topics that include poetry and\npolitics23. To filter our posts written in only script or other languages (mainly Russian), we opted\nto manually collect these data rather than use an automatic website scraping tool. We were also\nable to find 23 BBC News articles written in both scripts45. These articles almost exclusively deal\nwith politics, and exhibited a similar degree of word-to-word alignment. Due to the small num-\nber of articles, we elected to collect these by hand as well. Our corpus contains 2,813 Tajik-Farsi\nsentences with average Tajik and Farsi sentence lengths of 15.59 and 15.01 words respectively, as\nshown in Table 10 (Merchant & Tang 2024). We note that our our corpus will eventually be\nmade freely available to the broader linguistics community.\n6.1.2\nDictionary and Poetry\nSeveral months after creating our dataset, another group released their own set of digraphic Per-\nsian data on GitHub for the purpose of Tajik to Farsi transliteration (stibiumghost 2022). This\nincludes parallel news texts, a Classical Persian poetry collection, and a Farsi-Tajik dictionary.\nThis data is publicly available on the project’s GitHub repository. The dictionary contains 43,525\nentries, and the rest of the corpus consists of 37,940 Tajik-Farsi sentences with average Tajik\nand Farsi sentence lengths of 49 and 42.91 words respectively. The combined statistics has been\nshown in Table 11.\n6.2\nData Processing\n6.2.1\nAlignment and Normalization\nAs the corpus that we compiled was not aligned on a sentence-to-sentence basis, we utilized\nGaChalign, a Python implementation of the Gale-Church alignment algorithm, to do so (Tan &\nBond 2014). Afterwards, we normalize the data by stripping it of any and all characters that are\nnot Perso-Arabic or Tajik-Cyrillic letters, including Arabic diacritics, numbers, and punctuation.\nWe also strip the hyphen character from our Tajik data, which is often used to show that a certain\nword is made up of two words. This is typically seen in poetry, for example the single word к-\nаз, made up of ки (which) and аз (from). Preliminary testing showed that this character only\nprovided additional noise to our data, so we deemed it unnecessary.\n6.2.2\nSeparated Affix Normalization\nAs described earlier, certain affixes in Farsi can be written in several different ways. As the authors\nof our data incorporate both the ZWNJ and a single space to separate these affixes, we opted to\nnormalize this data. To do so, we connected all the affixes we could find (using a rule-based\n2https://dariussthoughtland.blogspot.com/\n3https://jaamjam.blogspot.com/\n4https://www.bbc.com/tajik\n5https://www.bbc.com/persian\n12\n\n\napproach) to the preceding stem using the ZWNJ. We provide the ZWNJ to our model as an an\nacceptable Farsi grapheme.\n7\nSystem Description\n7.1\nTransformer-based G2P Conversion\nThe transformer architecture has become an increasingly popular and successful choice for sequence-\nto-sequence conversion in recent years, rivaling the previously state-of-the-art recurrent neural\nnetworks (RNNs) with less data and training time (Wu et al. 2021). Previously applied mainly\nto larger tasks, such as machine translation, question answering, and summarization, more and\nmore research has begun applying it to character and sub-word level tasks, such as G2P conver-\nsion, transliteration, and morphological inflection. Here too, the model has replicated its initial\nsuccess 6. We train the model in both directions, Farsi to Tajik and Tajik to Farsi.\nWe apply a encoder-based seq2seq model based on that proposed by Yolchuyeva et al. (2019)\nusing the DeepPhonemizer tool from Schäfer et al. (2023). The transformer architecture consists\nof 4 encoder and decoder layers, with four parallel attention layers. The size of the embeddings\nis 256 and the dimension of the feed-forward neural network inner layer is 1024. Our code7 and\ndata8 are both available available to access online.\n7.2\nModel Training\nTo prepare our dataset, we utilize ten-fold cross validation, ensuring that for each model intera-\ntion, we use a unique (and randomized) split. Our overall dataset is split into 80% training, 10%\ndev, and 10% test sets, with this split being applied to each individual source of data (dictionaries,\nblogs, poetry etc.)\nWe trained our model with an initial learning rate of 0.001 and multiplied the value by 0.5 if\nperformance on the validation set did not improve for 10 epochs. We also implement a warmup\nphase of 5 epochs, and set the dropout rate for both the encoder and decoder to 0.1 to combat\noverfitting (Srivastava et al. 2014). Due to hardware limitations, batch size is set to 16. Training\nhyperparameters are not changed when training in either direction. With these settings, we\nfound that training our model past 100 epochs did not lead to significant differences in accuracy.\n8\nEvaluation and Results\n8.1\nMetrics\nAs this task blends translation with transliteration, we report several evaluation metrics to eval-\nuate our model from different viewpoints 9. As previous efforts presented indirect metrics due\n6We are aware that LLMs could also be utilized for this task, but elected to only use transformers due to the\nabundance of literature applying transformer models to transliteration and the lack thereof for LLMs.\n7https://github.com/merchantrayyan/NACIL_ParsTranslate/tree/main\n8https://github.com/merchantrayyan/ParsText\n9As we only present one model, we do not present a trajectory of learning over epochs. However, in future, dif-\nferent hyperparameters should be experimented with and the results of these across epochs could then be compared.\n13\n\n\nto a lack of parallel data, the results provided in Table 12 also set a baseline for future efforts\n(including our own).\nCharacter F-score (chrF) is based on the intuition that more accurate translations will tend\nto have characters that appear in a human’s translation. To do so, it compares the number of\ncharacter n-gram overlaps between the system output and the reference transliteration. While the\nbase implementation only looks at character n-grams (and is therefore slightly optimistic), recent\nresearch from Popović (2017) has shown that a modified version (chrF++), which takes unigrams\nand bigrams into account, better reflects human judgement. As such, we provide chrF++ as our\nmain metric.\nSequence Accuracy is the percentage of model outputs that are exactly the same as their ex-\npected counterpart. Due to differences in word segmentation between Farsi and Tajik, this is\ncalculated by removing all spaces from both the reference transliteration and the system output\nand comparing the two resulting sequences.\nRelaxed Sequence Accuracy (RSA) denotes the total number of correct sequences combined\nwith the number of sequences one edit distance away and vice versa. A single edit distance is\ndefined as a single addition, subtraction, or substitution to the predicted sequence that would\nmake it exactly the same as the reference sequence.\nAverage Levenshtein Distance (Avg. LD) is realized as the average Levenshtein (or edit) Dis-\ntance between the expected output sequence and the model prediction.\nLevenshtein Distance Ratio (LD Ratio) is taken as the ratio of the Levenshtein Distance to\nthe length of max(expectedoutput, modeloutput). Given an expected sequence and a reference\nsequence, a NPER of 0.0 means that the sequences are exactly identical, while a NPER of 1.0\nmeans that they have nothing in common.\nF-score is deemed a more appropriate metric for character-level evaluation due to the fact that\nraw accuracy would not accurately reflect less-common characters. We created a confusion matrix\nby aligning reference translations to our system output, and then calculate the overall F-score as\nwell as the F-score for consonants and vowels. This data is presented in Tables 13, 14, and 15.\n8.2\nResults\nInterestingly, our results revealed that our model performed significantly better on Tajik-to-Farsi\ntransliteration than Farsi-to-Tajik across all metrics, seen in Table 12. Although the Sequence\nAccuracy between Farsi-to-Tajik and Tajik-to-Farsi (with ZWNJ) are within 0.4% of each other,\nthe chrF++ scores of 58.70 and 65.43 show a greater difference in performance. Interestingly,\nomitting the ZWNJ drastically increases Sequence Accuracy for Tajik-to-Farsi from 34.37% to\n50.46%, chrF++ from 65.43 to 74.20, and decreases the Levenshtein Distance Ratio (L.D. Ratio)\nfrom 0.09 to 0.05. As the ZWNJ is an invisible character, we consider these results to be much\nmore representative of our model’s performance in this direction.\nThe stark contrast in these directions suggests that Farsi-to-Tajik transliteration poses a\nmuch greater challenge to our model than Tajik-to-Farsi transliteration. Comparison of the\nF1 scores shown in Tables 13 and 14 reveals vowel prediction to be the primary factor, with a\nweighted F1 score of 0.85 from Farsi-to-Tajik lagging behind the 0.99 achieved by Tajik-to-Farsi.\nA contributing factor to this may have been the surprising inability of our model to correctly\ntransliterate the character he when in word-final position, despite the prevalence of the preposi-\ntionsﮐﻪand(ﺑﻪки and ба) as seen in Examples 10 and 11. Beyond vowel prediction, our model\n14\n\n\nalso failed to predict semantically-important features such as the conjunction “va” and the Ezafe,\nas seen in Examples 10, 11, and 12.\nAlthough our model performed better on Tajik-to-Farsi transliteration, several issues are\nstillclear. Most notably, prediction of the ZWNJ proves to be more difficult than anticipated,\nwith its omission causing significant improvements across all metrics. Since the ZWNJ does not\nimpact comprehension, our model still outputs quite understandable transliterations, as seen in\nExamples 13, 14, and 15. Of course, some small errors remain, as demonstrated by the Macro F1\nscore of 0.95 in 15, and the unsuccessful deletion of the vowel “vav” in Example 15. The Macro\nF1 score in Table 13 in particular suggests that mapping to the redundant Farsi consonants may\nhave caused a small issue. Although such incorrect mapping has greater semantic implications\nthan the ZWNJ, it would cause only minimal confusion for a native speaker.\nFor all examples, the first line is the input sequence, the second line is the reference (correct)\ntransliteration, and the final line is our system output. Incorrect and omitted letters are indicated\nin bold.\nTable 12: Evaluation metrics for model performance in both directions\nModel\nchrF++\nSeq. Acc.\nRSA+1\nRSA+2\nAvg. L.D.\nL.D. Ratio\nFarsi→Tajik\n58.70\n33.99%\n46.55%\n52.39%\n3.79\n0.11\nTajik→Farsi (ZWNJ)\n65.43\n34.37%\n56.78%\n69.68%\n2.12\n0.09\nTajik→Farsi (No ZWNJ)\n74.20\n50.46%\n70.59%\n82.86%\n1.38\n0.05\nTable 13: F1 scores for predicted consonants in both directions (without ZWNJ)\nMacro F1\nMicro F1\nWeighted F1\nFarsi→Tajik\n0.97\n0.98\n0.98\nTajik→Farsi\n0.94\n0.99\n0.98\nTable 14: F1 scores for predicted vowels in both directions (without ZWNJ)\nMacro F1\nMicro F1\nWeighted F1\nFarsi→Tajik\n0.80\n0.86\n0.85\nTajik→Farsi\n0.97\n0.99\n0.99\n(10)ﻧﮕﻮﮐﻪﭼﺸﻢﻣﺮﺍﻣﻮﻧﺲﻧﮕﺎﻩﻧﺒﻮﺩ\nнагӯ ки чашми маро мӯниси нигоҳ набуд\nнагу каҳ чашм муро мунис нигаҳ набуд\n(11)ﺍﯾﻦﺑﺎﺯﻣﺎﺭﺍﺑﻪﺑﺤﺚﺧﻂﻭﺯﺑﺎﻥﻣﯽ ﺁﺭﺩ\nин боз моро ба баҳси хатту забон меорад\nин боз моро беҳ баҳс хат в забон меорад\n15\n\n\nTable 15: F1 scores for all predicted characters in both directions (without ZWNJ)\nMacro F1\nMicro F1\nWeighted F1\nFarsi→Tajik\n0.91\n0.93\n0.90\nTajik→Farsi\n0.95\n0.99\n0.98\n(12)ﮐﻪﺯﺧﺮﻣﻨﻬﺎﯼﺧﻮﺵﺍﻋﻤﯽﺑﻮﺩ\nﻣﯽ ﮐﺸﺪﺁﻥﺩﺍﻧﻪ ﺭﺍﺑﺎﺣﺮﺹﻭﺑﯿﻢ\nки зи хирманҳои хуш аъмо бувад\nмекашад он донаро бо ҳирсу бим\nкаҳ зе хирманҳӣ хваш аъмо буд\nмайкашад он донаро бй ҳирс в бим\n(13)\nзабони давлатии Тоҷикистон забони тоҷикӣ аст\nﺯﺑﺎﻥﺩﻭﻟﺘﯽﺗﺎﺟﯿﮑﺴﺘﺎﻥﺯﺑﺎﻥﺗﺎﺟﯿﮑﯽﺍﺳﺖ\nﺯﺑﺎﻥﺩﻭﻟﺘﯽﺗﺎﺟﯿﮑﺴﺘﺎﻥﺯﺑﺎﻥﺗﺎﺟﯿﮑﯽﺍﺳﺖ\n(14)\nбидонем кистему аз куҷо меоем\nﺑﺪﺍﻧﯿﻢﮐﯿﺴﺘﯿﻢﻭﺍﺯﮐﺠﺎﻣﯽ ﺁﯾﯿﻢ\nﺑﺪﺍﻧﯿﻢﮐﯿﺴﺘﯿﻤﻮﺍﺯﮐﺠﺎﻣﯿﺎﯾﻢ\n(15)\nГуфт Исрофилро Яздони мо\nКи бирав зон хок пур кун каф биё\nﮔﻔﺖﺍﺳﺮﺍﻓﯿﻞ ﺭﺍﯾﺰﺩﺍﻥﻣﺎ\nﮐﻪﺑﺮﻭﺯﺍﻥﺧﺎﮎﭘﺮﮐﻦﮐﻒﺑﯿﺎ\nﮔﻔﺖﺍﺳﺮﺍﻓﯿﻠﺮﺍﯾﺰﺩﺍﻥﻣﺎ\nﮐﻪﺑﺮﻭﺯﺍﻥﺧﺎﮎﭘﻮﺭﮐﻮﻥﮐﻒﺑﯿﺎ\n9\nConclusion and Future Work\nIn this paper, we explored the challenges of Tajik-Farsi transliteration and presented a transformer-\nbased transliteration approach as an alternative to machine translation. Our results prove our ap-\nproach to be viable, with our model achieving strong chrF++ scores of 58.70 (Farsi-to-Tajik), 65.43\n(Tajik-to-Farsi), and 74.20 (Tajik-to-Farsi without the ZWNJ) on novel digraphic datasets. Our\nusage of digraphic texts by native speakers, as opposed to word lists or non-corresponding texts,\nallowed for realistic evaluation of model performance inter-word features such as the conjunction\n“va”, the ZWNJ, and the Ezafe.\n16\n\n\nFurther analysis revealed our model encountered significant issues in Farsi-to-Tajik translit-\neration. In this direction, our model achieved lower results across all metrics, most notably a\nweighted F1 score of 0.85 for vowel prediction. Its inability to detect the Ezafe also negatively\nimpacted sentence meaning. Transliteration in the opposite direction proved to be much easier,\nwith a 16.09% increase in Sequence Accuracy when the semantically-trivial ZWNJ was omit-\nted. Overall, our model generally outputs quite understandable Tajik-to-Farsi transliterations. In\nboth directions, our model’s results set a strong baseline across a variety of metrics, thus allowing\nfor comparison with future efforts and highlighting the key challenges Tajik-Farsi transliteration\npresents.\nThe success of this approach also suggests that it can be applied to other cases of digraphia\nwith non-phonetic and phonetic written standards, including but not limited to: Arabic (Talafha\net al. 2021), Hindi-Urdu (Durrani et al. 2010), Kurdish (Ahmadi 2019), Azeri (Zohrabi et al. 2023),\nKonkani (Rajan 2014) and even Ottoman Turkish (Jaf & Kayhan 2021). In the case of Hindi-\nUrdu and Ottoman Turkish, both of these languages borrow heavily from Persian to the point\nwhere even Ezafe detection would be necessary.\nOur future work will focus on hyperparameter tuning, Ezafe detection, and further data\nacquisition to increase model performance. In particular, our Ezafe detection and additional data\nfrom different domains will greatly improve the versaility of our model. We hope that our efforts\ncontribute to the development of a practical Tajik-Farsi transliteration tool, further connecting\nTajikistan with the broader Persian-speaking world.\nFunding information\nThe work was partly performed during a research visit by Rayyan Merchant funded by the Sum-\nmer Undergraduate International Research Program, University of Florida.\nCRediT authorship contribution statement\nWe follow the CRediT taxonomy10.\nConceptualization: RM; Data curation: RM; Formal Analysis: RM, AKR, KT; Funding\nacquisition: RM, Investigation: RM; Methodology: RM, AKR, KT; Supervision: AKR, KT;\nVisualization: RM; Writing: RM; and Writing – review & editing: RM, AKR, KT.\nAcknowledgements\nWe would like to thank the audience at the Third North American Conference in Iranian Lin-\nguistics (NACIL 3) for their feedback and comments on our work. Significant thanks are due to\nDr. Christopher Geissler, Anna Stein, Anh Kim Nguyen, Julika Weber, Lara Rüter, Nina Strat-\nmann, and Ann-Sophie Haan for their support, advice, and assistance throughout this project.\nAll remaining errors are our own.\n10https://credit.niso.org/\n17\n\n\nAbbreviations\nFST Finite-State Transducer\nPOS Part of Speech\nBBC British Broadcasting Corporation\nG2P Grapheme-to-Phoneme\nTTS Text-to-Speech\nRNN Recurrent Neural Network\nZWNJ Zero-width Non-joiner\nReferences\nAhmadi, Sina. 2019. A rule-based Kurdish text transliteration system. ACM Transactions on\nAsian and Low-Resource Language Information Processing 18(2). doi:10.1145/3278623.\nChen, Nancy, Rafael E. Banchs, Min Zhang, Xiangyu Duan & Haizhou Li. 2018. Report of\nNEWS 2018 Named Entity Transliteration Shared Task. In Proceedings of the Seventh Named\nEntities Workshop, 55–73. Melbourne, Australia: Association for Computational Linguistics.\ndoi:10.18653/v1/W18-2409. http://aclweb.org/anthology/W18-2409.\nDavis, Chris Irwin. 2012. Tajik-Farsi Persian transliteration using statistical machine transla-\ntion. In Nicoletta Calzolari, Khalid Choukri, Thierry Declerck, Mehmet Uğur Doğan, Bente\nMaegaard, Joseph Mariani, Asuncion Moreno, Jan Odijk & Stelios Piperidis (eds.), Proceed-\nings of the Eighth International Conference on Language Resources and Evaluation (LREC‘12),\n3988–3995. Istanbul, Turkey: European Language Resources Association (ELRA). https:\n//aclanthology.org/L12-1601/.\nDoostmohammadi, Ehsan, Minoo Nassajian & Adel Rahimi. 2020. Persian Ezafe recognition\nusing transformers and its role in part-of-speech tagging. In Trevor Cohn, Yulan He & Yang\nLiu (eds.), Findings of the association for computational linguistics: Emnlp 2020, 961–971. Online:\nAssociation for Computational Linguistics. doi:10.18653/v1/2020.findings-emnlp.86. https:\n//aclanthology.org/2020.findings-emnlp.86/.\nDurrani, Nadir, Hassan Sajjad, Alexander Fraser & Helmut Schmid. 2010.\nHindi-to-Urdu\nmachine translation through transliteration. In Jan Hajič, Sandra Carberry, Stephen Clark\n& Joakim Nivre (eds.), Proceedings of the 48th Annual Meeting of the Association for Compu-\ntational Linguistics, 465–474. Uppsala, Sweden: Association for Computational Linguistics.\nhttps://aclanthology.org/P10-1048.\nEtezadi, Romina, Mohammad Karrabi, Najmeh Zare, Mohamad Bagher Sajadi & Moham-\nmad Taher Pilehvar. 2022.\nDadmaTools: Natural language processing toolkit for Persian\nlanguage. In Proceedings of the 2022 Conference of the North American Chapter of the Association\nfor Computational Linguistics: Human Language Technologies: System Demonstrations, 124–130.\nHybrid: Seattle, Washington + Online: Association for Computational Linguistics.\ndoi:\n10.18653/v1/2022.naacl-demo.13. https://aclanthology.org/2022.naacl-demo.13.\n18\n\n\nGhufronov, Daler. 2008.\nShifting Tajik writing system to Arabic script takes a lot of time,\nsays minister.\nASIA-Plus https://www.asiaplustj.info/en/news/29/20080721/\nshifting-tajik-writing-system-arabic-script-takes-lot-time-says-minister.\nHaddow, Barry, Rachel Bawden, Antonio Valerio Miceli Barone, Jindřich Helcl & Alexandra\nBirch. 2022. Survey of low-resource machine translation. Computational Linguistics 48(3).\n673–732. doi:10.1162/coli_a_00446. https://aclanthology.org/2022.cl-3.6/.\nJaf, Ashti Afasyaw & Sema Koç Kayhan. 2021. Machine-Based Transliterate of Ottoman to\nLatin-Based Script. Scientific Programming 2021. 1–8. doi:10.1155/2021/7152935. https://\nwww.hindawi.com/journals/sp/2021/7152935/.\nMegerdoomian, Karine & Dan Parvaz. 2008. Low-density language bootstrapping: the case of\nTajiki Persian. In Nicoletta Calzolari, Khalid Choukri, Bente Maegaard, Joseph Mariani, Jan\nOdijk, Stelios Piperidis & Daniel Tapias (eds.), Proceedings of the Sixth International Conference\non Language Resources and Evaluation (LREC‘08), Marrakech, Morocco: European Language\nResources Association (ELRA). https://aclanthology.org/L08-1591/.\nMerchant, Rayyan & Kevin Tang. 2024. ParsText: A digraphic corpus for Tajik-Farsi translit-\neration. In Kyle Gorman, Emily Prud’hommeaux, Brian Roark & Richard Sproat (eds.), Pro-\nceedings of the second workshop on computation and written language (cawl) @ lrec-coling 2024,\n1–7. Torino, Italia: ELRA and ICCL. https://aclanthology.org/2024.cawl-1.1/.\nPerry, John R. 2005. A Tajik Persian Reference Grammar. Koninklijke Brill NV.\nPopović, Maja. 2017. chrF++: words helping character n-grams. In Ondřej Bojar, Christian Buck,\nRajen Chatterjee, Christian Federmann, Yvette Graham, Barry Haddow, Matthias Huck, An-\ntonio Jimeno Yepes, Philipp Koehn & Julia Kreutzer (eds.), Proceedings of the Second Confer-\nence on Machine Translation, 612–618. Copenhagen, Denmark: Association for Computational\nLinguistics. doi:10.18653/v1/W17-4770. https://aclanthology.org/W17-4770/.\nRajan, Vinodh. 2014. Konkanverter - a finite state transducer based statistical machine translit-\neration engine for Konkani language. In Christian Boitet & M.G. Abbas Malik (eds.), Pro-\nceedings of the fifth workshop on south and southeast Asian natural language processing, 11–19.\nDublin, Ireland: Association for Computational Linguistics and Dublin City University. doi:\n10.3115/v1/W14-5502. https://aclanthology.org/W14-5502/.\nSalaev, Ulugbek, Elmurod Kuriyozov & Carlos Gómez-Rodríguez. 2022. A machine translit-\neration tool between Uzbek alphabets.\nIn Proceedings of the ALTNLP the international\nconference and workshop on agglutinative language technologies as a challenge of natural lan-\nguage processing, 42–50. Koper, Slovenia: CEUR Workshop Proceedings (CEUR-WS.org).\nhttps://ceur-ws.org/Vol-3315/paper05.pdf.\nSchäfer,\nChristian,\nOleksiy\nOliynyk\n&\nMoritz\nHaller.\n2023.\nDeep-\nPhonemizer.\nhttps://github.com/as-ideas/DeepPhonemizer.\ncommit:\n5dce7e27556aef4426f5623baf6351d266a30a73.\n19\n\n\nSrivastava, Nitish, Geoffrey Hinton, Alex Krizhevsky, Ilya Sutskever & Ruslan Salakhutdinov.\n2014. Dropout: A simple way to prevent neural networks from overfitting. Journal of Machine\nLearning Research 15(56). 1929–1958. http://jmlr.org/papers/v15/srivastava14a.\nhtml.\nstibiumghost. 2022. Tajik-to-Persian transliteration. https://github.com/stibiumghost/tajik-to-\npersian-transliteration. commit: 47792d13a97b60ea6ff562d20675cdf5e5e0a05e.\nTalafha, Bashar, Analle Abuammar & Mahmoud Al-Ayyoub. 2021.\nAtar: Attention-based\nLSTM for Arabizi transliteration. International Journal of Electrical and Computer Engineering\n(IJECE) 11(3). 2327–2334. doi:10.11591/ijece.v11i3.pp2327-2334. https://ijece.iaescore.\ncom/index.php/IJECE/article/view/22767.\nTan, Liling & Francis Bond. 2014. NTU-MC toolkit: Annotating a linguistically diverse corpus.\nIn Lamia Tounsi & Rafal Rak (eds.), Proceedings of COLING 2014, the 25th international\nconference on computational linguistics: System demonstrations, 86–89. Dublin, Ireland: Dublin\nCity University and Association for Computational Linguistics. https://aclanthology.\norg/C14-2019/.\nWikimedia Foundation. 2023a.\nList of wikipedias.\nhttps://en.wikipedia.org/wiki/\nList_of_Wikipedias.\nWikimedia Foundation. 2023b. Statistics. https://fa.wikipedia.org/wiki/%D9%88%DB%\n8C%DA%98%D9%87:%D8%A2%D9%85%D8%A7%D8%B1.\nWu, Shijie, Ryan Cotterell & Mans Hulden. 2021.\nApplying the transformer to character-\nlevel transduction.\nIn Paola Merlo, Jorg Tiedemann & Reut Tsarfaty (eds.), Proceedings\nof the 16th conference of the european chapter of the association for computational linguis-\ntics: Main volume, 1901–1907. Online: Association for Computational Linguistics.\ndoi:\n10.18653/v1/2021.eacl-main.163. https://aclanthology.org/2021.eacl-main.163/.\nYolchuyeva, Sevinj, Géza Németh & Bálint Gyires-Tóth. 2019. Transformer based grapheme-to-\nphoneme conversion. In Interspeech 2019, 2095–2099. doi:10.21437/Interspeech.2019-1954.\nZohrabi, Reihaneh, Mostafa Masumi, Omid Ghahroodi, Parham AbedAzad, Hamid Beigy, Mo-\nhammad Hossein Rohban & Ehsaneddin Asgari. 2023. Borderless Azerbaijani processing:\nLinguistic resources and a transformer-based approach for Azerbaijani transliteration.\nIn\nJong C. Park, Yuki Arase, Baotian Hu, Wei Lu, Derry Wijaya, Ayu Purwarianti & Adila Alfa\nKrisnadhi (eds.), Proceedings of the 13th international joint conference on natural language pro-\ncessing and the 3rd conference of the Asia-Pacific chapter of the association for computational lin-\nguistics (volume 2: Short papers), 175–183. Nusa Dua, Bali: Association for Computational\nLinguistics.\ndoi:10.18653/v1/2023.ijcnlp-short.20.\nhttps://aclanthology.org/2023.\nijcnlp-short.20/.\n20\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20047v1.pdf",
    "total_pages": 20,
    "title": "Connecting the Persian-speaking World through Transliteration",
    "authors": [
      "Rayyan Merchant",
      "Akhilesh Kakolu Ramarao",
      "Kevin Tang"
    ],
    "abstract": "Despite speaking mutually intelligible varieties of the same language,\nspeakers of Tajik Persian, written in a modified Cyrillic alphabet, cannot read\nIranian and Afghan texts written in the Perso-Arabic script. As the vast\nmajority of Persian text on the Internet is written in Perso-Arabic,\nmonolingual Tajik speakers are unable to interface with the Internet in any\nmeaningful way. Due to overwhelming similarity between the formal registers of\nthese dialects and the scarcity of Tajik-Farsi parallel data, machine\ntransliteration has been proposed as more a practical and appropriate solution\nthan machine translation. This paper presents a transformer-based G2P approach\nto Tajik-Farsi transliteration, achieving chrF++ scores of 58.70 (Farsi to\nTajik) and 74.20 (Tajik to Farsi) on novel digraphic datasets, setting a\ncomparable baseline metric for future work. Our results also demonstrate the\nnon-trivial difficulty of this task in both directions. We also provide an\noverview of the differences between the two scripts and the challenges they\npresent, so as to aid future efforts in Tajik-Farsi transliteration.",
    "published_date": "2025-02-27",
    "source": "arxiv"
  }
}