{
  "id": "arxiv_2502.20886v1",
  "text": "Ultrafast Heterogeneous Melting of Metals under Extreme Non-equilibrium States\nQiyu Zeng,1, 2, 3 Xiaoxiang Yu,1, 2, 3 Bo Chen,1, 2, 3 Shen Zhang,1, 2, 3\nKaiguo Chen,1, 2, 3 Dongdong Kang,1, 2, 3, ∗and Jiayu Dai1, 2, 3, †\n1College of Science, National University of Defense Technology, 410073 Changsha, Hunan, China\n2Hunan Key Laboratory of Extreme Matter and Applications,\nNational University of Defense Technology, 410073 Changsha, Hunan, China\n3Hunan Research Center of the Basic Discipline for Physical States,\nNational University of Defense Technology, Changsha 410073, China\n(Dated: March 3, 2025)\nThe extreme electron-ion nonequilibrium states created by ultrafast laser excitation challenge con-\nventional melting paradigms. Through neural network-enhanced multiscale simulations of tungsten\nand gold nanofilms, we identify electronic pressure relaxation as a critical driver of heterogeneous\nphase transformations. Subpicosecond uniaxial expansion generates density decrease that enable\nsurface-initiated melting far below equilibrium melting temperatures. This ultrafast heterogeneous\nmelting propagates at 2500 m/s—tenfold faster than thermal mechanisms—with characteristic sta-\ntionary diffraction peak splitting distinguishing it from thermal expansion dynamics. While tungsten\nshows pressure-driven solid-solid transitions, gold exhibits complete room-temperature amorphiza-\ntion under electronic stress. These results establish hot-electron-mediated lattice destabilization as\na universal pathway for laser-induced structural transformations, providing new insights for inter-\npreting time-resolved experiments and controlling laser-matter interactions.\nI.\nINTRODUCTION\nUltrafast laser excitation has emerged as a transfor-\nmative tool for probing and manipulating matter un-\nder extreme nonequilibrium conditions, enabling break-\nthroughs from attosecond spectroscopy to high-precision\nnanofabrication [1, 2]. A hallmark of these interactions\nis the transient electronic excitation that establishes a\npronounced temperature disparity between electrons and\nlattices (Te ≫Ti) — a nonequilibrium regime where hot\nelectrons coexist with a cold ionic framework. This state,\nfar removed from thermal equilibrium (Te = Ti), dynam-\nically reconfigures interatomic interactions: charge den-\nsity redistribution modulates potential energy surfaces\n(PES), altering bonding forces and energy barriers [3, 4].\nSuch processes deviate from equilibrium thermodynamic\npathways, raising fundamental questions about how ma-\nterials evolve when energy deposition outpaces thermal\nrelaxation, particularly in laser-induced melting.\nThe isochoric hypothesis, which assumes negligible vol-\nume changes during sub-picosecond heating events, has\nbeen the cornerstone of our understanding of material\nresponse upon laser excitation.\nWithin this picture, a\nplethora of femtosecond phenomena have been uncov-\nered: bond hardening [5, 6], phonon softening [7] and dy-\nnamic lattice instabilities [8, 9]. These processes occur on\ntimescales of ∼102 fs, where inertial stress confinement\nensures a quasi-constant density. However, emerging ev-\nidence reveals a paradigm shift at picosecond timescales:\nhot electrons can exert an additional pressure component\npe—besides the thermoelastic stress—through thermal\n∗ddkang@nudt.edu.cn\n† jydai@nudt.edu.cn\nkinetic energy and quantum degeneracy of thermalized\nelectrons [10–12], resulting in a volume change that may\nchallenge the isochoric assumption. In gold, for instance,\nisobaric calculations predict phonon softening and non-\nthermal melting [13, 14], in stark contrast with the iso-\nchoric hardening evidenced in sub-ps X-ray diffraction\nexperiments [15].\nThis dichotomy highlights a critical\nknowledge gap: How does the accumulation of electronic\npressure (during ∼102 fs) and its relaxation (on ∼101\nps timescale) affect structural transformations?\nIn addressing this issue, the intricacy of the laser-\ndriven process raise challenges. These difficulties arise\nfrom the complex interplay among the laser-modulated\nPES, non-adiabatic electron-ion energy exchange, and\nmicroscopic structural transformation processes [9, 16].\nExperimentally, the above issues, along with inherent\nlimitations in temporal and spatial resolution, confounds\nthe interpretation of measured data [17–20]. Theoreti-\ncally, the laser-driven process presents dual requirements\nthat existing methodologies struggle to reconcile: ab ini-\ntio accuracy to capture the hot-electron-modified PES\ngoverning pe, and atomic-scale resolution across experi-\nmentally relevant thickness (tens of nanometers) to track\nstress wave propagation and phase transition. This dual\nrequirement significantly constrains the efficacy of exist-\ning methodologies, such as classical molecular dynamics\ncombined with two-temperature model [21, 22] or real-\ntime time dependent density functional theory [23, 24],\nthereby hindering a thorough exploration into the real-\ntime response of laser-excited material without any prior\nconstraints.\nHere,\nwe\nunify\nab\ninitio\naccuracy\nwith\nlarge-\nscale molecular dynamics using recently-developed hy-\nbrid atomistic-continuum approach,\nknown as two-\ntemperature model coupled deep potential molecular dy-\nnamics (TTM-DPMD) [12]. By simulating free-standing\narXiv:2502.20886v1  [physics.comp-ph]  28 Feb 2025\n\n\n2\nFigure 1. Diverging melting dynamics in laser-excited tungsten. Under absorbed laser fluence of 120 mJ cm−2, (a)\nConventional TTM-MD prediction with groud-state PES A(R, Ti) showing homogeneous melting gorvened by electron-phonon\ncoupling.\n(b) Our ETD-DPMD results with laser-excited PES A(R, Te) revealing electronic pressure-driven heterogeneous\nmelting. The local structures are identified by the polyhedral template matching (PTM) method [25], and polyhedral surface\nmeshes around FCC-type (green) and amorphous-type (gray) particles are constructed to highlight the heterogeneity in lattice\nsymmetry.\ntungsten (W) and gold (Au) nanofilms, we uncover the\ncrucial role of electronic pressures in triggering hetero-\ngeneous structural transformations at picosecond scales.\nTime-resolved X-ray diffraction signatures further distin-\nguish this mechanism from thermal expansion, offering\nexperimental validation pathways.\nII.\nRESULTS\nAb initio modeling of laser-driven dynamics.\nWithin the TTM-DPMD framework, the electron tem-\nperature dependent deep neural network (ETD-NN) is\nimplemented to capture the ab initio laser-excited PES\nwhile maintaining computational efficiency. With ETD-\nNN, the nonthermal contribution to total energy, forces,\nand pressure at elevated eletronic temperature Te is in-\nherently incorporated [26].\nTo ensure the accuracy of\nour neural network model, we have validated the ther-\nmophysical and vibrational properties of W and Au un-\nder both equilibrium (Te = Ti) and non-equilibrium\nconditions (Te ̸= Ti) [12, 26].\nEspecially, we repro-\nduced the phonon softening in W along the H −N and\nN −Γ paths in the first Brillouin zone at elevated elec-\ntron temperatures up to 20, 000 K, consistent with pre-\nvious predictions [27] (see Fig.S1). Under more severe\nnon-equilibrium state (Te = 22, 000 K), an imaginary\nphonon mode at the N-point was observed, indicating\na possible solid-solid phase transition. Here we mainly\nfocus on the moderate non-equilibrium condition below\nthe Te = 20, 000 K to exclude the influence of lattice-\ninstability-driven nonthermal phase transition.\nThe efficiency of TTM-DPMD approaches enables a\nfull-scale ab initio description where the geometry of the\nsample is compatible with the experimental conditions.\nHere, we choose 30-nm-thick W nanofilm [28] and 35-nm-\nthick Au nanofilm [18] as the target sample. Since the foil\nthickness is comparable to the mean free path of excited\nelectrons (∼33 nm in W and ∼100 nm in Au), the ballis-\ntic electron transport and reflux inside the foil produces\nuniform laser energy deposition [29]. Extra vacuum space\nperpendicular to the laser incident direction (z-axis) is set\nto allow free surface response to the relaxation of internal\nstress (including both electronic and thermoelastic con-\ntributions). Periodic boundary conditions are applied in\nthe lateral directions to simulate the experimental con-\nditions where laser spot diameter is large (hundreds of\nmicrons) compared to the depth of laser energy deposi-\ntion [30].\nMore details about TTM-DPMD simulation\nare provided in the Method Section.\nUltrafast\nheterogeneous\nmelting\ndynamics.\nHere we present structural transformation of laser-\n\n\n3\nFigure 2. Extreme heterogeneity in laser-excited W. (a)(b) Depth-dependent thermodynamic pathway in the tungsten\nnanofilm. The absorbed laser fluence is 120 mJ cm−2 and thermodynamic states are shown by colored circles every 0.5 ps. The\nmelting curve (black solid line) under equilibrium condition (Te = Ti) is obtained via two-phase method [12]. State A marks\nthe initial buildup of electronic pressure (t = 0.5 ps), and state B marks the complete release of electronic pressure (t = 1.5 ps).\n(c) coordination number of selected region at t = 1.5 ps (as highlighted by colored stars in the Fig.2a,b), which is obtained by\nintegration of radial distribution function. For comparison, a typical coordination of BCC and FCC lattice is presented.\nexcited W subjected to an absorbed laser fluence of\n120 mJ cm−2 (duration of laser pulse set to 130 fs). This\nfluence, although insufficient to trigger dynamical insta-\nbility in the BCC lattice, reveals significant alterations\nin melting behavior due to the presence of hot electrons.\nFor comparison, we firstly discuss the purely thermal\nprocess obtained from a traditional TTM-MD method\nwith ground-state PES that does not incorporate laser-\nmodulation (Fig.1a). After laser energy deposition, the\nsystem reaches maximum electron temperature Te =\n19, 050 K while the lattice remains cold (Ti = 300 K).\nThe lattice temperature quickly increases due to electron-\nphonon energy exchange. Once lattice temperature ex-\nceeds the limit of lattice thermal stability, the nucleation\nof liquid region inside the foil is triggered, known as ho-\nmogeneous melting mechanism [21]. Within the first 5\nps, surface expansion remains limited to moderate volu-\nmetric change (Fig.S2a), as constrained by the timescale\nof thermal pressure buildup.\nThe introduction of laser modulation in PES through\nour ETD-NN model fundamentally alters this picture. As\npresented in Fig.1b, the W nanofilm quickly responds to\nlaser heating on a sub-picosecond timescale, and exhibits\ninstant surface expansion not observed in a purely ther-\nmal process. The heterogeneous nucleation of FCC phase\nis initially formed in the surface region, then the BCC-\nFCC transformation front moves inward with an average\nvelocity of ∼2571 m s−1. Subsequently, as ion temper-\nature increases above ∼2200 K at t = 2 ps, although\nthe temperature is significantly lower than the melting\npoint (Tm = 3540 K) under ambient condition, the col-\nlapse of crystal structure occurs in the surface region and\nproceeds inward as the BCC-FCC interface propagates.\nSuch a melting process exhibits a well-defined solid-liquid\ninterface moving inward, which is similar to the hetero-\ngeneous melting mechanism but has a high propagation\nspeed up to ∼2500 m s−1.\nHere we name this melt-\ning behavior as “ultrafast heterogeneous melting” be-\ncause the melting speed is an order of magnitude greater\nthan that of conventional heterogeneous melting process\n(∼102 m s−1) [18]. After t = 4 ps, the melt front rapidly\nadvances, completing the melting process within the fol-\nlowing two picoseconds.\nElectronic\npressure-induced\nthermodynamic\nand structural heterogeneity. The ultrafast hetero-\ngeneous melting process exhibits spatial characteristics\nakin to conventional heterogeneous melting, with a well-\ndefined melt front, while temporally resembling homoge-\nneous melting due to its rapid progression. Such a unique\ncombination of spatial and temporal features motivates a\ndeeper exploration of the thermodynamic pathways and\nmicroscopic mechanisms involved.\nAs shown in Fig.2a, the ultrafast heating of electrons\nresults in the buildup of extreme internal stress in a sub-\npicosecond timescales.\nThe thermalized electrons with\nextremely high kinetic energy can contribute to an extra\nstress of ∼45 GPa, which is significantly larger than that\nfrom thermal atomic vibrations of lattice. With the ex-\nistence of free surface, a super-high expansion velocity of\n∼755 m s−1 at the initial state (t = 0.4 ps) is observed\n(see Fig.S3), and the uniaxial expansion process launches\ninstantly to release this hot-electron-contributed pres-\nsure.\nAs shown in Fig.2b, the density in the surface\nregion (z = 1.8 nm) quickly decreases while the inte-\nrior region (z = 14.2 nm) is heated under the confine-\nment of internal stress. As a consequence, the inhomo-\ngeneous thermodynamic profiles are created. In density\nprofile, a well-defined interface with sharp decrease of\n∆ρ ∼5 g cm−3 follows the release of stress (see Fig.S2b).\nThis reduced density strongly influences the thermal sta-\nbility of lattice and explains the early onset of surface\ndisordering below equilibrium melting point.\n\n\n4\nFrom a microscopic perspective, the relaxation of elec-\ntronic stress waves induces local structural transforma-\ntions. The uniaxial expansion increases interatomic dis-\ntances perpendicular to the free surface, leading to a\ntransformation from a distorted BCC structure to an\nFCC structure along the uniaxial Bain deformation path\n[31]. This observation is similar to the BCC-FCC transi-\ntion observed by Murphy et al. using isotropic isobaric ab\ninitio MD [32], highlighting the unique role of electronic\npressure in modifying phase transitions.\nAs shown in\nFig.2c, the short-range order in the laser-excited nanofilm\nconfirms the coexistence of high-density BCC and low-\ndensity FCC structures.\nAt t = 1.5 ps, the interior\natoms display characteristics of a thermally-fluctuated\nBCC structure, while the surface atoms present typical\nFCC close-packed structures. This depth-variation in lat-\ntice coordination suggests that the density discontinuity\ndriven by electronic pressure is accompanied by a dis-\nruption in local lattice symmetry. As the temperature\ncontinues to rise, the interplay between lattice heating\nand electronic pressure relaxation creates a multi-phase\nsystem composed of high-density BCC, low-density FCC,\nand disordered structures.\nIII.\nDISCUSSIONS\nLaser fluence dependence of structural trans-\nformation.\nTo comprehensively understand the lat-\ntice response driven by electronic pressure, we performed\nmolecular dynamics simulations under uniaxial isobaric-\nisothermal ensemble (Ti = 300 K, p = 1 bar) across a\nwide range of Te from 10, 000 K to 20, 000 K.\nThe equilibrated density and lattice structure is shown\nin Fig.3a. The structural transformation dynamics ex-\nhibits obvious dependence on laser fluence. Under rela-\ntively moderate two-temperature state (Te ≤13, 000 K),\nthe BCC structure maintains with slight uniaxial dis-\ntortion.\nThe density decreases from initial value of\n19.15 g cm−3 to 17.15 g cm−3 at Te = 13, 000 K, with a\nuniaxial strain of ∼8.81%. As the Te increases, the elec-\ntronic pressure drives the initial BCC structure towards\nthe more close-packed structure, accompanied with shuf-\nfling of several close-packed atomic planes, thus obtaining\nFCC structure with stacking faults. When the Te exceeds\n16, 000 K, the stacking faults disappear and pure FCC\nstructure is generated with a density of 14.13 g cm−3 at\nTe = 20, 000 K, where the corresponding uniaxial strain\nis as high as 35.43%. A series of TTM-DPMD simula-\ntions under different laser fluence confirmed the BCC-\nFCC phase transition threshold (Fig.S5), once the laser\nfluence exceeds 80 mJ cm−2, corresponding to a max-\nimum electron temperature of 15, 000 K, the heteroge-\nneous nucleation and growth of FCC structure begin to\nappear as the uniaxial expansion proceeds.\nFurther, we investigate the laser fluence dependence of\nmelting mechanism. By calculating the ultrafast electron\ndiffraction pattern, we determine the complete melting\nFigure 3. Laser fluence dependence of structural trans-\nformation in W.\n(a) density decrease after electronic\npressure relaxation along (100) direction, insets denote the\nuniaxially-distorted BCC, FCC with stacking faults, and FCC\nrespectively.\n(b) isochoric and isobaric melting behavior\nunder non-equilibrium condition, obtained from constant-Te\nDPMD simulations via two-phase method. (c) complete melt-\ning time under different laser fluence. The yellow, red, and\ngreen region denotes the heterogeneous, homogeneous, and\nthe ultrafast heterogeneous melting mechanism respectively.\ntime through the decay of (110) diffraction peak dur-\ning laser heating processes (Fig.S6).\nFor comparison,\nthe results from purely thermal simulation are discussed\n(Fig.S7). As the laser fluence increases near the melt-\ning threshold (53 mJ cm−2), the thermal heterogeneous\nmelting starts from the free surface and proceeds slowly\nby the subsonic melt-front propagation (∼125 m s−1),\nsuch process lasts hundreds of picoseconds. At high laser\nfluence, the homogeneous melting dominates, where the\nnucleation and growth of liquid region inside the foil\nquickly completes the melting within several picoseconds.\nWhen incorporating the laser-excited PES through our\nETD-NN model, the threshold fluences to the different\nmelting regimes are reduced, both heterogeneous and ho-\nmogeneous melting are predicted to occur more rapidly.\nMoreover, as shown in the Fig.3b, the release of elec-\ntronic pressure introduces sharp decrease of local density,\nresulting in significantly reduced melting point in sur-\nface region as compared with isochoric condition. There-\nfore, as ion temperature increases, the low-density surface\ncrystalline can quickly collapse into disordered structure\n\n\n5\nbefore the interior melting. Based on TTM-DPMD sim-\nulations (Fig.S5), here we can specify the laser fluence\nneeded for triggering the newly discovered “ultrafast het-\nerogeneous melting” process in the Fig.3c. As the initial\nelectron temperature exceeds Te = 16, 000 K, the isobaric\nmelting point can deviate as large as ∆Tm ∼2750 K from\nisochoric one. Under such condition, the ultrafast hetero-\ngeneous process dominates the melting dynamics.\nNonthermal\nexpansion\nsignatures\nin\nX-ray\ndiffraction lineouts.\nTo elucidate the unique ex-\npansion dynamics under electronic pressure, we analyze\nthe static structure factor S(q), which directly correlates\nwith X-ray diffraction (XRD) measurements. During the\nlaser heating process, internal stress is released at the\nsurface, generating stress waves that propagate inward.\nThis results in a mixed signal representing both the ex-\npanded surface region and the isochoric interior region,\nas captured by S(q).\nAs shown in Fig.4, we take laser-excited W with laser\nfluence of Fabs = 80 mJ/cm2 as an example.\nIn the\npurely thermal process, the dominant role of electron-\nphonon coupling leads to the accumulation of thermal ki-\nnetic pressure inside the foil, thus driving gradual surface\nexpansion.\nFrom Fig.4a, the new characteristic peaks\nsplits from the original peak at q = 2.8 ˚A−1, then con-\ntinuously shifts to lower q values, corresponding to the\ngradual increase in interatomic distance of surface region\nunder uniaxial expansion.\nFigure 4.\nStatic structure factor S(q) of laser-excited W\nnanofilm under laser fluence of 80 mJ/cm2, estimated from\nTTD-DPMD trajectories with (a) ground-state PES (b) laser-\nexcited PES. The black line highlights the first diffraction\npeak from initial BCC structure.\nIn nonthermal processes (Fig.4b), the generation of\nelectronic pressure originates from the formation of the\ninitial two-temperature state.\nConsequently, the re-\nlease of hot-electron-contributed pressure occurs at sub-\npicosecond timescales, resulting in significant uniaxial\ndistortion. At t = 2 ps, the proportion of low-density sur-\nface region reaches a detectable level for XRD, resulting\nin a notable splitting of the first diffraction peak. A new\ncharacteristic peak has been observed at qs = 2.613 ˚A−1.\nUnlike thermal processes, the position of this new peak\nqs remains unchanged over time. Only its intensity grad-\nually increases, indicating the ongoing nonthermal ex-\npansion process.\nAs the lattice temperature increases,\nthe long-range structure of the lattice progressively dis-\nsipates, leading to the disappearance of characteristic\npeaks associated with crystalline structure in S(q) at\nt = 7 ps.\nFigure 5. Temporal evolution of static structure factor S(q) of\nlaser-excited W nanofilm at different laser fluence, estimated\nfrom TTD-DPMD trajectories with (a) ground-state PES (b)\nlaser-excited PES. The positions of new diffraction peak are\nmarked by black dashed line to highlight the difference be-\ntween thermal and nonthermal expansion dynamics.\nAs shown in Fig.5, we present the temporal evolu-\ntion of S(q) under various laser fluence, ranging from\n60 mJ/cm2 to 120 mJ/cm2, aiming to provide a compre-\nhensive understanding of expansion dynamics. Analysis\nof the 2.4 −3.0 ˚A−1 diffraction regime reveals distinct\nfluence-dependent behaviors: (1) During thermal expan-\nsion, it manifests as continuous shifting, where a higher\nlattice heating rate can result in a slightly faster shift of\nthe new diffraction peak, as shown in Fig.5a. (2) During\nnonthermal expansion process, it exhibits as discontinu-\nous splitting, and the position of the new diffraction peak\ndisplays a strong dependence on laser fluence. A larger\nelectron pressure corresponds to a lower q value position\nof the new peak, as illustrated in Fig.5b. The observed\nqualitative disparity in expansion dynamics, as indicated\nby S(q), implies the possibility of identifying evidence\nof electronic pressure relaxation dynamics through time-\nresolved X-ray diffraction experimental methodologies.\nUbiquity of heterogeneous structural dynam-\nics.\nTo demonstrate the ubiquity of electronic pressure\n\n\n6\nFigure 6. Nonthermal behavior of laser-excited gold. (a) electronic pressure contributed by hot electrons. (b) density decrease\nand (c) short-range order of laser-excited gold under uniaxial isobaric ensemble (d) isobaric and isochoric melting behavior of\nlaser-excited gold, the black solid line denotes previous lattice dynamics prediction by Smirnov et al. [6], and the nonthermal\nmelting regime (Tm ≤300 K) is filled with red diagonals..\nFigure 7. Atomic configurations of laser-heated 35-nm-thick Au nanofilm under laser energy density of 0.80 MJ/kg, where\nthe local symmetry of atoms is identified via PTM method. The green and grey color denotes FCC and disordered structure\nrespectively.\nin laser-driven processes, we extend the TTM-DPMD\nframework to gold (Au), a noble metal with fully occu-\npied d-orbitals. Despite its distinct electronic structure,\nAu exhibits analogous nonthermal dynamics.\nAt elevated electron temperatures, the hot electrons\nalso contribute non-negligible electronic pressure in Au\n(Fig.6a), reaching 25 GPa at Te = 20, 000 K.\nUnder\nisobaric-isothermal condition (Ti = 300 K, pz = 1 bar),\nelectronic pressure-induced uniaxial expansion reduces\nFCC symmetry to face-centered tetragonal (FCT), with\ncorresponding decrease in density from 19.44 g cm−3 at\nTe = 300 K to 17.17 g cm−3 at Te = 16, 000 K (Fig.6bc).\nAs Te reaches 17,000 K, the expansion can even desta-\nbilize the lattice, triggering a disordered transition at\nroom temperature (Ti = 300 K)—a “nonthermal melt-\ning” regime where amorphization occurs without lattice\nheating (Fig.6d). These findings align with the conclu-\nsions of Daraszewicz et al., and Medvedev et al.\nre-\ngarding nonthermal behaviors under isobaric constraints\n[13, 14], suggesting that the ultrafast disordering of laser-\nexcited Au is primarily due to electron pressure relax-\nation process.\nFurther, large-scale simulations of 35-nm-thick free-\nstanding Au nanofilm (containing 137,600 atoms) con-\nfirm ultrafast heterogeneous melting, mirroring W’s be-\nhavior. As shown in Fig.7, when the laser energy den-\nsity is set to 0.80 MJ kg−1, the initial maximum electron\ntemperature is approximately ∼15, 000 K, yielding an\nelectronic pressure contribution of ∼20 GPa. With the\nrelease of electronic pressure, the surface atoms directly\ntransforms into a disordered structure due to significant\nreduction in melting point. The melt front then moves\n\n\n7\ninward at a speed of 2, 916 m s−1, completing the melt-\ning process within 8 ps. These results, along with previ-\nous prediction on the widespread existence of electronic\npressure in laser-excited materials [11], underscore the\npervasive nature of electron pressure relaxation dynam-\nics and ultrafast heterogeneous structural transformation\nin laser-driven processes.\nSummary.\nBy investigating real-time response of\nlaser-excited W and Au nanofilm via TTM-DPMD ap-\nproach, we unraveled the vital role of the electronic\npressure in the laser-driven dynamics, which was pre-\nviously not fully understood.\nAs an integral part of\nnonthermal behavior, the electronic pressure builds up\nsimultaneously with appearance of the two-temperature\nstate, wherein the lattice remains cold. At elevated elec-\ntron temperatures, the additional pressure contributed\nby hot electrons becomes significant, reaching up to\npe ∼101 GPa at Te ∼104 K. The release of electronic\npressure triggers violent uniaxial expansion from free sur-\nface, which exhibits a drastic difference from thermal ex-\npansion in temporal behaviors, which can be identified\nby time-resolved X-ray diffraction techniques. As a re-\nsult, pressure, density, and temperature discontinuity in\nthermodynamic profile is generated and moves inward at\na high speed on the order of 103 m s−1.\nThe following structural transformation is therefore\ndominated by the relaxation of electronic pressure. Two\nunexpected phenomena, absent in either purely thermal\nprocess or previous lattice dynamics calculations, were\nobserved: (i) heterogeneous solid-solid transition (in W),\nwhich directly arises from the expansion process that\ndrives the BCC-FCC transition along the uniaxial Bain\npath. (ii) ultrafast heterogeneous melting (both in W and\nAu), which is a combination of density decrease driven by\nnonthermal expansion and temperature increase induced\nby electron-phonon coupling. These findings suggest a\nextreme structural heterogeneity in laser-excited metal,\nwhich has a profound influence on the interpretation of\nexperiments and our comprehension of nonthermal be-\nhavior.\nWe also note that this structural transformation is\nfundamentally different from the conventional nonther-\nmal phase transition driven by lattice instability. The\nlatter is expected to occur in less than a phonon pe-\nriod [8, 33, 34], which can be considered as homoge-\nneous and ultrafast. Instead, the nonthermal expansion\ninduces heterogeneous structural transformation, which\ncan strongly rely on the crystal symmetry, the orientation\nof free surface, and the strength of nonthermal pressure.\nEspecially, even when phonon spectra suggest a dynami-\ncally stable structure, this structural transformation can\noccur. This is particularly evident in laser-excited Au.\nMoreover,\nconsidering the interplay between this\nheterogeneous phase transition and ultrafast melting,\nwhether the intermediate solid phase can be observed by\nexperimental measurements depends on accurate deter-\nmination of electron-phonon coupling. Especially for the\nextremely inhomogeneous thermodynamic profile, both\nelectron temperature and density dependence of electron-\nphonon energy exchange rate should be considered in the\nfuture work. On this issue, TTM-DPMD approach can\nto be coupled with the newly-developed deep learning\nscheme to infer electronic structure on-the-fly [35].\nIV.\nMETHODS\nElectron temperature dependent neural net-\nwork model.\nTo capture the modulation on PES in-\ntroduced by hot electrons, here we adopt the deep neural\nnetwork with an additional parameter, electron tempera-\nture Te, named as electron-temperature-dependent deep\npotential (ETD-DP) model [12],\nA = A(R, Te) =\nX\ni\nNαi(Dαi(ri, {rj}j∈n(i)), Te)\n(1)\nwhere A(R, Te) indicates that the free energy depends\non the local atomic environment R and electron tem-\nperature, Nαi denotes the neural network of specified\nchemical species of αi of atom i, and the descriptors Dαi\ndescribes the local environment of atom i with its neigh-\nbor list n(i) = {j|rji < rcut}. The ETD-DP model can\ninherently incorporate the nonthermal characteristics of\nlaser-excited matters in molecular dynamics simulations,\nincluding the hot-electron-modulated atomic forces and\nvirial tensor,\nF = −∂A\n∂Ri\n= −∂U\n∂Ri\n+ Te\n∂S\n∂Ri\n(2)\nΞ = ∂A\n∂Ω· ΩT = ∂U\n∂Ω· ΩT −Te\n∂S\n∂Ω· ΩT\n(3)\nhere Ri denotes the coordinate vector of atom i, Ωde-\nnotes a 3 × 3 matrix formed by three lattice vectors and\nΩT is its transpose. Consider a system composed of N\natoms, the total pressure of this electron-ion system is\ndetermined by the summation of ionic thermal kinetic\ncontribution and virial contribution.\nIn the maintext, the ETD-DP model of tungsten\nis generated with DeePMD-kit packages [36] and DP-\nGenerator [37]. The configurations space with different\nelectronic occupation considered in this work is efficiently\nsampled.\nBased on the training data set generated in\nprevious work [12], we further improved the uniaxial ex-\npansion behavior of laser-excited tungsten along (100),\n(110) and (111) direction by sampling additional 1,860\nconfigurations, where the ion temperature ranges from\n100 K to 4,000 K, electron temperature ranges from 100\nK to 25,000 K.\nThe details in DP training and Kohm-Sham den-\nsity functional theory (KS-DFT) calculation is the same\nas previous work, where the self-consistency calcula-\ntions are all performed with the VASP packages [38].\nThe Perdew-Bruke-Erzerhof (PBE) exchange correlation\nfunctional is used [39] and psudopotential takes the pro-\njector augmented-wave (PAW) formalism [40]. The sam-\n\n\n8\npling of Brillouin zone is chosen as 0.2 ˚A−1 under am-\nbient condition and 0.5 ˚A−1 for high temperature (T ≥\n1600 K).\nTwo-temperature model coupled neural net-\nwork molecular dynamics approach.\nTo simulate\nthe real-time response of material upon laser excitation,\nthe additional description on electron subsystem is in-\ntroduced and strongly coupled with atomic system in\nTTM-DPMD approach. The heat conduction equation\nof electron continuum characterizes the temporal evo-\nlution of electron occupation, thus governing the tran-\nsition of atomic system between different Te-dependent\nPES. Langevin dynamics is incorporated to mimic the\ndynamic electron-ion collision, thus including the non-\nadiabatic energy exchange between electron and atomic\nsubsystem,\nCe(Te)∂Te\n∂t = ∇· (κe∇Te) −gei(Te)(Te −Ti) + S(r, t)\n(4)\nmi\nd2ri\ndt2 = −∇iA(Te) −γivi + ˜Fi(t)\n(5)\nwhere Ce the electron heat capacity, κe the electronic\nthermal conductivity, gei the electron-phonon coupling\nconstant, S(r, t) the laser source, γi the friction parame-\nter, ˜Fi the random force with Gaussian distribution.\nTo simulate the material response that relevant to\nreal experimental conditions, here the 30-nm-thick W\nnanofilm [28] and 35-nm-thick Au nanofilm [18] are cho-\nsen as the target sample. A Gaussian temporal profile of\nlaser pulse is used, and the duration is set to 130 fs. Since\nboth the thickness of W and Au nanofilm is comparable\nto the mean free path of excited electrons (∼33 nm in W\nand ∼100 nm in Au), the ballistic motion of the excited\nelectrons leads to the fast (within ∼100 fs) redistribution\nof the deposited energy within the ballistic range. As a\nresult, the uniform laser energy deposition is expected,\nS(t) =\nFabs\nσd\n√\n2π exp(−(t −t0)2\n2σ2\n)\n(6)\nwhere Fabs the absorbed laser fluence, σ the standard\ndeviation of the temporal Gaussian distribution, d the\nthickness of nanofilm, t0 the time zero defined as the\narrival of the maximum of the laser pulse. The absorbed\nlaser energy density ϵ can be estimated via ϵ = Fabs/ρd,\nwhere ρ the mass density.\nIn the maintext, the TTM-DPMD simulations is per-\nformed with LAMMPS packages [41] through modified\nEXTRA-FIX module.\nThe electronic heat capacity is\nobtained by individual DFT calculations Ce = Te ∂Se\n∂Te .\nThe electron-phonon coupling is set to constant value\nof 2.0 × 1017 W m−2 K−1, and the duration of laser\npulse is set to 130 fs.\nThe electron thermal conduc-\ntivity is described by the Drude model relationship,\nκe(Te, Ti) = 1\n3v2\nF Ce(Te)τe(Te, Ti), where vF is Fermi ve-\nlocity and τe(Te, Ti) is the total electron scattering time\ndefined by the electron-electron and electron-phonon\nscattering rates, 1/τe = 1/τe−e + 1/τe−ph = AT 2\ne + BTi.\nThe coefficients A = 2.11 × 10−4 K−2 ps−1, B = 8.4 ×\n10−2 K−1 ps−1, vF = 9710 ˚A ps−1 are adopted.\nFor atomic system, the sample geometry of 30-nm-\nthick 100-oriented single-crystalline W foil is a paral-\nlelepiped Lx × Ly × Lz with Lx = Ly = 30a0 and\nLz = 95a0 (171,000 atoms). a0 = 3.17104 ˚A is the pa-\nrameter of the elementary BCC cell for W corresponding\nto the ETD-DP model at 300 K and 0 GPa. Extra 30\nnm vacuum space along the z-axis is set to mimic the\nfree boundary condition. Periodic boundary conditions\nare applied in the lateral directions (x and y-axis). These\nconditions simulate the experimental situation in which\nthe laser spot diameter is large (hundreds of microns)\ncompared to the depth of the laser energy deposition\n(tens of nanometers) so that the effects of the edges of\nthe laser beam can be neglected.\n[1] M. Guan, D. Chen, S. Hu, H. Zhao, P. You, and S. Meng,\nTheoretical insights into ultrafast dynamics in quantum\nmaterials, Ultrafast Science 2022, 1 (2022).\n[2] E. M. Rafael R. Gattass, Femtosecond laser microma-\nchining in transparent materials, Nat. Photonics 2, 219\n(2008).\n[3] D. M. Fritz, D. A. Reis, B. Adams, R. A. Akre, J. Arthur,\nC. Blome, P. H. Bucksbaum, A. L. Cavalieri, S. En-\ngemann, S. Fahy, R. W. Falcone, P. H. Fuoss, K. J.\nGaffney, M. J. George, J. Hajdu, M. P. Hertlein, P. B.\nHillyard, M. H. von Hoegen, M. Kammler, J. Kaspar,\nR. Kienberger, P. Krejcik, S. H. Lee, A. M. Lindenberg,\nB. McFarland, D. Meyer, T. Montagne, E. D. Murray,\nA. J. Nelson, M. Nicoul, R. Pahl, J. Rudati, H. Schlarb,\nD. P. Siddons, K. Sokolowski-Tinten, T. Tschentscher,\nD. von der Linde, and J. B. Hastings, Ultrafast bond\nsoftening in bismuth: Mapping a solid interatomic po-\ntential with x-rays, Science 315, 633 (2007).\n[4] W. Liu, J. Luo, S. Li, and L. Wang, The seeds and homo-\ngeneous nucleation of photoinduced nonthermal melting\nin semiconductors due to self-amplified local dynamic in-\nstability, Sci. Adv. 8, eabn4430 (2022).\n[5] V. Recoules, J. Clerouin, G. Zerah, P. M. Anglade, and\nS. Mazevet, Effect of intense laser irradiation on the lat-\ntice stability of semiconductors and metals, Phys. Rev.\nLett. 96, 055503 (2006).\n[6] N. A. Smirnov, Copper, gold, and platinum under fem-\ntosecond irradiation: Results of first-principles calcula-\n\n\n9\ntions, Phys. Rev. B 101, 094103 (2020).\n[7] B. Arnaud and Y. Giret, Electron cooling and debye-\nwaller effect in photoexcited bismuth, Phys Rev Lett\n110, 016405 (2013).\n[8] E. S. Zijlstra, J. Walkenhorst, and M. E. Garcia, An-\nharmonic noninertial lattice dynamics during ultrafast\nnonthermal melting of insb, Phys Rev Lett 101, 135701\n(2008).\n[9] C. Lian, S. B. Zhang, and S. Meng, Ab initio evidence\nfor nonthermal characteristics in ultrafast laser melting,\nPhys. Rev. B 94, 184310 (2016).\n[10] S. Khakshouri, D. Alf`e, and D. M. Duffy, Development\nof an electron-temperature-dependent interatomic poten-\ntial for molecular dynamics simulation of tungsten under\nelectronic excitation, Phys. Rev. B 78, 224304 (2008).\n[11] E.\nB´evillon,\nJ.\nP.\nColombier,\nV.\nRecoules,\nand\nR. Stoian, Free-electron properties of metals under ul-\ntrafast laser-induced electron-phonon nonequilibrium: A\nfirst-principles study, Phys. Rev. B 89, 115117 (2014).\n[12] Q. Zeng, B. Chen, S. Zhang, D. Kang, H. Wang, X. Yu,\nand J. Dai, Full-scale ab initio simulations of laser-driven\natomistic dynamics, npj Comput. Mater. 9, 213 (2023).\n[13] S. L. Daraszewicz, Y. Giret, N. Naruse, Y. Murooka,\nJ. Yang, D. M. Duffy, A. L. Shluger, and K. Tanimura,\nStructural dynamics of laser-irradiated gold nanofilms,\nPhys. Rev. B 88, 184101 (2013).\n[14] N. Medvedev and I. Milov, Nonthermal phase transitions\nin metals, Sci. Rep. 10, 12775 (2020).\n[15] A. Descamps, B. K. Ofori-Okai, O. Bistoni, Z. Chen,\nE. Cunningham, L. B. Fletcher, N. J. Hartley, J. B.\nHastings, D. Khaghani, M. Mo, B. Nagler, V. Recoules,\nR. Redmer, M. Schrner, D. G. Senesky, P. Sun, H.-E.\nTsai, T. G. White, S. H. Glenzer, and E. E. McBride,\nEvidence for phonon hardening in laser excited gold us-\ning x ray diffraction at a hard x- ray free electron laser,\nSci. Adv. 10, eadh5272 (2024).\n[16] G. A. de la Pena Munoz, A. A. Correa, S. Yang,\nO. Delaire, Y. Huang, A. S. Johnson, T. Katayama,\nV. Krapivin, E. Pastor, D. A. Reis, S. Teitelbaum, L. Vi-\ndas, S. Wall, and M. Trigo, Ultrafast lattice disordering\ncan be accelerated by electronic collisional forces, Nat.\nPhys. 19, 1489 (2023).\n[17] R. Ernstorfer, M. Harb, C. T. Hebeisen, G. Sciaini,\nT. Dartigalongue, and R. D. Miller, The formation of\nwarm dense matter: experimental evidence for electronic\nbond hardening in gold, Science 323, 1033 (2009).\n[18] M. Mo, Z. Chen, R. Li, M. Dunning, B. Witte, J. Bald-\nwin, L. Fletcher, J. Kim, A. Ng, R. Redmer, et al.,\nHeterogeneous to homogeneous melting transition visual-\nized with ultrafast electron diffraction, Science 360, 1451\n(2018).\n[19] J. M. Molina and T. G. White, A molecular dynamics\nstudy of laser-excited gold, Matter Radiat. Extrem. 7,\n036901 (2022).\n[20] M. I. Arefev, M. V. Shugaev, and L. V. Zhigilei, Kinetics\nof laser-induced melting of thin gold film: How slow can\nit get?, Sci. Adv. 8, eabo2621 (2022).\n[21] D. S. Ivanov and L. V. Zhigilei, Combined atomistic-\ncontinuum modeling of short-pulse laser melting and\ndisintegration of metal films, Phys. Rev. B 68, 064114\n(2003).\n[22] Q. Zeng and J. Dai, Structural transition dynamics of\nthe formation of warm dense gold: From an atomic scale\nview, Sci. China-Phys. Mech. Astron. 63, 1 (2020).\n[23] S. Lu, L. Xie, K. Lai, R. Chen, L. Cao, K. Hu, X. Wang,\nJ. Han, X. Wan, J. Wan, Q. Dai, F. Song, J. He, J. Dai,\nJ. Chen, Z. Wang, and G. Wang, Plasmonic evolution\nof atomically size-selected au clusters by electron energy\nloss spectrum, Natl Sci Rev 8, nwaa282 (2021).\n[24] J. Xu, D. Chen, and S. Meng, Decoupled ultrafast elec-\ntronic and structural phase transitions in photoexcited\nmonoclinic vo¡sub¿2¡/sub¿, Sci. Adv. 8, eadd2392 (2022).\n[25] P. M. Larsen, S. Schmidt, and J. Schi{o}tz, Robust struc-\ntural identification via polyhedral template matching,\nModelling Simul. Mater. Sci. Eng. 24, 055007 (2016).\n[26] Supplemental material,\nSee Supplemental Material for\ndetails about the thermodynamic evolution and struc-\ntural transformation in TTM-DPMD.\n[27] Y. Giret, S. L. Daraszewicz, D. M. Duffy, A. L. Shluger,\nand K. Tanimura, Nonthermal solid-to-solid phase tran-\nsitions in tungsten, Phys. Rev. B 90, 094103 (2014).\n[28] M. Mo, S. Murphy, Z. Chen, P. Fossati, R. Li, Y. Wang,\nX. Wang, and S. Glenzer, Visualization of ultrafast melt-\ning initiated from radiation-driven defects in solids, Sci.\nAdv. 5, eaaw0392 (2019).\n[29] Z. Chen, V. Sametoglu, Y. Y. Tsui, T. Ao, and A. Ng,\nFlux-limited nonequilibrium electron energy transport in\nwarm dense gold, Phys Rev Lett 108, 165001 (2012).\n[30] Z. Chen, M. Mo, L. Soulard, V. Recoules, P. Hering,\nY. Tsui, S. Glenzer, and A. Ng, Interatomic potential\nin the nonequilibrium warm dense matter regime, Phys.\nRev. Lett. 121, 075002 (2018).\n[31] G. Grimvall, B. Magyari-K¨ope, V. Ozoli¸n˘s, and K. A.\nPersson, Lattice instabilities in metallic elements, Rev.\nMod. Phys. 84, 945 (2012).\n[32] S. T. Murphy, S. L. Daraszewicz, Y. Giret, M. Watkins,\nA. L. Shluger, K. Tanimura, and D. M. Duffy, Dynamical\nsimulations of an electronically induced solid-solid phase\ntransformation in tungsten, Phys. Rev. B 92, 134110\n(2015).\n[33] S. Wall, S. Yang, L. Vidas, M. Chollet, J. M. Glow-\nnia, M. Kozina, T. Katayama, T. Henighan, M. Jiang,\nT. A. Miller, D. A. Reis, L. A. Boatner, O. Delaire,\nand M. Trigo, Ultrafast disordering ofvanadium dimers\nin photoexcited vo2, Science 362, 6414 (2018).\n[34] X. Wang, J. C. Ekstrom, A. U. J. Bengtsson, A. Jarnac,\nA. Jurgilaitis, V. T. Pham, D. Kroon, H. Enquist, and\nJ. Larsson, Role of thermal equilibrium dynamics in\natomic motion during nonthermal laser-induced melting,\nPhys Rev Lett 124, 105701 (2020).\n[35] Q. Zeng, B. Chen, X. Yu, S. Zhang, D. Kang, H. Wang,\nand J. Dai, Towards large-scale and spatiotemporally re-\nsolved diagnosis of electronic density of states by deep\nlearning, Phys. Rev. B 105, 174109 (2022).\n[36] J. Zeng, D. Zhang, D. Lu, P. Mo, Z. Li, Y. Chen,\nM. Rynik, L. Huang, Z. Li, S. Shi, Y. Wang, H. Ye,\nP. Tuo, J. Yang, Y. Ding, Y. Li, D. Tisi, Q. Zeng, H. Bao,\nY. Xia, J. Huang, K. Muraoka, Y. Wang, J. Chang,\nF. Yuan, S. L. Bore, C. Cai, Y. Lin, B. Wang, J. Xu,\nJ. X. Zhu, C. Luo, Y. Zhang, R. E. A. Goodall, W. Liang,\nA. K. Singh, S. Yao, J. Zhang, R. Wentzcovitch, J. Han,\nJ. Liu, W. Jia, D. M. York, W. E, R. Car, L. Zhang, and\nH. Wang, Deepmd-kit v2: A software package for deep\npotential models, J. Chem. Phys. 159, 054801 (2023).\n[37] L. Zhang, D.-Y. Lin, H. Wang, R. Car, and E. Weinan,\nActive learning of uniformly accurate interatomic poten-\ntials for materials simulation, Phys. Rev. Materials 3,\n023804 (2019).\n\n\n10\n[38] G. Kresse and J. Furthm¨uller, Efficient iterative schemes\nfor ab initio total-energy calculations using a plane-wave\nbasis set, Phys. Rev. B 54, 11169 (1996).\n[39] J. P. Perdew, K. Burke, and M. Ernzerhof, Generalized\ngradient approximation made simple, Phys. Rev. Lett.\n77, 3865 (1996).\n[40] P. E. Bl¨ochl, Projector augmented-wave method, Phys.\nRev. B 50, 17953 (1994).\n[41] S. Plimpton, Fast parallel algorithms for short-range\nmolecular dynamics, J. Comput. Phys. 117, 1 (1995).\nV.\nACKNOWLEDGMENTS\nThis work was supported by the National Natu-\nral Science Foundation of China under Grant Nos.\n12304307, 12122103, 12104507, the Science and Tech-\nnology Innovation Program of Hunan Province under\nGrant No. 2021RC4026, and Postgraduate Technology\nInnovation Program of Hunan Province under Grant\nNo.CX20220070.\nVI.\nAUTHOR CONTRIBUTIONS\nQ.Z and J. D. proposed the original idea and designed\nthe research. Q. Z. carried out the simulations, Q. Z., X.\nY., D. K., and J.D. analyzed and interpreted the results.\nQ. Z, X. Y. and J. D. wrote the manuscript with the help\nfrom other authors.\nB. C., S. Z., and K. C. provided\nadditional support for the interpretation of the results.\nAll the authors reviewed the manuscript.\nVII.\nCOMPETING INTERESTS\nThe authors declare no competing interests.\nVIII.\nADDITIONAL INFORMATION\nSupplementary information is available for this pa-\nper\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20886v1.pdf",
    "total_pages": 10,
    "title": "Ultrafast Heterogeneous Melting of Metals under Extreme Non-equilibrium States",
    "authors": [
      "Qiyu Zeng",
      "Xiaoxiang Yu",
      "Bo Chen",
      "Shen Zhang",
      "Kaiguo Chen",
      "Dongdong Kang",
      "Jiayu Dai"
    ],
    "abstract": "The extreme electron-ion nonequilibrium states created by ultrafast laser\nexcitation challenge conventional melting paradigms. Through neural\nnetwork-enhanced multiscale simulations of tungsten and gold nanofilms, we\nidentify electronic pressure relaxation as a critical driver of heterogeneous\nphase transformations. Subpicosecond uniaxial expansion generates density\ndecrease that enable surface-initiated melting far below equilibrium melting\ntemperatures. This ultrafast heterogeneous melting propagates at 2500\nm/s-tenfold faster than thermal mechanisms-with characteristic stationary\ndiffraction peak splitting distinguishing it from thermal expansion dynamics.\nWhile tungsten shows pressure-driven solid-solid transitions, gold exhibits\ncomplete room-temperature amorphization under electronic stress. These results\nestablish hot-electron-mediated lattice destabilization as a universal pathway\nfor laser-induced structural transformations, providing new insights for\ninterpreting time-resolved experiments and controlling laser-matter\ninteractions.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}