{
  "id": "arxiv_2502.20787v1",
  "text": "MODULATION OF SUPERNARROW EIT PAIR\nVIA ATOMIC COHERENCE\nLin Cheng1,3,∗, Zhiyuan Xiong1, Shuaishuai Hou1, Yijia Sun1, Chenyu Dong1, Fan Wu4and\nKun Huang1,2\n1State Key Laboratory of Dynamic Testing Technology, North University of China,\nTaiyuan, China, 030051\n2Upgrading office of Modern College of Humanities and Sciences of Shanxi Normal University,\nLinfen, China, 041000\n3Department of Physics, University of Ottawa,\nOttawa, K1N6N5, Canada\n4School of Textile Science and Engineering, Xi’an Polytechnic University,\nXi’an, China, 710049\n∗Corresponding author e-mail:kiki.cheng@nuc.edu.cn\nAbstract\nWe report the phenomena of electromagnetically induced transparency (EIT) and electromagnetically\ninduced absorption (EIA) using two identical beams in rubidium atomic vapor.\nThe Λ-type EIT\nconfiguration is employed to examine the EIT spectrum for the D1 line in 87Rb F=2 characteristics\nby varying parameters such as frequency detuning, Iprobe/Ipump, the total power of probe and pump\nbeam. Notably, the pump beam is also investigated in this process, which has not been previously\nstudied. We study the effect of of the phase between the two applied fields and find that EIA and EIT\ncan transform into each other by adjusting the relative phase. These finding may have applications in\nlight drag or storage [1], optical switching [2], and sensing [3,4].\nKeywords: tunable absorber, epsilon-near-zero, metamaterial, bianisotropic response.\n1\nIntroduction\nElectromagnetically induced transparency (EIT) enables weak probe light to traverse a medium with-\nout absorption under the influence of strong coupling light. Recent years have seen significant theoretical\nand experimental advancements in the concept and methodology of EIT. EIT has made substantial\nprogress in fields such as nonlinear optics, non-inversion lasers, optical storage, light speed reduction,\nquantum noise suppression, and quantum information. Notably, advancements have been achieved in\nquantum noise reduction, nonlinear mixing efficiency, precise measurement of weak magnetic fields, real-\nization of non-inversion lasers, and achieving high refraction with low absorption. The nonlinear phase\nshift in EIT, associated with light-induced refractive index modulation, can reshape the wavefront of\nan optical field during propagation and has been observed in various nonlinear media, including liquid\ncrystals, semiconductors, and carbon nanotubes.\nIn addition, the alkali atom systems have recently\n260\narXiv:2502.20787v1  [physics.atom-ph]  28 Feb 2025\n\n\nemerged as powerful platforms for EIT. The multi-parameter can be adjusted, the phenomenon is simple,\nisotropic, and can be used to verify some basic physical phenomena in Alkali atom which has potential\napplications in optical switching, high-precision spectroscopy, atomic clocks [5,6], and systems with large\nnonlinearities. It also provides a foundation for practical applications in optical storage [7] and light\ndrag [8].\nMany studies have focused on degenerate EIT using two beams from two lasers. A drawback of this\napproach is that the overlapping and diameters of the beams are different, necessitating the use of two\nbeams or an acousto-optic modulator. Few studies have examined the use of a single beam emitted by\none laser to investigate EIT. Considering that a single beam can form two circularly polarized beams,\nafter a linearly polarized light passes through a 1/4 wave plate, the two beams interact with the medium,\navoiding issues of angle and radius inconsistency. This approach is advantageous for studying the EIT\neffect in degenerate energy levels and can be applied to optical storage applications. This study effectively\nexamines the impact of multiple parameters on EIT under the ideal condition of two beams with the same\nradius and perfect overlap at an angle of 0 degrees. It provides valuable reference data for degenerate\nEIT experiments.\nIn our experiments, we investigate and analyze the EIT induced by a single-frequency beam, which can\nbe controlled by parameters such as frequency detuning, ratio between two beams, and total power of these\ntwo beams. Meanwhile, the bright and dark states result from constructive and destructive interference\nbetween continuous and discrete states, which can be controlled through phase transitions, nonlinear\nphase shifts, and cross-dressing effects. Our findings are interpreted on the basis of a configuration of\nFano interference, utilizing both first- and third-order nonlinearity interference. We also investigated the\nEIT of pump beam by changing the nonlinear phase while scanning the magnetic field.\n2\nExperimental scheme\nEc\nEp\n5P1/2,F=1\n5S1/2,F=2\n-\n\n(a)\n(b)\n|3>\n|1>\n|2>\nFigure 1: (a) Λ-type configuration of 87Rb atomic system. The magnetic field B shifts m = ±1 levels by\n±δ. (b) Schematic of the experimental setup.\nAs shown in Fig.1 (a), the Rb atoms act as a two-level atomic system, including hyper-fine state-\ndegenerated-Zeeman levels 5S1/2, F = 2 (|1⟩and |2⟩) and an excited state 5P1/2 (|3⟩). The experimental\nsetup is shown schematically in Fig.1(b). A collimated Gaussian beam profile with a diameter of 3.2 mm\nis obtained by expanding the beam from an external cavity diode laser (ECDL) at a center wavelength\nof ∼794.88 nm. The Gaussian beam is separated into two arms, the first beam passes through the Rb\ncell without buffer gas as a reference beam, and the other beam is seeded into a 7 cm-long Rb cell at the\n261\n\n\nsame temperature which is maintained at 75◦C by a heated tape. The second beam is decomposed into\ntwo circularly polarized sub-beams by a fixed polarizer and rotated HWP denoted as Ep (left circularly\npolarized σ+) and Ec (right circularly polarized σ−), causes the transition ∆m = ±1. The outputs of\ntwo beam are automatically aligned and propagate perfectly through a magnetically shielded Rb cell.\nThe first beam are seeded into a 7 cm-long thermal Rb vapor cell installed into a solenoid coil and\nwrapped by µ-metal for magnetic shielding. The second Rb cell is filled with about 5 torr of He buffer\nFigure 2:\nThe induced typical EIT signal, the full width of the resonance is about 100 KHz. The EIT\nsignal generated can be up to 65% efficient.\ngas to ensure the long lifetimes of the atomic Zeeman coherence, obtaining narrow EIT resonances. A\nlongitudinal magnetic field for shifting the Zeeman sub-levels is created by a solenoid mounted inside the\ninner magnetic shield. The cell and the solenoid are enclosed in a µ-metal cylinder to eliminate earth’s\nand stray magnetic fields. A solenoid is used to control the static magnetic field along the propagation\ndirection of the laser beam. The produced magnetic field addressed a Zeeman coherence tuned to different\nhyperfine optical transitions with orthogonal linear polarization. The scan range of magnetic field is about\n939 mG, corresponding to 1250 KHz. The frequency can be fixed at the resonance point of 87Rb, F = 2,\nand then the magnetic field is swept, changing the effective detuning.\nA wollaston prism is used to separaet the probe and pump (coupling) beams, allowing their trans-\nmissions to be monitored as a function of detuning. The transmitted intensities are recorded directly\nby two photodetectors. The signal obtained from the photodiodes, while scanning the external magnetic\nfield, is recorded by the digital oscilloscope and transferred to a computer. We fix the frequencies of both\nthe frequencies of coupling and probe beams, and change the splitting between (5S1/2, mF = +1) and\n(5S1/2, F = 2, mF = −1) by scanning a bias magnetic field in the same direction as the light propagation.\nIn other words, we scan the detuning of the pump and probe to their respectively resonant transitions.\nWe employ the transition of |1⟩→|3⟩for probe (horizontally polarized) and |2⟩→|3⟩for coupling (ver-\ntically polarized). The probe and pump beams are perfectly spatial overlapped. The frequency detuning\ndenotes the difference between the resonant transition frequency Ωi and the frequency ωi of Ei (i=1,2).\nGi = µi3Ei/ℏis the Rabi frequency between the states |j⟩and |3⟩(j = 1, 2), where µj3 is the transition\ndipole matrix element. The two beams propagating in the same direction eliminate Doppler effects due\nto the motion of atoms. We scan the longitudinal magnetic field in this work instead of scanning the\nprobe beam. γ1 and γ2 are rates of spontaneous emission into the respective states |1⟩and |2⟩, whereas\nΓij describes the decay rate of coherence between |i⟩and |j⟩states. When a homogeneous magnetic field\n262\n\n\nis applied to the cell along the light axis using a solenoid coil, the energies of |1⟩and |2⟩states vary\naccordingly due to the Zeeman effect. Additionally, the spectrum has a flat background that is different\nfrom other high-resolution spectroscopy techniques using a scanning probe beam. We next present how\nthe signal is influenced by different parameters.\n3\nTheory analysis\nThe absorption of probe can be expressed by the absorption coefficient α = ωin0Im(χ)/c [9], where ω\nis the angular frequency of the probe beam, c is the speed of light in vacuum, and χ(ω) is the electric\nsusceptibility, n0 is the background refractive index. The absorption of the probe is proportional to\nIm(ρ31). The dispersion coefficient is given by β = ωin0Re(χ)/2c. To determine the susceptibility χ,\nwe analyze the density matrix ρij. The on-diagonal density matrix ρii correspond to the probabilities of\noccupying specific states, while the off-diagonal density matrix ρij are proportional to the electric dipole\nmoment of the transition and describe the coherence associated with the transition. For the transmission\nof probe and pump beams, the Liouville (or Von Neumann) pathways are ρ(0)\n11\nG2\n−−→ρ(1)\n31 (dressed by E2)\nand ρ(0)\n22\nG1\n−−→ρ(1)\n32 (dressed by E1), respectively. The expression of the first-order density matrix expanded\nusing Taylor expansion are given by\nρ(1)\n32 =\niGp\nΓ32 + i∆p + G2ce−ivcteiΦseiΦx\nΓ31+i(∆p−∆c)\n≈\niGp\nΓ32 + i∆p\n× (1 −\nG2\nce−ivcteiΦseiΦx\n(Γ31 + i(∆p −∆c))(Γ32 + i∆p))\n=\niGp\nΓ32 + i∆p\n+\n−iGpG2\nce−ivcteiΦseiΦx\n(Γ32 + i∆p)(Γ31 + i(∆p −∆c))(Γ32 + i∆p)\n=ρ(1)\np\n+ ρ(3)\np\n(1)\nρ(1)\n31 =\niGc\nΓ31 + i∆c +\nG2pe−ivpteiΦseiΦx\nΓ32+i(∆c−∆p)\n≈\niGc\nΓ31 + i∆c\n× (1 −\nG2\npe−ivpteiΦseiΦx\n(Γ32 + i(∆c −∆p))(Γ31 + i∆c))\n=\niGc\nΓ32 + i∆c\n+\n−iGcG2\npe−ivpteiΦseiΦx\n(Γ31 + i∆c)(Γ32 + i(∆c −∆p))(Γ31 + i∆c)\n=ρ(1)\nc\n+ ρ(3)\nc\n(2)\nwhere δ = gµBB/ℏis the Zeeman level shift of hyperfine level degeneracy caused by an external magnetic\nfield B. Here, µB is the Bohr magneton, g is the gyro-magnetic factor, B is the applied magnetic field,\nΦ0 = −vpt is the initial phase, Φs and the Φx are the self-Kerr nonlinear phase and cross-Kerr nonlinear\nphase, respectively. The Kerr nonlinear coefficient n2 can be expressed as\nn2 = Reχ(3)\nϵ0cn1\n= nS\n2 + nX\n2 = ReNµ12(ρS(3)\n21\n+ ρX(3)\n21\n)\nϵ0E2sEp\n1\nϵ0cn1\n.\n(3)\n263\n\n\nHere, χ(3) is the nonlinear susceptibility that induces the nonlinear phase through self- and cross-phase\nmodulation [10]. The imaginary parts of ρ31 and ρ21 proportionally determine the absorption of the\nprobe and pump beams after passing through the Rb cell.\nThe matrix element ρ is related to the\ncomplex susceptibility by the relation,\nP =1\n2ϵ0Ei\n\u0002\nχ(ωi)e−iωit + c.c.\n\u0003\n= −2ℏgNρe−iωit + c.c.\n(4)\nwhere N is the density of atoms and c.c is the complex conjugate. Substitute ρij into Eq. (3) allows the\ncalculation of the absorption and dispersion of the Rb. The dressed first-order density matrix ρ(1)\n31 can\nbe approximated as the sum of the first order and third-order terms governed by the dressed phase and\n∆c. The interference |ρ(1)\n11 + ρ(3)\n31 | ≈\np\nI1 + I2 + 2I1I2 cos(∆ϕ) = |ρ(1)\n11 | ± |ρ(1)\n31 |, where I1 and I2 represent\nthe intensities of first order and third order nonlinearity. Therefore, the interference can be constructive\nor destructive depending on whether the phase to be either 0 or π.\nAccording to Eqs.1 and 2, the nonlinear phase shift is influenced by the intensity of the incident\nbeams. To verify this, detailed experiments were set up to study the influence of the parameters on the\nprobe and pump signals.\n4\nResults and discussion\nFigure 3: Probe transmission as a function of frequency detuning. (a) The frequency detuning increase\nfrom negative to 0. (b) The frequency continuously increase from 0 to positive detuning. Change in\nprobe transmission as a function of detuning from 87Rb, F = 2 to 85Rb, F = 3, With a small magnetic\nfield of order 1 G to lift the degeneracy in the F = 1 and F = 2 ground states. EIT spectra due to the\nZeeman splitting of the magnetic sublevels in a magnetic field.\nThe power of the probe beam (P1 ≈100 µW ) and coupling beam (P2 ≈1 mW) can make the\nspectral width of the EIT small enough to achieve high efficiency. We applied an external magnetic field\nto investigate the effects of Zeeman splitting of the magnetic sub-levels. Applying 100 mV to the solenoid\ngenerated approximately 626 mG. A magnetic field of 30 mG corresponds to about a 40 KHz level shift.\nThe transmission spectra of the probe beam at the magnetic field of 626 mG are shown in Fig.3(a),\n264\n\n\nwhich illustrates the calculated transmission of the probe beam as a function of its frequency. Here,\nthe magnetic field ranges from 0 to 939 mG. The efficiency of the EIT components gradually increase\nto 67% gradually with an increase in detuning, accompanied by an FWMH of 100 KHz. Meanwhile,\nAutler-Towns splitting appears. In contrast, the width becomes large with an decrease in the detuning\nwithout Autler-Townes splitting. A broaden FWMH of EIT is due to response of decay rate γ87,b < γ85,b,\n52S1/2 →52P1/2 ¡ 52S1/2 →52P3/2 and an increase in the magnetic field leads to an increase in the\ndetuning ∆of the frequency ωc from the respective atomic transition. The pure dressing suppression\ndip corresponds to the dressed states |±⟩created by E2. Then the E1 field only resonates with the\ndressed energy level |G1+⟩, which meets the enhancement condition ∆1 + λ+ = 0 and a bright state\n(pure enhancement peak) is observed as shown in Fig.3(a). When ∆1 = ∆2 = 0 in Eqs. (1) and (2),\nIm(ρ(1)\n31 ) and Im(ρ(1)\n21 ) are approximately 0 which means the Rb is transparent to both the probe beam\nand coupling beam.\nFigure 4: The EIT efficiency and FWMH in different total power with same ratio between probe and\npump beam.\nFurthermore, when we increase the total power while maintaining the ratio between the two beams,\nthe intensity of the EIT signal increases. The experimental results indicate how the intensity of the EIT\nsignal depends on the ratio between the two beam, as shown in the blue line in Fig. 4. Moreover, Fig. 4\nshows that the half-height width in red line increases linearly with the overall power.\nThe transmission spectrum of the probe and pump lasers. These two beams exhibit distinct signals,\nEIT and EIA, and can concurrently measure different group velocities. This optical switch differs from\nthose referenced previously. Changes in probe transmission are shown as a function of detuning from the\nF = 1 −F = 2 levels, with a small magnetic field (approximately 1 G) applied to resolve degeneracy in\nthe F = 1 and F = 2 ground states. The range of the transmitted pump light is scaled by a factor of\n30. The spectrum makes the system quite sensitive to the relative phase between the two applied fields.\nThe density matrix is always accompanied by a phase-dependent term exp(±iΦ) where Φ denotes the\nrelative phase between the two laser fields. Adopting the same parameters as those in Fig. 4, we obtain\n265\n\n\nFigure 5: Variation of EIT signal with respect to the ratio between probe and pump power, showcasing\nEIT and EIA conversion.\ntwo energy absorption curves from the probe and coupling beam as function of the magnetic field for\ndifferent relative phases. From this figure, we find that under optimal ratio, when Φ is π, the system\nexhibits good EIT, while for Φ is 0 or 2π, EIA appears. This behavior acts like an optical switch. The\nFWMH of the observed EIT and EIA FWMH are\n100 KHz. By tuning the relative phase between\nthe two applied fields from π to 0, the medium transitions from EIT to EIA, vice versa. The optical\nFano interference could be achieved by adjusting experimental parameters. The bright- and dark-state\nsuggests EIT (I∝|ρ(1)\np | + |ρ(3)\np |) and EIA (I∝|ρ(1)\np | −|ρ(3)\np |), respectively. The dressing enhancement peak\narises from constructive interference between a perfect continuous state (ρ(1)\n21 ) and sharp discrete state as\nshown in Eq. (1) and (2).\n5\nConclusion\nIn summary, a technique utilizing a single beam was employed to observe narrow EIT resonances in\nnearly degenerate Λ system rubidium vapor. EIT can be controlled by frequency detuning, ratio between\nthe two beams and total power. Meanwhile, under optimal the relative phase conditions between the\ntwo applied fields, EIT rather than EIA can occur at resonance. By tuning the relative phase from 0\nto π, the medium transitions from EIT to EIA and vice versa. The narrow transparency resonances of\nEIT find applications in magnetometer atomic clocks [5, 6], light drag [8], high-resolution spectroscopy,\noptic switch and light storage [7]. This approach is expected to significantly enhance the sensitivity of\nnonlinear magneto-optical measurements substantially. Consequently, we anticipate that this method\nwill attract interest for sensitive optical magnetometer and for establishing new, lower bounds to test the\nviolation of parity and time-reversal invariance. Moremore, as demonstrated here, this technique enables\nsensitive measurements of phase shifts in nonlinear media with a very high signal-to noise ratio [11].\nEthical Approval:not applicable\nConfilicts of Interest: The authors declare no confilct of interest.\nDeclarations The statements, opinions and data contained in all publications are solely those of\nthe individual author(s) and contributor(s) and not of MDPI and/or the editor(s). MDPI and/or the\n266\n\n\neditor(s) disclaim responsibility for any injury to people or property resulting from any ideas, methods,\ninstructions or products referred to in the content.\nAuthor Contributions: Conceptualization, F.W and L.C; software,L.C;validation, Z. X., Y.S.,\nS.H., C.D; project administration, L.C.; funding acquisition, L.C. All authors have read and agreed to\nthe published version of the manuscript.\n6\nData Availability Statement\nThe data that support the findings of this study are available from the corresponding author, upon\nreasonable request.\n7\nFunding\nThe support the National Natural Science Foundation of China (62305312), the Natural Science Foun-\ndation of Shanxi Province, China (202203021222021), Research Project Supported by Shanxi Scholar-\nship Council of China(2312700048MZ) and the fellowship of China Postdoctoral Science Foundation\n(2022M722923). Shanxi Provincial Teaching Reform and Innovation Project (2024YB008).\n8\nAcknowledgement\nL.C acknowledges the support of China Scholaship Council, Zhiyuan Xiong, Yijia Sun, Shuaishuai Hou,\nKaixiang Hou, Yi Chen are grateful to L. C for helpful discussions.\nReferences\n[1] D. F. Philips, A. Fleischhauer, A. Mair, R. L. Walsworth, and M. D. Lukin, Storage of light in\natomic vapor, Physical Review Letters, 86, 783, (2000).\n[2] A. W. Brown, X. Min, All-optical switching and routing based on an electromagnetically induced\nabsorption grating, Optics Letters, 30, 699-701, (2005).\n[3] I. K. Kominis, T. W. Kornack, J. C. Allred, and M. V. Romalis, A subfemtotesla multichannel\natomic magnetometer, Nature, 422, 596–599, (2003)\n[4] A. Gusarov, D. Levron, E. Paperno, R. Shuker, and B. A. Baranga, Three-dimensional magnetic\nfield measurements in a single serf atomic-magnetometer cell, IEEE Transactions on Magnetics, 45,\n4478–4481 (2009).\n[5] J. Kitching, L. Hollberg, S. Knappe, and R. Wynands, Compact atomic clock based on coherent\npopulation trapping, Electronics Letters, 37, 1449–1451, (2001).\n[6] Svenja, Knappe, Vishal, Shah, Peter, D., D., Schwindt, Leo, and Hollberg, A microfabricated atomic\nclock, Applied Physics Letters, (2004)\n[7] I. Novikova, R. L. Walsworth, and Y. Xiao, Electromagnetically induced transparency-based slow and\nstored light in warm atoms, Laser & Photonics Review. 6, 333–353, (2012).\n267\n\n\n[8] Y. Solomons, C. Banerjee, S. Smartsev, J. Friedman, D. Eger, O. Firstenberg, and N. Davidson,\nTransverse drag of slow light in moving atomic vapor, Optics Letter, 45, (2020).\n[9] H. S. Moon, H. A. Kim, B. S. Kim, and J. B. Kim, Electromagnetically induced transparency in an\nideal three-level system in 87 Rb atoms, Journal- Korean Phys. Soc. 35, 207–211, (1999).\n[10] L. Cheng, Z. Zhang, L. Zhang, D. Ma, and Y. Zhang, Manipulation of ring-shaped beam via self- and\ncross- phase modulation in lower intensity, Physical Chemistry Chemical Physics. 21, 7618-7622,\n(2019).\n[11] V. Sautenkov, M. Lukin, C. Bednar, I. Novikova, E. Mikhailov, M. Fleischhauer, V. Velichansky,\nG. R. Welch, and M. O. Scully, Enhancement of magneto-optic effects via large atomic coherence\nin optically dense media, Physics Review A, 62, 023810 (2000).\n268\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20787v1.pdf",
    "total_pages": 9,
    "title": "Modulation of supernarrow EIT pair via atomic coherence",
    "authors": [
      "Lin Cheng",
      "Zhiyuan Xiong",
      "Shuaishuai Hou",
      "Yijia Sun",
      "Chenyu Dong",
      "Fan Wu",
      "Kun Huang"
    ],
    "abstract": "We report the phenomena of electromagnetically induced transparency (EIT) and\nelectromagnetically induced absorption (EIA) using two identical beams in\nrubidium atomic vapor. The {\\Lambda}-type EIT configuration is employed to\nexamine the EIT spectrum for the D1 line in 87Rb F=2 characteristics16 by\nvarying parameters such as frequency detuning, Iprobe/Ipump, the total power of\nprobe and pump beam. Notably, the pump beam is also investigated in this\nprocess, which has not been previously studied. We study the effect of of the\nphase between the two applied fields and find that EIA and EIT can transform\ninto each other by adjusting the relative phase. These finding may have\napplications in light drag or storage, optical switching, and sensing.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}