{
  "id": "arxiv_2502.21306v1",
  "text": "Solar prosumage under different pricing regimes: Interactions\nwith the transmission grid\nDana Kirchema,∗, Mario Kendziorskib, Enno Wiebrowb, Wolf-Peter Schilla, Claudia\nKemferta, Christian von Hirschhausenb\naDIW Berlin, Mohrenstraße 58, Berlin, 10117, Germany\nbTU Berlin, Straße des 17. Juni 135, Berlin, 10623, Germany\nAbstract\nSolar prosumers, residential electricity consumers equipped with photovoltaic (PV)\nsystems and battery storage, are transforming electricity markets. Their interactions\nwith the transmission grid under varying tariff designs are not yet fully understood.\nWe explore the influence of different pricing regimes on prosumer investment and\ndispatch decisions and their subsequent impact on the transmission grid. Using an\nintegrated modeling approach that combines two open-source dispatch, investment\nand grid models, we simulate prosumage behavior in Germany’s electricity market\nunder real-time pricing or time-invariant pricing, as well as under zonal or nodal\npricing. Our findings show that zonal pricing favors prosumer investments, while\ntime-invariant pricing rather hinders it. In comparison, regional solar availability\nemerges as a larger driver for rooftop PV investments.\nThe impact of prosumer\nstrategies on grid congestion remains limited within the scope of our model-setup,\nin which home batteries cannot be used for energy arbitrage.\nKeywords:\nprosumage, transmission grid, open-source modeling, ELMOD,\nDIETER\n∗corresponding author\nEmail addresses: dkirchem@diw.de (Dana Kirchem ), ewi@wip.tu-berlin.de (Enno\nWiebrow), wschill@diw.de (Wolf-Peter Schill), ckemfert@diw.de (Claudia Kemfert),\ncvh@wip.tu-berlin.de (Christian von Hirschhausen)\nPreprint submitted to Smart Energy\nMarch 3, 2025\narXiv:2502.21306v1  [econ.GN]  28 Feb 2025\n\n\n1. Introduction\nIn many electricity markets, grid-connected consumers can minimize their energy\nbills by using rooftop PV systems and battery storage to self-generate parts of their\nelectricity consumption. This phenomenon, which has been referred to as solar pro-\nsumage [1, 2], is on the rise in electricity markets around the world. In Germany, solar\nprosumage has been growing significantly in recent years, and projections indicate a\ncontinued upward trajectory as the overall PV capacity is planned to quadruple to\n400 GW, with rooftop systems accounting for around half of it [3].\nSolar prosumage has also become more relevant in other countries, such as Aus-\ntralia [4, 5], France [6] and the United States [7]. While solar availability remains\none of the key determinants of economic viability, such that in countries like Ireland,\nprosumer incentives are not sufficient for market uptake in the current policy environ-\nment [8], a study for Spain also demonstrates that even with high solar availability,\npolicy design is crucial for the uptake in prosumage [9].\nThe decision-making of prosumers still largely remains independent of wholesale\nmarket price signals, while retail tariffs, feed-in tariffs and PV investment costs play\na pivotal role in shaping their investment and dispatch decisions [10]. Among these\nfactors, lower feed-in tariffs can reduce PV investments, while low variable retail\ntariff parts can reduce PV self-generation and battery investments [10]. Network\ncharges and levies are also relevant for prosumer decisions [11]. Regarding storage\ninvestment costs, home batteries have to be very cheap for high self-consumption to\nbe economically viable for prosumers [12].\nWhile the effects of solar prosumage on other generation and storage capacities\nin the power sector have been previously studied [2], their interactions with the\nelectricity grid are not yet fully understood. On distribution grid level, prosumage\ncan lead to additional distribution grid stress, which can be mitigated by policies\nsuch as a maximum grid feed-in of rooftop PV [13]. Furthermore, grid stress can\nbe reduced when prosumage systems are operated with a load and solar availability\nforecast rather than with the premise of self-consumption maximization [14].\nEvidence regarding the effects of prosumage on the transmission grid is more\nambiguous though.\nProsumage may help defer transmission grid investments by\nreducing peak PV feed-in levels [2]. This can lead to lower transmission network\nusage and losses, particularly when prosumage smoothes PV peak feed-in. [15] find\nthat on the one hand, the additional renewable energy provided by prosumers can\ncause transmission charges to decrease. On the other hand, strategic behavior of\nprosumers could also increase transmission charges.\nIn this context, the implications of electricity tariff design for investments of\nrooftop PV and home batteries have not yet been connected to transmission grid ef-\n2\n\n\nfects in the current literature Understanding these interactions is relevant for efficient\ngrid planning and operation and for developing market structures that accommodate\nthe growing trend of decentralized self-generation. This study aims to bridge this\ngap by analyzing how different pricing regimes influence investments in solar photo-\nvoltaic capacities and home batteries, and how these in turn impact the transmission\ngrid. To achieve this, we combine two open-source models to quantitatively assess\nthe potential impacts. First, the economic dispatch model ELMOD generates whole-\nsale price time series for future scenarios in 2030 in Germany. These electricity prices\nserve as the basis for investment decisions into rooftop PV and battery storage us-\ning a prosumage module of the model DIETER, which takes into account different\ntariff design assumptions. Finally, the impacts of these investment decisions on the\ntransmission grid are evaluated with ELMOD. This multi-stage approach allows us to\nprovide a comprehensive analysis of how different pricing regimes influence prosumer\nbehaviour and, consequently, the transmission grid.\n2. Methods\n2.1. The Model ELMOD\nELMOD [16–18] is a comprehensive multi-step electricity market and transmis-\nsion grid model, incorporating both zonal market clearing with subsequent redispatch\nand nodal pricing representation. By integrating congestion management, ELMOD\naims to compare different market designs and their impact on market outcomes. The\ntool leverages a DC load flow approach to model power flows and analyze effects on\nthe grid.\n2.1.1. Day-Ahead model\nIn the day-ahead model, ELMOD minimizes the marginal costs of electricity\ngeneration and storage as well as the costs of unit curtailment according to the\nobjective function in Equation 1.\nmin\nT\nX\nt\nP\nX\np\nmcp,t · GENp,t + ccurt ·\nT\nX\nt\nZ\nX\nz\nCUz,t\n+\nT\nX\nt\nS\nX\ns\nmcs,t · GENs,t\n(1)\nBased on the selected market configuration, either the Zonal Market Balance\n(Equation 2) with exchange constraints or the Nodal Market Balance (Equation\n3) with DC load flow constraints is implemented. Note that the difference lies in\ntaking into account the net exchange of the zone EXnet\nz,t with its neighboring zones in\n3\n\n\nEquation 2, while taking into account the injection INJn,t at each node in Equation\n3.\nP\nX\np in z\nGENp,t +\nS\nX\ns in z\n(GENs,t −CHARGEs,t) + EXnet\nz,t −CUz,t\n=\nN\nX\nn in z\nloadn,t −LLz,t,\n∀z ∈Z, t ∈T\n(2)\nP\nX\np in n\nGENp,t +\nS\nX\ns in n\n(GENs,t −CHARGEs,t)\n+INJn,t −CUn,t\n=loadn,t −LLn,t\n∀n ∈N, t ∈T\n(3)\n2.1.2. Redispatch model\nIn the redispatch phase of ELMOD, redispatch costs are minimized according\nto the objective function in Equation 4.\nTotal redispatch costs comprise of the\nredispatch costs of generating units P and storage units S, as well as the curtailment\ncosts of units after the redispatch.\nmin\nT\nX\nt\nP\nX\np\ncredisp · (GEN up\np,t + GEN down\np,t\n) +\nT\nX\nt\nP\nX\np\nccurt · (CU redisp\np,t\n−cup,t)\n+\nT\nX\nt\nS\nX\ns\ncredisp · (GEN up\ns,t + GEN down\ns,t\n)\n+\nT\nX\nt\nS\nX\ns\ncredisp · (CHARGEup\ns,t + CHARGEdown\ns,t\n)\n(4)\nThe redispatch market balance (Equation 5) resembles the nodal market balance\nof the day-ahead model, but with the updated unit and storage operation after the\nredispatch.\n4\n\n\nP\nX\np in n\nGEN redisp\np,t\n+\nS\nX\ns in n\n(GEN redisp\ns,t\n−CHARGEredisp\ns,t\n)\n+ INJn,t −CUn,t +\nPRS\nX\nprs in n\nGENprs,t\n= loadn,t −LLn,t\n∀n ∈N, t ∈T\n(5)\n2.2. The Model DIETER\nDIETER (Dispatch and Investment Evaluation Tool with Endogenous Renew-\nables) is an open-source power sector model [19] which can incorporate different\nenergy sectors, such as mobility, heating or hydrogen production [20–23].1\nIn its\nmain version, DIETER is a linear program that determines the least-cost capac-\nity investment and dispatch decisions for various electricity generation and storage\ntechnologies.\nIn this analysis, we do not use the full model, but only a prosumage module,\nleaning on [10]. This model does not include the full power sector, but relies on\nexternal wholesale electricity prices. Here, prosumers minimize their overall electric-\nity bill according to equation 6. They optimize their investments into PV capacity\nINV ESTpv and home batteries INV ESTse, their direct self-consumption Gself\npv,t , their\nself-consumption via storage GENpv,t, their electricity usage from the grid Ft and\nthe grid feed-in GEN grid\npv,t , subject to the electricity price (RTP or time-invariant)\nwith perfect foresight and subject to a constant feed-in tariff tfeed. Prosumers sat-\nisfy their electricity demand by grid consumption, battery storage outflows and self\nconsumption (see equation 7). Household batteries can only be charged with energy\nfrom rooftop PV.\nRegarding PV investments, we assume that the extension potential solely involves\nprivate residential rooftops. We project that every suitable household in Germany\nwill not only have a solar rooftop but also a corresponding solar battery. The invest-\nments in solar rooftop PV and batteries are anticipated to substitute the PV and\nbattery capacities previously projected in the price forecast.\n1The model code for this study is available here: https://gitlab.com/diw-evu/projects/\nprosumage-lp.\n5\n\n\nmin\n(cinvest\npv\n+ cfix\npv ) · INV ESTpv + cinvest\nse\n· INV ESTse\n+ cinvest\nsp\n· INV ESTsp + cfix\ns /2 · (INV ESTsp + INV ESTse)\n+\nT\nX\nt\n(mcpv · GENpv,t + mcs · (CHARGEs,t + GENs,t)\n+ (tfix + tvar + binarynodal · rtpnodal\nt\n+ binaryzonal · rtpzonal\nt\n) · Ft\n−(tfeed + binarynodal · rtpnodal\nt\n+ binaryzonal · rtpzonal\nh\n) · GEN grid\npv,t )\n(6)\ndemandt ≤Ft + GENs,t + GEN self\npv,t\n(7)\n2.3. Model linkage\nTo investigate the interactions between solar prosumage and the transmission\ngrid, we integrate the two open-source models ELMOD and DIETER. Our approach\nfocuses on leveraging ELMOD for price forecasting and using the prosumage module\nof the model DIETER [10] to model investment and dispatch decisions (illustrated\nin figure 1).\nStep 1: Price Forecast with ELMOD. First, ELMOD performs a price forecast for\nthe parameterized scenario. This model clears either a zonal market (where Germany\nfunctions as a single price zone) or a nodal market (where each network node has its\nunique price) depending on the scenario. The projected wholesale electricity prices\nare subsequently utilized in the ensuing step.\nStep 2: Prosumage Investment Modeling with DIETER. Next, DIETER uses the\nwholesale price forecasts from ELMOD to model investments in rooftop PV and\nbattery capacity. These investments represent cost-minimizing prosumage behavior\nand are influenced by different electricity pricing scenarios:\n• Time-Invariant Prices: Simulates a fixed tariff that remains constant, as expe-\nrienced by most retail customers.\n• Real-Time Pricing: Reflects day-ahead market price variations in real-time,\nproviding a dynamic pricing environment.\nNote that the feed-in tariff remains the same across scenarios.\nStep 3: Day-Ahead Market Simulation with Updated Capacities. The investment de-\ncisions from DIETER are taken as updated rooftop PV and home battery capacities\nfor subsequent simulations.\n6\n\n\nScenario\nELMOD: Price forecast\nPrices\nDIETER: Investment\nProsumage capacities\nELMOD: Day-Ahead\nPrices (incl. new\ncapacities)\nMarket Dispatch\nELMOD: Prosumer\noptimization\nProsumer strategy\nELMOD: Redispatch\nFinal results\nData Exchange\nFigure 1: Illustration of the model interaction\n7\n\n\nStep 4: Prosumer Optimization. Depending on the market pricing scenario (real-\ntime vs. time-invariant, zonal vs. nodal), prosumers tailor their battery dispatch\nstrategies to enable solar self-consumption patterns that minimize their energy bills.\nStep 5: Intraday and Redispatch Stage. Finally, the prosumers feed-in to the grid\nand their demand from the grid are used as inputs for the intraday and redispatch\nstage. Here, any potential imbalances in generation or grid congestion are resolved\nthrough redispatch actions.\n3. Input data and scenarios\nWe parameterize our model analysis for a German case study, leaning on the\nScenario C of Germany’s grid development plan (Netzentwicklungsplan, NEP) [24] for\nthe year 2030. This scenario represents an ambitious outlook in terms of prosumage\nand flexibility technologies. It envisages a share of 65% renewable energy sources in\ngross electricity consumption, which is likely to be achieved well before the year 2030\nand thus can be interpreted as a near-term future scenario.\nTechnology\nInstalled capacity [GW]\nHard coal\n8.1\nLignite\n9\nGas\n33.4\nOther conventionals\n5\nBiomass\n8.5\nHydro\n10.4\nWind onshore\n85.5\nWind offshore\n18.3\nGround-mounted PV (solar park)\n31.2\nRooftop PV\nEndogenous\nHome battery\nEndogenous\nTable 1: Installed Capacity by Technology.\nOur data set encompasses 640 transmission grid nodes and over 1500 transmis-\nsion lines, based on a data set generated with the open-source Power Market Tool\n(POMATO) [25]. Renewable time series with high spatial and temporal resolution\nare generated at the nodal level using the atlite tool [26] which enables accurate\nsimulation of renewable generation profiles, particularly for wind and solar power.\n8\n\n\nRegionalization of wind onshore and ground-mounted solar PV (solar parks) capac-\nities is performed based on regional extension potentials.\nThe maximum installable PV capacity for households within each NUTS3 zone\nis calculated based on the extension potential data cited by [27], with a set capacity\nlimit of 10 kW per household. Households have an average electricity demand of\n3500 kWh per year. In order to set a maximum installable PV capacity at every\nnode, we divide the total household electricity demand at each node by 3500 to\nobtain the number of representative households. This is then multiplied by 10 kW,\nwhich gives the maximum installable PV capacity at every node.\nMarket simulations are conducted for one year at an hourly resolution.\nTwo\nmarket designs are simulated: zonal pricing with redispatch (the current market de-\nsign) and nodal pricing. The current market design represents the existing structure\nwhere wholesale electricity prices vary hourly, but are uniform across the market\nzone and congestion is managed via redispatch.\nNodal pricing involves location-\nspecific hourly wholesale market prices that reflect the local supply-demand balance\nconsidering transmission grid congestion.\nRegarding tariff schemes, we further distinguish between time-invariant and real-\ntime pricing (RTP). In combination, this results in four different pricing regimes:\nzonal time-invariant, zonal RTP, nodal time-invariant and nodal RTP. The feed-in\ntariff for household-produced electricity is set at 0.06 Euro per kWh.\nReal-time\nprices are obtained from the price forecast of ELMOD, while time-invariant prices\nare calculated as a demand-weighted average of this price time series over the full\nyear. The electricity tariff comprises a variable non-energy payment of 0.25 Euro per\nkWh and no upfront payment.\n4. Results\n4.1. Investment decisions\nInvestments into rooftop PV vary between 3.51 kW per household in the North\nof Germany and 5.13 kW per household in the South (see Figure 2). The increasing\ninvestments from northern to southern regions in Germany are due to higher solar\nirradiation, which translates into higher full-load hours of solar PV. On average,\nwe observe that zonal pricing leads to substantially higher rooftop PV investments\nthan nodal pricing. This is driven by wholesale price differences. Prices in the zonal\nscenario (0.35 EUR/kWh) are on average around twice as high than in the nodal\nscenario (0.17 EUR/kWh), which makes higher levels of prosumage more profitable.\nReal-time pricing further leads to slightly higher rooftop PV adoption as compared\nto time-invariant pricing. This is because real-time pricing offers the opportunity\n9\n\n\nSuederdonn\nAbbenﬂeth\nKummerfeld\nKruemmel\nFarge\nCloppenburg Ost\nLueneburg\nBuescherhof\nDoerpen West\nLuedershagen\nBechterdissen\nUtfort\nAltenkleusheim\nSelbeck\nBollenacker\nEnniger\nLießem\nWuergassen\nWahle\nSt. Peter\nLippborg\nAßlar\nQuint\nBergshausen\nSiersdorf\nSchmoelln\nOberhaid\nMechlenreuth\nRedwitz\nAschaﬀenburg\nCrossen\nRoehrsdorf\nBASF\nOtterbach\nHeilbronn\nSittling\nPlattling\nEichstetten\nWendlingen\nNeuﬁnsing\nKuehmoos\nOberottmarshausen\nRauhenzell \n3.6\n3.8\n4\n4.2\n4.4\n4.6\n4.8\n5\n5.2\nTariﬀ\nnodal time-invariant price\nnodal RTP\nzonal time-invariant price\nzonal RTP\nkW per household\nFigure 2: Investments in rooftop PV per (representative) household\nfor prosumers to align the electricity self-consumption with the electricity wholesale\nmarket and to substitute grid consumption in high-price hours to a larger extent.\nThe highest PV investments are achieved with a combination of zonal and real-time\npricing.\nWe observe similar effects for home battery investments. These tend to be the\nhigher in the scenario with zonal pricing, which makes self-consumption more prof-\nitable because of higher average wholesale prices. Additionally, consumers can avoid\nhigh-price periods by storage discharging if they are subjected to real-time pricing,\nthus they tend to invest more into home batteries. Power ratings of home batteries\nrange from 0.4 kW to 0.7 kW, while energy capacity is between 2.6 kWh and 3.8 kWh\n(see Figure 3). In terms of storage energy capacity, the effect of real-time pricing on\n10\n\n\nItzehoe\nSuederdonn\nWindpark Iven\nLuedershagen\nMeppen\nOvenstaedt\nMalchow\nReuter\nHeinersdorf\nSt. Peter\nKoepchenwerk\nBomig\nBergshausen\nLauchstaedt\nPreilack\nZukunft\nRagow\nWeida\nBergrheinfeld\nTrennfeld\nUchtelfangen\nHomburg\nWeier\nOttenhofen\nLechhausen\nFoehring\nRauhenzell \n0.45\n0.5\n0.55\n0.6\n0.65\n0.7\nKiel/West\nSuederdonn\nKummerfeld\nDiele\nBentwisch\nWehrendorf\nWindpark Bertikow\nPoeppinghausen\nSiegburg\nEller\nHattingen\nVoerden\nPaderborn-Sued\nMarzahn\nWolmirstedt\nKlostermansfeld\nWaldlaubershaim\nPreilack\nBeerfelden\nHueﬀenhardt\nPhilippsburg\nSchwandorf\nMuehlhausen\nTiengen\nMetzingen\nMeitingen\nKruen\n2.6\n2.8\n3\n3.2\n3.4\n3.6\n3.8\nnodal time-invariant price\nnodal RTP\nzonal time-invariant price\nzonal RTP\nkW per household\nkWh per household\nPower rating\nEnergy capacity\nFigure 3: Investments in home batteries per (representative) household\ninstalled capacity is smaller than for storage power rating or PV installations. Zonal\npricing still has a positive effect on installed energy capacity. In general, we do not\nobserve a large difference in investments based on the different pricing regimes, while\nthe location of the node and thus the availability factor of solar energy plays a much\nlarger role.\n4.2. Dispatch decisions\nFeeding the investment decisions back into ELMOD reveals how different pric-\ning schemes influence prosumer dispatch strategies. The analysis compares time-\ninvariant and real-time pricing.\nUnder time-invariant pricing, the main objective is to use stored energy imme-\ndiately to minimize losses from self-discharge, given that a very small self-discharge\nrate (lower than 0.01% per hour) is implemented. In contrast, when a temporal price\nsignal is present, such as with real-time pricing, the determining factor becomes the\nprice of grid electricity. Here, the stored electricity is not discharged immediately\nwhen domestic demand exceeds PV supply, but at least partly in later periods when\nelectricity prices are high, e.g., in early morning hours.\n11\n\n\n1125\n1150\n1175\n1200\n1225\nGW\n−20\n0\n20\n40\nEUR/MWh\n−50\n0\n50\n1125\n1150\n1175\n1200\n1225\nGW\n−20\n0\n20\n40\nEUR/MWh\n0\n10\n20\n30\n40\n50\n60\n70\nSelf consumption\nStorage charge\nSell to grid\nStorage discharge\nBuy grid\nProsumer demand\nBuy price\nFigure 4:\nOptimal prosumer dispatch decisions for real-time pricing (upper panel) and time-\ninvariant pricing (lower panel) for five selected days.\n12\n\n\n1125\n1150\n1175\n1200\n1225\nGW\n−20\n−10\n0\n10\nreal time\ntime invariant\nFigure 5: Resulting net input of prosumers to the grid.\nFigure 4 compares the prosumer strategy under both pricing schemes for an\nexemplary time period. In the case of time-invariant pricing, prosumers consume\nstored energy immediately to avoid losses from self-discharge while prosumers with\nreal-time pricing discharge their batteries to minimize the costs of grid electricity\nconsumption.\nThey prioritize purchasing electricity during low-price periods and\nconsuming stored energy during high-price periods, creating a more sophisticated\ndispatch strategy compared to time-invariant pricing.\nThe pricing scheme hardly affects the amount of energy that prosumers feed in\nto the grid, since there is no incentive to alter the strategy of maximizing energy\ncharging with the available battery capacity until it is completely charged. However,\nthe demand pattern for electricity from the network changes significantly if prosumers\nhave a real-time pricing scheme.\nFigure 5 shows the net grid interaction of prosumers under both time-invariant\npricing and real-time pricing. Under real-time pricing, grid consumption peaks are\nhigher because prosumers buy more electricity during low-price periods. In addition,\nprosumers avoid grid consumption by consuming previously stored energy during\nhigh-price hours. This behavior is particularly noticeable when prices are relatively\nlow in the evening and higher the next morning. In such cases, prosumers avoid buy-\ning electricity during high-price periods by utilizing stored energy from the previous\nday.\nFigure 6 depicts the use of all generation and storage technologies for the real-\ntime pricing scenario in the same time period. The generation from prosumers peaks\nin the middle of the day when solar PV generation is at its highest. During these\n13\n\n\nHour\n1125\n1150\n1175\n1200\n1225\nGW\n−25\n0\n25\n50\n75\nGeneration\nEUR/MWh\n−50\n0\n50\nother_res\nconventional\nsolar rooftop\nsolar park\nwind onshore\nhydro_ror\nwind offshore\nsolar battery\nhydro_psp\nhydro_res\nprosumer\nexchange\nload before prosumer dispatch\nload after prosumer dispatch\nprice\nFigure 6: Example dispatch in summer week\n14\n\n\ntime invariant\nzonal\nreal time\nzonal\ntime invariant\nnodal\nreal time\nnodal\nTWh\n−50\n0\n50\n100\n150\nSelf-consumption\nStorage in\nSell\nStorage out\nBuy\nFigure 7: Aggregated values for prosumer dispatch.\nhours, electricity is often exported to neighboring markets. The system load after the\nprosumer dispatch decision (solid black line in Figure 6) is lowered in two situations:\n1. Low-price periods: Prosumers satisfy their own demand and feed excess PV\nelectricity to the grid. Thus, the load is reduced during these hours.\n2. High-price periods: The total load is mostly lowered during times with higher\nprices because prosumers discharge their batteries and use less electricity from\nthe grid, resulting in a smoother load curve with fewer peaks.\nThese results demonstrate that real-time pricing leads to more dynamic prosumer\nbehavior and a smoother demand curve compared to time-invariant pricing because\nof an optimized operation of the home battery. Note that this is true even without\nfurther grid interactions of prosumer batteries, and while keeping a time-invariant\nfeed-in tariff.\nAlthough real-time pricing leads to more dynamic prosumer behavior and re-\nfined battery dispatch strategies, the annual difference between the scenarios remains\nsmall. Prosumers aim to minimize costs by shifting battery discharge to more ad-\nvantageous hours, but this optimization does not significantly alter the total amount\n15\n\n\nplant type\nreal time\ntime-invariant\nreal time\ntime-invariant\nzonal\nzonal\nnodal\nnodal\nother res\n57.6\n57.7\n62.2\n62.2\nconventional\n172.7\n173.7\n162.3\n163.0\nsolar rooftop\n3.6\n3.7\n4.2\n4.2\nGround-mounted PV\n23.7\n24.0\n27.2\n27.3\n(solar park)\nsolar battery\n0.8\n0.7\n0.5\n0.5\nwind onshore\n139.6\n140.0\n135.2\n135.3\nwind offshore\n79.0\n79.3\n76.3\n76.2\nhydro ror\n20.8\n20.9\n21.7\n21.7\n(run-of-river)\nhydro psp\n19.9\n19.8\n11.8\n11.7\n(pumped storage)\nTable 2: Yearly generation by plant type and scenario (TWh).\nof self-consumption, stored energy, or electricity exchanged with the grid. To some\nextent, this finding might also be driven by our model sequence, according to which\nthe prosumer investments are fixed in step 2 of the model linkage. Figure 7 shows\nthat the yearly aggregated values for self-consumption, stored energy, and electric-\nity sold to and bought from the grid remain almost identical across the two pricing\nschemes.\nThe annual generation of other market participants also remains relatively stable\nacross different pricing schemes. Table 2 provides a comparative overview of total\ngeneration from various sources besides prosumers under time-invariant and real-time\npricing scenarios.\n4.3. Transmission grid\nTable 3 shows the redispatch after the prosumer battery dispatch in terms of\ngeneration increase and decrease to balance the system. The model setup balances\nmismatches in generation caused by temporal deviations due to prosumers’ dispatch\ndecisions and network congestion in the same step, meaning that these two effects\ncannot be separated clearly.\nFigure 8 depicts the average line utilization and corresponding generation in-\ncreases and decreases. The most utilized lines are almost entirely those connected to\nother market areas, indicating that the main driver for network congestion is the ex-\nchange with neighboring markets. This observation leads to the conclusion that the\n16\n\n\nscenario\nincrease\ndecrease\nreal time zonal\n156.7\n31.8\ntime invariant zonal\n157.2\n30.7\nTable 3: Total annual generation increase and decrease after the prosumer decision stage (TWh).\nadaptation of generation is to a large extent a redispatch measure not caused by pro-\nsumers’ decisions but rather by the specific model setup and dataset. A comparison\nof relative values between the scenarios shows that we cannot observe a significant\nimpact on the adaptation measures.\n4.4. Limitations\nOur results provide insights into the relationship between pricing regimes and so-\nlar prosumage, and on its limited transmission grid impacts in the German scenario\nmodeled here. Yet, several limitations must be acknowledged and discussed. First,\nthe model setup assumes that prosumer behavior is not anticipated in the day-ahead\nmarket (step 1). Instead, the market is cleared as if prosumer battery dispatch could\nbe optimized in the most cost-effective way from a welfare perspective. In reality,\nwith a significant share of generation and demand coming from prosumers, other\nmarket participants would anticipate their behavior. This anticipation would likely\nlead to different market prices as other market participants would adjust their bid-\nding strategies in response to the expected prosumer dispatch patterns.\nSecond, the analysis does not consider flexibility options for households within\nthe electricity market other than home batteries. With the increasing penetration\nof electric vehicles and heat pumps, there will be more opportunities for prosumers\nto optimize their consumption strategies. Other flexible ways to react to a real time\nprice signal such as smart home automation or microgrid participation could signifi-\ncantly alter their behavior. This could lead to higher differences between the pricing\nschemes and more dynamic effects on the transmission grid. Likewise, we do not\nallow any further grid interactions of prosumer batteries. While this reflects the sta-\ntus quo in Germany, it appears desirable that PV-batteries would also provide their\nflexibility to the overall electricity sector in the future, for example by engaging in\nenergy arbitrage guided by wholesale prices. Yet, this is likely to lead to substan-\ntially different transmission grid impacts than modeled here under zonal pricing, as\nstorage charging and discharging might even aggravate existing grid congestion.\n17\n\n\nFigure 8: Average line utlization and redispatch measures for real time pricing in zonal market.\n18\n\n\nThird, the model assumes that prosumers have perfect foresight regarding their\nsolar PV generation and demand, allowing them to optimize their strategy effectively.\nIn reality, prosumers would face uncertainties in forecasting their solar PV output\nand consumption, which would affect their dispatch strategies and potentially lead\nto a less flexible behavior. This limitation appears to be particularly relevant for the\nreal-time pricing scenario, where prosumer batteries are discharged in a way that\nminimizes grud consumption costs.\nFinally, the analysis is conducted under current regulatory and policy frameworks.\nFuture changes in policies affecting feed-in tariffs, prosumer self-consumption bene-\nfits, and grid tariff design could substantially change prosumage investment decision\nand behavior. For example, lower volumetric charges could substantially reduce the\nincentives for solar prosumage [10].\n5. Conclusion\nBy linking capacity expansion, dispatch and grid models, we systematically as-\nsess the impact of tariff designs on the investment choices and operational strate-\ngies of solar prosumers, as well as their subsequent effects on the transmission grid.\nWithin our model parameterization, findings reveal that investments into rooftop\nsolar PV and home batteries are substantially driven by average solar availability,\nwhich is higher in the South of Germany. Zonal pricing provides stronger incen-\ntives for higher PV and battery investments compared to nodal pricing. The highest\ninvestments occur under zonal real-time pricing, which enables prosumers to align\ntheir self-consumption strategies better with the wholesale electricity market.\nRegarding dispatch decisions, real-time pricing leads to more dynamic prosumer\nbehavior, as battery storage is strategically used to minimize grid consumption costs\nby discharging when electricity prices are high. This results in a smoother overall\ndemand curve. The broader electricity market effects however remain limited in our\nparameterization, with only minor differences in annual electricity generation across\ndifferent technologies. The impact of prosumage on the transmission grid is similarly\nlimited in our model setup. Network congestion is predominantly driven by exchang\nwith other market areas rather than by prosumers. While small redispatch measures\nare observed, they do not significantly differ between tariff schemes. This suggests\nthat under the conditions examined in this study, prosumer dispatch strategies only\nhave a minor effect on overall transmission grid congestion.\n19\n\n\nThis finding, however, could change if prosumers used their PV-batteries also for\nenery arbitrage with grid electricity, guided by wholesale prices. In a single price\nzone, charging and discharging of batteries could then even increase transmission\nbottlenecks, depending on the location of the batteries. Exploring this in an ad-\njusted model setting could be a promising avenue for future research. Likewise, our\nresults hinge on several assumptions and simplifications of our modeling approach.\nFuture research could address some of these limitations, including the anticipation\nof prosumer behavior in market-clearing mechanisms, the integration of additional\nhousehold flexibility options such as electric vehicles and heat pumps, and the con-\nsideration of imperfect foresight in prosumer decision-making.\n6. Acknowledgments\nWe gratefully acknowledge financial support by the German Federal Ministry\nof Economic Affairs and Climate Action (BMWK) via the project MODEZEEN\n(FKZ 03EI1019D). We thank Christoph Weyhing and Richard Weinhold for their\ncontributions in the early stages of this work.\n7. Author contributions\nDana Kirchem: Methodology, Software, Formal analysis, Investigation, Data\ncuration, Writing - Original Draft, Visualization. Mario Kendziorski: Method-\nology, Software, Formal analysis, investigation, Data curation, Writing - Original\nDraft, Visualization. Enno Wiebrow: Methodology, Software, Formal analysis,\nInvestigation. Wolf-Peter Schill: Conceptualization, Methodology, Investigation,\nWriting - Review & Editing, Funding acquisition. Claudia Kemfert: Writing -\nReview. Christian von Hirschhausen: Conceptualization, Funding acquisition.\n20\n\n\nNomenclature\nParameters\nbinarynodal Binary variable to indicate nodal real-time pricing [0,1]\nbinaryzonal Binary variable to indicate zonal real-time pricing [0,1\nccurt\nCurtailment cost in EUR/MWh\ncfix\npv\nFixed cost of rooftop PV in EUR/MWh\ncfix\ns\nFixed cost for home battery storage in EUR/MWh\ncinvest\npv\nInvestment cost of rooftop PV in EUR/MWh\ncinvest\nse\nInvestment cost for home battery storage in EUR/MWh (energy)\ncinvest\nsp\nInvestment cost for home battery storage in EUR/MW (power rating)\ncredisp Redispatch cost in EUR/MWh\ndemandt Household electricity demand at time t in MWh\nloadn,t Load at node n at time t in MWh\nmcp,t Marginal cost of generating unit p at time t in EUR/MWh\nmcs,t\nMarginal cost of storage unit s at time t in EUR/MWh\nrtpnodal\nt\nNodal real-time electricity price in EUR/MWh\nrtpzonal\nt\nZonal real-time electricity price in EUR/MWh\ntfeed\nFeed-in tariff in EUR/MWh\ntfix\nFixed share of volumetric retail tariff in EUR/MWh\ntvar\nVariable share of volumetric retail tariff in EUR/MWh\nSets\nN\nSet of nodes\nP\nSet of power plants (including renewables)\n21\n\n\nS\nSet of storage units\nT\nSet of time periods\nZ\nSet of market zones\nVariables\nCHARGEs,t Charging of storage unit s at time t in MW\nCHARGEdown\ns,t\nCharging decrease of storage unit s at time t after redispatch in MW\nCHARGEredisp\ns,t\nCharging of storage unit s at time t after redispatch in MW\nCHARGEup\ns,t Charging increase of storage unit s at time t after redispatch in MW\nCU redisp\np,t\nCurtailment of generating unit p at time t after redispatch in MWh\nCUz,t Curtailment at zone z at time t in MWh\nEXnet\nz,t\nNet exchange at zone z at time t in MWh\nFt\nGrid consumption in MWh\nGEN grid\npv,t Generation of rooftop PV to the grid at time t in MWh\nGEN self\npv,t Generation of rooftop PV for self-consumption at time t in MWh\nGENp,t Generation of unit p at time t in MWh\nGEN redisp\np,t\nGeneration of unit p at time t after redispatch in MW\nINJn,t Injection at node n at time t in MW\nINV ESTpv Investment of rooftop PV in MW\nINV ESTse Investment of home battery storage in MWh (energy)\nINV ESTsp Investment of home battery storage in MW (power rating)\n22\n\n\nReferences\n[1] C. Von Hirschhausen, Prosumage and the future regulation of utilities: An\nintroduction, Economics of Energy & Environmental Policy 6 (1).\ndoi:10.\n5547/2160-5890.6.1.cvh.\n[2] W.-P. Schill, A. Zerrahn, F. Kunz, Prosumage of solar electricity: pros, cons,\nand the system perspective, Economics of Energy & Environmental Policy 6 (1).\ndoi:10.5547/2160-5890.6.1.wsch.\n[3] F. Schmidt, A. Roth, W.-P. Schill, Ausbau der Solarenergie: viel Licht, aber\nauch Schatten, DIW Wochenbericht 33 (2024) 507–517. doi:10.18723/diw\\\n_wb:2024-33-1.\n[4] K. Say, M. John, R. Dargaville, R. T. Wills, The coming disruption: The\nmovement towards the customer renewable energy transition, Energy Policy\n123 (2018) 737–748. doi:10.1016/j.enpol.2018.09.026.\n[5] K. Say, W.-P. Schill, M. John, Degrees of displacement: The impact of household\nPV battery prosumage on utility generation and storage, Applied Energy 276\n115466. doi:10.1016/j.apenergy.2020.115466.\n[6] J. Roulot, R. Raineri, The impacts of photovoltaic electricity self-consumption\non value transfers between private and public stakeholders in France, Energy\nPolicy 122 (2018) 459–473.\n[7] E. Tervo, K. Agbim, F. DeAngelis, J. Hernandez, H. K. Kim, A. Odukomaiya,\nAn economic analysis of residential photovoltaic systems with lithium ion bat-\ntery storage in the United States, Renewable and Sustainable Energy Reviews\n94 (2018) 1057–1066.\n[8] V. Bertsch, J. Geldermann, T. L¨uhn, What drives the profitability of house-\nhold PV investments, self-consumption and self-sufficiency?, Applied Energy\n204 (2017) 1–15.\n[9] J. L. Prol, K. W. Steininger, Photovoltaic self-consumption regulation in Spain:\nProfitability analysis and alternative regulation schemes, Energy Policy 108\n(2017) 742–754.\n[10] C. G¨unther, W.-P. Schill, A. Zerrahn, Prosumage of solar electricity: Tariff de-\nsign, capacity investments, and power sector effects, Energy Policy 152 112168.\ndoi:10.1016/j.enpol.2021.112168.\n23\n\n\n[11] J. Thomsen, C. Weber, Getting prices for prosumers right? Incentivizing invest-\nment and operation of small-scale PV-battery storage systems through prices,\ncharges and levies 45 (1) 35–59. doi:10.1007/s12398-020-00295-5.\n[12] R. Green, I. Staffell, “Prosumage” and the British electricity market, Economics\nof Energy & Environmental Policy 6 (2017) 33–50. doi:10.5547/2160-5890.\n6.1.rgre.\n[13] P. Neetzow, R. Mendelevitch, S. Siddiqui, Modeling coordination between re-\nnewables and grid: Policies to mitigate distribution grid constraints using resi-\ndential PV-battery systems, Energy Policy 132 (2019) 1017–1033.\n[14] J. Mosh¨ovel, K.-P. Kairies, D. Magnor, M. Leuthold, M. Bost, S. G¨ahrs,\nE. Szczechowicz, M. Cramer, D. U. Sauer, Analysis of the maximal possible\ngrid relief from PV-peak-power impacts by using storage systems for increased\nself-consumption, Applied Energy 137 (2015) 567–575.\n[15] Y. Chen, M. Tanaka, R. Takashima, Death spiral, transmission charges, and\nprosumers in the electricity market, Applied Energy 332 (2023) 120488.\n[16] F. Leuthold, H. Weigt, C. v. Hirschhausen, ELMOD - A Model of the Euro-\npean Electricity Market, Tech. rep., Dresden University of Technology, Chair\nfor Energy Economics and Public Sector Management (Jul. 2008).\n[17] J. Egerer, Open Source Electricity Model for Germany (ELMOD-DE), DIW\nBerlin Data Documentation 83, DIW Berlin, Berlin, Germany (Mar. 2016).\n[18] J. Weibezahn, M. Kendziorski, Illustrating the Benefits of Openness: A Large-\nScale Spatial Economic Dispatch Model Using the Julia Language, Energies\n12 (6) (2019) 1153. doi:10.3390/en12061153.\n[19] C. Gaete-Morales, M. Kittel, A. Roth, W.-P. Schill, DIETERpy: a Python\nframework for the Dispatch and Investment Evaluation Tool with Endoge-\nnous Renewables, SoftwareX 15 (2021) 100784. doi:10.1016/j.softx.2021.\n100784.\n[20] D. Kirchem, W.-P. Schill, Power sector effects of green hydrogen production\nin Germany, Energy Policy 182 (2023) 113738. doi:10.1016/j.enpol.2023.\n113738.\n24\n\n\n[21] A. Roth, C. Gaete-Morales, D. Kirchem, W.-P. Schill, Power sector benefits of\nflexible heat pumps in 2030 scenarios, Communications Earth & Environment\n5 (1) (2024) 718.\n[22] C. Gaete-Morales, J. J¨ohrens, F. Heining, W.-P. Schill, Power sector effects of\nalternative options for de-fossilizing heavy-duty vehicles–Go electric, and charge\nsmartly, Cell Reports Sustainability 1 (2024) 100123. doi:10.1016/j.crsus.\n2024.100123.\n[23] A. Gu´eret, W.-P. Schill, C. Gaete-Morales, Impacts of electric carsharing on a\npower sector with variable renewables, Cell Reports Sustainability 1 (11) (Nov.\n2024). doi:10.1016/j.crsus.2024.100241.\n[24] BNetzA, Genehmigung des Szenariorahmens 2019 - 2030 (2018).\nURL https://www.netzentwicklungsplan.de/sites/default/files/2022-\n11/Szenariorahmen_2019-2030_Genehmigung_0_0.pdf\n[25] R. Weinhold, R. Mieth, Power market tool (POMATO) for the analysis of zonal\nelectricity markets, SoftwareX 16 100870. doi:10.1016/j.softx.2021.100870.\n[26] F. Hofmann, J. Hampp, F. Neumann, T. Brown, J. H¨orsch, atlite: A Lightweight\nPython Package for Calculating Renewable Power Potentials and Time Series,\nJournal of Open Source Software 6 (62) (2021) 3294.\ndoi:10.21105/joss.\n03294.\n[27] M. Ebner, C. Fiedler, F. Jetter, T. Schmid, Regionalized potential assessment\nof variable renewable energy sources in Europe, in: 2019 16th International\nConference on the European Energy Market (EEM), IEEE, pp. 1–5. doi:10.\n1109/EEM.2019.8916317.\n25\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21306v1.pdf",
    "total_pages": 25,
    "title": "Solar prosumage under different pricing regimes: Interactions with the transmission grid",
    "authors": [
      "Dana Kirchem",
      "Mario Kendziorski",
      "Enno Wiebrow",
      "Wolf-Peter Schill",
      "Claudia Kemfert",
      "Christian von Hirschhausen"
    ],
    "abstract": "Solar prosumers, residential electricity consumers equipped with photovoltaic\n(PV) systems and battery storage, are transforming electricity markets. Their\ninteractions with the transmission grid under varying tariff designs are not\nyet fully understood. We explore the influence of different pricing regimes on\nprosumer investment and dispatch decisions and their subsequent impact on the\ntransmission grid. Using an integrated modeling approach that combines two\nopen-source dispatch, investment and grid models, we simulate prosumage\nbehavior in Germany's electricity market under real-time pricing or\ntime-invariant pricing, as well as under zonal or nodal pricing. Our findings\nshow that zonal pricing favors prosumer investments, while time-invariant\npricing rather hinders it. In comparison, regional solar availability emerges\nas a larger driver for rooftop PV investments. The impact of prosumer\nstrategies on grid congestion remains limited within the scope of our\nmodel-setup, in which home batteries cannot be used for energy arbitrage.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}