{
  "id": "arxiv_2502.21234v1",
  "text": "Quantum information elements in Quantum Gravity states\nand processes\nDaniele Oriti ∗\nDepto. de F´ısica Te´orica and IPARCOS, Facultad de Ciencias F´ısicas\nUniversidad Complutense de Madrid, Spain, EU\nMarch 3, 2025\nAbstract\nWe summarize basic features of quantum gravity states and processes, common to a number of\nrelated quantum gravity formalisms, and sharing a purely combinatorial and algebraic language,\nand a discrete geometric interpretation. We emphasize how, in this context, entanglement is\na seed of topological and geometric properties, and how a pre-geometric, discrete notion of\nquantum causality can be implemented, as well as some recent results (based on random tensor\nnetwork techniques) on the conditions for information transmission and holographic behaviour\nin quantum gravity states. Together, these features indicate that quantum information concepts\nand tools play a key role in defining the fundamental structure of quantum spacetime.\nIntroduction\nThe main goal of this contribution is to show how quantum gravity states and processes as\nidentified by a number of quantum gravity formalisms can be recast in the language of quantum\ninformation and how entanglement or quantum correlations can then be seen, in the same\nformalisms, as essential in the very structure of quantum spacetime. It is not a review even of the\nfew results we will summarize briefly, let alone of the substantial research done on entanglement\nand quantum information features in quantum gravity formalisms. For the latter, we refer to\n[1, 2], to remain limited to the results obtained in the quantum gravity context closer to our\nfocus.\nThe perspective we find convenient to adopt, in order to appreciate the role of quantum\ninformation-theoretic structures in these quantum gravity formalisms, is that of emergent space-\ntime, i.e. of quantum gravity as a theory of ‘spacetime constituents’with spacetime itself, geom-\netry and fields as emergent entities [3, 4, 5, 6, 7]. This perspective is motivated by several results\nin semiclassical physics, for example black hole thermodynamics and the information paradox,\ngravitational singularities, that all point in various ways to a breakdown of key notions on which\nstandard continuum, geometric physics is based, and, more indirectly, the results of analogue\ngravity in condensed matter systems, showing how effective field theory on curved backgrounds\ncan emerge rather generically from non-gravitational systems. It is also motivated by results in\nmodern quantum gravity approaches, including the ones we focus on in this contribution, with\n∗doriti@ucm.es\n1\narXiv:2502.21234v1  [gr-qc]  28 Feb 2025\n\n\ntheir combinatorial, algebraic and, indeed, (quantum) information-theoretic structures replacing\ngeometric notions and spacetime-based quantum fields. Indeed, to give some examples, canonical\nLoop Quantum gravity replaces smooth metric geometries with piecewise-degenerate quantum\ntwisted geometries encoded in combinatorial/algebraic data, lattice quantum gravity works with\npiecewise-flat quantum (often non-metric) geometries, string theory dualities also suggest that\nthe fundamental degrees of freedom of M-theory are not spacetime-based, and AdS/CFT gives\na concrete example of emergent gravity as well as a very partial ‘emergent space’, reconstructed\nfrom a lower-dimensional and non-gravitational CFT. This perspective also implies a shift away\nfrom the more traditional perspective that sees quantum gravity as the result of straightfor-\nwardly quantizing General Relativity or some other classical gravitational and spacetime-based\ntheory (whether perturbatively or non-perturbatively)1. From an emergent spacetime perspec-\ntive, a breakdown of spacetime notions, including locality, should be expected when moving to a\nmore fundamental description. One the key task is then to identify the hidden, possibly discrete\nmicrostructure replacing continuum spacetime fields in such more fundamental description of\nthe universe, with such fields, including the metric, being then understood as collective enti-\nties and gravity and the rest of continuum spatiotemporal physics as an approximate effective\ndescription of collective dynamics; controlling such collective dynamics is the second key task.\nIn other words, the universe itself is seen as a (background independent) quantum many-body\nsystem.\nTied to the notion of spacetime emergence is the further hypothesis that spacetime geomet-\nric and, possibly, topological structures can in fact emerge from the entanglement among more\nfundamental quantum constituents [8, 9], thus via a conjectured ‘entanglement/geometry cor-\nrespondence’. Support for this conjecture has been obtained mostly in a semi-classical context\nand in the AdS/CFT context, thus in presence of well-defined spacetime and geometric notions,\nstarting with the Ryu-Takanayagi entropy formula and related results [10]. However, they are\nsuggestive of something more fundamental, that calls for a concrete realization of this idea in\nfull quantum gravity, thus also in absence of spacetime and fields as we know them. This call\nhas been heard and partially answered, we would claim, in the quantum gravity formalisms on\nwhich the rest of this contribution will focus. Quantum correlations and, more generally, quan-\ntum information-theoretic notions acquire, in fact, a central role. These formalisms are canonical\nloop quantum gravity, spin foam models, group field theories and lattice quantum gravity in first\norder (tetrad-connection) variables. Despite several technical differences between them, they all\nshare many basic features. We will discuss such shared features, and only occasionally point out\nspecific differences; unless noted otherwise, we will only consider models of 4-dimensional quan-\ntum gravity and spacetime and a Lorentzian (as opposed to Euclidean/Riemannian) setting.\nWe will first discuss the nature of quantum gravity states in these formalisms, and emphasize\nthe role that entanglement among their constituents plays, their re-interpretation as quantum\ncircuits and their use to define holographic maps and quantum information channels. Then, we\nwill discuss the corresponding quantum gravity processes, indicating their possible formulation\nas quantum causal histories and, again, as quantum circuits, as well as the present limitations\nto such reformulation.\n1Interestingly, this more traditional perspective is also, historically and in part of the present community, the one\nadopted to interpret some of the same quantum gravity formalisms that we suggest can be fruitfully understood from\nan emergent spacetime perspective.\n2\n\n\n1\nQuantum gravity states as entanglement networks\nand quantum circuits\nIn the quantum gravity formalisms we are concerned with here, generic quantum gravity states\ncan be represented as (superpositions of) entanglement networks of quantum geometric con-\nstituents; more precisely, they are expressed by assigning algebraic data to a combinatorial\ngraph, where the algebraic data are taken from the (representation) theory of (Lie) groups, no-\ntably the Lorentz group or the rotation subgroup thereof. In turn, they can be seen as composed\nof elementary quantum systems, with associated one-body Hilbert space, located on nodes of\nthe graph, with the graph itself encoding a pattern of entanglement across the (sub-)systems\nliving on the nodes.\nFigure 1: The general structure of quantum gravity states as many-body systems., with the underlying\ngraph including both open links and links connecting pairs of nodes.\nThe graphs are usually taken to be dual to 3-dimensional simplicial complexes, in quantum\ngravity formalisms with a direct discrete geometric interpretation. In the following we restrict to\nsuch case. Different formalisms, as well as different models within a given formalism, will differ\nfor the class of graphs being considered and for the choice of one-body Hilbert space associated\nto the nodes of the graphs, as well as for the quantum dynamics assumed for such quantum\ngravity states. Leaving dynamical considerations aside, in this section, we now give more details\non a specific (set of) proposal(s) for the kinematical structures, and illustrate their quantum\ninformation-theoretic aspect.\n1.1\nEntanglement patterns of atoms of space - quantum space\nas a quantum circuit\nThe one-body Hilbert space can be taken to be space of states for a quantum tetrahedron,\nwhich can be constructed from SU(2)(2) group data and expressed in terms of its irreducible\nrepresentations:\nHv =\nM\n⃗jv\n\u0010\n⊗4\ni=1V ji\nv O\nI⃗jv\u0011\n(1.1)\nwhere one has a vector space V ji\nv for the representation label ji (a ‘spin’valued in the half-\nintegers) for each of the four triangles of the tetrahedron, with canonical basis |ji, ni⟩, then\ntensored together, and I⃗jv = InvG[V j1\nv ⊗· · · ⊗V j4\nv] is the space of intertwiners, i.e. tensors\n3\n\n\ninvariant under the diagonal action of the group G = SU(2)(2), built from the same four rep-\nresentation spaces.\nThis Hilbert space can be obtained from the direct quantization of the\nclassical phase space of geometries of a single tetrahedron, parametrized by Lie algebra elements\ncorresponding to normal vectors associated to its four triangles and conjugate group elements\ncorresponding to elementary parallel transports of an SU(2)(2) connection along paths dual to\nthe same triangles. It can depicted dually as a single vertex with four semi-links outgoing from\nit (each dual to one of the four triangles of the tetrahedron).\nFigure 2:\nA spin network vertex, with specific choice of labels, dual to a 3-simplex (tetrahedron).\nThe discrete geometric interpretation is confirmed by the action of geometric operators encod-\ning the tetrahedral geometries. For example, elements of the canonical basis in V ji\nv diagonalize\nthe area of the corresponding triangle, while intertwiners encode information about the volume\nof the whole tetrahedron with given triangle areas. For more details about this quantum geom-\netry, see [? ? ]. Thus, generic states in the (kinematical) Hilbert space of the quantum gravity\nformalisms we consider here can be understood as quantum many-body states built out of this\nsingle-body Hilbert space.\nIn particular, an interesting class of quantum states are those that admit a natural interpre-\ntation as corresponding to quantum tetrahedra glued to one another across shared faces to form\nextended simplicial complexes dual to 4-valent graphs. These are (maximally) entangled states of\nquantum tetrahedra [11, 12], and can be obtained by imposing, on a state corresponding to a set\nof N disconnected quantum tetrahedra |ψ⟩∈HN = NN\nn=1 Hn\nv, the projector Pγ = Q\nAixy=1 P xy\ni ,\nwhere Ai\nxy is the adjacency matrix of the graph γ ((x, y) label the pairs of vertices in the graph,\nand the additional index i runs trough the possible multiple links connecting the same two\nvertices), and the gluing projector P xy\ni\n: Hx\ni ⊗Hy\ni →Inv (Hx\ni ⊗Hy\ni ) imposes maximal entangle-\nment along the corresponding degrees of freedom of the two semi-links one intends to connect,\nby tracing over the corresponding SU(2) labels, and thus imposing (diagonal) SU(2) invariance.\nThe resulting state for the graph γ will be a (linear combination of) spin network(s) living\nin the Hilbert space\nHγ =\nM\n{j}\n\nO\n{v}\nI\n⃗|⊑O\n{e}∈∂γ\nV je\n\n\n(1.2)\nwhere we considered the general case of a graph including some open (semi-)links {e}, with all\ngraph links labelled by an irrep of SU(2) and graph vertices labelled by an intertwiner between\nthe associated irreps.\nThese spin network states constitute the kinematical Hilbert spaces of several quantum grav-\nity formalisms: canonical loop quantum Gravity, spin foam models, simplicial quantum gravity\nand tensorial group field theories (for quantum geometric models within this broader frame-\nwork). The difference between these formalisms lies in how the single-graph (or before that, the\nsingle-vertex) Hilbert spaces are embedded into the full Hilbert space that includes all possible\n4\n\n\nFigure 3: The gluing of two spin network vertices (equivalently, two quantum tetrahedra) obtained by\nthe imposition of maximal entanglement across the shared semi-link degrees of freedom (equivalently, the\nquantum data associated to a triangle on their boundary).\ngraphs and all possible numbers of vertices (as necessary to include the infinite number of de-\ngrees of freedom one would a priori expect in a full quantum theory of gravity. For example, in\ngroup field theory, this can be given by a Fock space of quantum tetrahedra. Generically, in all\nsuch formalisms generic states are thus superpositions of (open) spin network states, including\na superposition of graph structures.\nTo appreciate further the role of entanglement in these quantum gravity states, it is interest-\ning to point out a minimal version of entanglement/geometry correspondence in their structure\n[12]. We have already seen how entanglement is directly encoding graph connectivity (simpli-\ncial adjacency relations) and thus the only topological information, in fact, that is encoded in\nsuch quantum gravity states, absent any embedding of the graphs inside continuum manifolds.\nMoreover, a local measure of entanglement between simplices glued across a shared face is given\nby the dimension of the Hilbert space of shared states, i.e. the Hilbert space associated to the\nirrep j associated to the dual link: D = 2j + 1; in fact, this is also how the quantum area\nof the same triangular face scales, upon quantization of the classical area function (”entangle-\nment/area correspondence”). Further, one can ask what is the entanglement between the four\ntriangles/links associated to the same tetrahedron/vertex and the simplest measure is again the\ndimension of the corresponding Hilbert space of states, which scales like the intertwiner label;\nin turn, this scales like the quantum volume of the tetrahedron, obtained again by quantizing\nthe corresponding volume function (”entanglement/volume” correspondence).\nBefore we summarize a few recent results exploiting this entanglement structure, it is also\nworth emphasizing that such quantum gravity states can be understood in two additional ways\nthat make their quantum information theoretic nature manifest.\nFirst, they can be understood as generalised tensor networks, of the kind that have been\ncentral in much recent literature in quantum many-body physics, entanglement renormalization,\nnumerical simulations of many-body systems, lattice gauge theory, neural networks, quantum\ncomputing, AdS/CFT correspondence and more [13, 14, 15, 16, 17, 18]. More precisely, they are\ngeneralised Projected Entangled Pair States (PEPS), the generalization corresponding to the\nfact that the link bond dimension, normally held fixed and equal in all links of the network and\nher3e corresponding to the dimension of the assigned irreps of SU(2), is dynamical and assigned\nindependently in each link, and to the fact that a generic state is actually a superposition of\ntensor networks with given combinatorics and bond dimensions, with the superposition affecting\nalso the combinatorial structure (one has a superposition of different graphs).\nSecond, they can be reformulated as defining quantum circuits [19] (see also [20]). Consider a\nspin network state associated to an oriented graph with a number of open links, and consider the\ncorresponding spin network wavefunction, depending on group elements (holonomies) associated\n5\n\n\nwith the bulk links, in the corresponding irreps of SU(2). This wavefunction can be seen as a\nboundary-to-boundary map, from the Hilbert space corresponding to the tensor product of\nrepresentation spaces for the incoming boundary links to the one corresponding to the tensor\nproduct of the representation spaces for the outgoing boundary links:\nψ({ge}e∈γ) :\nO\ne∈∂γ,t(e)∈γ\nVje →\nO\ne∈∂γ,s(e)∈γ\nVje .\n(1.3)\nThis map defines a quantum circuit for the degrees of freedom living in the boundary Hilbert\nspaces, with holonomies playing the role of unitary one-spin gates and intertwiners being instead\nmulti-spin gates.\nFigure 4: The quantum circuit corresponding to a spin network wavefunction; holonomies are one-spin\nunitary gates, while intertwiners are multi-spin gates.\nThis reformulation is intriguing as it is potentially useful for further applications of quantum\ninformation ideas in fundamental quantum gravity.\n1.2\nHolographic maps and quantum channels from quantum\ngravity states\nThe correspondence between spin network states and generalised tensor networks has been ex-\nploited in a number of works, starting from [21, 16], and then in [22, 23, 24] and more recently\nin [25, 26, 27]. Here we give a brief summary of the last set of results. For other related results\nwith a similar formal setting and goals, although a slightly different perspective, see also [28].\nThe starting point is to consider quantum spin network states associated to a generically\nopen graph (which is held fixed in the following), of the general form:\n|φγ⟩=\nM\n{j}\nX\n{n}\nX\n{ι}\nφ{j}\n{n},{ι} Pγ\nO\nv\n|{jv}, {nv}, ιv⟩\n(1.4)\nwhere we have highlighted its construction from a product basis built from the one-body Hilbert\nspaces, but kept generic the assignment of irreps j for each link and intertwiner labels ι for each\nvertex, as well as the vector indices in each representation space.\nGiven such states, one can identify two subsets of data: the spin labels and magnetic numbers\nassociated to the boundary links of the graph, which we may call boundary dofs, and the spin\nlabels and intertwiner labels associated with the internal links and with the vertices of the graph,\nrespectively, which we call bulk dofs.\nIn terms of this partition, we are interested in defining two types of maps for a given quantum\nstate: bulk-boundary maps, and boundary-boundary maps, where the name indicates their\ndomain and target. In the first case, we are interested in particular in the condition that make\nsuch bulk-boundary maps holographic; in the second, we aim also to identify the conditions that\nwould characterize such boundary-boundary maps as good quantum channels of information.\nIn order to apply more straightforwardly tensor network techniques, we restrict to a subclass\nof quantum states, whose modes factorise per vertex, i.e. φ{j}\n{n}{ι} = Q\nv(fv)jv\nnv,ιv.\n6\n\n\nFigure 5: A schematic representation of a quantum state associated to an open (4-valent) graph.\nConsider the first issue. To simplify the analysis, we fix the bulk spins to specific values\ncollectively labelled J. This leads to a decoupling of boundary and remaining bulk dofs. Thus\nthe relevant Hilbert space factorizes as: HJ = N\nv I⃗jv N\ne∈∂γ V je. Now we can define a map\nMφγ, depending on the chosen quantum state, between the two bulk and boundary sub-spaces,\nmapping a generic bulk state |ζ⟩= P {ι}ζ{ι}|{ι} to the boundary state |φ∂γ(ζ)⟩= ⟨ζ|φγ⟩, which\nis clearly fully specified by the chosen quantum state for bulk+ boundary.\nAs a proxy condition for holographic behaviour, we take the isometry of this map, i.e. the\ncondition: M†\nφγMφγ = I, where I is the identity in the bulk subspace.\nOne can then show that the isometry condition is satisfied if and only if the reduced bulk\ndensity matrix ρbulk = Tr∂γ\nh\n|φγ⟩⟨φγ|\nQ\nv Djv\ni\nis maximally mixed, i.e. it has maximal entropy. In turn\nits entropy can be estimated, in terms of Renyi entropies, via standard randomization techniques\napplied to tensor networks [29, 30], which allow to translate the problem of maximizing the\nentropy of the reduced density matrix of the quantum system into that of minimizing the free\nenergy of a dual Ising model.\nIn our case, the same randomization method shows that, in\nthe regime in which spins are large (naively, a semiclassical regime), the boundary-bulk map\ndefined by our quantum gravity state is, roughly speaking, the more isometric (holographic)\nthe more inhomogeneous is the assigment of spin labels. The precise mathematical conditions\ncan be found in [25]. For related work, although relying on different methods, see [19]. This\nis interesting, because it may indicate an avenue for a microscopic, quantum gravity realization\n(and explanation?) of holography in a non-spatiotemporal and information-theoretic context.\nConsider now the second issue, i.e. transmisison of information and the entanglement be-\ntween two portions of the boundary, for the same quantum state and within the same restrictions\n(fixed bulk spins, fixed graph, factorized state). We partition the boundary dofs into two com-\nplementary sets A and ¯A, and look at the reduced density ρA = Tr ¯\nA[ρ] for the region A, where\nρ is the density matrix for the full quantum state φγ.\nWe are interested in the entanglement entropy between the two subregions of the boundary.\nAs a proxy for it, we can compute the 2nd Renyi entropy of the reduced density matrix, using\nagain the same random tensor network techniques, and thus the same dual ising model. The\ncalculation can be performed for both the homogeneous, same-spin case (all bulk spins assumed\nequal), and the inhomogeneous one.\nFrom the calculation, in the case of vanishing bulk (intertwiner) entropy, one obtains an\nexact Ryu-Takayanagi-like formula\nS(ρA)2 ≃K(j, γ)minΣA|ΣA|\n(1.5)\nwhere K is a factor depending on the details of the bulk spin assignment and |ΣA| is the\nsize (i.e. the number of crossing links) of the minimal surface in the bulk separating the two\nboundary regions.\n7\n\n\nFigure 6: Partitioning the boundary links into two subsets\nFigure 7: RT-like behaviour for the entanglement entropy between boundary subregions\nWhen the bulk (intertwiner) entropy is not negligible, one finds that the RT formula acquires\na correction term measuring the bulk contribution\nS(ρA)2 ≃K(j, γ)minΣA|ΣA| + Sbulk\n(1.6)\nwhich can also be computed. Interestingly, when the bulk entropy increases, a smaller and\nsmaller portion of the RT surface enters the bulk regions, and, under the same increase, when\nthe boundary region A tends to occupy the whole boundary, the RT surface tends to coincide\nwith the boundary of this high-entropy bulk region.\nThis is closely reminiscent of a black\nhole horizon, whose surface coincides with the RT surface, in the continuum geometry picture,\nand which encloses a maximal entropy bulk region.\nThis is intriguing because it suggest a\npossible realization of holographic behaviour and of effective black hole geometries in a non-\nspatiotemporal and information-theoretic context.\nIn trying to perform the same type of analysis for quantum gravity states involving a sum\nover spins, thus a sum over (discrete) quantum geometries, one has to face the issue that the cor-\nresponding Hilbert space does not present any obvious factorization between bulk and boundary\ndofs or between subsets of boundary ones (but it possesses a direct sum structure with respect\nto the possible spin assignments to the whole graph). The very notion of entanglement between\n8\n\n\nFigure 8: Black hole-like behaviour for the entanglement entropy between boundary subregions, when bulk\nentropy grows and the boundary region is extended\nany subset of dofs becomes ambiguous. If one tries to bypass this ambiguity by embedding the\nHilbert space into a larger, factorized one and work with a more clearly defined notion of sub-\nspaces and entanglement there, the ambiguity presents itself again in the choice of embedding.\nOne way to proceed is to work at the level of algebras of observables (acting on the given Hilbert\nspace of quantum gravity states) and to identify a notion of subsystem in terms of subalgebras,\nrather than subspaces. Moreover, holographic behaviour is then best characterized in terms of\n‘transmisison of information’, rather than entanglement scaling. This strategy has been applied\nfor quantum gravity states in [27], and outlined in its general formal aspects in [31].\nHere we just outline the main steps in the analysis.\nGiven the full algebra, one can identify algebraic subsystems, i.e. two subsets of observables\nseparately ‘testing’the two subsets of quantum dofs one is interested in mapping, to be considered\nas ‘input’and ‘output’(it could be bulk and boundary or two portions of the boundary). These\nare not subalgebras, in general.\nOne can then define a map between input-output operator\nspaces via the Choi-Jamiolkowski isomorphism.\nThe isometry condition on such map, our proxy for holography or complete transmission of\ninformation, can be shown to follow from a certain set of necessary condition, corresponding to\nthe requirement that the operator map defines a quantum channel.\nThese conditions can be identified using the same random tensor network techniques, in the\nregime of large spins (which minimizes key quantum fluctuations), and translated again also in\nconditions on the entropy of the underlying quantum gravity state.\nOne obtains again a Ruy-Takanayagi-like formula for the Renyi entropy of the quantum state\ndepending on a set of minimal surfaces, one for each spin sector, thus one for each superposed\nquantum geometry, and with a definition of ‘area spectrum’for the minimal surfaces that can be\nrelated to but differs from the one used in canonical loop quantum gravity or simplicial quantum\ngeometry.\nIn general, the necessary conditions for isometry amount to have negligible correlations be-\ntween boundary data and intertwiner bulk data, and on specific peaking properties of the quan-\ntum state around a subset of spin sectors. These same conditions may actually become also\nsufficient ones, upon additional constraints on the quantum states.\nTo summarize, for both boundary-bulk and boundary-boundary maps, holographic behaviour\nappears to require the bulk Hilbert space to be comparatively small with respect to the boundary\none (as measured by the dimensionality of their respective subspaces), and the total boundary\narea (scaling with the size of spin spaces assigned to its links) to be approximately constant\nacross different subsectors of spin assignments.\n9\n\n\nAgain, the importance of these results is not so much in the details of their conclusions, but in\nthe very fact that (quantum) geometric properties and quantum information theoretic properties\nare deeply intertwined and can be studied also in a non-spatiotemporal, purely combinatorial and\nalgebraic context, hopefully shedding light on the emergence of holographic (and gravitational)\nbehaviour at macroscopic scales as well as on its fundamental origin.\n2\nQuantum gravity processes as quantum causal his-\ntories (or not)\nWe now turn to the quantum dynamics of the quantum gravity structures we considered in the\nprevious section, and that we characterized in quantum information-theoretic terms. Our main\npoint is that a similar quantum information-theoretic characterization can be provided also for\nthe quantum gravity processes they are subject to, and that information theoretic tools can be\napplied to the analysis of their (quantum) causal properties. As in the previous section, we\nconsider a subset of quantum gravity formalisms, sharing many of their constitutive structures,\nand focus on their shared elements, rather than their differences.\n2.1\nQuantum causal processes of atoms of space - quantum\nspacetime as a quantum circuit\nA general scheme for quantum processes respecting minimal causality conditions, and to which\nwe can try to fit or adapt fundamental dynamical processes for our ‘atoms pf quantum space’,\nis represented by the formalism of quantum causal histories. The version we refer to here is the\none in [32, 33], with its initial development in a quantum gravity context to be found in [34, 35].2\nPossible dynamical processes are given by a set of ‘events’together with an order relation\nbetween pairs of them; these are also the constitutive elements of a directed graph.\nIn 4d\nquantum gravity models based on (quantum) simplicial geometry, fundamental events may be\ntaken to correspond to 4-simplices, while order relations between pairs of them correspond to\ntheir shared 3-simplices. The directed graph would then correspond to the dual 1-skeleton of\nthe oriented simplicial 4-complex. Note that this realization implies a restriction to 5-valent\ndirected graphs. For Lorentzian models, the order relations can be given a causal interpretation.\nAn important special case is represented by partially ordered sets (posets), which are directed\ngraphs which are also irreflexive, i.e. do not contain closed causal loops. Posets are also called, in\nthe quantum gravity literature, causal sets and are the basic entities in the causal set approach\nto qauntum gravity [41].\nClearly, this structure can be decomposed into elementary ‘evolution steps’, corresponding to\nthe possible orientation assignments of the 5-valent nodes: 5 links outgoing, 1 link incoming/4\nlinks outgoing, 2 links incoming/3 links outgoing, and their inverses.\nThe quantum process corresponding to each directed graph is obtained by an assignment of\nHilbert spaces to the links (and tensor products of Hilbert spaces for unordered sets of links) and\nelementary ‘evolution’operators to the nodes; in addition one can include also ‘gluing operators’to\nthe links, enforcing a prescription for the ‘transmission of information’ from one node/event to\nanother 3.\n2Of course, the abstract characterization of quantum dynamics and quantum causality, as well as its generalization\nto a context in which geometry and thus causal relations are themselves dynamical and subject to superposition, is\na hot topic in quantum foundations, with many recent developments. See [36, 37, 38, 39, 40] for a small sample.\nObviously, we are not going to review any of that.\n3In fact, a more complete and consistent definition of a quantum process in this language, of of a quantum causal\nhistory in particular, is given in terms of an assignment of algebras of operators and completely positive maps [33].\nWe give here a simplified earlier construction, which is sufficiently indicative of the general points we want to make.\n10\n\n\nFigure 9: An example of a 5-valent directed graph\nFigure 10: An example of an elementary quantum process\nA specification of a quantum dynamics and thus a specific quantum gravity model corre-\nsponds to the assignment of a quantum (probability) amplitude to each quantum process (to-\ngether with any restriction on the class of allowed processes, be it on the combinatorial structure\nor the associated operators and Hilbert spaces). Such amplitude is defined by the chosen node\noperator and gluing operator, in turn characterized by the corresponding kernels\nVn : ⊗\ne∈∂nHe\nv −→C\nPe : He\nv ⊗He∗\nv −→C\nwhere we have left implicit the dualization of the Hilbert spaces required to reflect the different\norientations of the links associated to the nodes.\nNotice that the specification of a gluing\noperator requires a ‘doubling’of the Hilbert space associated to the links of the directed graph,\ndistinguishing one copy of it associated to one of the connected nodes from the (dualized) one\nassociated to the other connected node4. Given these building blocks, the quantum amplitude\nassociated to the given process Γ can be defined as:\n4Notice that this doubling is necessary, if one wants to allow for a composition of processes or, from the point of\nview of their dual cellular complexes, the composition of different cellular complexes along shared boundaries.\n11\n\n\nA(Γ) = Tr\ne∈Γ\n Y\ne∈Γ\nPe\nY\nn∈Γ\nVn\n!\n(2.1)\nwhere with Tr we have indicated the trace operation over the (doubled) Hilbert spaces\nassociated to the links of the process. Different quantum gravity formalisms (notably canonical\nloop quantum gravity, spin foam models, lattice gravity path integrals and group field theories)\nshare this general structure of their dynamical quantum amplitudes, in a covariant language.\nFor example, for a more detailed presentation in the case of spin foam models (adapted also to\nthe group field theory language) see [42], in addition to the existing introductions to all these\nquantum gravity formalisms.\nIn fact, in quantum gravity formalisms that use this kind of discrete structures, the complete\nquantum dynamics should be completed with the definition of a continuum limit/approximation,\nsince reliance on any given cellular complex represents at best a truncation of the full set of quan-\ntum degrees of freedom of the fundamental theory. Also in accordance with the superposition\nprinciple and the interpretation of the above discrete structures as possible quantum processes,\nthis limit is encoded within a sum over all complexes/processes within the allowed class. The\nfull quantum dynamics is therefore encoded in a partition function (or transition amplitude, if\nthe complexes have boundaries) of the general form:\nZ =\nX\nΓ\nw(Γ)A(Γ)\n(2.2)\nwhere again the specification of the additional weights w(Γ) concurs to the definition of the\nspecific model being considered.\nTwo points are worth emphasizing about this construction. First, also these quantum pro-\ncesses, like the quantum states discussed in the previous section, can be reformulated in the\nlanguage of tensor networks, and this has been applied to the study of renormalization of quan-\ntum gravity dynamics from a lattice gauge theory perspective [43]. Second, at this level, thus\nbefore any extraction of coarse-grained or otherwise effective continuum dynamics, the connec-\ntion of these dynamical quantum amplitudes to that of gravitational theories can only be with\nlattice gravity, i.e. some discretized version of gravitational physics. This connection depends\nstrongly on the specific quantum gravity formalism being considered. In spin foam models, thus\nalso in group field theories, the connection can be shown (modulo remaining technical open is-\nsues) in the form of an exact equivalence with lattice gravity path integrals for 1st order gravity\ntheories5 [42], or in a semi-classical, asymptotic regime with 2nd order gravity [47] (in terms of\narea variables [48]).\nWe are interested in identifying the requirements on such quantum processes that make them\nbona fide quantum causal histories, that is, that make each quantum process encore a properly\ncausal unitary evolution. We do not discuss here to what extent this is something we should\nexpect or require, from fundamental quantum gravity processes, besides a few short remarks.\nThe required properties have been identified in [32, 33]. Consider the evolution operator\nEαβ : Hα →Hβ, obtained by composing all the elementary operators V connecting two complete\na-causal subsets α and β of links, that is subsets of links that are all causally unrelated within\neach subset and one the complete causal future (past) of the other, where the Hilbert spaces\nHα,β are the tensor product of the Hilbert spaces associated to the constituting links. For the\nquantum process to define a quantum causal history, the operators Eαβ should be: a) reflexive:\nEαα = Iα, b) antisymmetric: EαβEβα = Iα ⇔Eαβ = Eβα = Iα; c) transitive: EαβEβγ = Eαγ;\nd) unitary: P\nβ EαβE†\nαβ = P\nβ Eαβ ¯Eβα = Iα.\n5Usually, with gravity formulated as a constrained topological theory [44]. But see [45, 46] for models constructed\nfollowing alternative strategies.\n12\n\n\nOne can then check or impose that the relevant evolution operators of quantum gravity\nmodels of interest satisfy these requirements. However, one could also question their necessity.\nIndeed, we have stated that the full quantum gravity dynamics should rather be given by a sum\nover all such quantum processes. Therefore, one could argue that the operators satisfying proper\ncausality conditions are those obtained by performing this sum, that is:\nEαβ =\nX\nc\nλcEc\nαβ : Hα −→Hβ\n(2.3)\nbetween the same complete a-causal subsets. In other words, even accepting that the fundamen-\ntal quantum gravity dynamics should be expressed in the language of quantum causal histories,\none could argue that it is the full transition amplitudes that should satisfy causality constraints,\nand not the possible individual quantum processes.\nIt is easy to see [49] that these two perspectives are not equivalent, and in fact, they are\nnot even consistent with one another.\nMore precisely, while imposing ‘micro-reflexivity’(i.e.\nreflexivity of individual processes) implies full reflexivity (i.e. reflexivity of the evolution obtained\nupon summing over micro-processes) and the same is true for antisymmetry, the other two\nrequirements are much more problematic. First, one could make micro-transitivity compatible\nwith transitivity of the full evolution, by defining the latter more generally as P\nβ EαβEβγ = Eαγ,\nwhich is just the standard composition of quantum (transition) probability amplitudes; but\nmicro-transitivity itself appears to be too strong a requirement from the discrete quantum gravity\nperspective; indeed, taking into account also the dual lattice formulation of quantum processes,\nmicro-transitivity is equivalent to a condition of partial triangulation invariance of the quantum\ndynamics, i.e. a requirement that the quantum amplitudes associated to individual lattices are\npartially independent of the chosen lattice. To the extent in which gravity is not a topological\nfield theory with no local propagating degrees of freedom, this is a suspicious condition since it\nmay imply a partial triviality of the quantum dynamics. Second, one can actually verify that\nunitarity of the full evolution implies that the micro-evolution must not be unitary. So one has\nto make a choice.\nIt remains a valid goal to have the full quantum gravity dynamics, obtained via a sum over\nelementary quantum processes, defining a (‘coarse-grained’) quantum causal history. This would\nbe interesting, from the perspective we are exploring in this contribution, because it would mean\nthat quantum information and quantum computation can be found at the very heart of quantum\ngravity also at the dynamical level. The same interest would remain if instead one insists on the\nelementary processes be themselves quantum causal histories.\nIndeed, it is a general result [50] that a quantum causal history admits a unitary evolution\nbetween its acausal surfaces if and only if it can be represented as a quantum computational\nnetwork, i.e. a quantum circuit.\nThe idea of spacetime as a quantum circuit would then find a concrete realization, if quantum\ngravity evolution can be formulated as in terms of quantum causal histories, at the elementary\nor coarse-grained level, in the above language or in the more refined one of observable algebras\nand CP maps [33]. See also [51, 52] and the cited literature on process matrix formalism and\nindefinite causal structures for related directions.\nLet us now look in more detail at a couple of features of quantum gravity processes that have\nto be realized in order for them to define quantum causal histories, thus quantum circuits, and\nsee which obstacles one has to face to do so.\n2.2\nCausal hiccups and causal indifference in QG processes\nAs discussed, a proper representation in terms of quantum circuits requires: a) the absence or\n“irrelevance”of causal loops; b) suitable conditions ensuring unitarity of the evolution operators.\n13\n\n\nConcerning closed causal loops, there are three possible strategies that can be followed in\nconstructing quantum gravity models: a) define a quantum dynamics (amplitudes) that elimi-\nnates causal loops altogether; b) define a quantum dynamics (amplitudes) that suppresses causal\nloops, by assigning them subdominant contributions, in the relevant regimes; for example, one\ncould consider admitting causal loops in the theory, provided they do not spoil expected semi-\nclassical or continuum physics; c) define a quantum dynamics (amplitudes) that only allows\n“harmless”. Let us stress that the directed graphs underlying all current spin foam models and\nlattice gravity path integrals (or group field theory perturbative amplitudes) contain closed loops\nof order relations, i.e. causal loops. Thus the issue is of concrete relevance for such quantum\ngravity formalisms. While the first two options may be technically very challenging but are\nconceptually straightforward, when exactly a causal loop is physically harmless requires a more\ncareful analysis. The issue has been studied for example in [50], in the quantum gravity context,\nfollowing earlier work by Deutsch [53] in a general quantum mechanical context. The upshot\nis that causal loops are either entirely disruptive or entirely harmless, to paraphrase.\nMore\nprecisely, they either prevent the standard formulation of quantum mechanics to be applicable\nor, when they do not, they lead to no observable changes, since they simply end up contributing\nan extra subspace to the ordinary causality-respecting system. Moreover, by applying suitable\n(Deutsch) criteria, the causally well-behaved region of the process decouples entirely from the\ncausal loop, if the quantum dynamics remains linear, and if it does not stay linear, then the\ncausal loop does not carry independent degrees of freedom. For more details we refer again to\n[50].\nLet us now discuss unitarity of quantum evolution and, before that, the very dependence of\nthe quantum gravity transition amplitudes from the order of their arguments, thus a notion of\npast/future relating the quantum states it depends on, which is in many ways a prerequisite for\nit. The issue is: given two (‘initial’and ‘final’) quantum states, which kind of quantum amplitude\ndo we define, via the gravitational path integral? Let us first recall a few facts about quantum\ngravity path integrals, which can be verified at the formal level in great generality [54, 55], and\nhave to be then realized concretely in more rigorous manner by quantum gravity approaches,\nincluding the ones based on discrete structures that we have focused on here. Different quantum\ngravity amplitudes can be defined starting from the same proper-time truncation of the full path\nintegral (in canonical form), obtained via appropriate gauge-fixing of the general expression:\nK[h2\nij, h1\nij; N(τ2 −τ1)] =\nZ\nDhij(x, τ)Dπij(x, τ)eiS(hij,πij);N\n(2.4)\nwhere the amplitude depends on the fixed metric data on the two (past/future) boundaries.\nThis expression could be required to corresponds to (the matrix elements of) a unitary evolution\noperator in proper time. However, this is not the physical (transition) amplitude for quantum\ngravity, since the lack of integration over proper time (lapse) means that we have not yet imposed\nany conditions encoded in the Hamiltonian constraint of the (canonical) theory, thus no full\nquantum gravitational dynamics (the Einstein’s equations are indeed encoded in the Hamiltonian\nconstraint), beside enforcing at best some semiclassical restriction (due to the appearance of\nthe gravitational action in the expression). One can then define a ‘causal’transition amplitude\n(the analogue for quantum gravity of what would be, for a relativistic particle, the Feynman\npropagator, by integrating the lapse (proper time) over the full positive range:\nK[h2\nij, h1\nij] =\nZ N(x)=+∞\nN(x)=0\nD[N(x)(τ2 −τ1)] K[h2\nij, h1\nij; N(τ2 −τ1)] .\n(2.5)\nThis is the canonical counterpart of the straightforward Lagrangian gravitational path inte-\ngral K[h2\nij, h1\nij] =\nR\nDgµνeiS(gµν). it is invariant under Lagrangian (covariant) diffeomorphisms\nand indeed switches to its own complex conjugate under switch of spacetime orientation; in\n14\n\n\nother words, it does register an ordering between its two arguments, the boundary quantum\nstates. It does not, however, give a solution to the canonical Hamiltonian constraint, i.e. it is\nnot invariant under canonical symmetries (the canonical Dirac algebra, counterpart of covariant\ndiffeomorphisms, which are a subset of the canonical ones). A solution of the canonical Hamilto-\nnian constraint is instead obtained by integrating the lapse (proper time) over the full (positive\nand negative) real values:\nC[h2\nij, h1\nij] =\nZ N(x)=+∞\nN(x)=−∞\nD[N(x)(τ2 −τ1)] K[h2\nij, h1\nij; N(τ2 −τ1)] .\n(2.6)\nThis indeed defines (formally) a physical scalar product between canonical quantum gravity\nstates, solving all the constraints of the theory (or, equivalently, the matrix elements of the\nprojector operator onto such solutions). Its Lagrangian counterpart would look like C[h2\nij, h1\nij] =\nR\nDgµν\n\u0002\neiS(gµν) + e−iS(gµν)\u0003\n=\nR\nDgµν cos(S(gµν)) . This quantity does not register the space-\ntime orientation and it is symmetric under its switch, not encoding any ordering among it\narguments, the ‘initial’and ‘final’quantum states.\nSpin foam models (equivalently, the perturbative transition amplitudes of group field theo-\nries) aim to be discretized and thus mathematically better defined realization of the gravitational\npath integral. Which of the above quantities do they actually realize?\nAll the most studied spin foam models are discrete counterparts of the path integral for\ngravity formulated as a constrained topological BF theory. It turns out that, like their con-\ntinuum counterpart (and the path integral for topological BF theory itself) they are invariant\nunder switch of spacetime (lattice) orientation, more precisely the inversion of the orientation\nof their constitutive simplicial structures; this invariance is in fact realized locally at the level\nof each node or 4-simplex contribution V to the total amplitude A as well as at the level of\nlower-dimensional simplices (eg triangles) in the simplicial complex. Recall that the 1-skeleton\nof this simplicial complex corresponds to the directed graph whose order relations have a ten-\ntative causal interpretation (in Lorentzian models). The orientation independence of the spin\nfoam amplitudes thus implies than none of the most studied spin foam models defines a proper\nquantum causal history (a quantum circuit) and a unitary quantum gravity dynamics. This\nwould remain true even if one was able to remove causal loops from the underlying directed\ngraph.\nIt is possible to construct ‘properly causal’spin foam models, but a suitable restriction of their\namplitudes so that they register faithfully the orientation of the underlying complex. This has\nbeen done first, for the Barrett-Crane model, in [49], and more recently by similar procedures for\nthe EPRL model in [56, 57]. These restricted models are therefore candidates for the realization\nof the ‘causal propagator’for quantum gravity, and for a formulation in terms of quantum causal\nhistories and quantum circuits. However, these causality-inspired constructions are all rather ad\nhoc and we still lack a systematic construction procedure of spin foam models from first principle\n(rather than by restricting by hand a-causal models) taking into account causality restrictions,\nas well as a more complete analysis of the properties of the present ‘ad-hoc’ones.\nConclusions\nWe have argued that both semi-classical considerations and quantum gravity formalisms suggest,\nin different ways, that spacetime and gravity may be emergent, collective, not fundamental\nnotions, and that the universe may be a (peculiar, background independent) quantum many-\nbody system of pre-geometric quantum entities, some yet to be unraveled ‘atoms of space’.\nIn particular, there are intriguing indications that topology and geometry may emerge from\nthe entanglement among such fundamental quantum entities.\nMore generally, an intriguing\n15\n\n\npossibility is that quantum spacetime physics may be formulated, in its most fundamental level,\nentirely in the language of quantum information.\nA variety of quantum gravity formalisms share the same combinatorial and algebraic quantum\nstructures as quantum states: quantized simplicial structures and spin networks.\nWe have\noutlined the ways in which such quantum states can be described in quantum information-\ntheoretic terms. More precisely, we have summarized how these quantum states: a) can be seen as\ngeneralised tensor networks and realize a precise discrete entanglement/geometry (and topology)\ncorrespondence; b) can be framed as information channels (or quantum circuits); c) can be\nused to define bulk/boundary and boundary-to-boundary maps, for which one can then identify\nconditions for holographic behaviour. This could indicate an avenue toward understanding the\nmicroscopic origin of holographic behaviour in quantum gravity.\nWe have then discussed how, in the same quantum gravity formalisms, dynamical quantum\nprocesses can be recast as quantum causal histories, provided some key properties are imple-\nmented in their amplitudes, and then again as quantum circuits; we have also pointed out some\nof the challenges faced to implement the required properties Again, the main point is that quan-\ntum information tools and language may be the appropriate ones to formulate also the quantum\ndynamics of the microscopic constituents of the universe, when geometry and fields fail.\nBefore we go on to comment on some more conceptual aspects of the these conclusions, we\npoint out that the (tensorial) group field theory framework, on top of providing a completion of\nlattice gravity path integrals and spin foam models (thus sharing the same quantum amplitudes)\nand a 2nd quantized framework for spin network states (thus a convenient Fock space structure\nfor their Hilbert space) [58, 59], provides also a number of almost standard field theoretic tools\nto study them and in particular to extract effective continuum gravitational physics from them\n[60]. This means that, even in this more abstract, non-spatiotemporal, pre-geometric context,\none can apply quantum field theoretic techniques to the quantum information structures we\npresented above, to analyse their formal properties and to unravel their physical meaning.\nSome philosophical considerations: is the universe a quantum computer? - To con-\nclude let us offer some thoughts on different ways in which we could interpret the relevance\nof quantum information language and tools for encoding the fundamental microstructure of\nspacetime and the universe.\nA straightforward attitude is to give to this fact an ontological basis: the universe is a quan-\ntum computer. In this case, the fact that quantum information is the appropriate language to\nunderstanding is no surprise: it is just the language representing how it fundamentally operates,\nit is the language that constitutes its basic laws. From the epistemological point of view, this\nattitude follows from and it is grounded on a straightforward scientific realism: the world is out\nthere and entirely independent, in its properties, of our epistemic activities, which achieve (at\nbest) a faithful (albeit partial) representation of the way the world is. It is also tied to a realist\nand ontologically committed view on laws of nature: they are what governs the physical world,\ni.e. the rules by which it functions and evolves.\nChallenges against all the above are numerous and the philosophical debate about each of\nthe above points is old and intricate and interesting. Here we want to make two brief comments\nabout this ‘the universe is a quantum computer’view, implicitly based on the attitude we just\nsummarized.\nA first immediate one is that all the realist views on laws face challenges at different levels\nfrom quantum gravity, and in particular from the very possibility of space, time and geometry\nbeing emergent notions. The quantum information structures we discussed in this contributions\ncan be seen as encoding these challenges, but at the same time offering tentative ways to meet\n(if not solve) them. This is discussed in [61].\nA second one is that one can adopt (and try to develop further) a less ontologically committed\nview on the object of our scientific theories, i.e. the physical world, including laws of nature, and\n16\n\n\nthus a weaker version of (scientific) realism. One can adopt a more epistemic view on physical\nlaws based on a more substantial role given to epistemic agents, taken to be irreducible and not\nnegligible (outside convenient idealizations). This epistemic, agent-based view would tie well\nwith a more participatory form of realism, in which what is real is, roughly speaking, only the\nresult and content of the interaction between the world and the epistemic agents, none of which\nis independently real outside of such interaction. This weaker form of realism would be the\nonly kind of ontological commitment allowed by the epistemic premises. This view may have\nimplications for (and be tested with) the interpretation of quantum mechanics, as well as the\nconstruction and interpretation of theories of quantum spacetime and geometry.\nMore generally, it would lead to a view in which the universe is (to a large extent) what we\nthink it is (or what we model it as), in the sense that it is our epistemic constructions that make\nreality, rather than simply represent it. Obviously this is just a vague statement, to be made\nmore precise and articulated, but it is maybe interesting to see how a similar view changes how\nwe may interpret the role of (quantum) information theoretic structures in fundamental quantum\ngravity. In a fundamental quantum gravity context, we argued, we have no spacetime notions\nto rely on; we have to think the world (and model it) without spacetime. We are then left with\ncombinatorics and algebra as mathematical language, and with information processing, rather\nthan definite, ontologically grounded objects (whose ontological characterization would normally\nassume space and time), as the only ‘dynamical’content. This reflects the more basic, more\nirreducible structures in our thinking, which at the same time correspond (given the above view\nof what it is to be ‘real’) to the more basic structures ‘in the world’. (Quantum) Computers are\nabstract models of (quantum) information processing, and of our own thinking. To the extent in\nwhich the universe is (largely) what we think it is (in the sense outlined above), and we think like\n(quantum) computers, it is not so surprising, perhaps, that the quantum (non-spatiotemporal)\nuniverse is naturally modeled as a quantum computer.\nThese rather vague considerations are offered, here, only as potentially useful indications of\nphilosophical avenues to explore and develop further, on the basis of the scientific developments\nin quantum gravity, that we have summarized in this contribution.\nAckowledgements\nWe acknowledge support through the Grant PR28/23 ATR2023-145735 (funded by MCIN /AEI\n/10.13039/501100011033). We also thank the organizers and the participants of the “QG and\ncomputation”workshop in Sydney for a very interesting event and for many stimulating discus-\nsions, as well as the editors of this volume for their patience.\n17\n\n\nReferences\n[1] E. Bianchi and E.R. Livine, Loop Quantum Gravity and Quantum Information, (2023),\nDOI [2302.05922].\n[2] E. Colafranceschi, Emergent spacetime properties from entanglement, Ph.D. thesis,\nNottingham U., 2022.\n[3] J. Butterfield and C.J. Isham, Space-time and the philosophical challenge of quantum\ngravity, in Physics meets philosophy at the Planck scale: Contemporary theories in\nquantum gravity, C. Callender and N. Huggett, eds., pp. 33–89 (1999), DOI\n[gr-qc/9903072].\n[4] N. Seiberg, Emergent spacetime, in 23rd Solvay Conference in Physics: The Quantum\nStructure of Space and Time, pp. 163–178, 1, 2006, DOI [hep-th/0601234].\n[5] T. Padmanabhan, Emergent Gravity Paradigm: Recent Progress, Mod. Phys. Lett. A 30\n(2015) 1540007 [1410.6285].\n[6] D. Oriti, Levels of spacetime emergence in quantum gravity, 1807.04875.\n[7] S. Carlip, Challenges for Emergent Gravity, Stud. Hist. Phil. Sci. B 46 (2014) 200\n[1207.2504].\n[8] M. Van Raamsdonk, Lectures on gravity and entanglement., in Theoretical Advanced Study\nInstitute in Elementary Particle Physics: New Frontiers in Fields and Strings,\npp. 297–351, 2017, DOI [1609.00026].\n[9] B. Swingle, Spacetime from Entanglement, Ann. Rev. Condensed Matter Phys. 9 (2018)\n345.\n[10] M. Rangamani and T. Takayanagi, Holographic Entanglement Entropy, vol. 931, Springer\n(2017), 10.1007/978-3-319-52573-0, [1609.01287].\n[11] B. Bayta¸s, E. Bianchi and N. Yokomizo, Gluing polyhedra with entanglement in loop\nquantum gravity, Phys. Rev. D 98 (2018) 026001 [1805.05856].\n[12] E. Colafranceschi and D. Oriti, Quantum gravity states, entanglement graphs and\nsecond-quantized tensor networks, JHEP 07 (2021) 052 [2012.12622].\n[13] R. Orus, A Practical Introduction to Tensor Networks: Matrix Product States and\nProjected Entangled Pair States, Annals Phys. 349 (2014) 117 [1306.2164].\n[14] F. Verstraete, V. Murg and J.I. Cirac, Matrix product states, projected entangled pair\nstates, and variational renormalization group methods for quantum spin systems, Adv.\nPhys. 57 (2008) 143.\n[15] J.I. Cirac, D. Perez-Garcia, N. Schuch and F. Verstraete, Matrix product states and\nprojected entangled pair states: Concepts, symmetries, theorems, Rev. Mod. Phys. 93\n(2021) 045003 [2011.12127].\n[16] S. Singh, N.A. McMahon and G.K. Brennen, Holographic spin networks from tensor\nnetwork states, Phys. Rev. D 97 (2018) 026013 [1702.00392].\n[17] L. Tagliacozzo, A. Celi and M. Lewenstein, Tensor Networks for Lattice Gauge Theories\nwith continuous groups, Phys. Rev. X 4 (2014) 041024 [1405.4811].\n18\n\n\n[18] G. Evenbly and G. Vidal, Tensor Network Renormalization, Phys. Rev. Lett. 115 (2015)\n180405.\n[19] Q. Chen and E.R. Livine, Loop quantum gravity’s boundary maps, Class. Quant. Grav. 38\n(2021) 155019 [2103.08409].\n[20] G. Czelusta and J. Mielczarek, Quantum simulations of a qubit of space, Phys. Rev. D\n103 (2021) 046001 [2003.13124].\n[21] S. Singh, R.N.C. Pfeifer and G. Vidal, Tensor network decompositions in the presence of a\nglobal symmetry, Phys. Rev. A 82 (2010) 050301 [0907.2994].\n[22] M. Han and S. Huang, Discrete gravity on random tensor network and holographic R´enyi\nentropy, JHEP 11 (2017) 148 [1705.01964].\n[23] G. Chirco, D. Oriti and M. Zhang, Group field theory and tensor networks: towards a\nRyu–Takayanagi formula in full quantum gravity, Class. Quant. Grav. 35 (2018) 115011\n[1701.01383].\n[24] G. Chirco, A. Goeßmann, D. Oriti and M. Zhang, Group field theory and holographic\ntensor networks: dynamical corrections to the Ryu–Takayanagi formula, Class. Quant.\nGrav. 37 (2020) 095011 [1903.07344].\n[25] E. Colafranceschi, G. Chirco and D. Oriti, Holographic maps from quantum gravity states\nas tensor networks, Phys. Rev. D 105 (2022) 066005 [2105.06454].\n[26] G. Chirco, E. Colafranceschi and D. Oriti, Bulk area law for boundary entanglement in\nspin network states: Entropy corrections and horizon-like regions from volume\ncorrelations, Phys. Rev. D 105 (2022) 046018 [2110.15166].\n[27] E. Colafranceschi, S. Langenscheidt and D. Oriti, Holographic properties of superposed\nquantum geometries, Phys. Rev. D 110 (2024) 046024 [2207.07625].\n[28] C. Akers and A.Y. Wei, Background independent tensor networks, SciPost Phys. 17\n(2024) 090 [2402.05910].\n[29] P. Hayden, S. Nezami, X.-L. Qi, N. Thomas, M. Walter and Z. Yang, Holographic duality\nfrom random tensor networks, JHEP 11 (2016) 009 [1601.01694].\n[30] X.-L. Qi, Z. Yang and Y.-Z. You, Holographic coherent states from random tensor\nnetworks, JHEP 08 (2017) 060 [1703.06533].\n[31] S. Langenscheidt, E. Colafranceschi and D. Oriti, Channel-State duality with centers,\n2404.16004.\n[32] F. Markopoulou, Quantum causal histories, Class. Quant. Grav. 17 (2000) 2059\n[hep-th/9904009].\n[33] E. Hawkins, F. Markopoulou and H. Sahlmann, Evolution in quantum causal histories,\nClass. Quant. Grav. 20 (2003) 3839 [hep-th/0302111].\n[34] F. Markopoulou and L. Smolin, Causal evolution of spin networks, Nucl. Phys. B 508\n(1997) 409 [gr-qc/9702025].\n[35] F. Markopoulou and L. Smolin, Quantum geometry with intrinsic local causality, Phys.\nRev. D 58 (1998) 084032 [gr-qc/9712067].\n19\n\n\n[36] O. Oreshkov, F. Costa and C. Brukner, Quantum correlations with no causal order,\nNature Commun. 3 (2012) 1092 [1105.4464].\n[37] K. Goswami, C. Giarmatzi, M. Kewming, F. Costa, C. Branciard, J. Romero et al.,\nIndefinite Causal Order in a Quantum Switch, Phys. Rev. Lett. 121 (2018) 090503\n[1803.04302].\n[38] V. Baumann, M. Krumm, P.A. Gu´erin and v. Brukner, Noncausal Page-Wootters circuits,\nPhys. Rev. Res. 4 (2022) 013180 [2105.02304].\n[39] L. Mrini and L. Hardy, Indefinite causal structure and causal inequalities with\ntime-symmetry, 2024.\n[40] L. Hardy, Probability theories with dynamic causal structure: A new framework for\nquantum gravity, 2005.\n[41] F. Dowker and S. Surya, The Causal Set Approach to the Problem of Quantum Gravity,\n(2024), DOI.\n[42] M. Finocchiaro and D. Oriti, Spin foam models and the Duflo map, Class. Quant. Grav.\n37 (2020) 015010 [1812.03550].\n[43] B. Dittrich, S. Mizera and S. Steinhaus, Decorated tensor network renormalization for\nlattice gauge theories and spin foam models, New J. Phys. 18 (2016) 053009 [1409.2407].\n[44] E. Bianchi and F. Hellmann, The Construction of Spin Foam Vertex Amplitudes, SIGMA\n9 (2013) 008 [1207.4596].\n[45] A. Baratin, C. Flori and T. Thiemann, The Holst Spin Foam Model via Cubulations, New\nJ. Phys. 14 (2012) 103054 [0812.4055].\n[46] R. Dekhil, M. Laudonio and D. Oriti, A state sum for four-dimensional Lorentzian\nquantum geometry in terms of edge vectors, 2501.10115.\n[47] S.K. Asante, B. Dittrich and H.M. Haggard, Effective Spin Foam Models for\nFour-Dimensional Quantum Gravity, Phys. Rev. Lett. 125 (2020) 231301 [2004.07013].\n[48] B. Dittrich and J. Padua-Arg¨uelles, Twisted geometries are area-metric geometries, Phys.\nRev. D 109 (2024) 026002 [2302.11586].\n[49] E.R. Livine and D. Oriti, Implementing causality in the spin foam quantum geometry,\nNucl. Phys. B 663 (2003) 231 [gr-qc/0210064].\n[50] E.R. Livine and D.R. Terno, Quantum causal histories in the light of quantum\ninformation, Phys. Rev. D 75 (2007) 084001 [gr-qc/0611135].\n[51] P. Arrighi and S. Martiel, Quantum Causal Graph Dynamics, Phys. Rev. D 96 (2017)\n024026 [1607.06700].\n[52] P. Arrighi, A. Durbec and M. Wilson, Quantum networks theory, Quantum 8 (2024) 1508\n[2110.10587].\n[53] D. Deutsch, Quantum mechanics near closed timelike lines, Phys. Rev. D 44 (1991) 3197.\n[54] C. Teitelboim, Quantum Mechanics of the Gravitational Field, Phys. Rev. D 25 (1982)\n3159.\n20\n\n\n[55] J.J. Halliwell and J.B. Hartle, Wave functions constructed from an invariant sum over\nhistories satisfy constraints, Phys. Rev. D 43 (1991) 1170.\n[56] J. Engle and A. Zipfel, Lorentzian proper vertex amplitude: Classical analysis and\nquantum derivation, Phys. Rev. D 94 (2016) 064024 [1502.04640].\n[57] E. Bianchi and P. Martin-Dussaud, Causal Structure in Spin Foams, Universe 10 (2024)\n181 [2109.00986].\n[58] D. Oriti, The microscopic dynamics of quantum space as a group field theory, in\nFoundations of Space and Time: Reflections on Quantum Gravity, pp. 257–320, 10, 2011\n[1110.5606].\n[59] D. Oriti, Group Field Theory and Loop Quantum Gravity, 8, 2014 [1408.7112].\n[60] D. Oriti, Tensorial Group Field Theory condensate cosmology as an example of spacetime\nemergence in quantum gravity, 12, 2021 [2112.02585].\n[61] V. Lam and D. Oriti, The quantum gravity seeds for laws of nature, Eur. J. Phil. Sci. 14\n(2024) 63 [2404.12248].\n21\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21234v1.pdf",
    "total_pages": 21,
    "title": "Quantum information elements in Quantum Gravity states and processes",
    "authors": [
      "Daniele Oriti"
    ],
    "abstract": "We summarize basic features of quantum gravity states and processes, common\nto a number of related quantum gravity formalisms, and sharing a purely\ncombinatorial and algebraic language, and a discrete geometric interpretation.\nWe emphasize how, in this context, entanglement is a seed of topological and\ngeometric properties, and how a pre-geometric, discrete notion of quantum\ncausality can be implemented, as well as some recent results (based on random\ntensor network techniques) on the conditions for information transmission and\nholographic behaviour in quantum gravity states. Together, these features\nindicate that quantum information concepts and tools play a key role in\ndefining the fundamental structure of quantum spacetime.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}