{
  "id": "arxiv_2502.21275v1",
  "text": "Utilizing Quantum Fingerprints in Plant\nCells to Evaluate Plant productivity\nUmadini Ranasinghe,1* Abigail L. Stressinger,2* Guangpeng Xu,1\nYasmin Sarhan,1 Fred Harrington,3 James Berry,2 Tim Thomay1\n1 Department of Physics, State University of New York at Buffalo, New York\n2 Department of Biology, State University of New York at Buffalo, New York\n3 Helios-NRG, LLC, East Amherst, New York\nOvercoming the strong chlorophyll background poses a significant challenge for measuring\nand optimizing plant growth. This research investigates the novel application of specialized\nquantum light emitters introduced into intact leaves of tobacco (Nicotiana tabacum), a well-\ncharacterized model plant system for studies of plant health and productivity. Leaves were\nharvested from plants cultivated under two distinct conditions: low light (LL), representing un-\nhealthy leaves with reduced photosynthesis. and high light (HL), representing healthy leaves\nwith highly active photosynthesis. Higher-order correlation data were collected and analyzed\nusing machine learning (ML) techniques, specifically a Convolutional Neural Network (CNN),\nto classify the photon emitter states. This CNN efficiently identified unique patterns and created\ndistinct fingerprints for Nicotiana leaves grown under LL and HL, demonstrating significantly\ndifferent quantum profiles between the two conditions. These quantum fingerprints serve as a\nfoundation for a novel unified analysis of plant growth parameters associated with different\nphotosynthetic states. By employing CNN, the emitter profiles were able to reproducibly clas-\nsify the leaves as healthy or unhealthy. This model achieved high probability values for each\nclassification, confirming its accuracy and reliability. The findings of this study pave the way\nfor broader applications, including the application of advanced quantum and machine learning\ntechnologies in plant health monitoring systems.\nKey words: Quantum fingerprint, plant productivity, quantum light emitters, machine\nlearning.\nAbbreviations: Quantum dots (QDs), Low light (LL), High light (HL), Machine\nlearning (ML), Convolution neutral network (CNN), Green fluorescent protein (GFP),\nHanbury-Brown and Twiss (HBT), Beam splitter (BS), Avalanche photodiodes (APDs),\nCorrelation board (CB), photon correlation spectroscopy (PCS), Photosynthetically ac-\ntive radiation (PAR), Photoluminescence (PL).\n1.\nIntroduction\nAutofluorescence, the natural light emission from plant tissues, poses a significant obstacle in\naccurately studying their fluorescent properties, sometimes leading to inaccurate determina-\ntions of photosynthetic activity [26,34,36]. This phenomenon, primarily driven by chlorophyll\nemissions and other light gathering proteins [33], can be affected by multiple variable factors,\nincluding quenching and overlapping signals, making it difficult to quantify and standardize the\nmultiple parameters associated with overall photosynthetic health and productivity. Quantum\ndots (QDs), with their unique property of emitting only one photon at a time, help to overcome\nthis strong chlorophyll fluorescence commonly found in plants.\nDue to their distinct of light, QDs as quantum light emitters are highly specific and reflec-\ntive of their surrounding conditions. Therefore, quantum light from QD-transformed species\nis reflective of the environmental and intracellular conditions of the organism. This property\narXiv:2502.21275v1  [physics.bio-ph]  28 Feb 2025\n\n\nhas led to the use of quantum dots in plant systems [16], primarily as enhancers of pro-\nductivity and biosensors for pathogen and pollutant detection [32]. Furthermore, QDs have\nbeen utilized to monitor nutrient levels in plants, providing critical insights into their nutri-\ntional status and enabling nutrient management strategies [14, 20, 30]. However, most recent\napplications have focused on utilizing QDs to mitigate abiotic stressors and enhance plant\ngrowth [6,19,32,38,47,53]. As quantum light emitters, QDs have the ability to monitor plant\nhealth and distinguish sub-optimal growth conditions. Yet, minimal research has been con-\nducted on the role of QDs as evaluators of plant productivity.\nUnderstanding how QDs are used as quantum light emitters requires first recognizing how\nthe concept of light as discrete energy quanta has led to advancements in studying photon\nnumber properties. These developments have established a foundational concept central to our\ncurrent quantum optics experiments. In an early 1956 study, Hanbury Brown and Twiss [5]\nconducted a groundbreaking experiment that distinguished between thermal and Poissonian\nlight, marking a pivotal moment in the study of optical coherence. This foundation was further\nestablished in a 1963 study by Glauber and Sudarshan [15] introduced the quantum theory of\nphoton correlations. Their work focused on higher-order factorial moments of photon-number\ndistributions, providing a framework to analyze and understand the behavior of light at the\nquantum level [15, 16, 25, 44]. Their findings set the stage for advancements in understanding\nthe properties of light sources, bridging classical and quantum optics.\nThe exploration of higher-order photon correlations has since led to numerous applications,\nparticularly in quantum light emitters. [39–41]. Furthermore, this technology can be used in\na range of biological applications [31, 37].Most notably, photon correlation techniques have\nbeen applied in cancer diagnostics. Detecting and treating cancer remains a major challenge\nin medicine. Optics and photonics technologies have applied principles of physics to enhance\ndiagnostic methods [48]. Also, Photon correlation spectroscopy (PCS), a specialized technique\nwithin photon correlation that analyzes fluctuations in scattered light to determine the size and\nmotion of particles in a sample, has been used to study proteins and other biomacromolecules\nin aqueous solutions. PCS has been widely applied to investigate conformational changes in\nproteins, their aggregation, and interactions with other molecules. These studies help to reveal\nimportant native functions of proteins, DNA, RNA, and even microorganisms like Escherichia\ncoli, Pseudomonas putida, and Dunaliella viridis [17,43]. Furthermore, time correlated single\nphoton counting (TCSPC) is a technique that detects single photons from a periodic light signal,\nrecords their detection times, and creates a distribution of photons over the signal’s time period.\nThis technique has numerous biomedical applications, such as time-domain optical tomogra-\nphy, studying transient phenomena in biological systems, spectrally resolved fluorescence life-\ntime imaging, Fluorescence resonance energy transfer (FRET) experiments in live cells, and\nanalyzing dye-protein complexes using fluorescence correlation spectroscopy [2,21,56]. How-\never, there has been limited research exploring photon correlation in plants.\nIn the past decade, data-driven approaches like Machine Learning (ML) have opened up new\nopportunities for quantum photonics experiments [23,50,55,57]. ML models, known for han-\ndling large and sparse datasets, have achieved significant speedups in certain quantum measure-\nments [12,18,29,55] and offer a way to overcome the limitations of traditional fitting methods,\nespecially in the low-photon flux regime [10, 13, 28, 51]. One notable advancement is the de-\nvelopment of a Convolutional Neural Network (CNN)-based algorithm tailored for the rapid\nclassification of single-photon emitters within the nitrogen-vacancy (NV) center of nanodia-\nmonds [8,9,22,35]. The CNN model improves accuracy by identifying subtle features extracted\nfrom sparse correlation data.\nIn this study, we aim to develop an innovative technique to optimize plant productivity us-\n\n\ning a novel quantum-based fingerprinting concept. The approach involves introducing biocom-\npatible quantum dots (QDs) as quantum light emitters into the leaf cells of tobacco plants.\nPlants were grown under two distinct environmental conditions, low light (LL) and high light\n(HL), to assess the technique’s applicability across different growth scenarios. We hypothe-\nsize that QDs as quantum light emitters provide a significant advantage over methods using\nclassical chlorophyll fluorescence detection, which are often masked by plant pigments and\nlight-absorbing/quenching components in photosynthetically-active plant tissues [3,26,33,34].\nQuantum light sources emit single photons with unique quantum properties, allowing them to\nbe optically distinguished from classical multiphoton light sources. This optical quantum differ-\nentiation is achieved by leveraging higher-order correlation functions to analyze and confirm\nthe quantum nature of the emitted light. To interpret the data, we classify the quantum sig-\nnals based on time resolved correlation patterns using a Convolutional Neural Network (CNN)\nmodel. The CNN is trained to extract subtle and complex features from the data, enabling\nit to accurately differentiate between the quantum properties of light that are emitted from\nhealthy and unhealthy leaves. This is done without interference from any other non-quantum\nlight emissions within the experimental leaf samples. This approach results in the creation\nof distinct quantum fingerprints for each leaf, representing their unique quantum fluorescence\ncharacteristics. Furthermore, we show that our pre-trained machine learning model can clas-\nsify the probabilities of emissions from experimental categories, thereby predicting the derived\nquantum fingerprints as being from healthy or unhealthy leaves. The results show that quantum-\nbased fingerprinting provides a novel and effective way to characterize optimal plant growth\nand monitor plant health under different conditions.\n2.\nMethod\n2.1.\nPreparation of leaves and analysis of photosynthesis\nTobacco (Nicotiana tabacum var. SR1) leaves were prepared under low-light (LL) conditions\nand high-light (HL) conditions. All growing conditions were standardized in growth cham-\nbers (24◦C, 12 hr light/dark cycle, daily watering) except for light intensity, which differed\nby 30× between groups. The high-light group was exposed to 430 µmol photons m−2 s−1\n(430 × 10−6 Einsteinm−2 s−1), and the low-light group received only 15 µmol photons m−2\ns−1 \u000015×10−6 Einsteinm−2 s−1\u0001\nof light. Normal growth light conditions for tobacco plants\nare between 400-450 µmol m−2 s−1 \u0000400−450×10−6 Einsteinm−2 s−1\u0001\n[4]. LL conditions\nsignificantly decrease rates of photosynthesis, leading to reductions in growth, stomatal con-\nductance, intercellular carbon dioxide levels, and transpiration rates [1,54]. As a result, the LL\ngroup is considered unhealthy compared to the HL group, which is expected to affect quantum\nmeasurements.\nTo determine the photosynthetic efficiency of each experimental group, we used the Pho-\ntosynQ MultispeQ V 2.0 fluorimeter device (Photosynq Inc. East Lansing, MI 48823 USA).\nThe following parameters were analyzed for each tobacco leaf: photosynthetically active ra-\ndiation (PAR), non-photochemical quenching, relative chlorophyll, and photosystem I active\ncenters. PAR was calculated by measuring the fraction of incoming light that is active in pro-\nmoting photosynthesis [24]. Non-photochemical quenching infers plant health by measuring\nthe plant’s ability to dissipate excess light energy harmlessly as heat and is calculated by pro-\nviding pulse-amplitude modulation fluorescence. The chlorophyll content of each leaf was cal-\nculated by measuring the ratio between the absorbance of red (650 nm) and infrared (940 nm)\nlight. Finally, the number of active Photosystem I centers was determined by absorbance-based\nmeasurements (810-940 nm).\n\n\nThese parameters provide a quantitative measurement of the overall photosynthetic efficiency\nof each experimental group of tobacco leaves. A total of sixteen leaves, eight from each exper-\nimental group, were measured for this study.\n2.2.\nBiolistic transformation of leaves\nTobacco leaves were transformed using the Biolistic PDS-1000/He Particle Delivery System,\ncommonly known as the “Gene Gun” (Bio-Rad PDS-1000/He). This system was used to deliver\ncustom gold microprojectiles coated with DNA and quantum dots onto the abaxial surface of\neach tobacco leaf. We modified previously published protocols for transformation of tobacco\nplants [11,42]. To prepare the microprojectiles, we added 0.1 M Biotin-PEG-SH-Thiol (Nanocs\nMW 5000) to 20 µl of 66 nm gold particles (Bio-Rad), creating a conjugated gold-biotin parti-\ncle. Green fluorescent protein (GFP) report gene was delivered via the pBI121-GFP vector of a\nconstitutive CaMV35S promoter [7]. The GFP plasmid was added in a ratio of 10 µg DNA to\n1.2 mg of gold-biotin particles. The particles were combined with 25 µl of 2.5 M CaCl2, 10 µl\nof 0.1 M spermidine free base, then vortexed for 15 seconds. The DNA-coated microprojectiles\nwere centrifuged at maximum speed for 5 seconds, washed with 100% EtOH, and resuspended\nin 24 µl 100% EtOH. Finally, 5 µl of Streptavidin Conjugate CdSe/ZnS core/shell Quantum\nDots (585 nm, Invitrogen Thermo Fisher Scientific) were added to the particle solution. This\nlinked the quantum dots to the gold microprojectile via the Biotin-PEG-SH-Thiol linker as\nshown Figure 1.\nAfter being detached from their host plant, each tobacco leaf was bombarded twice at 900\npsi by 8 µl of microprojectiles. Stopping screens were placed 6 cm away from the petri dish\ncontaining the leaf. After bombardment, leaves recovered in the dark for 24 hours, then were\nmoved back to their initial growth chambers prior to examining for GFP expression and quan-\ntum fluorescence.\nFig. 1. Design of multi-component gold projectile designed to carry DNA and\nQDs into plant cells. Biotin PEG Thiol serves as a linker between gold micropar-\nticle and QDs. Green Fluorescent Protein (GFP) serves as a visible genetic marker\nfor successful cellular uptake, which, when expressed, fluoresces green under ultra-\nviolet light. Streptavidin-conjugated QDs (emission spectrum of 585 nm) fluoresce\norange under ultraviolet light.\n\n\n2.3.\nDevelopment of quantum fingerprint\nThe photoluminescence (PL) of leaves was measured to confirm the emission of QDs. A\nHanbury-Brown and Twiss (HBT) setup with four detectors is shown in Figure 2. It was used\nto measure second-order correlation that describes the probability of detecting two photons at\ndifferent times, providing information about the photon emission statistics. This work expands\nupon previous findings [46], where an HBT setup is employed to study photon correlation\nproperties. Each path leads to an Avalanche Photodiode (APD). Every photon that arrives at\nthe APD triggers a click recording the detection time.\nFig. 2. Experimental layout for measuring higher-order correlation. (a) The\nleaf under 365 nm UV light (b) The stereo microscope (c) The leaf under stereo\nmicroscope (d) The Hanbury Brown and Twiss (HBT) set up with 50:50 Beam\nSplitters:BS, and detected by Avalanche Photodiodes:APDs connected to a Corre-\nlation Board:CB.\nHigher-order correlation data were collected and analyzed using a machine learning model\nto classify the photon states. Further details on the computational method can be found in [52].\nThe correlation data was compiled into a 3D matrix with dimensions (4,4,2x +1), where x is\n\n\nthe bin number. Starting with x = 6, the resulting matrix has dimensions (4,4,13), representing\nthe g(2) correlation matrix.\nThis matrix forms the foundation for creating a 2D quantum fingerprint in tobacco leaf cells\nby normalizing the matrix.\n2.4.\nClassification of probabilities\nThe CNN model was employed to classify leaves based on LL or HL growth conditions. The\ndataset is divided into two portions, 80% is allocated for training the model, while the remaining\n20% is reserved for testing. This division ensures that the model has sufficient data to learn\npatterns, relationships, and features during the training phase. The model was trained over\n20 epochs, with each epoch representing a full pass through the training data. After training,\nthe model was used to classify leaves by predicting probabilities for each sample as either\nhealthy or unhealthy, providing a clear indication of its confidence in each classification. To\nfurther validate its performance, the trained model was tested on new, unseen data, where it\nsuccessfully assigned probabilities to each sample in the validation set, determining whether\na leaf is healthy or unhealthy. The model architecture and layer operations are illustrated in\nFigure 3.\nFig. 3. Schematic of the CNN model for probability classification. The architec-\nture consists of a convolutional layer, followed by a Conv2D layer with 16 filters\nand a (3×3) kernel, activated using ReLU. A flattening layer converts the convolu-\ntional output into a 1D feature vector. The model includes dense layers for binary\nclassification: one with 32 neurons and ReLU activation to learn complex feature\nrepresentations, and a final dense layer with a single neuron and sigmoid activation\nfor classification.\n3.\nResults\nThis study combines quantum technology and machine learning to analyze plant health produc-\ntivity. Quantum dots (QDs) were introduced into tobacco leaves to study their quantum prop-\nerties under different lighting conditions. The data revealed clear differences between healthy\nand unhealthy leaves, visualized as unique quantum fingerprints. The CNN model accurately\nclassified the leaves, achieving high probabilities for both healthy and unhealthy categories,\ndemonstrating the effectiveness of this approach in plant health productivity.\nTo determine the productivity of tobacco leaves on a cellular level, we measured photosyn-\nthetic parameters based on light-driven fluorescence and absorbance changes via LED light. As\nexpected, the tobacco plants used in this experiment, which were grown under reduced light in-\ntensity, exhibited lower rates of photosynthesis. Thus, the parameters for tobacco grown under\n\n\nHL will have high photosynthetic activity than plants grown under LL. Overall, we observed\nstatistically significant differences in all parameters between HL and LL tobacco leaves (Fig\n4). Therefore, tobacco leaves from both experimental groups have contrasting rates of photo-\nsynthesis, which will be reflected in their quantum fingerprint.\nFig. 4. Fluorescence and absorbance-based photosynthetic parameters indi-\ncate higher photosynthetic activity in HL vs. LL tobacco leaves. (A) Light in-\ntensity via photosynthetically active radiation (µmol photons m−2 s−1). (B) Non-\nPhotochemical Quenching measures each leaf’s ability to dissipate excess absorbed\nlight energy as heat. (C) Relative chlorophyll content (µmol of chlorophyll per m2\nof leaf), calculated by measuring the absorbance at 650 and 940 nm. (D) The frac-\ntion of Photosystem I centers that are active is calculated via a ratio of Fo (fluores-\ncence level of a dark-adapted leaf with all Photosystem acceptors fully oxidized) to\nFm (the maximum fluorescence achieved when all acceptors are fully reduced). This\nratio is typically between 0.75 and 0.85 for healthy/light-sufficient leaves. Statisti-\ncal significance is determined by a two-sample equal variance t-test: (*p < 0.05),\n(**p < 0.01), (***p < 0.001).\nThe gold microprojectiles were specifically engineered to serve as carriers for both DNA and\nQDs into the tobacco plant cells. This design successfully allowed for the microcarrier and its\ncomponents to gain cellular entry through biolistic transformation. Our constructed micropro-\njectile links biocompatible quantum dots and Green Fluorescent Protein (GFP) reporter gene to\ngold nanoparticles as shown in Figure 1. Therefore, the GFP marker serves as a confirmation\nof delivery of the microprojectile into tobacco leaf cells. When the GFP reporter gene entered\nthe cell nucleus, green fluorescence was observed under ultraviolet light, indicating the entry of\nall components, including streptavidin-conjugated quantum dots (Fig 5). Additionally, orange\nfluorescence was observed on both HL and LL leaves, confirming the presence of quantum\ndots. Both green and orange fluorescence was observed in HL and LL leaves.\nThe successful emission of QDs was confirmed through a photoluminescence spectrum, as\nillustrated in Figure 6. The plot highlights distinct emission peaks corresponding to the key\ncomponents introduced into the tobacco leaf cells. Specifically, the GFP exhibited a strong peak\naround 500 nm, indicating successful expression within the plant cells. The QDs displayed a\nprominent emission peak at 585 nm, verifying their presence and functionality as quantum light\nemitters. Additionally, a characteristic chlorophyll fluorescence peak was observed at approx-\nimately 680 nm, reflecting the natural autofluorescence of the plant. These well-defined peaks\nconfirm the successful integration and activity of both GFP and QDs within the leaf cells,\n\n\nFig. 5. Successful delivery of a multi-component microprojectile into tobacco\nleaf cells facilitated introduction of quantum dots. (A) Stereoscope image of a\nHL tobacco leaf under ultraviolet light (365 nm) shows strong GFP and quantum\ndot fluorescence. (B) Stereoscope image of a LL tobacco leaf under ultraviolet light\n(365 nm) also shows GFP and quantum dot fluorescence, confirming successful\nmicroprojectile penetration.\nFig. 6. Photoluminescence (PL) spectrum of the tobacco leaf showing distinct emis-\nsion peaks for Green Fluorescent Protein (GFP) at 500 nm, quantum dots (QDs) at\n585 nm, and chlorophyll at 680 nm.\n\n\nalongside the expected chlorophyll fluorescence background.\nWe generated four quantum fingerprints for leaves under LL and HL, as illustrated in Figure\n7. The data showed noticeable differences between tobacco plants with low and high-light\nconditions demonstrating the impact of photosynthetic activity on the quantum properties of\nthe emitted light. The fingerprint is visualized as a 4 × 4 2D plot, where each detector pair\ncorrelation contributes 13 data points. These points appear as small rectangles on the plot,\nresulting in 208 segments across the entire plot. The diagonal elements always show zero as\nthey represent correlations between the same detectors, and the off-diagonal elements represent\nthe time correlation values between different detector pairs.\nFig. 7. Quantum fingerprints for healthy leaf grown in HL conditions (top), and an\nunhealthy leaf grown in LL conditions (bottom).\nThese results suggest that quantum readings are affected by differences in photosynthetic\nproductivity and health status. Using a novel quantum-based fingerprinting concept, we devel-\noped a higher-order photon correlation to optimize plant productivity.\nThe probabilities of the healthy and unhealthy validation leaves are summarized in Table 1.\nThe model predicted a 91% probability of being healthy and a 9% probability of being un-\nhealthy for the healthy validation leaf. Similarly, it predicted an 84% probability of being un-\nhealthy and a 16% probability of being healthy for the unhealthy validation leaf. This confirms\nthe accurate identification of leaves as healthy or unhealthy using the CNN model.\nValidation Type\nTime/Step\nHealthy Probability\nUnhealthy Probability\nHealthy Validation Leaf\n0s 54ms/step\n0.91\n0.09\nUnhealthy Validation Leaf\n0s 46ms/step\n0.16\n0.84\nTable 1. Validation Results for Healthy and Unhealthy Leaves\nOngoing experiments aim to explore further the link between quantum profiles and the opti-\nmization of productivity of tobacco plants.\n4.\nConclusion\nOur study demonstrates the potential to link quantum data to plant photosynthetic health under\nvarying growth conditions, revealing significant differences between high-light (HL) and low-\nlight (LL) environments. Light intensity, the critical growth condition we altered, significantly\naffected several photosynthetic parameters. The intensity of incoming light was directly related\nto the amount of light used for photosynthesis, and the ability to dissipate excess light energy as\nheat. As expected, chlorophyll content was also directly related to light intensity, since chloro-\nphyll is the primary light-capturing molecule in plants and the activity of Photosystem I was\n\n\nmore efficient in HL leaves. Photosystem I activity infers that HL leaves are healthier since they\nhave a higher fraction of molecules converting light into chemical energy. Though the photo-\nsynthetic parameters we analyzed do not provide an overall measurement of photosynthetic\nactivity for a plant, they establish a baseline indication of plant photosynthetic state. Incor-\nporation of photosynthetic parameters such as stomatal conductance, electron transport rate,\nand protein and enzyme activity would create a more comprehensive measurement of plant\nhealth [27, 49]. Correlating the combined, synergistic effects of these parameters with quan-\ntum profiles will further train our machine learning algorithm, and correlate plant responses to\nenvironmental stressors.\nIn this study, QDs acting as quantum light emitters, were successfully introduced into to-\nbacco leaves using the biolistic transformation method. This innovative approach allowed\nfor fluorescence measurements, bypassing the limitations imposed by chlorophyll autofluo-\nrescence. Time-resolved correlation patterns were analyzed using a CNN model, resulting in\nthe classification of HL and LL leaves and the successful creation of their respective finger-\nprints. These fingerprints provided unique insights into the quantum fluorescence properties\nof leaves under different conditions. The CNN model was highly effective in identifying HL\nand LL leaves by analyzing correlation data and assigning probabilities to each classification.\nHL leaves were identified with 91% probability, while LL leaves were identified with 84%\nprobability. The successful use of machine learning in this context significantly advanced our\nresearch, providing a powerful tool for efficient analysis.\nOur findings provide a new method for correlating quantum light from quantum dots to pho-\ntosynthesis in tobacco plants, which offers a novel way for monitoring plant health. Our results\nencourage further research on species with significant applications in agriculture, due to the\nheightened frequency and intensity of environmental conditions. As part of our future plan, we\naim to refine and expand the approach to analyze a wider variety of plants and algae, includ-\ning those from different species and under diverse environments (i.e. water-depleted, extreme\nheat, viral-infected). By advancing the integration of quantum technology and machine learn-\ning, this research lays the groundwork for innovative approaches to monitoring and improving\nplant productivity.\nReferences\n1. Roger Andersen and M. J. Kasperbauer. Chemical composition of tobacco leaves altered by near-\nultraviolet and intensity of visible light. Plant Physiology, 51(4):723–726, 4 1973.\n2. Wolfgang Becker, Axel Bergmann, Giovanni L. Biscotti, and Angelika Rueck. Advanced time-\ncorrelated single photon counting techniques for spectroscopy and imaging in biomedical systems.\nvolume 5340, page 104. Lasers and Applications in Science and Engineering, SPIE, 6 2004.\n3. James O. Berry, Pradeep Yerramsetty, Amy M. Zielinski, and Christopher M. Mure. Photosyn-\nthetic gene expression in higher plants. Photosynthesis Research, 117(1-3):91–120, 7 2013.\n4. Ajaya K. Biswal, Gopal K. Pattanayak, Shiv S. Pandey, Sadhu Leelavathi, Vanga S. Reddy, Govin-\ndjee, and Baishnab C. Tripathy. Light intensity-dependent modulation of chlorophyll b biosyn-\nthesis and photosynthesis by overexpression of chlorophyllide a oxygenase in tobacco\n. Plant\nPhysiology, 159(1):433–449, 3 2012.\n5. R. HANBURY BROWN and R. Q. TWISS. Correlation between photons in two coherent beams\nof light. Nature, 177(4497):27–29, 1 1956.\n6. Lingling Chen, Lan Zhu, Xiaohui Liu, Lu Chen, Han Zhou, Huixin Ma, Guilan Sun, Ashadu\nNyande, Zhaohu Li, and Honghong Wu. Recent omics progress in nanobiotechnology for plant\nabiotic stress tolerance improvement. The Crop Journal, 12(5):1274–1279, 10 2024.\n7. Po-Yen Chen. Molecular Breeding, 11(4):287–293, 2003.\n\n\n8. Iris Cong, Soonwon Choi, and Mikhail D. Lukin. Quantum convolutional neural networks. Nature\nPhysics, 15(12):1273–1278, 8 2019.\n9. Vedran Dunjko and Hans J. Briegel. Machine learning \\ amp; artificial intelligence in the quantum\ndomain. 2017.\n10. Prashant S. Emani, Jonathan Warrell, Alan Anticevic, Stefan Bekiranov, Michael Gandal,\nMichael J. McConnell, Guillermo Sapiro, Al´an Aspuru-Guzik, Justin T. Baker, Matteo Bas-\ntiani, John D. Murray, Stamatios N. Sotiropoulos, Jacob Taylor, Geetha Senthil, Thomas Lehner,\nMark B. Gerstein, and Aram W. Harrow. Quantum computing at the frontiers of biological sci-\nences. Nature Methods, 18(7):701–709, 1 2021.\n11. Michael H. Farkas, Elmer-Rico E. Mojica, Minesh Patel, Diana S. Aga, and James O. Berry.\nDevelopment of a rapid biolistic assay to determine changes in relative levels of intracellular\ncalcium in leaves following tetracycline uptake by pinto bean plants. The Analyst, 134(8):1594,\n2009.\n12. Pedro Freire, Egor Manuylovich, Jaroslaw E. Prilepsky, and Sergei K. Turitsyn. Artificial neural\nnetworks for photonic applications—from algorithms to implementation: tutorial. Advances in\nOptics and Photonics, 15(3):739, 9 2023.\n13. Jun Gao, Lu-Feng Qiao, Zhi-Qiang Jiao, Yue-Chi Ma, Cheng-Qiu Hu, Ruo-Jing Ren, Ai-Lin Yang,\nHao Tang, Man-Hong Yung, and Xian-Min Jin. Experimental machine learning of quantum states.\nPhysical Review Letters, 120(24), 6 2018.\n14. Vandana Ghormade, Mukund V. Deshpande, and Kishore M. Paknikar. Perspectives for nano-\nbiotechnology enabled protection and nutrition of plants. Biotechnology Advances, 29(6):792–\n803, 11 2011.\n15. Roy J. Glauber. Photon correlations. Physical Review Letters, 10(3):84–86, 2 1963.\n16. Roy J. Glauber. The quantum theory of optical coherence. Physical Review, 130(6):2529–2539,\n6 1963.\n17. Vladimir M. Gun’ko, Alla V. Klyueva, Yuri N. Levchuk, and Roman Leboda. Photon correlation\nspectroscopy investigations of proteins. Advances in Colloid and Interface Science, 105(1-3):201–\n328, 9 2003.\n18. Ravi S. Hegde. Deep learning: a new tool for photonic nanostructure design. Nanoscale Advances,\n2(3):1007–1023, 2020.\n19. Ali Raza Khan, Abdul Salam, Guanlin Li, Babar Iqbal, Zaid Ulhassan, Qunlu Liu, Wardah Azhar,\nFiza Liaquat, Iftikhar Hussain Shah, Syed Shams ul Hassan, and Daolin Du. Nanoparticles and\ntheir crosstalk with stress mitigators: A novel approach towards abiotic stress tolerance in agricul-\ntural systems. The Crop Journal, 12(5):1280–1298, 10 2024.\n20. Lav R. Khot, Sindhuja Sankaran, Joe Mari Maja, Reza Ehsani, and Edmund W. Schuster. Applica-\ntions of nanomaterials in agricultural production and crop protection: A review. Crop Protection,\n35:64–70, 5 2012.\n21. Matthias Kress. Time-resolved microspectrofluorometry and fluorescence lifetime imaging of\nphotosensitizers using picosecond pulsed diode lasers in laser scanning microscopes. Journal of\nBiomedical Optics, 8(1):26, 1 2003.\n22. Zhaxylyk A. Kudyshev, Simeon I. Bogdanov, Theodor Isacsson, Alexander V. Kildishev, Alexan-\ndra Boltasseva, and Vladimir M. Shalaev. Rapid classification of quantum sources enabled by\nmachine learning. Advanced Quantum Technologies, 3(10), 9 2020.\n23. Zhaxylyk A. Kudyshev, Alexander V. Kildishev, Vladimir M. Shalaev, and Alexandra Boltasseva.\nMachine learning–assisted global optimization of photonic devices. Nanophotonics, 10(1):371–\n383, 10 2020.\n24. Sebastian Kuhlgert, Greg Austic, Robert Zegarac, Isaac Osei-Bonsu, Donghee Hoh, Martin I.\nChilvers, Mitchell G. Roth, Kevin Bi, Dan TerAvest, Prabode Weebadde, and David M. Kramer.\nMultispeq beta: a tool for large-scale plant phenotyping connected to the open photosynq network.\nRoyal Society Open Science, 3(10):160592, 10 2016.\n\n\n25. K. Laiho, T. Dirmeier, M. Schmidt, S. Reitzenstein, and C. Marquardt. Measuring higher-order\nphoton correlations of faint quantum light: A short review. Physics Letters A, 435:128059, 5 2022.\n26. Tracy Lawson and Silvere Vialet-Chabrand. Imaging spatial and temporal variation in photosyn-\nthesis using chlorophyll fluorescence. In Methods in Molecular Biology, pages 293–316. Springer\nUS, 2024.\n27. Chongyang Li, Mingyang Ma, Tianpeng Zhang, Pengwen Feng, Xiao Chen, Yang Liu, Marian\nBrestic, Tarek M. Galal, Hatim M. Al-Yasi, and Xinghong Yang. Comparison of photosynthetic\nactivity and heat tolerance between near isogenic lines of wheat with different photosynthetic\nrates. PLOS ONE, 16(12):e0255896, 12 2021.\n28. Zhan-Ming Li, Shi-Bao Wu, Jun Gao, Heng Zhou, Zeng-Quan Yan, Ruo-Jing Ren, Si-Yuan Yin,\nand Xian-Min Jin. Fast correlated-photon imaging enhanced by deep learning. Optica, 8(3):323,\n3 2021.\n29. Dianjing Liu, Yixuan Tan, Erfan Khoram, and Zongfu Yu. Training deep neural networks for the\ninverse design of nanophotonic structures. ACS Photonics, 5(4):1365–1369, 2 2018.\n30. Ruiqiang Liu and Rattan Lal. Potentials of engineered nanoparticles as fertilizers for increasing\nagronomic productions. Science of The Total Environment, 514:131–139, 5 2015.\n31. Weixuan Liu, Katherine A. Pratte, Peter J. Castaldi, Craig Hersh, Russell P. Bowler, Farnoush\nBanaei-Kashani, and Katerina J. Kechris. A generalized higher-order correlation analysis frame-\nwork for multi-omics network inference. 1 2024.\n32. Y. Liu, L. He, A. Mustapha, H. Li, Z.Q. Hu, and M. Lin. Antibacterial activities of zinc oxide\nnanoparticles against escherichia coli o157:h7. Journal of Applied Microbiology, 107(4):1193–\n1201, 4 2009.\n33. Nikki Cecil M. Magdaong and Robert E. Blankenship. Photoprotective, excited-state quench-\ning mechanisms in diverse photosynthetic organisms.\nJournal of Biological Chemistry,\n293(14):5018–5025, 4 2018.\n34. Kate Maxwell and Giles N. Johnson. Chlorophyll fluorescence—a practical guide. Journal of\nExperimental Botany, 51(345):659–668, 4 2000.\n35. Alexey A. Melnikov, Hendrik Poulsen Nautrup, Mario Krenn, Vedran Dunjko, Markus Tiersch,\nAnton Zeilinger, and Hans J. Briegel. Active learning machine learns to create new quantum\nexperiments. Proceedings of the National Academy of Sciences, 115(6):1221–1226, 1 2018.\n36. E.H. Murchie and T. Lawson. Chlorophyll fluorescence analysis: a guide to good practice and\nunderstanding some new applications. Journal of Experimental Botany, 64(13):3983–3998, 8\n2013.\n37. Giovanna Nicora, Francesca Vitali, Arianna Dagliati, Nophar Geifman, and Riccardo Bellazzi.\nIntegrated multi-omics analyses in oncology: A review of machine learning methods and tools.\nFrontiers in Oncology, 10, 6 2020.\n38. Yusuf Opeyemi Oyebamiji, Basit Akolade Adigun, Noraziyah Abd Aziz Shamsudin, As-\nmuni Mohd Ikmal, Monsuru Adekunle Salisu, Fadila Ahmad Malike, and Adebola Azeez Lateef.\nRecent advancements in mitigating abiotic stresses in crops. Horticulturae, 10(2):156, 2 2024.\n39. Sam Powers and Dejan Stojkovic. An event centric approach to modeling quantum systems. 2023.\n40. Sam Powers, Guangpeng Xu, Herbert F. Fotso, Tim Thomay, and Dejan Stojkovic. Testing a\ndiscrete model for quantum spin with two sequential stern-gerlach detectors and photon fock\nstates. arXiv preprint, arXiv:2304.13535, 2023. quant-ph.\n41. Matthew F. Pusey, Jonathan Barrett, and Terry Rudolph. On the reality of the quantum state.\narXiv, 2011.\n42. J M Staub and P Maliga. Long regions of homologous dna are incorporated into the tobacco\nplastid genome by transformation. The Plant Cell, 4(1):39–45, 1 1992.\n43. M.W. Steer, J.M. Picton, and J.C. Earnshaw. Laser light scattering in biological research. In\nAdvances in Botanical Research, pages 1–69. Elsevier, 1985.\n44. E. C. G. Sudarshan. Equivalence of semiclassical and quantum mechanical descriptions of statis-\n\n\ntical light beams. Physical Review Letters, 10(7):277–279, 4 1963.\n45. Hyuna Sung, Jacques Ferlay, Rebecca L. Siegel, Mathieu Laversanne, Isabelle Soerjomataram,\nAhmedin Jemal, and Freddie Bray. Global cancer statistics 2020: Globocan estimates of incidence\nand mortality worldwide for 36 cancers in 185 countries. CA: A Cancer Journal for Clinicians,\n71(3):209–249, 2 2021.\n46. Tim Thomay, Sergey V. Polyakov, Olivier Gazzano, Elizabeth Goldschmidt, Zachary D. Eldredge,\nTobias Huber, Vivien Loo, and Glenn S. Solomon. Simultaneous, full characterization of a single-\nphoton state. Physical Review X, 7(4), 11 2017.\n47. Deepika Tripathi, Mithilesh Singh, and Shashi Pandey-Rai. Crosstalk of nanoparticles and phy-\ntohormones regulate plant growth and metabolism under abiotic and biotic stress. Plant Stress,\n6:100107, 12 2022.\n48. Valery V. Tuchin, J¨urgen Popp, and Valery Zakharov, editors. Multimodal Optical Diagnostics of\nCancer. Springer International Publishing, 2020.\n49. G. Vico, F.H.M. Tang, N.A. Brunsell, T.E. Crews, and G.G. Katul.\nPhotosynthetic capacity,\ncanopy size and rooting depth mediate response to heat and water stress of annual and peren-\nnial grain crops. Agricultural and Forest Meteorology, 341:109666, 10 2023.\n50. Pauli Virtanen, Ralf Gommers, Travis E. Oliphant, Matt Haberland, Tyler Reddy, David Cour-\nnapeau, Evgeni Burovski, Pearu Peterson, Warren Weckesser, Jonathan Bright, St´efan J. van der\nWalt, Matthew Brett, Joshua Wilson, K. Jarrod Millman, Nikolay Mayorov, Andrew R. J. Nelson,\nEric Jones, Robert Kern, Eric Larson, C J Carey, ˙Ilhan Polat, Yu Feng, Eric W. Moore, Jake Van-\nderPlas, Denis Laxalde, and Perktold. Scipy 1.0: fundamental algorithms for scientific computing\nin python. Nature Methods, 17(3):261–272, 2 2020.\n51. Shi-Bao Wu, Zhan-Ming Li, Jun Gao, Heng Zhou, Chang-Shun Wang, and Xian-Min Jin. Classi-\nfication of quantum correlation using deep learning. Optics Express, 31(3):3479, 1 2023.\n52. Guangpeng Xu, Jeffrey Carvalho, Chiran Wijesundara, and Tim Thomay. Optimized higher-order\nphoton state classification by machine learning. APL Quantum, 1(3), 9 2024.\n53. Ruifeng Yan, Yanfeng Zhang, Hongyan Tian, Yuan Hao, and Haifeng Sun. Sio2 nanoparticle\nattenuates phytotoxicity of graphene quantum dots in Zea mays (l.) plants. Land Degradation &\nDevelopment, 35(12):3745–3755, 5 2024.\n54. L. Y. Yang, L. T. Wang, J. H. Ma, E. D. Ma, J. Y. Li, and M. Gong. Effects of light quality on\ngrowth and development, photosynthetic characteristics and content of carbohydrates in tobacco\n(nicotiana tabacum l.) plants. Photosynthetica, 55(3):467–477, 9 2017.\n55. Kan Yao, Rohit Unni, and Yuebing Zheng. Intelligent nanophotonics: merging photonics and\nartificial intelligence at the nanoscale. Nanophotonics, 8(3):339–366, 1 2019.\n56. K. A. Zachariasse. Einzelphotonenz¨ahlung: Time-correlated single photon counting. von d. v.\no’connor und d. phillips. academic press, london – new york 1984. viii, 288 s., geb. $45. isbn\n0-12-524140-2. Nachrichten aus Chemie, Technik und Laboratorium, 33(10):896–896, 10 1985.\n57. Jiajia Zhou, Bolong Huang, Zheng Yan, and Jean-Claude G. B¨unzli. Emerging role of machine\nlearning in light-matter interaction. Light: Science amp; Applications, 8(1), 9 2019.\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21275v1.pdf",
    "total_pages": 13,
    "title": "Utilizing Quantum Fingerprints in Plant Cells to Evaluate Plant productivity",
    "authors": [
      "Umadini Ranasinghe",
      "Abigail L. Stressinger",
      "Guangpeng Xu",
      "Yasmin Sarhan",
      "Fred Harrington",
      "James Berry",
      "Tim Thomay"
    ],
    "abstract": "Overcoming the strong chlorophyll background poses a significant challenge\nfor measuring and optimizing plant growth. This research investigates the novel\napplication of specialized quantum light emitters introduced into intact leaves\nof tobacco (Nicotiana tabacum), a well-characterized model plant system for\nstudies of plant health and productivity. Leaves were harvested from plants\ncultivated under two distinct conditions: low light (LL), representing\nunhealthy leaves with reduced photosynthesis. and high light (HL), representing\nhealthy leaves with highly active photosynthesis. Higher-order correlation data\nwere collected and analyzed using machine learning (ML) techniques,\nspecifically a Convolutional Neural Network (CNN), to classify the photon\nemitter states. This CNN efficiently identified unique patterns and created\ndistinct fingerprints for Nicotiana leaves grown under LL and HL, demonstrating\nsignificantly different quantum profiles between the two conditions. These\nquantum fingerprints serve as a foundation for a novel unified analysis of\nplant growth parameters associated with different photosynthetic states. By\nemploying CNN, the emitter profiles were able to reproducibly classify the\nleaves as healthy or unhealthy. This model achieved high probability values for\neach classification, confirming its accuracy and reliability. The findings of\nthis study pave the way for broader applications, including the application of\nadvanced quantum and machine learning technologies in plant health monitoring\nsystems.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}