{
  "id": "arxiv_2502.21125v1",
  "text": "arXiv:2502.21125v1  [q-bio.GN]  28 Feb 2025\nEukaryotes evade information storage-replication rate trade-oﬀwith\nendosymbiont assistance leading to larger genomes\nParthasarathi Sahu, Sashikanta Barik, Koushik Ghosh, and Hemachander Subramanian∗\nDepartment of Physics, National Institute of Technology Durgapur, India\nAbstract\nGenome length varies widely among organisms, from compact genomes of prokaryotes to vast and complex genomes\nof eukaryotes. In this study, we theoretically identify the evolutionary pressures that may have driven this divergence\nin genome length.\nWe use a parameter-free model to study genome length evolution under selection pressure to\nminimize replication time and maximize information storage capacity.\nWe show that prokaryotes tend to reduce\ngenome length, constrained by a single replication origin, while eukaryotes expand their genomes by incorporating\nmultiple replication origins. We propose a connection between genome length and cellular energetics, suggesting that\nendosymbiotic organelles, mitochondria and chloroplasts, evolutionarily regulate the number of replication origins,\nthereby inﬂuencing genome length in eukaryotes. We show that the above two selection pressures also lead to strict\nequalization of the number of purines and their corresponding base-pairing pyrimidines within a single DNA strand,\nknown as Chagraﬀ’s second parity rule, a hitherto unexplained observation in genomes of nearly all known species.\nThis arises from the symmetrization of replichore length, another observation that has been shown to hold across\nspecies, which our model reproduces. The model also reproduces other experimentally observed phenomena, such as\na general preference for deletions over insertions, and elongation and high variance of genome lengths under reduced\nselection pressure for replication rate, termed the C-value paradox. We highlight the possibility of regulation of the\nﬁring of latent replication origins in response to cues from the extracellular environment leading to the regulation of\ncell cycle rates in multicellular eukaryotes.\nKeywords: genome size evolution, prokaryote-eukaryote divergence, Chargaﬀ’s second parity rule, C-value paradox,\nendosymbiosis, latent origins, GC-Skew, origins of replication, replichores\nSigniﬁcance Statement\nUnderstanding the forces shaping genome architecture is\na long-standing challenge in evolutionary biology.\nOur\nstudy demonstrates that the balance between replication\nspeed and information storage, constrained by cellular en-\nergetics, drives the divergence in genome lengths between\nprokaryotes and eukaryotes. By quantifying selection pres-\nsure as the ratio of replication time to genomic informa-\ntion content, we show that this pressure enforces adaptive\nconstraints, giving rise to features such as symmetric repli-\nchores and Chargaﬀ’s second parity rule. These insights\nnot only help us resolve an enduring evolutionary puzzle,\nbut also oﬀer a uniﬁed framework linking genome organi-\nzation, cellular specialization, and even potential mecha-\nnisms underlying carcinogenesis.\n∗Corresponding author: hsubramanian.phy@nitdgp.ac.in\nIntroduction\nLife on Earth began approximately 3.7 billion years ago\nand evolved from simpler forms to complex and diverse or-\nganisms observed today, shaped by various selection pres-\nsures [1, 2].\nOrganisms are broadly classiﬁed into two\ngroups: prokaryotes and eukaryotes. Prokaryotes are char-\nacterized by simpler structures, whereas eukaryotes are\ngenerally more complex and have evolved from prokary-\notes, with deﬁning characteristics such as endosymbi-\notic relationships, nuclear membranes, huge variance in\ngenome size, etc. [3, 4, 5]. Despite emerging earlier in\nEarth’s history, prokaryotes maintain smaller genomes and\nshow less morphological evolution compared to eukaryotes\n[6, 7, 8]. The constraints limiting the complex morpholog-\nical evolution of prokaryotes are debated [9, 10, 11].\nThe\ntendency\nof\nprokaryotes to\nacquire\ncompact\ngenomes is extensively modeled, with models constructed\nto include impacts of population size, environmental per-\n1\n\n\nturbations, and selection for metabolic eﬃciency under nu-\ntrient limitation [6, 12, 13, 14]. The evolutionary forces\nshaping eukaryotic genome length remain comparatively\nunder-explored. In eukaryotes, current frameworks have\nlargely focused on the impact of mutational mechanisms\n[15, 16] and energetic constraints on genome length [17].\nDespite extensive studies, a simple explanation for such\na dramatic divergence of genome length between prokary-\notes and eukaryotes is lacking. In this study, we use a very\nsimple, parameter-free model that incorporates the inﬂu-\nence of two primary evolutionary forces: faster replication\nand enhanced information storage capacity, to study the\nevolution of genome length across these two domains of\nlife. We show that the genome lengths of prokaryotes and\neukaryotes diverge under the same selection pressure, if\nwe restrict prokaryotes to have a single replication origin,\nwhile allowing eukaryotes to have multiple origins.\nWe\nargue that this diﬀerentiation stems from access to the\nenergy supply of mitochondria (or chloroplasts), as evi-\ndenced by the observed correlation between the number\nof mitochondria (or chloroplasts) and the length of the\ngenome in eukaryotes. Surprisingly, the model also repro-\nduces multiple other observations that hold for nearly all\nspecies, such as the equality of purines and pyrimidines\non a single strand of DNA, called Chagraﬀ’s second parity\nrule (PR-2), replichore length symmetrization (see below),\na preference for deletions over insertion mutations, and a\nhuge variance in the genome lengths seen in eukaryotes,\ncalled the C-Value paradox.\nThe Model\nTo study the eﬀect of the aforementioned selection pres-\nsures on genome length, i.e. faster replication and higher\ninformation storage capacity, we utilize a model, where a\npool of N identical sequences is evolved over m genera-\ntions under these selection pressures. The initial sequence\npool consists of N identical sequences, containing purines\nor pyrimidines, homogeneously across the sequence, with\nall purines on one strand and all pyrimidines on the com-\nplementary strand (e.g., 5′-RRRRRRR-3′/3′-YYYYYYY-\n5′). Each generation involves two major steps: (i) repli-\ncation of N sequences and mutation of all daughter se-\nquences in the pool and (ii) selection of half of the se-\nquences in the pool based on their ability to satisfy the\nabove two selection pressures.\nThese two steps are re-\npeated m times, and the time-evolution of the sequence\nlength, averaged over all the N sequences, is recorded for\nevery generation, for subsequent analysis.\nMutation: We implement large-scale genomic mutations\nthrough random deletions or duplications of regions in the\ndaughter sequence that comprise 5% to 10% of the total\ngenome length (Fig. 2). These large-scale mutations rep-\nresent well-documented drivers of evolutionary processes\n[6, 18, 19, 20, 11]. The size and location of these muta-\ntions are chosen stochastically. During a mutation involv-\ning duplication, the duplicating fragment is randomly cho-\nFigure 1: Algorithm of the model.\nEvaluation of the impact of the\ntwo selection pressures, fast replication and high information storage\ncapacity, on the genome length of an organism.\nAn initial pool of\nN sequences is evolved over m generations that involve two recurring\nsteps: replication and mutation of all the sequences in the pool and\napplying selection pressure to extract the ﬁttest sequences for the next\ngeneration. An initial pool of N identical sequences, composed of all\npurines or all pyrimidines, are replicated, and the daughter sequences are\nmutated, producing a pool of 2N sequences. Selection acts on this pool,\nremoving N less-ﬁt sequences that do not satisfy the selection pressure\nadequately.\nThis replication-selection cycle is repeated m times, and\nthe average genome length at every generation is recorded.\nsen from either the original strand or the complementary\nstrand.\nThis mechanism ensures that over generations,\neach strand can have varying amounts of both purines\nand pyrimidines, even though the initial pool sequences\nare composed entirely of either purines or pyrimidines.\nIn each generation, every sequence is replicated, and the\nreplicated sequence in the pool undergoes a single muta-\ntion, i.e., a duplication or deletion.\nFollowing this, the\nsequence pool is expanded to include N replicated and\nmutated sequences along with the N unmutated sequences\nof the previous generation, resulting in a total of 2N se-\nquences.\nFigure 2: Mutation of a given genome. A DNA double strand, from the\ninitial pool, with a homogeneous distribution of purines on one strand\n(red) and pyrimidines on its complement (blue). A mutation involves\neither a deletion or a duplication of a segment of a random length of\n5-10% of the total genome length, chosen at a random location of\nthe daughter genome.\nThe mutation results in either a decrease or\nan increase in the length of the genome by 5-10%.\nThe duplicated\nfragment can be from either strand, thereby altering the composition of\npurines/pyrimidines in each strand.\n2\n\n\nSelection: Following mutations, N sequences are selected\nfrom the pool of 2N for the next generation based on their\nability to satisfy the selection pressure. The selection pres-\nsure is quantiﬁed through a factor γ, deﬁned as\nγ =\nreplication time\ninformation storage capacity\n(1)\nTo quantify information storage capacity, we utilize the\nmetric of total genome length, since it provides the upper\nlimit for total information storage. Similarly, as a proxy\nfor the replication time for the entire genome, we consider\nthe length of the longest replichore, where, replichores are\ndeﬁned as disjoint segments of the genome that replicate\nindependently of each other. This substitution is based\non the following considerations: (a) Replichores replicate\nsimultaneously and independently, parallelizing the repli-\ncation process [21, 22].\nAlthough the ﬁring of multiple\nreplication origins across the genome is generally not syn-\nchronized [23, 24], we assume ideal conditions, where ori-\ngins ﬁre and replication progress across each replichore\nindependently and simultaneously. (b) For simplicity, it is\nassumed here that the replication speed of a replichore is\nconstant throughout the length of the replichore, although\nthe speed depends on the sequence and the availability of\nactivated nucleotides, in general [25]. This simplifying as-\nsumption enables us to use the replichore length as a re-\nplacement for the replication time of the whole genome,\nin our evaluation of γ. Therefore, with the above assump-\ntions, we redeﬁne equation (1) as\nγ = length of longest replichore\nlength of full genome\n(2)\nIn the selection process, the factor γ is calculated for all\nthe 2N (parent and mutated daughter) sequences in the\npool, and the N sequences with the lowest values of γ are\nextracted as the ﬁttest sequences and are carried forward\nto the next generation.\nTo identify replichores in a genome, we ﬁrst locate repli-\ncation origins and termini by analyzing base composition\nasymmetry or nucleotide skews, i.e., the excess of G over\nC and A over T on any given stretch of a single strand,\nacross the genome. This local violation of Chagraﬀ’s sec-\nond parity rule [26] is regularly utilized to ﬁnd the replica-\ntion origins and termini, by equating the locations of peaks\nand valleys in the skew plot to the replication origins and\ntermini. This is a widely used technique for in-silico pre-\ndiction of replication origins since 1996 [22, 27, 28, 29,\n30].\nIn this study, we have used the purine-pyrimidine\n(RY) cumulative skew, W, of the sequences [31, 32], where\nWRY (n) is deﬁned as WRY (n) = Σn\ni=1(δS(i),R −δS(i),Y ).\nHere,S is a genomic sequence of length N bp, composed of\nfour nucleotides, classiﬁed into two groups: R = {G, A},\nY = {C, T }, and n = 1 . . . N. We have taken 1000 purine-\nﬁlled single strands of length 1024 bp each as the initial\nsequence pool. These sequences are allowed to mutate, by\naccrual or deletion of genome fragments, leading to local\ndistortions in the skew in each generation.\nIn order to\navoid identifying small-scale skew variations (peaks and\nvalleys smaller than a certain length scale) as origins or\ntermini, since these are not identiﬁed as origins or termini\nby origin-ﬁnding algorithms [32, 33, 34, 35], we concen-\ntrate only on large-scale skew variations and ignore small-\nscale ones. We use wavelet transforms to ﬁlter out these\norigins and termini resulting from small-scale variations,\nby down-sampling the genome sequence of length N to a\nlength of N/2w, where w is the wavelet level. To ensure\nthat mutating fragments are not smaller than the wavelet\ncompression scale w and thus go unnoticed by the selection\npressure, we choose a w such that the smallest mutating\nfragment is larger than the compression factor; i.e., we\nimpose the condition 0.05N > 2w, where N is the full\ngenome length. It should be emphasized that the qual-\nitative divergence of prokaryotic and eukaryotic genome\nlengths does not depend on the wavelet level used in this\ndown-sampling procedure. Once the origins and termini of\nthe replication are identiﬁed, the lengths of the replichores\nwere measured as the distances between neighboring ori-\ngins and termini, the largest of which is chosen for the cal-\nculation of γ. A detailed description of the methodology\nfor identifying replication origins and measuring replichore\nlengths is provided in the supplementary material.\nIn our model, we chose the population N = 1000, the\ninitial sequence length of 1024 bp (L0), the number of\ngenerations m = 1000, and used a 4-level wavelet transfor-\nmation. We repeated the experiment 100 times to ensure\nstatistical robustness.\nOur model also includes an upper threshold for the num-\nber of replication origins allowed in a genome (Orimax)\nto prevent an uncontrolled explosion in genome length.\nGenomes with a replication origin count greater than\nOrimax are eliminated during the selection process. For\nprokaryotes, Orimax is set to 1, while for eukaryotes,\nOrimax is set to a value much greater than 1 (50 and 100).\nAlthough we use parameters such as Orimax, wavelet lev-\nels, and mutation size 5% - 10% for computational con-\nvenience, the model itself is free of intrinsic parameters,\nand the observed divergence between the prokaryotic and\neukaryotic genome length is completely insensitive to the\nparameters listed above.\nResults\nThe variation in genome length (in bp) of prokaryotes and\neukaryotes over 500 generations is shown in Fig. 3(a) and\n(b), respectively.\nThe evolutionary minimization of the\nselection pressure γ, for prokaryotes and eukaryotes, is\nshown in Fig. 3(c) and (d).\nWe observe that, in the absence of any restrictions on\nthe number of replication origins, the genome tends to\nincrease in length indeﬁnitely (Fig. 3b). However, taking\ninto account the scarcity of monomer resources and energy\nrequired to replicate longer genomes, we restrict genomes\nto have a maximum of Orimax origins. When Orimax is set\nhigh (>> 1), the average genome length is observed to in-\ncrease over generations. On the other hand, when Orimax\n3\n\n\n0\n100\n200\n300\n400\n500\n400\n600\n800\n1000\n1200\n1400\n0\n100\n200\n300\n400\n500\n0\n0.5\n1\n1.5\n2\n0\n100\n200\n300\n400\n500\nGeneration\n0\n0.1\n0.5\n1\n1 Origin\n5 Origins\n0\n100\n200\n300\n400\n500\nGeneration\n0\n0.005\n0.01\n0.02\n0.03\n0.04\n50 Origins\n100 Origins\n95% confidence interval\nProkaryotes\nEukaryotes\n(a)\n(b)\n(c)\n(d)\nSelection Pressure\nGenome Length (bp)\nFigure 3: The evolution of genome length over generations.\nAn ini-\ntial population of 1000 purine-ﬁlled single-strand sequences is subjected\nto mutation and evolved under the selection pressure (γ) to minimize\nreplication time while maximizing information storage capacity. The ex-\nperiment is repeated 100 times, and the evolution of average genome\nlength over 500 generations is shown, with a 95% conﬁdence inter-\nval. (a) When each genome in the pool is constrained to have a single\nreplication origin, mimicking prokaryotic genomes, the average genome\nlength decreases over generations.\nAlso shown is the genome length\nevolution when a few more origins are allowed, as in the case of ar-\nchaea. (b) In contrast, when the sequences are allowed to accommodate\nmany more replication origins, mimicking eukaryotic genomes, the aver-\nage genome length increases. This is because the expansion in genome\nlength of eukaryotes does not come at the expense of replication time.\nUnlike prokaryotes, eukaryotes can parallelize replication across multi-\nple replichores by replicating them independently and simultaneously,\ndue to the presence of multiple origins, thereby reducing the replication\ntime substantially, while maintaining a large genome length.\nDue to\nthe constraint of single origin, prokaryotes cannot have more than two\nreplichores, and hence cannot parallelize replication beyond these two,\nthus restricting their genome length. (c) and (d) Minimization of mu-\ntation pressure γ. For both prokaryotes and eukaryotes, γ converges to\n1/number of replichores. This convergence implies symmetrization of\nreplichore lengths across a genome. The initial pool has no origins, and\nhence one replichore, and the initial value of γ is thus 1.\nis restricted to 1, mimicking a prokaryotic genome, the\naverage length of the genome decreases over generations.\nDespite the applied selection pressure being identical in\nboth scenarios, prokaryotic genomes tend to lose sequence\nlength, while eukaryotes tend to elongate their genomes.\nThis behavior mirrors the evolutionary divergence between\nthe lengths of the prokaryotic and eukaryotic genomes. In\nthe context of the model, the explanation for this pattern\nof genome evolution is as follows.\nConsider\na\ngenome\nwith\nan\nasymmetric\npurine-\npyrimidine composition, where all nucleotides at the 5′−\nend of the replication origin are pyrimidines, and those\nat the 3′−end are purines. The cumulative skew proﬁle\nof this sequence forms a “V” shape, as illustrated in Fig.\n4(a). Prokaryotic genomes with the two replichores emerg-\ning from their single origin exhibit such skew proﬁles. The\nsingle replication origin is located at the valley point of the\n“V”-shaped skew proﬁle [28, 29, 30, 35]. The skew proﬁle\nof a eukaryotic genome, on the other hand, has multiple\nconcatenated “V”-shapes, as shown in Fig. 4(b), where,\neach arm of each “V” corresponds to a replichore, and the\nmultiple valley points, to multiple origins. Mutations in\nthe sequence alter this skew proﬁle. The selection pressure\nγ depends on whether the genome undergoes deletion or\ninsertion, and which replichore arm (shorter or longer) is\naﬀected due to the mutation. Fig. 4 shows a few skew pro-\nﬁles of the mutated sequences. Selection acts on the set\nof genomes with such altered skew proﬁles and prefers se-\nquences that decrease the replication time and/or increase\nthe information storage.\nIn the prokaryotic genome (P), mutations involving\nelongations are not preferred by the selection, since it ei-\nther increases the longest replichore length (e.g. P3 and\nP5), resulting in an increase in overall replication time,\nor adds an extra valley point to the sequence (e.g.\nP4\nand P6), which is eliminated by the selection pressure, as\nprokaryotes are restricted to have a single replication ori-\ngin. However, a mutation that shortens the longest repli-\nchore (e.g., P2) is selected because it decreases the replica-\ntion time. Unlike prokaryotic genomes, in eukaryotes, our\nselection algorithm allows for the addition of more origins,\nand hence more replichores (e.g.\nE4 and E6).\nIf these\nnew replichores are not the longest among all replichores,\nmutated sequences containing them will be selected due\nto their increased information storage capacity and neu-\ntral inﬂuence on replication time (e.g., E6).\nTherefore,\nthe genome length of eukaryotes continues to increase over\ngenerations through the incorporation of new origins and\nhence replichores, until selection restricts further increase\nin the number of origins due to the upper limit Orimax.\nIn both prokaryotic and eukaryotic organisms, evolu-\ntionary selection pressures favor the symmetrization of\nreplichore lengths. This phenomenon arises because repli-\nchores that are shorter than the longest replichore can un-\ndergo elongation through mutational processes, as this en-\nhances the genome’s information storage capacity without\nincreasing its replication time, thereby reducing γ. This\naligns with the general observation of symmetric replichore\nlengths in prokaryotes [36, 37, 38] and the balanced dis-\ntribution of short sequence motifs in eukaryotes [20, 39].\nCollectively, these selective forces drive two key outcomes:\n(1) the equilibration of replichore lengths and (2) the ad-\ndition of one or more new origins, and hence replichores.\nThe observed genome length reduction in prokaryotes\n(Fig.\n3) is due to a bias of the selection pressure that\nfavors deletions over insertions, although both mutational\nevents are equally probable in our model. As explained\nin the previous paragraph, selection pressure favors the\nsymmetrization of replichores. When two replichores of\nthe prokaryote are of unequal length, symmetrization re-\nquires deletion of the longer replichore or insertion into\nthe shorter replichore. Since our choice for the location of\nthese two mutational events is entirely random and, there-\nfore, evenly distributed over the lengths of the genome, the\n4\n\n\nprobability of choosing the shorter replichore for insertion\nor deletion will always be smaller than the probability of\nmutations occurring on the longer replichore. Although se-\nlection favors insertion into shorter replichore and deletion\nat longer replichore equally, since the latter is stochasti-\ncally more favored, deletion occurs more frequently. This\ncomputational observation reproduces the strong evolu-\ntionary preference observed experimentally for deletions\nover insertions in prokaryotes [40, 11, 41, 42, 43, 44].\noriginal\nmutated (deletion)\nmutated (duplication and insertion)\nP1\nP3\nP4\nP6\nE1\nE2\nE3\nE4\nE5\nP\nE\nP2\nE6\nProkaryote\nEukaryote\nsequence\nlongest replichore\nreplication origin\n(a)\n(b)\nFigure 4:\nEﬀect of selection pressure on prokaryotic and eukaryotic\ngenomes. The left panel, in blue background, shows the skew proﬁles\nof a prokaryotic and a eukaryotic genome of an intermediate genera-\ntion, before mutation. The right panel, in red background, shows a few\nskew proﬁles of these genomes, after mutation. For eukaryotic genomes,\nmutations adding an extra replichore originating from a new replication\norigin (e.g., ‘E6’) are preferred, as they increase information storage by\nelongating the genome without increasing the replication time (deter-\nmined by the length of the longest replichore). In prokaryotic genomes,\nmutations that increase the length of the longest replichore (e.g., ‘P3’\nand ‘P5’) or add a new replication origin (e.g., ‘P4’ and ‘P6’) are elimi-\nnated by selection pressure. Instead, mutations that shorten the longest\nreplichore length, leading to a symmetrization of replichore lengths (e.g.,\n‘P2’), are favored, as they optimize the selection pressure (γopt = 1/2)\nby lowering the replication time.\nAn initial increase in the average genome length is seen\nin Fig.\n3.\nThis is an artifact of our initial choice of\ngenomes, each of which has been chosen as a homoge-\nneous stretch of purines or pyrimidines. Therefore, these\ninitial sequences have no origin and the length of the entire\ngenome is equal to the length of a replichore, with γ = 1.\nThe deletions in these sequences do not alter the value of\nγ, since they aﬀect both the numerator and the denom-\ninator of γ equally. However, duplications can reduce γ\nwhen the duplicating fragment is from the complementary\nstrand, introducing a new replichore and an origin. The\nreduction in γ is due to the division of the genome into two\nreplichores, due to the introduction of an origin, thereby\nreducing the replication time [21]. As a result, within our\nmodel, during the early stages of evolution, deletions are\nnot favored by selection, and the average genome length\nincreases.\nSymmetrization\nof\nreplichore\nlengths\nleads\nto\nChargaﬀ’s Second Parity Rule\nThe evolution of genomic sequences in our model begins\nwith a pool of sequences composed entirely of purines (R)\non the Watson-strand and complementary pyrimidines (Y)\non the Crick-strand. In successive generations, mutation\ninvolving the exchange of strand fragments between com-\nplementary strands introduces strand heterogeneity, that\nis, sequences with interspersed R and Y bases. As demon-\nstrated in the earlier section, evolution under the deﬁned\nselection pressure γ drives sequences to have replichores\nof equal length. Half of the replichores, positioned to the\nleft of each origin, become pyrimidine-rich, while the re-\nmaining half, to the right of origins, are purine-rich. This\nsymmetry in the cumulative nucleotide skew around repli-\ncation origins [27] results in global parity in the purine\nand pyrimidine content throughout the genome, leading\nto Chargaﬀ’s second parity rule (PR-2).\nChargaﬀ’s ﬁrst parity rule, identiﬁed before the discov-\nery of DNA’s double-stranded structure [45, 46], revealed\nequal counts of adenine (A) and thymine (T), as well as\nguanine (G) and cytosine (C) in double-stranded DNA\n(dsDNA), a pattern now understood as a consequence of\nWatson-Crick base pairing. In contrast, Chargaﬀ’s sec-\nond parity rule (PR-2), which extends this symmetry to\nindividual strands of dsDNA, lacks a universally accepted\nmechanistic explanation [47, 48, 49, 50]. Early hypotheses\nattributed PR-2 to adaptive intra-strand stem-loop for-\nmation, favoring local sequence inversions to achieve the\nfunctional beneﬁts of self-complementarity [51, 50]. How-\never, this rationale fails to account for PR-2’s prevalence\nin non-coding regions, where selective pressures for sec-\nondary structures are weak [52]. Alternative theories pro-\npose PR-2 as a manifestation of the law of large numbers\nor an emergent property of entropy maximization in large\ngenomes, where stochastic shuﬄing of sequences via in-\nversions and transpositions homogenizes base composition\nover time [53, 54, 55, 56, 57, 58]. However, these mecha-\nnisms rely on no strand-bias assumptions and do not ac-\ncount for an asymmetry in base substitution frequencies\nbetween purine and pyrimidine, i.e. R →Y ̸= Y →R\n[59, 60]. More importantly, while these theories account\nfor global compositional symmetries, they neither explain\nnor reproduce local nucleotide compositional skews around\nreplication origins that are prevalent in genomes of nearly\nall species [27, 28, 29, 30, 61]. The near-universal pres-\nence of local violations of PR-2 points to their importance,\nspeciﬁcally for replication origin functionality. Stochastic\nnucleotide shuﬄing would erase these local PR-2 violations\nas well, and hence will be counterproductive.\nIn our framework, although we incorporate inter-strand\nshuﬄing, PR-2 emerges not as a passive outcome of ran-\ndom sequence shuﬄing but as an adaptive response to se-\nlection pressure (Fig. 5). Here, selection pressure elimi-\nnates any bias in the base substitution frequencies between\npurines and pyrimidines. Any alteration in the symmet-\nric, V-shaped proﬁle of the cumulative nucleotide skew (see\nFig. 4) due to the bias in base substitution frequencies is\nnot tolerated by the selection, since it would adversely af-\nfect the replication time, by making the replichore lengths\nasymmetric. Therefore, selection acts against such biased\nsubstitutions, restoring the symmetry of the cumulative\nskew diagram and that of the replichore lengths, and hence\n5\n\n\nthe global equivalence in the purine-pyrimidine content\nof a DNA single-strand. The evolutionary trajectory of\npurine content in our simulations (Fig. 5) illustrates this\ndynamic, demonstrating a rapid convergence to R/Y par-\nity concurrent with replichore symmetrization. Note that,\nalthough the mean R/Y composition equilibrates to 50%\nin both selective and neutral evolutionary processes (red\nand blue curves in Fig. 5), the variance in R/Y composi-\ntion is larger for neutral evolution, when compared with\nthe evolution under selective pressure. This suggests that\nstrong selective pressure leads to strict compliance with\nPR-2, whereas, non-adaptive evolution allows for devia-\ntions from PR-2. If the selection pressure for short repli-\ncation time is weak or non-existent, as in the case of mito-\nchondria, and for plasmids and viroids, the PR-2 compli-\nance requirement vanishes, according to our model. There\nis a lack of need to maintain symmetric replichore lengths\nto minimize replication time in these genomes, since the\nrate-limiting step for their replication is the replication\ntime of the host genomes, which are much larger. This pre-\ndiction has been validated experimentally [48, 62]. Chloro-\nplasts’ replication is independent of its host cell cycle [63],\nand it is, therefore, PR-2 compliant.\n0\n50\n100\n150\n200\n250\n300\nGeneration\n40\n50\n60\n70\n80\n90\n100\n% Purine Content\n0\n0.2\n0.4\n0.6\n0.8\n1\nSelection Pressure ( )\nWithout Selection Pressure\nWith Selection Pressure\nSelection Pressure ( )\nFigure 5: Evolutionary trajectories of base composition over generations.\nAn initial pool of double-stranded DNA, with the Watson strand com-\nposed entirely of purines (R) and the Crick strand, of pyrimidines (Y),\nis evolved through mutations (inversions and inverted transpositions).\nThe variation in purine content of the Watson strand over generations\nis shown, with shaded regions indicating 95% conﬁdence interval. Blue\ncurve: Strand evolution without any selection pressure, exhibiting grad-\nual R/Y parity in DNA single-strand, due to stochastic inter-strand\nshuﬄing. This demonstrates PR-2 emerging from stochasticity alone.\nThese sequences do not exhibit any structured nucleotide skew pro-\nﬁles associated with replication origins, seen in most genomes.\nRed\ncurve: Under selection, R/Y parity emerges more rapidly via replichore\nsymmetrization, which is a direct consequence of the selection pressure\nto minimize replication time by balancing replichore lengths. Selection\nmaintains the nucleotide skew proﬁles around replication origins, align-\ning with experimental observations. Selection also preserves PR-2 by\neliminating mutational biases for speciﬁc nucleotides, removing the ne-\ncessity for the no-strand bias assumption, used in explanations based on\nneutral processes.\nInﬂuence\nof\nendosymbiont\npower\nsupply\non\ngenome length\nAccording to our model above, prokaryotes tend to min-\nimize their genome length due to the limitation of a sin-\ngle replication origin, whereas eukaryotes tend to acquire\ngenome content, because of their ability to accommodate\nmultiple replication origins. The rationale for our choice\nto restrict the number of origins of prokaryotes to one,\nwhile allowing the eukaryotes to have many more is to\nalign the model with observations. A deeper reason for\nthis choice lies in the bioenergetic requirement for main-\ntaining multiple replication origins, which is to provide\nactivated monomers and energy supply for the replication\nmachinery simultaneously to multiple replicating segments\nof a large genome. This requirement is met through the\nendosymbiotic relationship of eukaryotes with mitochon-\ndria or chloroplasts [17, 9]. Jordan G. Okie\net al. have\nidentiﬁed a linear relationship between mitochondrial and\nchloroplast count and cell volume in a number of eukary-\notes [64].\nSince there is a well-known allometric rela-\ntionship between cell volume and genome length [65, 66,\n67, 68], we have converted the cell volume data of Jor-\ndan G. Okie et al. to that of genome length and plotted\nthe variation of genome length as a function of mitochon-\ndrial/chloroplast count. Fig. 6 shows this linear relation-\nship between the above two variables. This suggests that\nthe length of the eukaryotic genome is in part determined\nby the availability of the power supply to simultaneously\nreplicate multiple genomic segments, provided by multiple\nmitochondria or chloroplasts.\nThis limitation imposed on genome length by cellular\nenergetics is taken into account in our model by limiting\nthe number of origins to a set value, Orimax. In prokary-\notes, which lack mitochondria/chloroplasts, the number of\norigins is generally limited to 1 (or a few), and therefore\nwe take Orimax = 1. In eukaryotes, the number of origins\ncan be of the order of tens of thousands, and are limited\nonly by power supply availability, as argued above (6). We\ntherefore set Orimax to 50 or 100, to explore the genome\nlength divergence between prokaryotes and eukaryotes.\n0\n1\n2\n3\n4\n5\nlog10 number of mitochondria\n5\n6\n7\n8\n9\n10\n11\n12\nlog10 genome size (bp)\nUnicellular\nMulticellular\nLinear Fit\nCorr. Coeff. = 0.83\ny = 1.04x + 6.01\nn = 65\n(a)\n0\n0.5\n1\n1.5\n2\n2.5\n3\n3.5\nlog10 number of chloroplast\n6\n7\n8\n9\n10\n11\n12\n13\nlog10 genome size (bp)\nUnicellular\nMulticellular\nLinear Fit\nCorr. Coeff. = 0.56\ny = 0.90x + 8.02\nn = 94\n(b)\nFigure 6:\n(a) Correlation between the number of mitochondria and\ngenome length in 65 eukaryotic cells. (b) Correlation between the num-\nber of chloroplasts and genome length in 94 eukaryotic cells. These plots\nare produced using data from Jordan G. Okie et al. [64]. We estimate\nthe genome length from cell volume using the relation V = kCα [66],\nwith k = 3.04 × 10−5 µm3/bp and α = 0.89. The genome length is\npositively correlated with mitochondrial or chloroplast count, support-\ning the argument that the replication of longer genomes of eukaryotes\nis carried out with the energy provided by the endosymbionts.\n6\n\n\nUpper and lower bound of genome length\nAs explained before, the selection pressure symmetrizes\nthe replichore length and adds new origins, and thus repli-\nchores, to maximize information storage capacity. After\nevolving the sequences for a considerable number of gener-\nations, the selection produces genomes with nearly equal\nreplichore lengths and the maximum number of origins\n(Orimax = 1 for prokaryotes and Orimax >> 1 for eu-\nkaryotes), thus minimizing the selection pressure.\nThe\ntheoretical optimum genome length under these conditions\nis\nLopt ≈length of each replichore × max no. of replichores\n= length of each replichore × 2 Orimax\n(3)\nTherefore the optimum selection pressure is\nγopt = 1/number of replichores,\n(4)\nThe selection pressure can be seen to converge to this op-\ntimum in Fig. 3(c) & (d). For prokaryotes, γopt = 1\n2, since\na single origin can only support two replichores. Whereas,\nfor eukaryotes, γopt is 0.01 and 0.005, since, at optimum\ngenome length, they will have ≈100 and ≈200 repli-\nchores, corresponding to 50 and 100 origins, respectively.\nLower bound: The model introduces a wavelet-based\nresolution limit for distinguishing replication origins. Fol-\nlowing a w-level wavelet transform of the genome, pairs of\npeaks or valleys in the nucleotide skew proﬁle separated\nby fewer than 2w nucleotides become indistinguishable,\nas the transform disregards small-scale variations. This\nimposes a minimum threshold of 2w base pairs (bp) on\nreplichore lengths. This threshold may serve as a proxy\nfor the minimal genomic information necessary for cellular\nviability, reﬂecting evolutionary constraints on the small-\nest genome length. Consequently, in our simulations, the\nsmallest genome length achievable for prokaryotes is of the\norder of 2 × 2w nucleotides. Within the model, this lower\nbound reﬂects the computational resolution limit for iden-\ntiﬁcation of origins, whereas, in the evolutionary dynamics\ncaptured by the model, this lower bound reﬂects the need\nfor suﬃcient informational complexity for cellular mainte-\nnance and replication machinery [69, 70, 71, 72, 73]. Our\nchoice of a speciﬁc wavelet level ensures that the genome\nlength does not reduce below a certain viability limit.\nUpper bound: One can make an interesting observa-\ntion from the eq. 4: The optimum length of a eukaryotic\ngenome does not depend on the length of the replichore;\nonly on their number. A genome can therefore increase\nits own length by increasing the length of each of its repli-\nchores evenly, without inﬂuencing γ. Such an alteration\nincreases both the replication time and the information\nstorage capacity equally, thereby nullifying its eﬀect on\nthe selection pressure γ. However, our stochastic model\ncannot make such concerted changes at multiple locations\nin the genome, and hence cannot alter the length of the\ngenome this way. When the selection pressure is low, evo-\nlution, on the other hand, can alter the genome length\nby progressively lengthening each of the replichores, by\ntemporarily tolerating an uneven distribution of replichore\nlengths. This would result in very diﬀerent genome lengths\nand corresponding variance in replication times, due to\nvariation in replichore length, even within very similar eu-\nkaryotic species, as has been observed abundantly [74, 65,\n75, 76].\nTherefore, our model does not impose a strict\nupper limit on the genome length, although it converges\nto a constant genome length for a ﬁxed number of origins,\nOrimax. The evolutionarily optimized eukaryotic genome\nlength for a constant Orimax value depends on the average\nlength of the initial genome pool, which can be altered to\nproduce a longer or shorter optimized genome.\nLarge variance of eukaryotic genome length due to\nlow selection pressure for replication time\nIn order to verify our statement above that the genome\nlength can vary drastically even within similar species\nwhen the selection pressure for replication time is low,\nwe reduce the cost of replication time in our evaluation\nof selection pressure, by raising it to a power α, where\n0 ≤α ≤1. The modiﬁed expression for selection pressure\nreads\nγ =\n(replication time)α\ninformation storage capacity.\n(5)\nThis modiﬁcation allows for uneven distribution of repli-\nchore lengths, and the algorithm tolerates an increase in\nthe replication time by prioritizing information storage ca-\npacity, thus enlarging the genome, as explained above.\nWhen the importance of replication time reduces, and its\ncost (α) goes down, the variance in the lengths of the\ngenomes of our initial population increases with genera-\ntion, as seen from the widening of conﬁdence interval with\ngeneration in Fig. 7.\nSuch computationally observed signiﬁcant variation in\ngenome length has been documented across species [77,\n78, 79] and even within conspeciﬁc populations [75, 76,\n80, 81], an observation whose evolutionary mechanism is\ndeeply contested. This constitutes the central mystery of\nthe C-value paradox, a set of observations of uncertain\nevolutionary origins [82, 65]. Prevailing hypotheses posit\nthat persistent upward mutation pressure drives C-value\n(a measure of genome content) expansion, with species\nexhibiting slower cellular division rates being more tol-\nerant of random DNA accumulation [74, 83, 84].\nThis\nframework is supported by evidence demonstrating strong\nnegative correlations between genome length and both\nmitotic and meiotic division rates [85, 86].\nOur com-\nputational model provides an explanation for the above\nobservation, where, low selection pressure for replication\ntime shifts the evolutionary trajectory towards maximiz-\ning information storage capacity at the expense of repli-\ncation time. Apart from increasing the genome content\nover generations (C-value), this also increases the vari-\nance of the genome length, leading to drastically diﬀerent\ngenome lengths even within conspeciﬁc organisms (Fig. 7).\nWhether the accumulated genome carries information or\n7\n\n\nnot cannot be answered within our model, another mys-\ntery of the C-value paradox.\nFigure 7: Genome length evolution under reduced selection pressure for\nreplication time. In our model, the replication time is dictated by the\nlength of the longest replichore of the genome.\nUnder low selection\npressure for replication time (i.e.\nlow α), replichores expand to en-\nhance information storage capacity while minimally impacting the cost\nof replication time. This drives progressive genome elongation over gen-\nerations. This reduced pressure also permits uneven replichore lengths\nacross the genome, as opposed to the optimized symmetrical replichore\nlengths observed under strong selection. Consequently, genome length\nvariability within a set of related species increases over time, as reﬂected\nin the widening conﬁdence intervals for low α. This explains the genome\nlength variability experimentally observed across species and within con-\nspeciﬁc organisms.\nThe conﬁdence interval shown here is calculated\nwith 30 samples, for the purpose of visual demonstration. The increase\nin variance with the reduction in α persists for higher sample numbers.\nDiscussion\nThe divergence between the lengths of genomes of prokary-\notes and eukaryotes has been an enduring enigma, noted\nsince the ﬁrst systematic C-value measurements carried\nout in the 1950s. The nearly 100-fold diﬀerence in cell\nsizes between prokaryotes and eukaryotes, and the huge\nincrease in the structural and functional complexity of eu-\nkaryotes are generally attributed to this diﬀerence. The\npurpose of this paper is to investigate the evolutionary\norigin of this divergence.\nHere, we identify replication\ntime and information storage capacity as the two primary\ndeterminants of genome length, with the latter strongly\nconstrained by cellular energetics. The interplay between\nthese two variables dictates the evolutionary trajectory of\ngenome length, for any given species.\nWe quantify this interplay between replication time and\ninformation storage capacity by deﬁning Selection Pres-\nsure simply as the ratio of the above two variables. Evo-\nlution acts on the genome, attempting to minimize the\nreplication time while maximizing the information storage\ncapacity. By rewriting the selection pressure in terms of\nthe length of the replichores and the total length of the\ngenome, we make the selection pressure computable. We\nmodel the evolution of a pool of genomes by introducing\nstochastic mutations, randomly adding or deleting a frac-\ntion of the total genome, and evaluating the eﬀect of the\nselection pressure on the mutated genomes.\nWe observe that prokaryotic genomes, modeled here\nas genomes with a single replication origin, lose genome\nlength with evolving generations. This is due to the in-\nability of prokaryotic genomes to parallelize their replica-\ntion by dividing the genome into multiple segments (repli-\nchores) that can replicate independently and simultane-\nously, because of the restriction on the number of origins.\nThis restriction reduces the genome length for prokary-\notes, since only two simultaneously replicating segments\nare allowed, and any increase in the size of these segments\nincreases the replication time, and is thus evolutionarily\ndisfavored. On the other hand, we observe that eukary-\notic genomes tend to increase their genome length indeﬁ-\nnitely, without incurring a cost from increased replication\ntime, since the model’s allowance of a large number of\norigins for eukaryotic genomes allows for massive paral-\nlelization of genome replication, by dividing the genome\ninto multiple independently and simultaneously replicat-\ning segments. This indeﬁnite expansion of the eukaryotic\ngenome is curtailed only by cellular energetic constraints,\nthe need for activated monomers and energy supply for si-\nmultaneously replicating thousands of genomic segments.\nThis constraint is experimentally demonstrated by the lin-\near relationship between the number of endosymbionts and\ngenome length in eukaryotes (Fig. 6). We model this con-\nstraint by limiting the number of origins allowed for eu-\nkaryotic genomes.\nOur model demonstrates that Chargaﬀ’s second parity\nrule (PR-2), i.e. the symmetry of purine (R) and pyrim-\nidine (Y) frequencies within individual DNA strands,\nemerges as a direct consequence of selection for replica-\ntion eﬃciency. When initialized with purine-ﬁlled single-\nstrand sequences, evolution under the deﬁned selection\npressures drives them toward parity, yielding strands with\nequal purine and pyrimidine content. Critically, this sym-\nmetry is not a natural outcome of stochastic inter-strand\nsequence shuﬄing or thermodynamic entropy maximiza-\ntion, but an adaptive response to selection for balanced\nreplichore lengths.\nAny compositional bias in a strand\nwould generate asymmetrical replichores, delaying repli-\ncation and reducing ﬁtness. Thus, PR-2 in our framework\nreﬂects an evolutionary optimization: the equalization of\nR/Y content is a byproduct of selection to harmonize repli-\nchore architecture, ensuring eﬃcient bidirectional replica-\ntion.\nThese results suggest that PR-2 is a signature of\nreplication-driven adaptation, rather than an outcome of\nneutral processes.\nAlthough not originally intended,\nsurprisingly, our\nmodel reproduces several other experimentally observed\nphenomena,\nin addition to the prokaryote-eukaryote\ngenome length divergence and reproduction of PR-2 com-\npliance. (a) A general preference for deletion mutations\nover insertions (Fig. 4a) [40, 11, 41, 42, 43, 44]. (b) A\ntendency to equalize the lengths of all replichores of the\ngenome, as indicated by the optimized γ value (Fig. 3c,d)\n8\n\n\nFigure 8: Neutral and adaptive evolutionary trajectories leading to Char-\ngaﬀ’s second parity rule (PR-2). In the neutral process, starting from a\npurine-ﬁlled Watson strand of low ﬁtness (high γ), genomes may reach\na state of equal purine (R) and pyrimidine (Y) content on a single\nstrand, i.e. PR-2, solely through a large number of mutations (inver-\nsions and inverted transpositions), occurring neutrally without providing\nany adaptive beneﬁt.\nThe rate of convergence to PR-2 through this\nroute is slower, and the PR-2 compliance is less strict. Moreover, the\nnucleotide skews that dictate the V-shaped replichore structure are aver-\naged out, nullifying the sequence signature corresponding to replication\norigins. Alternatively, as demonstrated in this work, selection pressure\nfor rapid replication can swiftly enforce PR-2 through replichore length\nsymmetrization, resulting in a strict compliance with this parity rule.\nThis adaptive process also retains the sequence signature that deter-\nmines replication origins.\n[20, 36, 37, 38, 39] (c) Correlation between genome length\nand the number of mitochondria/chloroplasts (Fig. 6) [64,\n87] (d) Increase in the variance of genome length resulting\nfrom a reduced selection pressure for replication time min-\nimization (C-value paradox) (Fig. 7) [75, 76, 80, 81] (e)\nAnticorrelation between cell-cycle time and genome length\n(Fig. 7) [85, 86].\nOur model can be tested using in-vitro evolution ex-\nperiments on self-replicating DNA sequences that involve\ndeletions and insertion mutations.\nUnder strong selec-\ntion pressure for faster replication, the sequences should\nevolve towards a replichore structure with a central origin\nof replication and equal and opposite nucleotide skews on\nthe two replichore arms. However, when primed to repli-\ncate from the ends, these sequences should evolve toward\npurine/pyrimidine-ﬁlled single strands. When the supply\nof monomers is adequate, the more ﬁt sequences would\nexhibit multiple origins. Any imbalance in the lengths of\nthe two replichores of the evolutionarily superior sequences\nshould adversely aﬀect the sequence’s ﬁtness.\nOur explanation for the divergence between prokary-\notic and eukaryotic genome lengths rests primarily on the\nnumber of origins used during DNA replication:\nusing\nmore origins reduces the replication time, all else being\nequal. Multicellular eukaryotes appear to have invented\na new degree of freedom to modulate their cell replica-\ntion time depending on tissue-level spatial, temporal, en-\nergetic, and environmental constraints by employing an\nappropriate number of origins. As has been amply demon-\nstrated, multicellular organisms do not utilize all avail-\nable origins of replication to replicate their DNA. Only\nabout 30% of the origins of the human genome are con-\nstitutively ﬁred, with the utilization of the rest depend-\ning on the tissue/organism-level requirements [88, 89, 90].\nThis top-down control of replication origin ﬁring partly\nenables these organisms to create specialized organs with\ndisparate cell-cycle rates, such as human skin and colon,\nwhere rapid cell-cycle rates are crucial, and neurons in\nthe brain, which rarely replicate, presumably to preserve\ninformation [91, 92, 93, 94]. An important sequence char-\nacteristic that segregates multicellular eukaryotic origins\ninto constitutive, latent, and dormant sets is the magni-\ntude of nucleotide skew at the origin locations [95]. Our\nmodel above too uses these nucleotide skews to identify the\nlocations of origins, although the magnitude of the skew is\nnot utilized for determining the eﬃciency of origin ﬁring,\na simpliﬁcation that will be removed in a later article. We\nspeculate that the local loss of such top-down control on\nreplication origin selection in various tissues leads to rapid\nreplication and, consequently, carcinogenesis [96]. Regu-\nlation of the number and ﬁring eﬃciency of replication\norigins can modulate genome architecture at evolutionary\ntimescales, while organismal top-down control appears to\ntame the origins into serving the individual organism at\nthe timescale of the lifetime of that individual.\nStatements and Declarations\nCompeting interests\nThe authors declare no competing interests.\nAcknowledgments\nSupport for this work was provided by the Science & En-\ngineering Research Board (SERB), Department of Science\nand Technology (DST), India, through a Core Research\nGrant with ﬁle no. CRG/2020/003555 and a MATRICS\ngrant with ﬁle no. MTR/2022/000086.\nSupplementary Information\nThe algorithms and parameters used to generate the plots\nare provided in supplementary information.\nSupplementary Information\nModel\nWe are interested in the investigation of genome length\nevolution under a selection pressure that attempts to min-\nimize replication time while maximizing information stor-\nage capacity.\nAn initial pool of N identical sequences,\ncomposed of all purines or all pyrimidines, are replicated,\nand the daughter sequences are mutated, producing a pool\nof 2N sequences. Selection acts on this pool, removing N\nless-ﬁt sequences that do not satisfy the selection pressure\nadequately. This replication-selection cycle is repeated m\ntimes, and the average genome length at every generation\nis recorded.\n9\n\n\nAlgorithms\nWe followed the following algorithm to mutate each se-\nquence in the pool and then calculate the selection pres-\nsure (γ) to extract the ﬁt sequences.\nMutation\nWe implement large-scale genomic mutations through\ndeletions or duplications of random regions comprising 5%\nto 10% of the total genome length (Fig. 9). In each gener-\nation, every sequence in the pool undergoes a single muta-\ntion, i.e., either a duplication or deletion. Following this,\nthe sequence pool is expanded to include the new N mu-\ntated sequences along with the N sequences of the previous\ngeneration, resulting in a total of 2N sequences.\noriginal sequence\nchoose a random fragment \nof random length between \n5-10% of total genome size\ndeletion\nduplication\nremove the \nselected fragment\nduplicate from \nthe same strand\nduplicate from the \ncomplement strand\nchoose a random location \nto insert the fragment\nadd the mutated sequence \nto the existing sequnce pool\nP1 = 0.5\nP'1 = 0.5\nP'2 = 0.5\nP2 = 0.5\nFigure 9: Algorithm for mutation. Here, P1 and P ′\n1 are the probability\nof the sequence undergoing deletion or duplication, respectively. And,\nP2 and P ′\n2 are the probability of the sequence undergoing duplication\nfrom the same strand or complementary strand, respectively.\nCalculation of selection pressure\nFollowing mutation, N sequences are selected from the\npool of 2N for the next generation based on a selection\npressure aimed at minimizing the factor γ, which is deﬁned\nas,\nγ = length of longest replichore\nfull genome length\n(6)\nA low γ value of a sequence suggests that the sequence is\ncapable of fast replication and high information storage.\nWe used cumulative skew of the sequences to identify\nreplication origins and termini and hence the replichore\nfind local minima\nand maxima\ndifference between \nconsequtive maxima and minima\ngiven sequence\nf\u0000\u0001\n\u0002\n\u0003\u0004\u0005 \u0004\n\u0006 \u0007\b\u0000 \t\n\u000b\f\n\n\r\nof\n\b\u000e\n\n\u000b\n\n\u000f\u0004\n\u0001\u0003\n\ncompressed sequence\nlocate replication\norigins and termini\ncalculate \nreplichore lengths\nf\u0000\u0001\n\u0002\n\b\n\u000e\n\nlongest replichore\nreplichore length\nscaled back\n\u000b\n\n\u0006 \n\u0003\n\b\n\u0000o\n\u0001\nf \u0007\n\u0003\n\bo\ns γ\n\u000b\n\n\u0006\n\n\u0003\n\b\n\u0000 o\n\u0001\nf \u0007\n\u0003\b o\ns\n\u0010γ) =\nlength of longest replichore\nfull genome length\nx 2w\norigin\nterminus\nwavelet transform\nl1\nl2\nl3\nl4\n5'- RYYRYYYRYYYYRRYY......RRRYRRRRRYRRY-3'\nDownsampling \nby w-level\nl2 x 2w\nl2\nUpsampling \nby w-level\n=\nl2\nl1 + l2 + l3 + l4\nFigure 10: Calculation of selection pressure (γ)\nlengths. The purine-pyrimidine (RY) cumulative skew of\nthe sequences, WRY (n), is deﬁned as;\nWRY (n) = Σn\ni=1(δS(i),R −δS(i),Y )\n(7)\nHere,S is a genomic sequence of length N bp, composed\nof four nucleotides, classiﬁed into two groups: R = {G, A},\nY = {C, T }, and n = 1 . . . N.\nThe selection pressure (γ) is calculated for each of the\nsequences. Thereafter, N sequences with the lowest γ val-\nues are selected as evolutionarily superior and are carried\nforward to the next generation.\nGenome Length Evolution Over 1000 Gen-\nerations\nIn our simulations, we set the population size to N = 1000,\nthe initial genome length to 1024 bp (L0), and the number\nof generations to m = 1000, employing a four-level wavelet\ntransformation. Each experiment was repeated 100 times\nto ensure statistical robustness. The genome length stabi-\nlized within 500 generations; thus, for clarity, the main ar-\nticle presents results up to 500 generations. The complete\ngenome length evolution over 1000 generations is shown\nbelow.\n10\n\n\n0\n500\n1000\nGeneration\n400\n600\n800\n1000\n1200\n1400\nGenome Length\n1 Origin\n5 Origins\n0\n500\n1000\nGeneration\n0\n0.5\n1\n1.5\n2\nGenome Length\n104\n50 Origins\n100 Origins\n0\n500\n1000\nGeneration\n0\n0.1\n0.5\n1\nSelection pressure\n1 Origin\n5 Origins\n0\n500\n1000\nGeneration\n0\n0.005\n0.01\n0.02\n0.03\n0.04\nSelection pressure\n50 Origins\n100 Origins\nFigure 11: Genome length evolution for 1000 generations\nGenome Length and Cell Size Allometry\nGenome length has been reported to scale with cell volume\nfollowing an allometric relationship [65, 67, 68]:\nV = kCα,\n(8)\nwhere V represents the cell volume in cubic micrometers,\nand C denotes genome length in base pairs. We applied\nthis allometric relation to estimate genome lengths from\ncell volumes in our dataset.\nTo determine the coeﬃcients k and α, we analyzed the\ncorrelation between cell volume and genome length for 60\norganisms with available genome data. The estimated co-\neﬃcients were then used in Eq. 8 to infer genome lengths\nfor the remaining organisms in our dataset.\n7\n7.5\n8\n8.5\n9\n9.5\n10\n10.5\nlog10 Genome Size (bp)\n1\n2\n3\n4\n5\n6\n7\nlog10 Cell Volume (cubic micrometer)\nUnicellular\nMulticellular\nLinear Fit\ny = 0.89x + -4.52\nR = 0.64\nn = 60\nFigure 12: Correlation between genome length and cell volume.\nThe log-log correlation of genome length and cell vol-\nume for these 60 organisms is presented in Fig. 12, yield-\ning estimated coeﬃcients of k = 3.04 × 10−5 µm3/bp and\nα = 0.89. Using these coeﬃcients, we estimated genome\nlengths for the rest of the organisms from equation (8) and\nsubsequently analyzed their correlation with mitochondria\nand chloroplast count. The correlation between genome\nlength and mitochondrial count is discussed in the main\narticle.\nParameters\nThe following parameters were used to generate Fig. (3)\nof the main article.\n1. Length of each sequence in the initial pool, L0 = 1024\nbp\n2. Number of sequences in the pool, N = 1000\n3. Wavelet level = 4\n4. Minimum length of mutating fragment = 5% of full\ngenome\n5. Maximum length of mutating fragment = 10% of full\ngenome\n6. Number of generations = 1000\nThe following parameters were used to generate Fig. (5)\nof the main article.\n1. Length of each sequence in the initial pool, L0 = 1024\nbp\n2. Number of sequences in the pool, N = 100\n3. Wavelet level = 4\n4. Minimum length of mutating fragment = 5% of full\ngenome\n5. Maximum length of mutating fragment = 10% of full\ngenome\n6. Maximum number of replication origins Orimax = 50\n7. Number of generations = 300\nThe following parameters were used to generate Fig. (7)\nof the main article.\n1. Length of each sequence in the initial pool, L0 = 1024\nbp\n2. Number of sequences in the pool, N = 100\n3. Wavelet level = 4\n4. Minimum length of mutating fragment = 5% of full\ngenome\n5. Maximum length of mutating fragment = 10% of full\ngenome\n6. Maximum number of replication origins Orimax = 50\n7. Number of generations = 500\n11\n\n\nReferences\n[1]\nT Ryan Gregory. “Understanding natural selection:\nessential concepts and common misconceptions”.\nIn: Evolution: Education and outreach 2 (2009),\npp. 156–175.\n[2]\nFreeman Dyson. Origins of life. Cambridge Univer-\nsity Press, 1999.\n[3]\nRadhey S Gupta and G Brian Golding. “The ori-\ngin of the eukaryotic cell”. In: Trends in biochemical\nsciences 21.5 (1996), pp. 166–171.\n[4]\nT Martin Embley and William Martin. “Eukary-\notic evolution, changes and challenges”. In: Nature\n440.7084 (2006), pp. 623–630.\n[5]\nWilliam F Martin, Sriram Garg, and Verena Zi-\nmorski. “Endosymbiotic theories for eukaryote ori-\ngin”. In: Philosophical Transactions of the Royal\nSociety B: Biological Sciences\n370.1678 (2015),\np. 20140330.\n[6]\nItamar Sela, Yuri I Wolf, and Eugene V Koonin.\n“Theory of prokaryotic genome evolution”. In: Pro-\nceedings of the National Academy of Sciences 113.41\n(2016), pp. 11399–11407.\n[7]\nMichael Lynch and John S Conery. “The origins of\ngenome complexity”. In: science 302.5649 (2003),\npp. 1401–1404.\n[8]\nEduardo PC Rocha. “The organization of the bac-\nterial genome”. In: Annual review of genetics 42.1\n(2008), pp. 211–233.\n[9]\nNick Lane. “Energetics and genetics across the\nprokaryote-eukaryote divide”. In: Biology direct 6\n(2011), pp. 1–31.\n[10]\nKatsumi Chiyomaru and Kazuhiro Takemoto. “Re-\nvisiting the hypothesis of an energetic barrier to\ngenome complexity between eukaryotes and prokary-\notes”. In: Royal Society open science 7.2 (2020),\np. 191859.\n[11]\nAlex Mira, Howard Ochman, and Nancy A Moran.\n“Deletional bias and the evolution of bacterial\ngenomes”. In: TRENDS in Genetics 17.10 (2001),\npp. 589–596.\n[12]\nPiotr\nBentkowski,\nCock\nVan\nOosterhout,\nand\nThomas Mock. “A model of genome size evolu-\ntion for prokaryotes in stable and ﬂuctuating en-\nvironments”. In: Genome biology and evolution 7.8\n(2015), pp. 2344–2351.\n[13]\nCarolina A Martinez-Gutierrez and Frank O Ayl-\nward. “Genome size distributions in bacteria and ar-\nchaea are strongly linked to evolutionary history at\nbroad phylogenetic scales”. In: PLoS Genetics 18.5\n(2022), e1010220.\n[14]\nAlejandro Rodr´ıguez-Gij´on et al. “Linking prokary-\notic genome size variation to metabolic potential and\nenvironment”. In: ISME communications 3.1 (2023),\np. 25.\n[15]\nStephan Fischer et al. “A model for genome size\nevolution”. In: Bulletin of mathematical biology 76\n(2014), pp. 2249–2291.\n[16]\nMarco Colnaghi, Nick Lane, and Andrew Pomi-\nankowski. “Genome expansion in early eukaryotes\ndrove the transition from lateral gene transfer to\nmeiotic sex”. In: Elife 9 (2020), e58873.\n[17]\nNick Lane and William Martin. “The energetics of\ngenome complexity”. In: Nature 467.7318 (2010),\npp. 929–934.\n[18]\nPatrick Alfred Pierce Moran. “Random processes in\ngenetics”. In: Mathematical proceedings of the cam-\nbridge philosophical society. Vol. 54. 1. Cambridge\nUniversity Press. 1958, pp. 60–71.\n[19]\nYuri I Wolf et al. “The universal distribution of\nevolutionary rates of genes and distinct characteris-\ntics of eukaryotic genes of diﬀerent apparent ages”.\nIn: Proceedings of the National Academy of Sciences\n106.18 (2009), pp. 7273–7280.\n[20]\nGuenter Albrecht-Buehler. “Inversions and inverted\ntranspositions as the basis for an almost universal\n“format” of genome sequences”. In: Genomics 90.3\n(2007), pp. 297–305.\n[21]\nHemachander Subramanian and Robert A Gatenby.\n“Evolutionary advantage of anti-parallel strand ori-\nentation of duplex DNA”. In: Scientiﬁc Reports 10.1\n(2020), p. 9883.\n[22]\nParthasarathi Sahu et al. “High Nucleotide Skew\nPalindromic DNA Sequences Function as Potential\nReplication Origins due to their Unzipping Propen-\nsity”. In: Journal of Molecular Evolution (2024),\npp. 1–15.\n[23]\nDominik Boos and Pedro Ferreira. “Origin ﬁring reg-\nulations to control genome replication timing”. In:\nGenes 10.3 (2019), p. 199.\n[24]\nPrasanta K Patel et al. “DNA replication origins ﬁre\nstochastically in ﬁssion yeast”. In: Molecular biology\nof the cell 17.1 (2006), pp. 308–316.\n[25]\nXindan Wang et al. “Replication and segregation of\nan Escherichia coli chromosome with two replication\norigins”. In: Proceedings of the National Academy of\nSciences 108.26 (2011), E243–E250.\n[26]\nRivka Rudner, John D Karkas, and Erwin Chargaﬀ.\n“Separation of B. subtilis DNA into complementary\nstrands. 3. Direct analysis.” In: Proceedings of the\nNational Academy of Sciences 60.3 (1968), pp. 921–\n922.\n[27]\nJean R Lobry. “Asymmetric substitution patterns\nin the two DNA strands of bacteria.” In: Molecular\nbiology and evolution 13.5 (1996), pp. 660–665.\n12\n\n\n[28]\nAndrei Grigoriev. “Analyzing genomes with cumula-\ntive skew diagrams”. In: Nucleic acids research 26.10\n(1998), pp. 2286–2290.\n[29]\nElisabeth RM Tillier and Richard A Collins. “The\ncontributions of replication orientation, gene di-\nrection, and signal sequences to base-composition\nasymmetries in bacterial genomes”. In: Journal of\nMolecular Evolution 50 (2000), pp. 249–257.\n[30]\nMichael J McLean, Kenneth H Wolfe, and Kevin\nM Devine. “Base composition skews, replication\norientation, and gene orientation in 12 prokaryote\ngenomes”. In: Journal of molecular evolution 47\n(1998), pp. 691–696.\n[31]\nRen Zhang and Chun-Ting Zhang. “Identiﬁcation of\nreplication origins in archaeal genomes based on the\nZ-curve method”. In: Archaea 1.5 (2004), p. 335.\n[32]\nNatalia V Sernova and Mikhail S Gelfand. “Identiﬁ-\ncation of replication origins in prokaryotic genomes”.\nIn: Brieﬁngs in Bioinformatics 9.5 (2008), pp. 376–\n391.\n[33]\nAC Frank and JR Lobry. “Oriloc: prediction of repli-\ncation boundaries in unannotated bacterial chromo-\nsomes”. In: Bioinformatics 16.6 (2000), pp. 560–561.\n[34]\nRen Zhang and Chun-Ting Zhang. “Z curves, an in-\ntutive tool for visualizing and analyzing the DNA se-\nquences”. In: Journal of Biomolecular Structure and\nDynamics 11.4 (1994), pp. 767–782.\n[35]\nFeng Gao and Chun-Ting Zhang. “Ori-Finder: a\nweb-based system for ﬁnding oriC s in unanno-\ntated bacterial genomes”. In: BMC bioinformatics\n9 (2008), pp. 1–6.\n[36]\nT David Matthews and Stanley Maloy. “Fitness ef-\nfects of replichore imbalance in Salmonella enterica”.\nIn: Journal of bacteriology 192.22 (2010), pp. 6086–\n6088.\n[37]\nAaron E Darling, Istv´an Mikl´os, and Mark A Ra-\ngan. “Dynamics of genome rearrangement in bac-\nterial populations”. In: PLoS genetics 4.7 (2008),\ne1000128.\n[38]\nMagnus G Jespersen et al. “Insertion sequence ele-\nments and unique symmetrical genomic regions me-\ndiate chromosomal inversions in Streptococcus pyo-\ngenes”. In: Nucleic Acids Research 52.21 (2024),\npp. 13128–13137.\n[39]\nVinayakumar V Prabhu. “Symmetry observations\nin long nucleotide sequences.” In: Nucleic acids re-\nsearch 21.12 (1993), p. 2797.\n[40]\nChih-Horng Kuo and Howard Ochman. “Deletional\nbias across the three domains of life”. In: Genome\nbiology and evolution 1 (2009), pp. 145–152.\n[41]\nMartin S Taylor, Chris P Ponting, and Richard\nR Copley. “Occurrence and consequences of cod-\ning sequence insertions and deletions in mam-\nmalian genomes”. In: Genome research 14.4 (2004),\npp. 555–566.\n[42]\nShiheng Tao et al. “Patterns of insertion and dele-\ntion in mammalian genomes”. In: Current Genomics\n8.6 (2007), pp. 370–378.\n[43]\nJan O Andersson and Siv GE Andersson. “Pseudo-\ngenes, junk DNA, and the dynamics of Rickettsia\ngenomes”. In: Molecular biology and evolution 18.5\n(2001), pp. 829–839.\n[44]\nT Ryan Gregory. “Insertion–deletion biases and the\nevolution of genome size”. In: Gene 324 (2004),\npp. 15–34.\n[45]\nErwin Chargaﬀ. “Chemical speciﬁcity of nucleic\nacids and mechanism of their enzymatic degrada-\ntion”. In: Experientia 6.6 (1950), pp. 201–209.\n[46]\nErwin Chargaﬀ, Rakoma Lipshitz, and Charlotte\nGreen. “Composition of the desoxypentose nucleic\nacids of four genera of sea-urchin”. In: Journal of\nBiological Chemistry 195.1 (1952), pp. 155–160.\n[47]\nNoboru Sueoka. “Intrastrand parity rules of DNA\nbase composition and usage biases of synonymous\ncodons”. In: Journal of molecular evolution\n40\n(1995), pp. 318–325.\n[48]\nDavid Mitchell and Robert Bridge. “A test of Char-\ngaﬀ’s second rule”. In: Biochemical and biophysical\nresearch communications 340.1 (2006), pp. 90–94.\n[49]\nPierre-Fran¸cois Baisn´ee, Steve Hampson, and Pierre\nBaldi. “Why are complementary DNA strands sym-\nmetric?” In: Bioinformatics 18.8 (2002), pp. 1021–\n1033.\n[50]\nDonald R Forsdyke. “Neutralism versus selection-\nism: Chargaﬀ’s second parity rule, revisited”. In: Ge-\nnetica 149.2 (2021), pp. 81–88.\n[51]\nDonald R Forsdyke. “Relative roles of primary se-\nquence and (G+ C)% in determining the hierarchy\nof frequencies of complementary trinucleotide pairs\nin DNAs of diﬀerent species”. In: Journal of molec-\nular evolution 41 (1995), pp. 573–581.\n[52]\nShang-Hong Zhang and Ya-Zhi Huang. “Limited\ncontribution of stem-loop potential to symmetry of\nsingle-stranded genomic DNA”. In: Bioinformatics\n26.4 (2010), pp. 478–485.\n[53]\nJR\nLobry.\n“Properties of\na\ngeneral model\nof\nDNA evolution under no-strand-bias conditions”. In:\nJournal of molecular evolution 40 (1995), pp. 326–\n330.\n[54]\nGuenter Albrecht-Buehler. “Asymptotically increas-\ning compliance of genomes with Chargaﬀ’s second\nparity rules through inversions and inverted trans-\npositions”. In: Proceedings of the National Academy\nof Sciences 103.47 (2006), pp. 17828–17833.\n13\n\n\n[55]\nAndrew Hart, Servet Mart´ınez, and Felipe Olmos.\n“A Gibbs approach to Chargaﬀ’s second parity\nrule”. In: Journal of Statistical Physics 146 (2012),\npp. 408–422.\n[56]\nPiero Fariselli et al. “DNA sequence symmetries\nfrom randomness: the origin of the Chargaﬀ’s sec-\nond parity rule”. In: Brieﬁngs in bioinformatics 22.2\n(2021), pp. 2172–2181.\n[57]\nBakhyt T Matkarimov and Murat K Saparbaev.\n“Chargaﬀ’s second parity rule lies at the origin of\nadditive genetic interactions in quantitative traits\nto make omnigenic selection possible”. In: PeerJ 11\n(2023), e16671.\n[58]\nPatrick Pﬂughaupt and Aleksandr B Sahakyan.\n“Generalised interrelations among mutation rates\ndrive the genomic compliance of Chargaﬀ’s sec-\nond parity rule”. In: Nucleic Acids Research 51.14\n(2023), pp. 7409–7423.\n[59]\nJean-Pierre\nVartanian,\nMichel\nHenry,\nand\nSi-\nmon Wain-Hobson. “Hypermutagenic PCR involv-\ning all four transitions and a sizeable proportion\nof transversions”. In: Nucleic acids research 24.14\n(1996), pp. 2627–2631.\n[60]\nAC Frank and JR Lobry. “Asymmetric substitution\npatterns: a review of possible underlying mutational\nor selective mechanisms”. In: Gene 238.1 (1999),\npp. 65–77.\n[61]\nBoris Bartholdy et al. “Allele-speciﬁc analysis of\nDNA replication origins in mammalian cells”. In:\nNature communications 6.1 (2015), p. 7051.\n[62]\nChristoforos Nikolaou and Yannis Almirantis. “De-\nviations from Chargaﬀ’s second parity rule in or-\nganellar DNA: Insights into the evolution of organel-\nlar genomes”. In: Gene 381 (2006), pp. 34–41.\n[63]\nYukihiro\nKabeya\nand\nShin-ya\nMiyagishima.\n“Chloroplast DNA replication is regulated by the\nredox state independently of chloroplast division in\nChlamydomonas reinhardtii”. In: Plant physiology\n161.4 (2013), pp. 2102–2112.\n[64]\nJordan G Okie, Val H Smith, and Mercedes Martin-\nCereceda. “Major evolutionary transitions of life,\nmetabolic scaling and the number and size of mi-\ntochondria and chloroplasts”. In: Proceedings of\nthe Royal Society B: Biological Sciences 283.1831\n(2016), p. 20160611.\n[65]\nT Ryan Gregory. “Coincidence, coevolution, or cau-\nsation? DNA content, cell size, and the C-value\nenigma”. In: Biological reviews 76.1 (2001), pp. 65–\n101.\n[66]\nT. Ryan Gregory, Paul Hebert, and Ju Kolasa. “Evo-\nlutionary Implications of the Relationship between\nGenome Size and Body Size in Flatworms and Cope-\npods”. In: Heredity 84 ( Pt 2) (Mar. 2000), pp. 201–\n8. doi: 10.1046/j.1365-2540.2000.00661.x.\n[67]\nEttore Olmo. “Nucleotype and cell size in verte-\nbrates: a review.” In: Basic and applied histochem-\nistry 27.4 (1983), pp. 227–256.\n[68]\nMANFREDI ROMANINI MG. “The DNA nuclear\ncontent and the evolution of vertebrates”. In: Cyto-\ntaxonomy and vertebrate evolution (1973), pp. 39–\n81.\n[69]\nAlexander V Markov, Valery A Anisimov, and An-\ndrey V Korotayev. “Relationship between genome\nsize and organismal complexity in the lineage leading\nfrom prokaryotes to mammals”. In: Paleontological\nJournal 44 (2010), pp. 363–373.\n[70]\nJos´e E Gonz´alez-Pastor, Jos´e L San Mill´an, and Fe-\nlipe Moreno. “The smallest known gene.” In: Nature\n369.6478 (1994), pp. 281–281.\n[71]\nJohn I Glass et al. “Essential genes of a minimal\nbacterium”. In: Proceedings of the National Academy\nof Sciences 103.2 (2006), pp. 425–430.\n[72]\nClaire M Fraser et al. “The minimal gene com-\nplement of Mycoplasma genitalium”. In: Science\n270.5235 (1995), pp. 397–404.\n[73]\nRosario Gil et al. “Determination of the core of a\nminimal bacterial gene set”. In: Microbiology and\nMolecular Biology Reviews 68.3 (2004), pp. 518–537.\n[74]\nMark Pagel and Rufus A Johnstone. “Variation\nacross species in the size of the nuclear genome\nsupports the junk-DNA explanation for the C-\nvalue paradox”. In: Proceedings of the Royal Society\nof London. Series B: Biological Sciences 249.1325\n(1992), pp. 119–124.\n[75]\nJudith K Greenlee, KS Rai, and Alton D Floyd.\n“Intraspeciﬁc variation in nuclear DNA content in\nCollinsia verna Nutt.(Scrophulariaceae)”. In: Hered-\nity 52.2 (1984), pp. 235–242.\n[76]\nPetr ˇSmarda and Petr Bureˇs. “Understanding in-\ntraspeciﬁc variation in genome size in plants.” In:\n(2010).\n[77]\nMike D Bennett and Ilia J Leitch. “Nuclear DNA\namounts in angiosperms: targets, trends and tomor-\nrow”. In: Annals of botany 107.3 (2011), pp. 467–\n590.\n[78]\nIlia J Leitch and Andrew R Leitch. “Genome size\ndiversity and evolution in land plants”. In: Plant\ngenome diversity Volume 2: Physical structure, be-\nhaviour and evolution of plant genomes. Springer,\n2012, pp. 307–322.\n[79]\nT Ryan Gregory. The evolution of the genome. Else-\nvier, 2011.\n[80]\nMA Mowforth and JP Grime. “Intra-population\nvariation in nuclear DNA amount, cell size and\ngrowth rate in Poa annua L.” In: Functional Ecology\n(1989), pp. 289–295.\n14\n\n\n[81]\nSamuel\nF\nLockwood\nand\nJohn\nW\nBickham.\n“Genome size in Beaufort Sea coastal assemblages\nof Arctic ciscoes”. In: Transactions of the American\nFisheries Society 121.1 (1992), pp. 13–20.\n[82]\nSusumu Ohno. “So much” junk” DNA in our\ngenome. In” Evolution of Genetic Systems””. In:\nBrookhaven symposium in biology. Vol. 23. 1972,\npp. 366–370.\n[83]\nMichael David Bennett. “Nuclear DNA content and\nminimum generation time in herbaceous plants”. In:\nProceedings of the Royal Society of London. Series\nB. Biological Sciences 181.1063 (1972), pp. 109–135.\n[84]\nDmitri A Petrov. “Mutational equilibrium model of\ngenome size evolution”. In: Theoretical population\nbiology 61.4 (2002), pp. 531–544.\n[85]\nIrena ˇS´ımov´a and Tom´aˇs Herben. “Geometrical con-\nstraints in the scaling relationships between genome\nsize, cell size and cell cycle length in herbaceous\nplants”. In: Proceedings of the Royal Society B: Bi-\nological Sciences 279.1730 (2012), pp. 867–875.\n[86]\nDennis Francis, M Stuart Davies, and Peter W Bar-\nlow. “A strong nucleotypic eﬀect on the cell cycle re-\ngardless of ploidy level”. In: Annals of Botany 101.6\n(2008), pp. 747–757.\n[87]\nPeyman Fahimi, Ch´erif F. Matta, and Jordan\nOkie.\n“Are\nSize\nand\nMitochondrial\nPower\nof\nCells Inter-determined?” In: Journal of Theoret-\nical Biology\n572 (July 2023), p. 111565. doi:\n10.1016/j.jtbi.2023.111565.\n[88]\nLilas Courtot, Jean-S´ebastien Hoﬀmann, and Val´erie\nBergoglio. “The protective role of dormant origins\nin response to replicative stress”. In: International\njournal of molecular sciences 19.11 (2018), p. 3569.\n[89]\nRA Sclafani and TM2292467 Holzen. “Cell cycle reg-\nulation of DNA replication”. In: Annu. Rev. Genet.\n41.1 (2007), pp. 237–280.\n[90]\nAntoine Aze and Domenico Maiorano. “Recent ad-\nvances in understanding DNA replication: cell type–\nspeciﬁc adaptation of the DNA replication pro-\ngram”. In: F1000Research 7 (2018).\n[91]\nIchiro Hiratani et al. “Global reorganization of repli-\ncation domains during embryonic stem cell diﬀeren-\ntiation”. In: PLoS biology 6.10 (2008), e245.\n[92]\nTyrone Ryba et al. “Evolutionarily conserved repli-\ncation timing proﬁles predict long-range chromatin\ninteractions and distinguish closely related cell\ntypes”. In: Genome research 20.6 (2010), pp. 761–\n770.\n[93]\nDavid M Gilbert. “Making sense of eukaryotic DNA\nreplication origins”. In: Science 294.5540 (2001),\npp. 96–100.\n[94]\nNicholas Rhind and David M Gilbert. “DNA repli-\ncation timing”. In: Cold Spring Harbor perspectives\nin biology 5.8 (2013), a010132.\n[95]\nGuillaume Guilbaud et al. “Determination of human\nDNA replication origin position and eﬃciency re-\nveals principles of initiation zone organisation”. In:\nNucleic Acids Research 50.13 (2022), pp. 7436–7450.\n[96]\nHaiqing Fu et al. “Dynamics of replication origin\nover-activation”. In: Nature Communications 12.1\n(2021), p. 3448.\n15\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21125v1.pdf",
    "total_pages": 15,
    "title": "Eukaryotes evade information storage-replication rate trade-off with endosymbiont assistance leading to larger genomes",
    "authors": [
      "Parthasarathi Sahu",
      "Sashikanta Barik",
      "Koushik Ghosh",
      "Hemachander Subramanian"
    ],
    "abstract": "Genome length varies widely among organisms, from compact genomes of\nprokaryotes to vast and complex genomes of eukaryotes. In this study, we\ntheoretically identify the evolutionary pressures that may have driven this\ndivergence in genome length. We use a parameter-free model to study genome\nlength evolution under selection pressure to minimize replication time and\nmaximize information storage capacity. We show that prokaryotes tend to reduce\ngenome length, constrained by a single replication origin, while eukaryotes\nexpand their genomes by incorporating multiple replication origins. We propose\na connection between genome length and cellular energetics, suggesting that\nendosymbiotic organelles, mitochondria and chloroplasts, evolutionarily\nregulate the number of replication origins, thereby influencing genome length\nin eukaryotes. We show that the above two selection pressures also lead to\nstrict equalization of the number of purines and their corresponding\nbase-pairing pyrimidines within a single DNA strand, known as Chagraff's second\nparity rule, a hitherto unexplained observation in genomes of nearly all known\nspecies. This arises from the symmetrization of replichore length, another\nobservation that has been shown to hold across species, which our model\nreproduces. The model also reproduces other experimentally observed phenomena,\nsuch as a general preference for deletions over insertions, and elongation and\nhigh variance of genome lengths under reduced selection pressure for\nreplication rate, termed the C-value paradox. We highlight the possibility of\nregulation of the firing of latent replication origins in response to cues from\nthe extracellular environment leading to the regulation of cell cycle rates in\nmulticellular eukaryotes.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}