{
  "id": "arxiv_2502.20446v1",
  "text": "Astronomy & Astrophysics manuscript no. main\n©ESO 2025\nMarch 3, 2025\nReconstructing orbits of galaxies in extreme regions (ROGER). IV.\nUnveiling galaxy evolution patterns in OmegaWINGS clusters.\nHernán Muriel1, 2, 3\n, David Pérez-Millán4, 5 , Martín de los Rios6, 7, 8 , Andrea Biviano4, 9 , Valeria Coenda1, 2 ,\nHéctor J. Martínez1, 2 , Andrés N. Ruiz1, 2 , Benedetta Vulcani10 , and Selene Levis1\n1 Instituto de Astronomía Teórica y Experimental (IATE), CONICET - UNC, Laprida 854, X5000BGR, Córdoba, Argentina\n2 Observatorio Astronómico, Universidad Nacional de Córdoba, Laprida 854, X5000BGR, Córdoba, Argentina\n3 INAF-Osservatorio Astronomico di Trieste, via G.B. Tiepolo, 11 - I-34143 Trieste, Italy\n4 Instituto de Radioastronomia y Astrofisica, UNAM, Campus Morelia, Michoacán CP 58089, Mexico\n5 INAF–Osservatorio di Astrofisica e Scienza dello Spazio di Bologna, Via Gobetti 93/3, 40129 Bologna, Italy\n6 Departamento de Física Teórica, Universidad Autónoma de Madrid, 28049 Madrid, Spain\n7 Instituto de Física Teórica, IFT-UAM/CSIC, C/ Nicolás Cabrera 13-15, Universidad Autónoma de Madrid, Cantoblanco, Madrid\n28049, Spain\n8 SISSA - International School for Advanced Studies, Via Bonomea 265, 34136 Trieste, Italy\n9 IFPU Institute for Fundamental Physics of the Universe, via Beirut, 2 - I-34014 Trieste, Italy\n10 INAF- Osservatorio astronomico di Padova, Vicolo Osservatorio 5, I-35122 Padova, Italy\nReceived XXXX; accepted XXXX\nABSTRACT\nContext. Clusters of galaxies have proven to be efficient systems in modifying various properties of galaxies, such as star formation\nor morphology. However, projection effects impose serious challenges in determining how, when, and to what extent galaxies are\naffected by the cluster environment.\nAims. Using innovative techniques to classify galaxies based on their history within the cluster, we aim to determine how galaxies of\ndifferent classes are affected by the cluster environment.\nMethods. We applied the ROGER code to select trajectories of galaxies in the phase space for 35 galaxy clusters from the\nOmegaWINGS survey. A new algorithm was applied to minimize contamination effects.\nResults. We found that both morphological transformation and the quenching of star formation begin shortly after galaxies enter the\ncluster. Even though over the last 2 −3 Gyr, galaxies entering clusters have undergone significant transformations in both their star\nformation and morphology these transformation processes are not complete, that is, they are not completely quenched and are not\nearly type yet. Backsplash galaxies and recent infallers show a higher fraction of jellyfish galaxies compared to older cluster members,\nsuggesting that the timescale of this phenomenon is typically less than 3 Gyr.\nKey words. galaxies: general – galaxies: stellar content – galaxies: evolution – galaxies: clusters: general\n1. Introduction\nGalaxy clusters represent the most densely populated virialized\nenvironments. They are defined by a strong gravitational\npotential, hot ionized intracluster gas, and may host up to\nthousands of galaxies. It is well established that various\ngalaxy properties change systematically depending on their\nenvironment: morphology (e.g., Dressler 1980; Whitmore\net al. 1993; Domínguez et al. 2001; Bamford et al. 2009;\nPaulino-Afonso et al. 2019; Vulcani et al. 2023), color (e.g.,\nBlanton et al. 2005; Martínez & Muriel 2006; Weinmann\net al. 2006; Martínez et al. 2008), luminosity (e.g., Adami\net al. 1998; Coenda et al. 2006), the fraction of star-forming\ngalaxies (e.g., Hashimoto et al. 1998; Mateus & Sodré 2004;\nBlanton & Moustakas 2009; Schaefer et al. 2017; Coenda\net al. 2019; Vulcani et al. 2010; Paccagnella et al. 2016;\nPérez-Millán et al. 2023) and the gas content (e.g., Giovanelli\n& Haynes 1985; Cortese et al. 2011; Brown et al. 2017).\nIn cluster environments, galaxies generally evolve to become\nredder, to have earlier-type morphologies, and exhibit older\nstellar populations. Additionally, cluster galaxies show reduced\ngas content, lower levels of star formation, and weaker emission\nlines in their spectra than galaxies in less dense environments\nlike in the field.\nSeveral mechanisms are responsible for influencing galaxies\nwithin clusters, particularly by depleting gas and subsequently\nhalting star formation. One key process is ram-pressure stripping\n(RPS, e.g., Gunn & Gott 1972; Abadi, Moore, & Bower\n1999; Book & Benson 2010; Vijayaraghavan & Ricker 2015;\nSteinhauser, Schindler, & Springel 2016), which removes cold\nand warm gas from galaxies due to the pressure exerted by\nthe intracluster hot gas. Another mechanism that can deplete\nthe gas supply is tidal stripping caused by the gravitational\npotential of the cluster (e.g., Gnedin 2003; Villalobos et al. 2014;\nLópez-Gutiérrez et al. 2022).\nIn intermediate-density regions, such as cluster outskirts and\ngroups, galaxy-galaxy interactions, also known as harassment,\nplay a more significant role (e.g., Spitzer & Baade 1951;\nMoore et al. 1998). This process can lead to both gas loss\nand morphological changes. Tidal stripping from these galaxy\nencounters can strip stars or truncate the stellar disc of galaxies,\ntransforming them into spheroid-dominated systems (e.g., Smith\net al. 2015). Morphological evolution is thought to be largely\nArticle number, page 1 of 9\narXiv:2502.20446v1  [astro-ph.GA]  27 Feb 2025\n\n\nA&A proofs: manuscript no. main\ndriven by mergers (e.g., Toomre 1977; Barnes 1992; Martin et al.\n2018), which are common in galaxy groups but much rarer in\nclusters due to the high relative velocities of galaxies. Major\nmergers tend to form spheroidal systems (Navarro & White\n1994), while gas-rich minor mergers may lead to the formation\nof massive disks (Jackson et al. 2022).\nAlthough the environment is important in shaping the\nproperties of galaxies, internal processes that depend on stellar\nmass have proven to be very efficient in shutting down the star\nformation. Some of these processes are: supernova-driven winds\n(e.g., Bower et al. 2012; Stringer et al. 2012), halo heating\n(Marasco et al. 2012), feedback from massive stars (e.g., Dalla\nVecchia & Schaye 2008; Hopkins et al. 2012), and active galactic\nnuclei (AGN) feedback (e.g.,Nandra et al. 2007; Hasinger 2008;\nSilverman et al. 2008; Cimatti et al. 2013). These mechanisms\nare collectively known as “mass quenching”.\nIt is well known that the observed properties of galaxies in\nclusters depend on the projected distance to the cluster center,\nwith morphology being one of the first examples (Whitmore\n& Gilmore 1991). However, the projected distance is too\nimprecise to determine both the fall time and the type of orbit.\nTypically, the orbits of substructures falling into a cluster-size\nhalos are highly radial and eccentric (Gill et al. 2005). As a\nconsequence, at a given radius within a cluster, there can be\nboth newly infalling objects and others that have been orbiting\nfor several gigayears. However, when considering both the\ncluster-centric distance and velocity with respect to the mean\nvelocity of the cluster galaxies (i.e., the phase-space diagram),\nrecent infallers generally exhibit higher velocities compared to\nlong-term galaxies. This results in different regions of the phase\nspace being more populated by objects with similar orbits and\ninfall times. Moreover, radial and eccentric orbits may result in\nthe galaxy having a trajectory that crosses the virial radius after\npassing through the cluster’s pericenter, which in phase space\ntends to place it at large projected radii and low velocities. These\ngalaxies are known as backsplash (Balogh et al. 2000; Mamon\net al. 2004).\nRhee et al. (2017) correlate the position in the projected\nphase space with the time since infall (the time since a galaxy\ncrossed for the first time the virial radius) and derive regions of\nconstant mean infall time for galaxies in the different regions\nof the phase space. These authors divide the phase space into\ndifferent zones that they associate with different infall times.\nSimilar analyses have been conducted by Pasquali et al. (2019).\nDe los Rios et al. (2021) and Coenda et al. (2022) proposed\na novel method to separate galaxies in the phase space, taking\ninto account the type of orbit. The technique employs machine\nlearning algorithms to assign probabilities of having a specific\ntype of orbit or the time spent within the cluster. To implement\nthis algorithm, these authors developed the code ROGER\n(Reconstructing Orbits of Galaxies in Extreme Regions), which\nis publicly available 1 and will be described in section 3.\nROGER\nhas\nbeen\nrecently\napplied\nto\na\nsample\nof\nX-ray-emitting clusters by Martínez et al. (2023). They\nobserve that significant morphological evolution occurs only\nin virialized galaxies within clusters. However, they also\nnote that blue galaxies recently entering the cluster may\nhave already experienced morphological changes. They explore\nwhether quenching timescales are generally shorter than those\nrequired for morphological changes. Their findings indicate\n1 There\nare\ntwo\nimplementations\navailable:\nin\nR\nhttps://github.com/Martindelosrios/ROGER\nand\nin\npython\nhttps://github.com/Martindelosrios/pyROGER.\nthat quenching happens more rapidly across all predicted\ndynamical categories. Moreover, while quenching is noticeably\naccelerated as soon as galaxies enter clusters, morphological\ntransformations take longer times, requiring prolonged exposure\nto the cluster’s physical mechanisms. In contrast, Sampaio et al.\n(2024) analyzed a sample of clusters in the SDSS and found\nthat morphological transition precedes complete star formation\nquenching.\nMartínez et al. (2023) also analyzed the galaxy populations\nby color for each of the classes provided by ROGER that are:\ncluster galaxies, backsplash galaxies, recent infallers, infallers,\nand interlopers. For cluster and backsplash galaxies, they limited\nthe analysis to red galaxies due to the contamination produced\nby projection effects (see Coenda et al. 2022 for a detailed\ndiscussion). Martínez et al. (2023) found that blue recent\ninfallers tend to be smaller than both infalling galaxies and\ninterlopers, which are similar in size. Based on these results, they\nsuggested that a single pass through the cluster environment can\nalter the galaxy’s morphology, and also shrink the size of blue\ngalaxies. Marasco et al. (2023) analyze a sample of galaxies\nwith MUSE data in groups and clusters to explore how the\naging of stellar populations can lead to a morphological change\nin galaxies where star formation has been rapidly quenched.\nThey found that the morphological transformation is completed\nafter 1.5–3.5 Gyr, occurring faster for more efficient quenching\nscenarios.\nGalaxies that halt star formation in less than 1.5 Gyr exhibit\ndistinctive spectral features, such as the absence of emission\nlines and Hδ absorption, and are referred to as post-starburst\ngalaxies\n(PSB,\nDressler\n&\nGunn\n1982).\nAnalyzing\nthe\ncharacteristics of their stellar populations and their distribution\nwithin clusters can provide important insights into the physical\nmechanisms behind the suppression of star formation. Analyzing\nWINGS and OmegaWINGS cluster galaxies in phase space,\nPaccagnella et al. (2017) found that PSBs comprise a mix of\ngalaxies with diverse accretion histories. PSBs with the most\npronounced Hδ feature seem to have been recently accreted. In\nterms of stellar masses, magnitudes, colors, and morphologies,\nthey found that PSBs fall between passive and emission-line\ngalaxies, characteristic of a population transitioning from\nstar formation activity to a passive state. Analyzing different\nenvironments, Paccagnella et al. (2019) found that the fraction\nof PSBs increases with halo mass, suggesting that mechanisms\ncommon in densely populated regions, such as ram-pressure\nstripping, play a significant role in the formation of many PSB\ngalaxies in these environments (see also Socolovsky et al. 2019;\nVulcani et al. 2020; Wilkinson et al. 2021; Werle et al. 2022).\nRam-pressure stripping can effectively remove gas from\ngalaxies during their initial entry into clusters, with galaxies on\nradial orbits experiencing more severe gas loss (e.g., Jaffé et al.\n2015; Yoon et al. 2017; Jaffé et al. 2018). Additionally, radio\nobservations reveal disrupted and stripped gas while the galaxy’s\nstellar core remains largely intact, a phenomenon consistent with\nRPS. In some cases, star formation has been detected in the\nstripped tails (e.g., Gavazzi et al. 1995; Poggianti et al. 2019;\nLee et al. 2022; Roberts et al. 2022; Gullieuszik et al. 2023). Due\nto the appearance caused by this effect, these galaxies are known\nas jellyfish galaxies. Jaffé et al. (2018) studied the phase-space\ndistribution of cluster galaxies and found that jellyfish galaxies\ntend to have higher peculiar velocities (Biviano et al. 2024)\nand more radially elongated orbits compared to the overall\ncluster population. They also found that those jellyfish with the\nlongest gas tails are moving at high speeds, and close to cluster\ncores, where ram pressure is stronger. They concluded that\nArticle number, page 2 of 9\n\n\nH. Muriel: Unveiling galaxy evolution patterns\nmany jellyfish galaxies likely formed through rapid, outside-in\nram-pressure stripping during their first infall into the cluster.\nSalinas et al. (2024) estimated the duration of optical tails of\njellyfish galaxies, from their initial appearance to their eventual\ndisappearance. They found that galaxy tails first emerge around\n∼1.16 R200 and vanish approximately 0.6 Gyr after reaching the\npericenter.\nIn this work, we investigate the properties of galaxies in\nclusters depending on their orbit type using the predictions of\nthe ROGER code. We are particularly interested in comparing\ngalaxies that have been within the cluster from more than 2\nGyr ago and have completed several orbits (hereafter “cluster\ngalaxies”), with those that have made a single passage through\nthe cluster center and are now located outside the cluster virial\nregion (hereafter “backsplash galaxies”). This comparison aims\nto understand the initial impact that the cluster environment\nexerts on galaxies during their first encounter. To achieve this\ngoal, we analyze the morphology and age of the populations,\nas well as the fractions of passive galaxies, recently quenched\ngalaxies, PSB, and jellyfish galaxies.\nIn this paper, we use a subsample of OmegaWINGS clusters\n(OW), which are described in section 2. The ROGER code\nis detailed in section 3, while in subsection 3.2, we present\nthe technique used to correct for misclassification effects. The\nproperties of the galaxies are analyzed in section 4, where\nmorphology, the fraction of quenched galaxies, age, and the\nfractions of PSB and jellyfish galaxies are compared by orbit.\nIn section 5, we summarize our findings and present our\nconclusions. Throughout this paper we assume a concordance\nΛCDM cosmology with ΩM = 0.3, ΩΛ = 0.7, and H0 =\n70 km s−1 Mpc\n−1.\n2. Data\n2.1. The cluster sample\nThe galaxy clusters used in this study constitute a subset derived\nfrom the OW spectroscopic survey (Gullieuszik et al. 2015;\nMoretti et al. 2017). This survey serves as an extension of\nthe WIde-field Nearby Galaxy Cluster Survey (WINGS, Fasano\net al. 2006; Varela et al. 2009; Moretti et al. 2014), which is\na multi-wavelength survey aimed to cover the outskirts of 76\nmassive clusters (of which, 46 were spectroscopically observed),\nspanning a redshift range of 0.04 ≤z ≤0.07, selected from the\nROSAT All-Sky Survey (Ebeling et al. 1996).\nOW expands the spatial coverage of the WINGS survey for\n46 of these clusters, acquiring imaging data in the B, and V\nbands across an area of approximately 1 deg2. Moreover, it\nencompasses a broad range of velocity dispersion (σ ∼500 −\n1, 300 km s−1), X-ray luminosity (LX ∼0.2 −5 × 1044 erg s−1),\nand R200 (radius where the mean interior density is 200 times\nthe critical density of the Universe) of about 1−3 Mpc. The R200\nvalues for the cluster sample are taken from Biviano et al. (2017).\nThe target selection process for the spectroscopic observations\nmirrored that of the photometric survey (Cava et al. 2009;\nMoretti et al. 2017). These selections were based on galaxies\nwith a total magnitude brighter than V = 20, excluding those\nsignificantly above the color-magnitude sequence with B −V >\n1.20. Additionally, galaxies brighter than MV = −17.4 (the\nabsolute magnitude limit of a galaxy with V = 20 at the redshift\nof the most distant cluster in the sample, reaching a magnitude\ncompleteness of 80%), were chosen (see Paccagnella et al.\n2017). Spectroscopic follow-up for OW included observations\nusing the VST fibre spectrograph. OW spectra cover a range of\napproximately 3800 to 9000 Å, with a resolution of 3.5 −6 Å.\nIn this work, we have restricted the sample to clusters that have\nat least 50% completeness in spectroscopy, resulting in a total of\n35 clusters.\n2.2. The spectrophotometric code\nAlthough the sample of clusters and galaxies selected in\nthis work is the same one used in Salerno et al. (2020),\nthe spectroscopic properties of galaxies were recalculated\nfollowing Fritz et al. (2017). The stellar population properties\nare determined using the spectrophotometric code SINOPSIS2\n(SImulatiNg OPtical Spectra wIth Stellar population models).\nSINOPSIS utilizes the theoretical spectra of simple stellar\npopulations (SSP) across 12 different ages, ranging from 106 yr\nto the age of the Universe at the redshift of the galaxy (tu);\nand four metallicity values: sub-solar (Z = 0.004), solar (Z =\n0.017), and super-solar (Z = 0.03, 0.04). The SSP models are\nbased on work by Charlot & Bruzual (in prep.), using a Chabrier\n(2003) IMF with masses ranging from 0.1 to 100 M⊙. After\nobtaining the best fit, an age binning is applied, reducing the\nfinal resolution to four age bins.\nThe stellar age bins are defined according to stellar\npopulation features (Fritz et al. 2007), thus:\n⋆Stellar age bin 1 (0 - 19.95 Myr): Characterized by emission\nlines and the strongest ultraviolet emission.\n⋆Stellar age bin 2 (19.95 - 571.5 Myr): Hydrogen lines\nfrom the Balmer series reach their maximum intensity in\nabsorption, while the Cak,h UV lines still have low (almost\nundetectable) equivalent widths.\n⋆Stellar age bin 3 (0.5715 - 5.754 Gyr): Balmer absorption\nlines decrease in intensity, while the k calcium line reaches\nits maximum level in absorption.\n⋆Stellar age bin 4 (5.754 Gyr - tu): SSPs in this age bin\nare reddest, and the main spectral characteristics show an\nasymptotic behavior. The 4000 Å break (D4000) attains the\nhighest values.\nThe resulting star formation rates (SFRs) for these four bins\nform the final star formation history (SFH). Total stellar mass\nis obtained by rescaling the aperture mass using the aperture and\ntotal magnitudes in the V-band. In this way, we are assuming that\nthe color gradient between the aperture and the whole galaxy\nis negligible, as done by other authors (e.g., Kauffmann et al.\n2003) Detailed descriptions of the code can be found in Fritz\net al. (2007), Fritz et al. (2017), and Pérez-Millán et al. (2023).\nTo address incompleteness corrections (both geometrical and\nmagnitude-based) in the spectroscopic catalogs, the ratio of\nspectra yielding a redshift to the total number of galaxies in the\nparent photometric catalog was utilized, computed as a function\nof V magnitude and radial distance from the brightest cluster\ngalaxy. All calculations were conducted while weighting each\ngalaxy to account for both types of incompleteness. The ultimate\nspectroscopic sample comprises 14,801 galaxies within 35 out of\n46 OW clusters.\nIn this study, we analyze galaxy properties based on\nmorphological types, using the morphologies estimated by\nFasano et al. (2012) and Vulcani et al. (2023). These\nauthors employ the MORPHOT code, a non-parametric and\nfully empirical method for automatically estimating galaxy\nmorphology. MORPHOT utilizes 21 morphological diagnostics\nthat can be directly computed from galaxy images and provides\n2 https://jacopofritz.wixsite.com/webpage/sinopsis\nArticle number, page 3 of 9\n\n\nA&A proofs: manuscript no. main\ntwo distinct classifications: one derived from a maximum\nlikelihood semi-analytical method and the other from a neural\nnetwork approach. The final morphological estimator combines\nboth techniques and has been tested on an additional sample\nof visually classified WINGS galaxies (see also, Vulcani et al.\n2011a).\nThe MORPHOT code assigns each galaxy a TYFIN type\nranging from −6 to 11. We classify them into two groups:\nearly-types, which include galaxies with TYFIN ≤0 such as\ncD, elliptical, and S0 galaxies; and late-types, with TYFIN > 0,\ncorresponding to early spirals, late spirals, and irregular galaxies.\n3. ROGER classification\n3.1. Orbital classes\nGiven the position of a galaxy in the Projected Phase Space\nDiagram (PPSD), specifically, its projected distance to the\ncluster center in terms of R200, and its line-of-sight velocity\nrelative to the cluster in units of σ, ROGER3 was trained\nby De los Rios et al. (2021) to compute the probabilities for\na galaxy to belong to different classes using three Machine\nLearning techniques: K-Nearest Neighbors (KNN), Support\nVector Machines, and Random Forest. It is worth to mention\nthat these machine learning methods were trained using galaxies\nfrom the MultiDark Planck 2 simulation (Klypin et al. 2016),\nwhere the real classes and properties of each galaxy are known.\nROGER was trained using a sample of 34 massive clusters. This\nsample is more massive than that of OmegaWINGS (medians\nof log(M200) are 15.04 and 14.67, respectively) and have a\nlarger velocity dispersion (median values of 1255 and 744 km/s,\nrespectively). However, ROGER uses ∆vlos/σ, which exhibits\nsimilar behaviors in both samples. This similarity is directly\nrelated to the self-similarity of halos, so the application of\nROGER to a less massive sample does not introduce significant\nbiases. ROGER computes, for each galaxy, its probability to\nbelong to each of the following five orbital classes, as defined\nby De los Rios et al. (2021):\n(1) Cluster galaxies (CL): Galaxies designated as satellites\nof the cluster, having maintained this status for over 2 Gyr.\nThe majority reside within R200, with a few exceptions (∼4%),\ntemporarily beyond R200 in their orbital trajectories.\n(2) Backsplash galaxies (BS): Galaxies that have traversed\nR200 precisely twice, once on their entry into the cluster and\nagain on their exit. Located outside R200, these galaxies have\nundergone a single transit through the cluster core. They are\nlikely to eventually become CL in the future.\n(3) Recent infallers (RIN): These are galaxies located within\nR200, having crossed it just once on their entry and no earlier\nthan 2 Gyr ago. These galaxies are currently undergoing the\nenvironmental effects of the cluster for the first time. Some may\ntransition into backsplash galaxies (BS) in the future.\n(4) Infallers (IN): These galaxies have spent their entire\nlifetimes outside R200 and are currently in the process of falling\ninto the cluster, indicated by their negative radial velocities\nrelative to the cluster.\n(5) Interlopers (ITL): These galaxies have likewise remained\noutside R200 for the entirety of their lifetimes; however, they are\nnot approaching the cluster and lack any physical association\nwith it. Their presence in the PPSD is solely attributable to\nprojection effects.\n3 In this work we used the python implementation of ROGER that is\navailable in: https://github.com/Martindelosrios/pyROGER\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\nR/R200\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\nvlos/\nCL\nBS\nRIN\nITL\nFig. 1: Distribution of galaxies in the phase space according\nto the classification produced by ROGER. The types of orbits\nconsidered are: cluster galaxies (CL, red); backsplash galaxies\n(BS, orange); recent infallers (RIN, green) and interlopers (ITL,\ngrey).\nLike any selection method based on the phase space, the\nselection of the orbital classes by ROGER is affected by potential\ndeviations from the state of relaxation. Since ROGER is trained\nwith galaxies in dark matter halos selected from the MultiDark\ncosmological simulations, it exhibits the same biases as an\nobserved sample. In the present analysis, we will consider\ncategories CL, BS, RIN, and ITL. The IN class was not included\nin our analysis, as it does not represent a statistically significant\nsample. Although ∼12% of the total sample has the highest\nprobability corresponding to the IN class, this percentage is\nreduced to less than 2% (91 galaxies across the entire stellar\nmass range) when applying the Coenda et al. (2022) criteria4,\nsuggesting that the sample of galaxies classified as IN based on\nthe highest probability could be heavily contaminated by other\nclasses. On the other hand, galaxies classified as ITL should not\nnecessarily be interpreted as field galaxies, as due to hierarchical\nclustering, a significant fraction of these galaxies could belong\nto groups or filaments around the clusters.\nBased on the findings of De los Rios et al. (2021), we employ\nthe trained KNN technique to determine class probabilities for\nour galaxies. ROGER was applied to our data and each galaxy\nwas assigned an orbit type based on its highest probability of\nbelonging to a given orbit and weighted by the probability to\nbelong to this category. The resulting number of galaxies in each\npredicted class is provided in Table 1. In Fig. 1 we display the\nPPSD positions of galaxies that meet our classification criteria,\nrepresented by different colors.\n3.2. Correcting the effects of misclassification\nThe determination of orbits in the phase space is strongly\nlimited by issues of contamination and incompleteness, we\n4 In order to reduce contamination among classes in the PPSD\ndiagram, Coenda et al. (2022) tested various threshold values and\nselected those that produce pure samples (high precision) for each class\nwithout sacrificing statistical power (high sensitivity). They proposed\nthe optimal threshold values for each class.\nArticle number, page 4 of 9\n\n\nH. Muriel: Unveiling galaxy evolution patterns\nTable 1: Total number of galaxies and by morphological type for\neach of the types of orbits considered.\nProperty\nCL\nBS\nRIN\nITL\nAll\n2080 (669)\n997 (393)\n928 (550)\n530 (477)\nET\n1424 (484)\n524 (198)\n587 (339)\n222 (187)\nLT\n524 (147)\n314 (132)\n288 (180)\n238 (230)\nNotes. The numbers in parentheses correspond to the weighted values\n(see text for more details).\nrefer the reader to Coenda et al. (2022) for a thorough\ndiscussion on this matter. To mitigate these problems, Martínez\net al. (2024) proposed a method to improve the accuracy of\ndetermining the distribution of galaxy properties by statistically\ncorrecting for misclassification errors in the PPSD. The method\ninvolves the use of an estimation the confusion matrix, which\ncontains the information of how each class is contaminated\nfrom misclassified galaxies that actually belong to the other\nclasses. By inverting this matrix, the authors are able to\nobtain better determinations of the intrinsic distributions of\ngalaxy properties, such as color. The method was tested using\nsimulated galaxy clusters, showing significant improvements in\nthe accuracy of classifying galaxies, particularly for those in\ncluster and backsplash categories. The corrected distributions\neliminate most of the contamination from misclassified galaxies,\noffering a more reliable analysis of galaxy properties in various\nenvironments. The authors emphasize that their method allows\nfor a more precise interpretation of observational data, reducing\nbiases caused by misclassifications.\nThe method of Martínez et al. (2024) allows us to compute\nfor each galaxy in our samples an individual weight depending\non its class i, mass M, and rest-frame B −V color. We proceed\nas follows:\n1. We split galaxies into four bins in log(M/M⊙): [9.485, 9.8),\n[9.8, 10.2), [10.2, 10.6), and [10.6, 11.5].\n2. For each class i and mass bin j we compute the observed\ncolor distribution using 11 equal size bins in B −V color,\nranging from −0.3 to 1.7: fobs(i, j, k), where k denotes the\nbin in color.\n3. Following Martínez et al. (2024), we obtain, for each\nclass and mass range, the reconstructed color distribution\nfrec(i, j, k). We use the confusion matrix estimated by the\nauthors.\n4. The weight we assign to a galaxy of class i, stellar mass\nin the j−th bin, and color in the k−th bin is the quotient:\nfrec(i, j, k)/ fobs(i, j, k).\nThe derived weights are ≤1 and have a median of approximately\n0.6.\n4. Results: Comparing physical properties of CL,\nBS, RIN, and ITL galaxies\n4.1. Morphology\nAs discussed in the introduction, a single passage through the\ninner regions of the cluster can not only alter the star formation\nbut also modifies the morphology of a galaxy. Depending on\nthe ROGER class, the morphological type has been estimated\n5 According to Pérez-Millán et al. 2023, the sample is complete in\nstellar mass for log(M/M⊙) ≥9.48.\nFig. 2: Fractions of early (upper panel) and late (bottom panel)\ntype galaxies as a function of the stellar mass for CL, BS, RIN,\nand ITL galaxies.\nfor 80 to 90% of the galaxies. Fig. 2 shows fractions of early\nand late type galaxies (ET and LT, respectively) as a function\nof stellar mass for CL, BS, RIN, and ITL classes. In this and\nthe following figures, errors were obtained using the bootstrap\nresampling technique. The fractions of early- and late-type\nare not mirror-like for two reasons: in addition to the fact\nthat not all galaxies in the sample have been morphologically\nclassified, each galaxy has an assigned weight depending on its\ncharacteristics. The first thing we observe is that, regardless of\nthe type of orbit, the ET fractions systematically increase (and\nLT fractions decrease) with stellar mass. Similar results were\nfound by Vulcani et al. (2011b) and Vulcani et al. (2011a). If\nwe compare the fractions at fixed stellar mass bin, we observe\nthat the highest fractions of ET correspond to cluster members\nand the lowest values to ITL. BS and RIN have intermediate\nvalues between the two previous ones, with RIN having higher\nfractions of ET than BS. For the LT fractions, we again find\nthat CL and ITL are the extreme cases, with CL having the\nlowest LT fractions, which, depending on the stellar mass,\nranges between 0.2 and 0.3. While BS and RIN also exhibit\nintermediate fractions, in this case, they are indistinguishable\nfrom each other.\n4.2. Star formation quenching\nThe left column of Fig. 3 shows the fractions of CL, BS, RIN and\nITL passive galaxies in four bins of stellar mass (we assume that\na galaxy is passive if its SFR ≤0.0001 M⊙yr−1). In agreement\nwith what is observed for ET galaxy fractions (see Fig. 2), the\nhighest (lowest) fraction of passive galaxies corresponds to CL\n(ITL), while BS and RIN have intermediate values. RIN have\na higher fraction of passive galaxies than BS across almost the\nentire stellar mass range. As expected, in all cases, an increase\nArticle number, page 5 of 9\n\n\nA&A proofs: manuscript no. main\nFig. 3: Left panel: Fractions of CL, BS, RIN, and ITL\npassive galaxies as a function of stellar mass. Top panel:\nAll morphological types; central and bottom panels: Early\nand late types, respectively, for CL and BS galaxies. Right\npanel: Fraction of recently strongly quenched galaxies. Types of\ngalaxies are presented as shown in the left panel.\nin the fraction of passive galaxies is observed as stellar mass\nincreases.\nFor CL and BS galaxies, we have also analyzed the fractions\nof passive galaxies as a function of morphological types. Since\nCL and BS are mostly ET, they show similar behavior to the\noverall sample (see central left panel of Fig. 3), although with\nsystematically higher values, while LT galaxies (lower panel)\nshow a weaker dependence on stellar mass. This could be\nindicating that low mass LT galaxies are being more affected\nby the environment, compensating for the lower quenching\nthey experience by the mass-quenching compared to more\nmassive ones. These two opposing phenomena tend to flatten the\ndependence of star formation quenching on mass.\nWith the aim of assessing how intense the recent quenching\nof star formation has been, we have calculated the fraction of\ngalaxies that have experienced strong star formation quenching\nover the last ∼0.5 Gyr. This fraction, which we refer to as\nRSQ (galaxies that have been Recently Strongly Quenched), is\ncalculated as the number of galaxies per class that have been\ncompletely quenched, or have reduced their star formation by\nhalf during the mentioned period, divided by the total number of\ngalaxies in the same class that were star-forming at the beginning\nof the interval. In practice, the calculation involves comparing\nthe SFR between the age bins 0 −19.95 Myr and 19.95 −571.5\nMyr (bin 2, SFR2), which are the first two age bins computed\nby the SINOPSIS code (see Table 1 in Pérez-Millán et al. 2023).\nAccording to Ruiz et al. (2023), backsplash galaxies at z = 0\nhave been outside R200 for 1.25 Gyr on average, meaning that\nthe period over which we calculate the fraction is less than half\nthe time the galaxies have been in the backsplash phase. In other\nFig. 4: Luminosity-weighted Age as a function of the stellar\nmass. Types of galaxies are presented as shown in Fig. 3.\nwords, most of the BS galaxies should already be outside R200\nby the age of bin 2, while most of the RIN galaxies should\nhave already entered the cluster in the same period. For this\ncalculation, we consider star-forming galaxies to be those with\nSFR2 ≥0.001M⊙yr−1; however, the general conclusions do not\ndepend on the choice of this threshold. The RSQ fraction have\nbeen computed as a function of stellar mass and are shown in the\nright panel of Fig. 3.\nThe behavior of the RSQ fractions is very similar to that\nof the fraction of galaxies with SFR = 0; in other words, the\ngalaxies that have experienced the strongest quenching are the\ncluster galaxies. It is important to note that the calculation of\nthe RSQ fraction is based on the sample of galaxies that were\nstar-forming in age bin 2, which, in the case of CL galaxies,\nare the fewest. Of the small number of CL galaxies that were\nstar-forming in bin 2, approximately 80% have been strongly\nquenched, whereas this percentage is 50% for ITL. RIN galaxies,\ndespite their short time in the cluster, show a significant degree\nof quenching, although clearly less than that of the CL galaxies.\nThe BS galaxies, although they were mostly already outside R200\nin age bin 2, have continued their quenching process, something\nnoted by Ruiz et al. (2023).\n4.3. Age\nGalaxies with different dynamical histories are expected to show\ndifferences in luminosity-weighted age. The top panel of Fig. 4\nshows that CL are on average always the oldest at all masses.\nWhen comparing the ages of BS, RIN, and ITL galaxies, no\nstatistically significant difference is observed between these\npopulations, which could be related to the fact that BS and\nRIN galaxies have spent most of their lives outside the cluster.\nAlthough these populations have shown clear differences in the\ndegree of star formation quenching, this has not been sufficient\nto alter the average age of the samples.\nThe middle and lower panels of Fig. 4 compare the ages\nof CL and BS galaxies for ET and LT galaxies, respectively,\nshowing that the differences observed for the total samples are\nmainly due to late-type galaxies.\nArticle number, page 6 of 9\n\n\nH. Muriel: Unveiling galaxy evolution patterns\nFig. 5: Fractions of post-starburst galaxies within the predicted\nclasses CL, BS, RIN, and ITL.\n4.4. Post-starburst galaxies\nAny process of star formation quenching can be studied by\nanalyzing the population of galaxies that, although no longer\nforming stars, have done so recently. This type of galaxy is\nknown as post-starburst galaxies, and they can be identified\nthrough spectral analysis. Fritz et al. (2014) identified in the\nWINGS survey k+a/a+k spectra that exhibit a combination of\nfeatures characteristic of both K and A-type stars, with strong\nHδ absorption lines and an absence of emission lines. These\nare typical of post-starburst/post-starforming galaxies where star\nformation was abruptly halted at some point within the last 0.5–1\nGyr.\nUsing the criteria established by Fritz et al. (2014) to\nclassify PSB galaxies, Paccagnella et al. (2017) and Paccagnella\net al. (2019) identified PSB galaxies in OmegaWINGS cluster\nenvironments. Fig. 5 shows the PSB fractions for CL, BS,\nRIN, and ITL galaxies. Although the fractions are very small\nin all cases, it can be seen that cluster galaxies have the\nhighest fraction of PSB, while ITL show the lowest fraction.\nWith intermediate values, BS and RIN galaxies do not show\nstatistically significant differences between each other. The fact\nthat CL galaxies have the highest fraction of PSB, aligns with\nwhat was observed in the RSQ fractions6, which indicated that\nclusters have remained efficient in quenching the star formation.\n4.5. Jellyfish galaxies\nThe quenching of star formation is directly related to the loss of\ngas in galaxies. One of the most extreme examples of gas loss\nare the so-called Jellyfish galaxies, where, due to the action of\nthe intracluster medium gas, galaxies can lose high percentages\nof their gas. This phenomenon can be further intensified by tidal\nforces, either from the cluster potential or through interactions\nwith other galaxies.\nThe pioneering work of Gunn & Gott (1972) showed that\nboth the velocity of galaxies and the density of the intracluster\nmedium are fundamental parameters in gas removal. The\npresence of Jellyfish galaxies will also depend on various factors,\nsuch as the time spent in the cluster, how close to the cluster\ncenter a galaxy passes, the duration of the Jellyfish phenomenon,\nthe amount of gas available to be removed and the inclination of\nthe galaxy relative to the velocity with respect to the intracluster\n6 Note that the PSB fraction refers to all galaxies, while the RSQ\nfraction refers only to star-forming galaxies in age bin 2.\nFig. 6: Fraction of jellyfish galaxies within the predicted classes\nCL, BS, and RIN. b) As in panel a) for JClass 3, 4, and 5.\nmedium (e.g., Kronberger et al. 2008). Since the different orbit\nclasses provided by ROGER occupy different regions in phase\nspace, the fraction of Jellyfish galaxies is also expected to\ndepend on the orbit type.\nPoggianti et al. (2016) have conducted the first systematic\nsearch for galaxies that are being stripped of their gas at\nlow redshift, selecting galaxies with different degrees of\nmorphological evidence for gas stripping. They have visually\ninspected images and identified 344 candidates in 71 galaxy\nclusters of the OW+WINGS sample. The authors tentatively\ncategorized candidates into five groups based on the visual signs\nof stripping observed in the optical bands (JClass), ranging\nfrom the most extreme cases (JClass =\n5) to progressively\nless intense ones, with JClass = 1 being the least pronounced.\nConsequently, the JClass =\n5 and 4 categories include the\nmost reliable candidates and feature the most notable examples\nof classic jellyfish galaxies. JClass = 3 candidates are likely\nundergoing stripping and/or experiencing ram pressure events,\nwhereas JClasses =\n2 and 1 are tentative cases for which\nthe current imaging does not allow for definitive conclusions.\n(Vulcani et al. 2022) identified an additional subsample of ram\npressure stripping candidates that were missed by the visual\ninspection performed by (Poggianti et al. 2016).\nIn the left panel of Fig. 6, the fractions of galaxies classified\nas jellyfish in any of the classes are shown. ITL galaxies were\nexcluded from this analysis because, being objects external to the\ncluster, a significant fraction of the ITL-jellyfish is expected to\nbe linked to galaxy interactions rather than effects caused by the\nintra-cluster gas. As expected, the fractions are extremely low,\nbut a clear difference by class is observed, with CL showing the\nlowest fraction and RIN the highest, while BS have intermediate\nvalues. The right panel of Fig. 6 shows the fraction of jellyfish\ngalaxies for JClass values 3, 4, and 5, where we can see that\nCL galaxies continue to display the lowest fraction, while BS\nand RIN are indistinguishable, though with greater uncertainties\ncompared to those presented in the left panel.\n5. Summary and conclusions\nWe have studied different properties of cluster galaxies using the\nROGER code, which allows the selection of the most probable\norbits of galaxies in the projected phase space. For the first time\nin this type of studies, a technique was applied to minimize the\nconsequences of misclassification caused by projection effects\nArticle number, page 7 of 9\n\n\nA&A proofs: manuscript no. main\n(Martínez et al. 2024), which introduce serious biases in galaxy\nsamples and, consequently, in the conclusions drawn from them\n(see Coenda et al. 2022). The types of orbits analyzed are: cluster\ngalaxies (CL), backsplash galaxies (BS), recent infallers (RIN),\nand interlopers (ITL). We focus on comparing cluster galaxies\nthat likely orbited the cluster more than once, with backsplash\ngalaxies that have made a single passage and are now outside the\ncluster. The main goal is to understand the initial impact of the\ncluster environment on galaxies after their first incursion within\nthe virial radius.\nFor this analysis, a subsample of 35 OW clusters was\nused, and the following galaxy properties were considered:\nmorphology, fraction of quenched galaxies, age, fraction of PSB\ngalaxies, and fraction of jellyfish galaxies. In all cases, the\nanalyses were performed as a function of the galaxies’ stellar\nmass. Our main conclusions are:\n1. Regardless of class, ET fractions increase and LT fractions\ndecrease with stellar mass in agreement with previous results\nbased on the same data (Vulcani et al. 2011b,a; Pérez-Millán\net al. 2023). Separating galaxies by class, higher ET fractions\nare found in cluster members, while ITL show the lowest\nvalues. BS and RIN have intermediate values, with RIN\nshowing the highest ET fraction. For LT fractions, CL has\nthe lowest values, ranging from 0.2 to 0.3 depending on\nstellar mass. BS and RIN show similar, indistinguishable\nLT fractions. The fact that the morphological type fractions\nof BS and RIN are clearly different from those of ITL\nsuggests that morphological transformation begins shortly\nafter galaxies enter the cluster, although it is clearly not\nyet complete, as clusters exhibit significantly higher ET\nfractions than those of BS and RIN. These results are\nconsistent with those reported by Martínez et al. 2023;\nVulcani et al. 2011b,a.\n2. BS and RIN galaxies exhibit significantly higher fractions\nof quenched galaxies compared to ITL, although lower\nthan CL, indicating that the quenching of star formation\nproceeds rapidly once galaxies enter the cluster. Based on\nthe fraction of RSQ (Recently Strongly Quenched) galaxies,\nwe found that galaxies that have experienced the strongest\nquenching during the last 0.5 Gyr are the cluster galaxies.\nApproximately 80% of the CL galaxies have been strongly\nquenched during this period of time, whereas this percentage\nis 50% for the ITL galaxies. It is important to clarify that\nthe fractions of RSQ galaxies are calculated from galaxies\nthat were still forming stars at z ∼0.04, which, in the\ncase of clusters, represent a smaller fraction compared\nto other orbital types. What our results indicate is that\nthe few cluster galaxies still forming stars 0.5 Gyr ago,\nwere rapidly quenched. This phenomenon is consistent with\nthe slow-then-rapid quenching scenario (e.g., Wetzel et al.\n2013; Maier et al. 2019), in which slow quenching, or\n“strangulation”, begins when a galaxy crosses the R200 radius\nand gas inflow is halted. During this phase, galaxies continue\nforming stars but show elevated metallicities as quenching\nbegins. As they move toward the cluster’s denser core, a\nrapid phase follows in which star formation is abruptly\nhalted due to increasing ram pressure, which can also strip\naway cold gas, even in massive galaxies. RIN galaxies,\ndespite their short time in the cluster, also show a significant\ndegree of quenching. BS galaxies, although they were mostly\nalready outside R200 in age bin 2, have continued their\nquenching process, something noted by Ruiz et al. 2023.\n3. The mean ages of BS, RIN, and ITL galaxies are statistically\nindistinguishable and clearly younger than cluster members.\nAlthough these populations show clear differences in the\ndegree of star formation quenching, this fact has not been\nsufficient to alter the average age of the samples. When\nanalyzed by morphological type, the differences between BS\nand CL are mainly due to late-type galaxies.\n4. In agreement with Paccagnella et al. (2017), cluster galaxies\nhave the highest fraction of PSB, while ITLs exhibit the\nlowest values. BS and RIN galaxies show intermediate\nvalues with no statistically significant differences between\nthem. Although the fractions of PSB and RSQ galaxies have\nbeen calculated with respect to different sub-samples7, the\nfact that CL class (composed of galaxies that have been in\nthe cluster for more than 2 Gyr) shows the highest fractions\nof both PSB and RSQ suggests that some galaxies require a\nlonger time to be completely quenched. On the other hand,\nalthough BS and RIN galaxies exhibit significant fractions\nof quenched galaxies, there is still a considerable number of\ngalaxies available to be quenched during successive orbits\nwithin the cluster in order to become PSB.\n5. The observed fractions of jellyfish galaxies clearly depend\non the type of orbit, with CL showing the lowest fraction\nand RIN the highest, while BS have intermediate values.\nConsidering that the jellyfish phase lasts between 1 and\n2 Gyr (e.g., Jaffé et al. 2018), it is expected that RIN,\nwhich entered the cluster less than 2 Gyr ago, are the most\naffected. On the other hand, BS galaxies, which according\nto Ruiz et al. (2023) spend on average 1.8 Gyr in a cluster,\nwould have already experienced the jellyfish phenomenon,\nand for some of them, the phenomenon might no longer be\nobservable. Finally, CL galaxies, which have been inside the\ncluster for more than 2 Gyr, are not expected to be observed\nin their jellyfish phase. These results are in agreement with\nYun et al. (2019) who found that, typically, jellyfish galaxies\nare late infallers (< 2.5−3 Gyr ago, at z = 0) in the TNG100\nsimulations. Similarly, Rohr et al. (2023), using the TNG50\ncosmological simulation, found that the peak RPS period\nbegins within approximately 1 Gyr of infall and lasts for ∼2\nGyr.\nOur results suggest that, although over the past 2 −\n3 Gyr galaxies entering clusters have undergone significant\ntransformations in both their star formation and morphology, it\nwill still be necessary for them to orbit within the cluster for a\nlonger time to complete the transformation processes.\nGalaxies located outside R200 that have already made their\nfirst passage through the cluster center continue undergoing\ntransformations, particularly the quenching of the star formation.\nConsidering that an average backsplash galaxy at z\n=\n0,\naccording to Ruiz et al. (2023), spends ∼1.8 Gyr in its diving\nphase and ∼1.2 Gyr outside R200, and that the fraction of passive\nBS galaxies is clearly lower than that in clusters, we conclude\nthat the quenching process of a galaxy entering the cluster can\nlast more than 3 Gyr. However, the fact that RIN, which on\naverage should have spent less time in the cluster than BS, and\nwhich show a higher fraction of passive galaxies than BS, we\ncannot rule out the possibility that, despite the decontamination\nprocesses applied in this work, some degree of contamination\nbetween different orbital types still persists. In particular, BS\nmay be experiencing some level of contamination from infalling\ngalaxies and RIN from CL. An alternative explanation for\nthe observed differences between BS and RIN arises when\n7 The PSB fractions are calculated for all galaxies in a given class,\nwhile the RSQ fractions are based on those that were star forming 0.5\nGyr ago.\nArticle number, page 8 of 9\n\n\nH. Muriel: Unveiling galaxy evolution patterns\nconsidering the times at which those two classes first dived into\nclusters. BS galaxies crossed the clusters’ core when the clusters\nwere less massive. At a lookback time of ∼3 Gyr, clusters can\nbe up to some ∼20% less massive than at z = 0 (see for instance\nvan der Burg et al. 2015). Therefore, these galaxies were affected\nby the environment of typically lesser massive clusters than the\none acting upon RIN at the present, and thus less affected by\nthe environment during their passage through the clusters inner\nregions compared to RIN that are still moving inside the clusters.\nFurthermore, while BS galaxies were crossing the clusters, those\nthat would later become RIN galaxies were being pre-processed\nby the environment in the outskirts of the clusters, adding up to\nthe mass quenching experienced by all galaxies (note that BS\nand RIN galaxies are approximately the same age). This model\nis consistent with results recently found by Levis et al. (in prep.).\nThese authors analyze a sample of groups of galaxies in the TNG\nsimulations and find that the timing of a galaxy’s entry into the\ngroup significantly influences its evolution, with later-arriving\nRIN galaxies experiencing stronger effects from the intragroup\nmedium than earlier-arriving BS galaxies.\nAcknowledgements. The authors thank the referee for her/his comments\nand suggestions that helped us improve the clarity of the paper. This\npaper has been partially supported with grants from Consejo Nacional de\nInvestigaciones Científicas y Técnicas (PIP 11220210100064CO), Argentina,\nthe Agencia Nacional de Promoción Científica y Tecnológica (PICT 2020-3690,\nPICT-2021-I-A-00700),\nArgentina,\nSecretaría\nde\nCiencia\ny\nTecnología,\nUniversidad Nacional de Córdoba, Argentina. MdlR is supported by the Next\nGeneration EU program, in the context of the National Recovery and Resilience\nPlan, Investment PE1 – Project FAIR “Future Artificial Intelligence Research”\nand acknowledges financial support from the Comunidad Autónoma de Madrid\nthrough the grant SI2/PBG/2020-00005. D.P.M acknowledges financial support\nfrom the UNAM-DGAPA-PAPIIT IN111620 grant, Mexico, and from a\nCONAHCyT scholarship.\nReferences\nAbadi, M. G., Moore, B., & Bower, R. G. 1999, MNRAS, 308, 947\nAdami, C., Biviano, A., & Mazure, A. 1998, A&A, 331, 439\nBalogh, M. L., Navarro, J. F., & Morris, S. L. 2000, ApJ, 540, 113\nBamford, S. P., Nichol, R. C., Baldry, I. K., et al. 2009, MNRAS, 393, 1324\nBarnes, J. E. 1992, ApJ, 393, 484\nBiviano, A., Moretti, A., Paccagnella, A., et al. 2017, A&A, 607, A81\nBiviano, A., Poggianti, B. M., Jaffé, Y., et al. 2024, ApJ, 965, 117\nBlanton, M. R., Eisenstein, D., Hogg, D. W., Schlegel, D. J., & Brinkmann, J.\n2005, ApJ, 629, 143\nBlanton, M. R. & Moustakas, J. 2009, ARA&A, 47, 159\nBook, L. G. & Benson, A. J. 2010, ApJ, 716, 810\nBower, R. G., Benson, A. J., & Crain, R. A. 2012, MNRAS, 422, 2816\nBrown, T., Catinella, B., Cortese, L., et al. 2017, MNRAS, 466, 1275\nCava, A., Bettoni, D., Poggianti, B. M., et al. 2009, A&A, 495, 707\nChabrier, G. 2003, PASP, 115, 763\nCimatti, A., Brusa, M., Talia, M., et al. 2013, ApJL, 779, L13\nCoenda, V., de los Rios, M., Muriel, H., et al. 2022, MNRAS, 510, 1934\nCoenda, V., Mast, D., Martínez, H. J., Muriel, H., & Merchán, M. E. 2019, A&A,\n621, A98\nCoenda, V., Muriel, H., Donzelli, C. J., et al. 2006, AJ, 131, 1989\nCortese, L., Catinella, B., Boissier, S., Boselli, A., & Heinis, S. 2011, MNRAS,\n415, 1797\nDalla Vecchia, C. & Schaye, J. 2008, MNRAS, 387, 1431\nDe los Rios, M., Martínez, H. J., Coenda, V., et al. 2021, MNRAS, 500, 1784\nDomínguez, M., Muriel, H., & Lambas, D. G. 2001, AJ, 121, 1266\nDressler, A. 1980, ApJ, 236, 351\nDressler, A. & Gunn, J. E. 1982, ApJ, 263, 533\nEbeling, H., Voges, W., Bohringer, H., et al. 1996, MNRAS, 283, 1103\nFasano, G., Marmo, C., Varela, J., et al. 2006, A&A, 445, 805\nFasano, G., Vanzella, E., Dressler, A., et al. 2012, MNRAS, 420, 926\nFritz, J., Moretti, A., Gullieuszik, M., et al. 2017, ApJ, 848, 132\nFritz, J., Poggianti, B. M., Bettoni, D., et al. 2007, A&A, 470, 137\nFritz, J., Poggianti, B. M., Cava, A., et al. 2014, A&A, 566, A32\nGavazzi, G., Contursi, A., Carrasco, L., et al. 1995, A&A, 304, 325\nGill, S. P. D., Knebe, A., & Gibson, B. K. 2005, MNRAS, 356, 1327\nGiovanelli, R. & Haynes, M. P. 1985, ApJ, 292, 404\nGnedin, O. Y. 2003, ApJ, 582, 141\nGullieuszik, M., Giunchi, E., Poggianti, B. M., et al. 2023, ApJ, 945, 54\nGullieuszik, M., Poggianti, B., Fasano, G., et al. 2015, A&A, 581, A41\nGunn, J. E. & Gott, J. R. I. 1972, ApJ, 176, 1\nHashimoto, Y., Oemler, Augustus, J., Lin, H., & Tucker, D. L. 1998, ApJ, 499,\n589\nHasinger, G. 2008, A&A, 490, 905\nHopkins, P. F., Quataert, E., & Murray, N. 2012, MNRAS, 421, 3522\nJackson, R. A., Kaviraj, S., Martin, G., et al. 2022, MNRAS, 511, 607\nJaffé, Y. L., Poggianti, B. M., Moretti, A., et al. 2018, MNRAS, 476, 4753\nJaffé, Y. L., Smith, R., Candlish, G. N., et al. 2015, MNRAS, 448, 1715\nKauffmann, G., Heckman, T. M., White, S. D. M., et al. 2003, MNRAS, 341, 54\nKlypin, A., Yepes, G., Gottlöber, S., Prada, F., & Heß, S. 2016, MNRAS, 457,\n4340\nKronberger, T., Kapferer, W., Ferrari, C., Unterguggenberger, S., & Schindler,\nS. 2008, A&A, 481, 337\nLee, J. H., Lee, M. G., Mun, J. Y., Cho, B. S., & Kang, J. 2022, ApJL, 931, L22\nLópez-Gutiérrez, M. M., Bravo-Alfaro, H., van Gorkom, J. H., Caretta, C. A., &\net al. 2022, MNRAS, 517, 1218\nMaier, C., Ziegler, B. L., Haines, C. P., & Smith, G. P. 2019, A&A, 621, A131\nMamon, G. A., Sanchis, T., Salvador-Solé, E., & Solanes, J. M. 2004, A&A, 414,\n445\nMarasco, A., Fraternali, F., & Binney, J. J. 2012, MNRAS, 419, 1107\nMarasco, A., Poggianti, B. M., Fritz, J., et al. 2023, MNRAS, 525, 5359\nMartin, G., Kaviraj, S., Devriendt, J. E. G., Dubois, Y., & Pichon, C. 2018,\nMNRAS, 480, 2266\nMartínez, H. J., Coenda, V., & Muriel, H. 2008, MNRAS, 391, 585\nMartínez, H. J., Coenda, V., Muriel, H., de los Rios, M., & Ruiz, A. N. 2023,\nMNRAS, 519, 4360\nMartínez, H. J., de los Rios, M., Coenda, V., et al. 2024, A&A, in press.\nMartínez, H. J. & Muriel, H. 2006, MNRAS, 370, 1003\nMateus, A. & Sodré, L. 2004, MNRAS, 349, 1251\nMoore, B., Lake, G., & Katz, N. 1998, ApJ, 495, 139\nMoretti, A., Gullieuszik, M., Poggianti, B., et al. 2017, A&A, 599, A81\nMoretti, A., Poggianti, B. M., Fasano, G., et al. 2014, A&A, 564, A138\nNandra, K., Georgakakis, A., Willmer, C. N. A., et al. 2007, ApJL, 660, L11\nNavarro, J. F. & White, S. D. M. 1994, MNRAS, 267, 401\nPaccagnella, A., Vulcani, B., Poggianti, B. M., et al. 2017, ApJ, 838, 148\nPaccagnella, A., Vulcani, B., Poggianti, B. M., et al. 2016, ApJL, 816, L25\nPaccagnella, A., Vulcani, B., Poggianti, B. M., et al. 2019, MNRAS, 482, 881\nPasquali, A., Smith, R., Gallazzi, A., et al. 2019, MNRAS, 484, 1702\nPaulino-Afonso, A., Sobral, D., Darvish, B., et al. 2019, A&A, 630, A57\nPérez-Millán, D., Fritz, J., González-Lópezlira, R. A., et al. 2023, MNRAS, 521,\n1292\nPoggianti, B. M., Fasano, G., Omizzolo, A., et al. 2016, AJ, 151, 78\nPoggianti, B. M., Gullieuszik, M., Tonnesen, S., et al. 2019, MNRAS, 482, 4466\nRhee, J., Smith, R., Choi, H., et al. 2017, ApJ, 843, 128\nRoberts, I. D., Lang, M., Trotsenko, D., et al. 2022, ApJ, 941, 77\nRohr, E., Pillepich, A., Nelson, D., et al. 2023, MNRAS, 524, 3502\nRuiz, A. N., Martínez, H. J., Coenda, V., et al. 2023, MNRAS, 525, 3048\nSalerno, J. M., Martínez, H. J., Muriel, H., et al. 2020, MNRAS, 493, 4950\nSalinas, V., Jaffé, Y. L., Smith, R., et al. 2024, MNRAS, 533, 341\nSampaio, V. M., de Carvalho, R. R., Aragón-Salamanca, A., et al. 2024,\nMNRAS, 532, 982\nSchaefer, A. L., Croom, S. M., Allen, J. T., et al. 2017, MNRAS, 464, 121\nSilverman, J. D., Mainieri, V., Lehmer, B. D., et al. 2008, ApJ, 675, 1025\nSmith, R., Sánchez-Janssen, R., Beasley, M. A., et al. 2015, MNRAS, 454, 2502\nSocolovsky, M., Maltby, D. T., Hatch, N. A., et al. 2019, MNRAS, 482, 1640\nSpitzer, Lyman, J. & Baade, W. 1951, ApJ, 113, 413\nSteinhauser, D., Schindler, S., & Springel, V. 2016, A&A, 591, A51\nStringer, M. J., Bower, R. G., Cole, S., Frenk, C. S., & Theuns, T. 2012, MNRAS,\n423, 1596\nToomre, A. 1977, in Evolution of Galaxies and Stellar Populations, ed. B. M.\nTinsley & D. C. Larson, Richard B. Gehret, 401\nvan der Burg, R. F. J., Hoekstra, H., Muzzin, A., et al. 2015, A&A, 577, A19\nVarela, J., D’Onofrio, M., Marmo, C., et al. 2009, A&A, 497, 667\nVijayaraghavan, R. & Ricker, P. M. 2015, MNRAS, 449, 2312\nVillalobos, Á., De Lucia, G., & Murante, G. 2014, MNRAS, 444, 313\nVulcani, B., Fritz, J., Poggianti, B. M., et al. 2020, ApJ, 892, 146\nVulcani, B., Poggianti, B. M., Aragón-Salamanca, A., et al. 2011a, MNRAS,\n412, 246\nVulcani, B., Poggianti, B. M., Dressler, A., et al. 2011b, MNRAS, 413, 921\nVulcani, B., Poggianti, B. M., Finn, R. A., et al. 2010, ApJL, 710, L1\nVulcani, B., Poggianti, B. M., Gullieuszik, M., et al. 2023, ApJ, 949, 73\nVulcani, B., Poggianti, B. M., Smith, R., et al. 2022, ApJ, 927, 91\nWeinmann, S. M., van den Bosch, F. C., Yang, X., & Mo, H. J. 2006, MNRAS,\n366, 2\nWerle, A., Poggianti, B., Moretti, A., et al. 2022, ApJ, 930, 43\nWetzel, A. R., Tinker, J. L., Conroy, C., & van den Bosch, F. C. 2013, MNRAS,\n432, 336\nWhitmore, B. C. & Gilmore, D. M. 1991, ApJ, 367, 64\nWhitmore, B. C., Gilmore, D. M., & Jones, C. 1993, ApJ, 407, 489\nWilkinson, A., Almaini, O., Wild, V., et al. 2021, MNRAS, 504, 4533\nYoon, H., Chung, A., Smith, R., & Jaffé, Y. L. 2017, ApJ, 838, 81\nYun, K., Pillepich, A., Zinger, E., et al. 2019, MNRAS, 483, 1042\nArticle number, page 9 of 9\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20446v1.pdf",
    "total_pages": 9,
    "title": "Reconstructing orbits of galaxies in extreme regions (ROGER). IV. Unveiling galaxy evolution patterns in OmegaWINGS clusters",
    "authors": [
      "Hernán Muriel",
      "David Pérez-Millán",
      "Martín de los Rios",
      "Andrea Biviano",
      "Valeria Coenda",
      "Héctor J. Martínez",
      "Andrés N. Ruiz",
      "Benedetta Vulcani",
      "Selene Levis"
    ],
    "abstract": "Clusters of galaxies have proven to be efficient systems in modifying various\nproperties of galaxies, such as star formation or morphology. However,\nprojection effects impose serious challenges in determining how, when, and to\nwhat extent galaxies are affected by the cluster environment. Using innovative\ntechniques to classify galaxies based on their history within the cluster, we\naim to determine how galaxies of different classes are affected by the cluster\nenvironment. We applied the ROGER code to select trajectories of galaxies in\nthe phase space for 35 galaxy clusters from the OmegaWINGS survey. A new\nalgorithm was applied to minimize contamination effects. We found that both\nmorphological transformation and the quenching of star formation begin shortly\nafter galaxies enter the cluster. Even though over the last $2-3$ Gyr, galaxies\nentering clusters have undergone significant transformations in both their star\nformation and morphology these transformation processes are not complete, that\nis, they are not completely quenched and are not early type yet. Backsplash\ngalaxies and recent infallers show a higher fraction of jellyfish galaxies\ncompared to older cluster members, suggesting that the timescale of this\nphenomenon is typically less than 3 Gyr.",
    "published_date": "2025-02-27",
    "source": "arxiv"
  }
}