{
  "id": "arxiv_2502.21146v1",
  "text": "Unmasking Stealthy Attacks on Nonlinear DAE Models of Power Grids\nAbdallah Alalem Albustamia, Ahmad F. Tahaa, Elias Bou-Harbb\naVanderbilt University, Civil and Environmental Engineering Department, Nashville, 37235, TN, US\nbLouisiana State University, Division of Computer Science and Engineering, Baton Rouge, 70803, LA, US\nAbstract\nSmart grids are inherently susceptible to various types of malicious cyberattacks that have all been documented in the\nrecent literature. Traditional cybersecurity research on power systems often utilizes simplified models that fail to capture\nthe interactions between dynamic and steady-state behaviors, potentially underestimating the impact of cyber threats.\nThis paper presents the first attempt to design and assess stealthy false data injection attacks (FDIAs) against nonlinear\ndifferential algebraic equation (NDAE) models of power networks. NDAE models, favored in industry for their ability\nto accurately capture both dynamic and steady-state behaviors, provide a more accurate representation of power system\nbehavior by coupling dynamic and algebraic states. We propose novel FDIA strategies that simultaneously evade both\ndynamic and static intrusion detection systems while respecting the algebraic power flow and operational constraints\ninherent in NDAE models. We demonstrate how the coupling between dynamic and algebraic states in NDAE models\nsignificantly restricts the attacker’s ability to manipulate state estimates while maintaining stealthiness. This highlights\nthe importance of using more comprehensive power system models in cybersecurity analysis and reveals potential vul-\nnerabilities that may be overlooked in simplified representations. The proposed attack strategies are validated through\nsimulations on the IEEE 39-bus system.\nKeywords:\nFalse data injection attack, power system nonlinear differential algebraic model, dynamic state estimation.\n1. Introduction\nIn recent years, the pervasive adoption of information\ntechnology has elevated cybersecurity to a critical issue\nfor contemporary power systems.\nThe close intercon-\nnection between the physical and cyber dimensions of\nthese systems suggests that a compromise in cybersecu-\nrity could pose a significant risk to their physical integrity\n[1]. A particularly insidious threat within this domain is\nStealthy False Data Injection Attacks (SAs).2 In partic-\nular, SAs have the capability to manipulate state estima-\ntion processes—that are instrumental in obtaining system-\nwide situational awareness and inform subsequent con-\ntrol actions—while evading conventional detection mecha-\nnisms, thereby threatening the stability and reliability of\nsmart grids [2].\nExtensive research has been dedicated to the exploration\nof SAs against modern power systems, spanning the con-\nstruction of valid attack strategies, assessing the impact\nEmail addresses:\nabdallah.b.alalem.albustami@vanderbilt.edu (Abdallah Alalem\nAlbustami), ahmad.taha@vanderbilt.edu (Ahmad F. Taha),\nebouharb@lsu.edu (Elias Bou-Harb)\n1This work is supported by National Science Foundation under\nGrants 2230087 and 2404946.\n2We refer to these attacks by SAs, in contrast to the more verbose\nacronym SFDIAs used in the literature. We note that not all SAs\nare false data injection attacks, but the SAs considered in this paper\nare presumed to fall within the class of FDIAs.\nof attacks on system stability, and developing defense and\nmitigation strategies [2]. The design and mitigation of SAs\ncan be broadly categorized into three categories [3]: (i)\nthose leveraging power flow equations (either DC or AC)\nto devise attack vectors [4] and hence targeting steady-\nstate grid conditions; (ii) those exploiting the system’s ar-\nchitectural vulnerabilities, including both centralized and\ndecentralized attack schemes [5, 6]; (iii) those predicated\non the methodology of construction, ranging from at-\ntacks informed by complete or partial system topology—\nleveraging knowledge of the physical and logical layout of\nthe power grid—as in [7, 8] to data-driven strategies that\nrequire no a priori knowledge of the grid’s dynamics or\nparameters [9–11].\nIn addressing SAs, two critical routines underpin the\nresilience of these infrastructures: state estimation (SE)\nand intrusion detection (ID) [2]. State estimation is the\nprocess for inferring the grid’s current state from mea-\nsurements, essential for decision-making and monitoring.\nIntrusion detection works in tandem, discerning genuine\nsystem changes from erroneous or malicious data, hence\nsafeguarding the state estimation process against potential\nanomalies [3]. Significant efforts have been dedicated to\ndeveloping and detecting stealthy data integrity attacks to\ncompromise SE. This is a centerfold of most attack detec-\ntion algorithms as most of them rely on computing resid-\nuals between predicted system state and estimated one.\nThese attacks can be bounded, with limitations on their\nAccepted to International Journal of Electrical Power and Energy Systems, February 2025\nMarch 3, 2025\narXiv:2502.21146v1  [eess.SY]  28 Feb 2025\n\n\nimpact [12], or unbounded thereby offering wider scope\nfor disruption [13]. Moreover, they can be meticulously\ntailored to create a worst-case scenario by exploiting the\nvulnerabilities of specific intrusion detectors [14, 15].\nKey Research Gap. Despite extensive research, a crit-\nical gap exists in analyzing SAs against power systems\nmodeled with Nonlinear Differential Algebraic Equations\n(NDAE). NDAE models, which are widely favored in in-\ndustry for their ability to accurately represent both dy-\nnamic and steady-state behaviors of power systems [16],\noffer several advantages over simplified linearized or Non-\nlinear ODE (NODE) models:\n• More accurate representation of power system dynam-\nics, capturing interactions between generator dynamic\nstates (e.g., rotor angles, speeds, and transient voltages)\nand network algebraic constraints that model steady-\nstate power flow behavior. This coupling allows for a\nmore realistic simulation of system response to distur-\nbances and control actions [17, 18].\n• Capacity to model expanded Phasor Measurement Unit\n(PMU) deployment across various bus types (e.g., load,\nrenewable), extending beyond the generator-bus limita-\ntions of ODE models, potentially improving SE accuracy\nand fault detection [19, 20].\n• Continuous validation of state estimates against alge-\nbraic power flow and power balance constraints, improv-\ning the detection of measurement errors, model inaccu-\nracies, and potential cyberattacks by identifying incon-\nsistencies between the system’s dynamic behavior and\ninstantaneous power flow solutions.\nThese advantages can significantly impact SA analysis:\n• Formulation: NDAE models present attackers with a\nmultifaceted challenge. They must design attack vec-\ntors that simultaneously: (1) keep detection residuals\nbelow established thresholds to evade conventional in-\ntrusion detectors, (2) ensure adherence to nonlinear al-\ngebraic constraints to maintain physical plausibility of\nthe compromised system state, and (3) ensure the per-\nturbed system remains observable and the state estima-\ntion process converges to a solution.\n• Detection and Mitigation:\nThe interdependence be-\ntween dynamic and algebraic states in NDAE models\nenables multi-modal anomaly detection. Discrepancies\nbetween the temporal evolution of dynamic states and\nthe instantaneous algebraic constraints can reveal subtle\nattack signatures not apparent in decoupled or simpli-\nfied models.\n• Attack Analysis: NDAE models allow for a unified eval-\nuation of how attacks on PMU measurement affect both\ndynamic states and steady-state variables, providing in-\nsights into both transient stability issues and steady-\nstate constraint violations that may be overlooked in\ndecoupled analyses.\nThe lack of research in this area necessitates an in-depth\ninvestigation to gauge the susceptibility of NDAE-modeled\npower systems to SAs and the development of NDAE-\nspecific detection and mitigation strategies. What follows\nis a detailed delineation of the literature that closely re-\nlates to this key gap of SA design and impact assessment\non NDAE power system models.\nRelevant Literature. Previous research on SAs against\npower systems has primarily focused on simplified models\nthat may not fully capture the complex nonlinear dynam-\nics and interactions present in real-world power grids. For\ninstance, in [21] and [22], the authors investigate SAs using\nlinearized descriptor (another more mathematical phrase\nused to describe DAEs) systems. They employ a basic Bad\nData Detection (BDD) scheme for intrusion detection and\nuse an observer-based approach for SE. They define a per-\nfect attack as one that satisfies certain detection avoidance\nand state divergence conditions, but they do not consider\nhow the resulting state estimates must satisfy the algebraic\nconstraints inherent in DAE models. Furthermore, their\nuse of linearized models may not adequately capture the\nnonlinear behavior of power systems, potentially overlook-\ning vulnerabilities that arise from the interaction between\ndynamic and algebraic states.\nMore recent studies, such as [23], [24], and [25], have\nshifted focus to FDIAs in nonlinear settings.\nHowever,\nthese works primarily address static power flow models,\noptimizing attack sparsity and detection or leveraging deep\nlearning for forecasting-based anomaly detection.\nThey\ndo not consider the coupled dynamic and algebraic com-\nponents present in real systems, leaving a critical gap in\nunderstanding vulnerabilities arising from these interac-\ntions.\nStudies like [26] and [27] have explored the inherent vul-\nnerabilities of AC state estimation to false data injection\nattacks, with the former leveraging physical system prop-\nerties for defense and the latter assessing physical disrup-\ntions from a bi-level optimization perspective. A signifi-\ncant body of work has also focused on constructing SAs\nagainst the AC state estimation process, which captures\nthe algebraic constraints governing the steady-state be-\nhavior of power systems [28–31]. While these studies con-\ntribute to our understanding of system vulnerabilities un-\nder stealthy attack scenarios that exploit the algebraic con-\nstraints of steady-state behavior, they overlook dynamic\nsystem components, such as generator dynamics, and their\ninteraction with the algebraic power flow equations. As a\nresult, the impact of SAs designed using these approaches\nmay not be fully representative of the actual system re-\nsponse when both dynamic and algebraic components are\nsimultaneously considered.\nTo the best of the authors’ knowledge, this paper\npresents the first attempt to design and assess SAs against\nNDAE models of power systems that simultaneously ac-\ncount for generator dynamic behaviors and algebraic con-\nstraints that model steady-state power flow.\nInvestigated Research Questions.\nThis paper ad-\n2\n\n\ndresses this gap by investigating the following research\nquestions:\n• Q1.\nHow does incorporating NDAE models influence\nthe formulation, detection, and impact of SAs?\nAre\nthere notable limitations and consequences when sim-\nplified models are employed to analyze and detect SAs\nin power systems?\n• Q2. How does the effectiveness of different mainstream\nintrusion detectors differ in detecting SAs for NDAE-\nmodeled power systems? What improvements are nec-\nessary to enhance their detection capabilities?\n• Q3.\nHow do NDAE-specific state monitoring algo-\nrithms, when coupled with dynamic intrusion detection\nmethods, perform against tailored SAs?\nPaper Objectives and Contributions.\nThis study\nexamines attack strategies on NDAE-modeled power sys-\ntems.\nWe categorize attacks into two main strategies.\n(i) Constraint-Unaware Attacks:\nThis strategy focuses\non attacks that manipulate PMU measurements to re-\nmain undetected by intrusion detection systems but do\nnot consider the adherence to the system’s algebraic con-\nstraints, potentially leading to implausible physical con-\nditions in the simulated attacks.\n(ii) Constraint-Aware\nAttacks: Here, stealthy attacks are designed to adhere to\nboth detection evasion and the algebraic and operational\nconstraints, ensuring attacks are both physically plausible\nand stealthy. The contributions of this paper are threefold:\n1. Development of NDAE-aware SA strategies that ensure\nthe resulting state estimates, encompassing both gen-\nerator dynamics and steady-state variables, simultane-\nously satisfy the algebraic constraints of DAE models\nwhile remaining stealthy to intrusion detection. This\napproach captures the inherent coupling between dy-\nnamic and algebraic states, presenting a more com-\nprehensive attack model than those considering only\nsteady-state behavior. Specifically, we introduce an It-\nerative Constraint-Aware Attack Algorithm (ICAA), an\nefficient and scalable method for refining attack vec-\ntors to satisfy physical constraints while evading de-\ntection.\nICAA begins with initial attack vectors de-\nsigned to bypass detection thresholds (referred to as\nconstraint-unaware attacks, as they do not consider\nphysical system constraints) and systematically adjusts\nthem to ensure physical plausibility, avoiding the need\nfor direct solution of the NDAE model or complex op-\ntimization procedures, making ICAA computationally\ntractable for large-scale power systems.\n2. Evaluation of attack impacts on NDAE-specific state\nestimation and intrusion detection, comparing CUSUM\nand Chi-squared detector performance against the pro-\nposed attacks. This analysis reveals how NDAE models\ninherently constrain attack vectors compared to simpli-\nfied power system representations, affecting both dy-\nnamic and algebraic state estimates.\n3. Quantitative assessment of NDAE model resilience\nagainst cyberattacks through case studies on the IEEE\n39-bus system. We investigate trade-offs between con-\nstraint tolerance, false alarm rates, and attack de-\ntectability, providing insights into the security implica-\ntions of using NDAE models for power system analysis\nand control.\nPaper Organization. The rest of the paper is organized\nas follows. Section 2 includes the preliminaries. Section 3\npresents the attack strategies. Case studies are presented\nin Section 4, and the paper is concluded in Section 6.\n2. Preliminaries\nThis section summarizes the NDAE model, state esti-\nmation methods, and basic intrusion detectors critical for\nunderstanding and implementing the proposed algorithms.\n2.1. Power Network NDAE Model\nPower systems can be modeled using a set of Nonlin-\near Differential Algebraic Equations (NDAE) that capture\nboth the dynamic behavior of generators and the algebraic\npower flow constraints of the network. The NDAE model\ntakes the following general form:\nGen. Dynamics: ˙xd = Adxd + fd(xd, xa) + Bdu\n(1a)\nFlow Constraints: 0 = Aaxa + fa(xd, xa) + Baw.\n(1b)\nHere, xd represents the dynamic state variables asso-\nciated with generators, while xa represents the algebraic\nstate variables related to power flow in the network. The\nfunctions fd and fa capture the nonlinearities present in\nthe generator dynamics and power flow equations respec-\ntively. Incorporating PMU measurements, represented by\na vector y ∈Rp of voltage and current phasors into the\nNDAE model, results in:\nE ˙x = Ax + f(x) + Buu + Bww + wp,\n(2a)\ny = Cx + wm.\n(2b)\nThe output matrix C ∈Rp×n links state vectors to PMU\ndata via their geographic placements, with wm ∈Rp and\nwp ∈Rn representing random measurement and process\nnoise.\nFor a complete and detailed description of the NDAE\nmodel, including the specific algebraic equations for power\nflow and power balance, please refer to Appendix A.\n2.2. NDAE State Estimation for Attack Detection\nIn the context of NDAE-modeled power systems, SE\nbecomes particularly challenging due to the presence of\nboth dynamic and algebraic states.\nSome methods in\nthe literature simplify this task by reducing the model\nto NODE form or neglecting the algebraic constraints,\ncompromising system representation fidelity [17]. Incor-\nporating algebraic constraints into the state estimation\n3\n\n\nprocess for NDAE models can be accomplished through\ntwo primary approaches: a decoupled two-step approach\nand a coupled joint estimation approach. The decoupled\napproach first estimates algebraic variables using static\nSE techniques (such as Least Absolute Value estimation),\nthen derives dynamic state estimates using dynamic es-\ntimation methods (such as the Extended Kalman Filter)\n[32, 33].\nFor the purpose of this work, we utilize the\njoint SE approach, which simultaneously estimates both\ndynamic and algebraic states, as it has demonstrated\nsuperior accuracy in capturing the interactions between\ndynamic and algebraic states in NDAE models, particu-\nlarly in the presence of process and measurement noise,\nas well as uncertainties from loads and renewable energy\nsources [20].\nJoint NDAE Observer.\nIn [20], the authors in-\ntroduce an observer that jointly estimates the dynamic\nand algebraic states of a NDAE-modeled power network\nusing a Lyapunov-based, control-theoretic approach. The\nobserver and error dynamics are given by:\nE ˙ˆx = Aˆx + f(x) + Buu + Bww + L(y −ˆy),\n(3a)\nZ ˙e = (A −LC)e + ∆f + (Bw −LDw)w.\n(3b)\nThe observer gain matrix L is determined through solving\na convex semidefinite program problem that ensures that\nthe error dynamics are bounded, hence guaranteeing that\nthe state estimates are close to the actual system states\nunder the presence of uncertainty from loads, renewables,\nand process and measurement noise.\n2.3. Intrusion Detection\nTo analyze the impact of SAs on NDAE-modeled\npower systems, we employ two well-established residual-\nbased intrusion detection methods: the Cumulative Sum\n(CUSUM) detector [34] and the Chi-squared (χ2) detector\n[35]. These detectors are chosen for their proven effective-\nness in power system security and their compatibility with\nthe utilized NDAE model [36–38].\n2.3.1. CUSUM Detection\nThe Cumulative Sum (CUSUM) detector is a dynamic\ndetection method that monitors changes in the cumulative\nsum of residuals, r ∈Rp, defined as the differences between\nthe state estimates from the SE step (3) and the noisy\nmeasurements obtained from PMUs (2b):\nr(t) = y(t) −C ˆx(t).\n(4)\nThe CUSUM detection process is defined as:\nc1 = 0, ck =\n(\nmax (0, ck−1 + zk −b) ,\nif ck−1 ≤τ,\n0 and ˆk = k −1,\nif ck−1 > τ.\n(5)\nThe parameters to be set are the bias b ∈R>0 and the\nthreshold τ ∈R>0. The output is the alarm time(s) ˆk. An\nalarm is triggered when the test sequence ck−1 exceeds a\npredefined threshold τ, and ck is set to zero. The param-\neters b and τ are critical design choices that control the\nsensitivity and detection threshold of the CUSUM detec-\ntor. While [39] outlines a theoretical approach for tuning\nb and τ, this work employs a practical methodology based\non analyzing historical residual data to tune these param-\neters.\nThe choice of the distance measure zk depends on the\nconfiguration of the CUSUM detectors in the system.\nWhen using a scalar distance measure that aggregates\ninformation from all residuals, such as zk = r⊤\nk Σ−1rk,\nthe CUSUM parameters (b, τ, and ck) are also scalars.\nThis centralized approach monitors all residuals collec-\ntively, treating the entire set of measurements as a sin-\ngle unit. In contrast, if the distance measure is a vector,\nsuch as using the residual vector rk itself or its absolute\nvalues |rk|, then the CUSUM parameters become vectors\n(b, τ, ck ∈Rp). This vectorized approach monitors each\nmeasurement’s residual separately, allowing for different\nsensitivity for each measurement. This effectively provides\na distributed detection capability within a single CUSUM\nframework as it allows to to detect localized anomalies to\nindividual measurements.\nThe CUSUM detector offers several advantages over tra-\nditional static detection methods, such as BDD. Unlike\nstatic methods which typically rely on single-shot residual\nanalysis to flag anomalies, CUSUM dynamically tracks cu-\nmulative changes in residuals over time, making it more\nsensitive to subtle, persistent deviations introduced by\nstealthy attacks. Additionally, it is computationally effi-\ncient and straightforward to implement, as it requires only\nresidual computations and simple iterative updates. This\nmakes it a practical choice for real-time applications.\n2.3.2. Chi-squared (χ2) Detector\nThe Chi-squared detector is a static detection mecha-\nnism designed to identify sudden anomalies in the resid-\nuals. Considering the residual vector (4), the chi-squared\nprocedure is defined as:\nzk = r⊤\nk Σ−1rk\n(6)\nAn alarm is triggered when zk exceeds a predefined thresh-\nold α. This threshold is set using the inverse regularized\nlower incomplete gamma function P −1(·, ·). Specifically,\nα is calculated as α = 2P −1 \u0000 ny\n2 , 1 −1\nm\n\u0001\n, where ny is the\nnumber of independent measurements, and m represents\nthe desired mean time between false alarms [39]. The χ2\ndetector (also referred to as BDD) is widely used in FDIA\nresearch due to its effectiveness in identifying significant\ndeviations indicative of malicious injections.\nNext, we present two attack strategies designed to by-\npass the aforementioned intrusion detection systems, each\naccounting for different levels of system constraints.\n4\n\n\n3. Attack Strategies\nIn this section, we propose two attack strategies to\nevaluate whether the strict physical and operational con-\nstraints inherent in NDAE models—due to the coupling\nof dynamic and algebraic variables—make it more diffi-\ncult for adversaries to evade SE and ID systems.\nWe\ndefine two types of attacks: (i) Constraint-Unaware At-\ntacks (SCUAs), which aim to bypass ID methods with-\nout adhering to algebraic constraints.\nWe formulate\nthese attacks to explore their feasibility on the SE pro-\ncess of NDAE-modeled power systems when constraints\nare neglected, providing insights into applying similar at-\ntacks on simplified models that disregard grid physics.\n(ii) Constraint-Aware Attacks (SCAAs), which maintain\nstealthiness against both ID systems and the NDAE con-\nstraints, ensuring the physical plausibility of the attacked\nstate estimates. We point out here that these two prob-\nlems have not been studied in the literature for NDAE-\nmodeled power systems, although they do sound intuitive\nand meaningful as outlined in Section 1. The effectiveness\nof both attack strategies is validated in Section 4. Before\ndetailing each strategy, we clarify key definitions used in\nattack formulation:\n• Attack Vector (a(k) ∈Rp): A vector that represents the\nmanipulations applied to measurements at time k.\n• Measurement Selection Matrix (Γ ∈Rp×p): A diagonal\nmatrix where the i-th diagonal element is 1 if the i-th\nmeasurement is targeted by the attack, and 0 otherwise.\nThis matrix defines which measurements are targeted by\na(k).\n• Attack start time (k∗): Scalar defining the time step of\nattack initiation.\n• Attacked Measurements (y∗(k) ∈Rp): The measure-\nments obtained by adding the attack vector, scaled by\nthe measurement selection matrix, to the true measure-\nments at time step k, i.e., y∗(k) = y(k) + Γa(k).\n3.1. Stealthy Constraint-Unaware Attacks (SCUAs)\nStealthy Constraint-Unaware Attacks (SCUAs) are at-\ntacks designed to exploit vulnerabilities in ID systems\nby maximizing the injected false data while maintaining\ndetector outputs at their predefined thresholds, without\nconsidering the algebraic and operational constraints of\nNDAE models. Below, we outline worst-case stealthy at-\ntack strategies for both detectors reproduced in Section\n2.3, building on established methods from the literature\n[14, 40].\n3.1.1. SCUA formulation for CUSUM\nThe CUSUM statistic under a stealthy injection attack\nconsidering a distance measure zk = r⊤\nk Σ−1rk and a single\nCUSUM statistic for all measurements is represented as:3\nck = max\n\u00000, ck−1 + (Σ−0.5(rk + ak))2 −b\n\u0001\n(7)\nAn attack sequence, ak, that can neutralize the residuals\nand maintain ck at its threshold can be defined as follows\n[39]:\nak =\n\n\n\n\n\n\n\n\n\n\n\nΣ\n1\n2 Γ\n\u0012q\nτ+b−ck−1\nn\n, . . . ,\nq\nτ+b−ck−1\nn\n\u0013⊤\n−rk,\nif k = k∗\nΣ\n1\n2 Γ\n\u0012q\nb\nn, . . . ,\nq\nb\nn\n\u0013⊤\n−rk,\nif k > k∗.\n(8)\nThe matrix Γ selects the n measurements targeted by\nthe attacker, where n corresponds to the number of ones on\nthe diagonal of Γ (i.e., number of selected measurements).\nThis enables the attacker to spread the impact across any\nn selected measurements based on their access to PMU\ndata, while still keeping the overall CUSUM statistic at\nthe desired threshold.\nIn the case of considering a distance measure zk = |rk|,\nwhere ck = max (0, ck−1 + |rk + ak| −b), the attack vec-\ntor ak can be designed to selectively target specific mea-\nsurements to keep the CUSUM statistic ck at desired lev-\nels. The attack sequence, ak can be defined as follows [14]:\nak,i =\n(\n±(τi + bi −ck−1,i) −rk,i,\nif k = k∗,\nbi −rk,i,\nif k > k∗,\n(9)\nwhere i = 1, 2, . . . , p represents each individual measure-\nment. Here, the attacker must know the specific param-\neters of the CUSUM statistic for each targeted measure-\nment.\nBy selecting which measurements to attack and\nadjusting the magnitude of the injection based on this in-\nformation, the attacker can maintain the CUSUM statis-\ntic ck(i) for each targeted measurement i at its respective\nthreshold τ(i), thus implementing an effective SA in a dis-\ntributed detection environment.\n3.1.2. SCUA formulation for χ2\nTo design a SA that bypasses the χ2 detector, the attack\nvector ak must be crafted to ensure that the test statistic\nzk does not exceed α. This can be achieved by controlling\nthe total residual energy introduced by ak as follows:\nak = Σ\n1\n2 Γ\n\u0012rα\nn, . . . ,\nrα\nn\n\u0013⊤\n−rk\n(10)\nThis distribution allows the attacker to maintain the resid-\nual energy within the threshold α, thereby avoiding detec-\ntion by the χ2 detector.\n3While the NDAE model operates in continuous time, we use\nthe discrete-time index k in our attack formulations to reflect the\ndiscrete nature of digital measurements and control actions in power\nsystems. Here, k represents the sampling instant or time step of the\nmeasurement systems.\n5\n\n\nThe attack vectors in (8), (9), and (10) are designed\nto decieve the ID by ensuring the output remains consis-\ntently at its threshold. In these attacks, we assume that\nID is done prior to the SE process, which means that it is\nused to check the measurements for anomalies before they\nare passed to the joint SE process, as this aligns with the\npaper’s objective of quantifying the effectiveness of the at-\ntacks by analyzing their impact on SE accuracy. However,\nas the common practice would be to employ ID after SE,\nwe also analyze this case, where residuals are computed\nusing the current state estimates: rk = yk −C ˆxk. For\nthis case, we need to account for how the attack vector\npropagates through the state estimates.\nTo avoid solv-\ning the complete NDAE observer or computing LMIs, we\ncan approximate this propagation using a simple Euler\ndiscretization:ˆxk+1 = ˆxk + ∆t(Aˆxk + f(ˆxk, u) + L(yk −\nC ˆxk)). Under attack, y∗\nk = yk + ak, the perturbed state\nestimate can be approximated as:\nˆx∗\nk ≈ˆxk −∆tLak\n(11)\nThis leads to the following residual expression: r∗\nk = yk −\nC ˆx∗\nk = (I + ∆tCL)ak + rk, Defining M = I + ∆tCL,\nthe attack vector can be designed as:\nak = M −1(ζ −rk)\n(12)\nwhere ζ is chosen based on the detector type as in (8),\n(9), or (10). Note that for small sampling times ∆t, ma-\ntrix M approaches identity, making both cases (ID before\nand after SE) nearly equivalent. In either case, these at-\ntack vectors serve as baselines that will be refined in the\nfollowing section to satisfy physical constraints.\nThese strategies imply that once a SCUA is initiated,\nthe detector’s output remains consistently at its thresh-\nold.\nThis highlights the importance of carefully tuning\nthe threshold. If set too high, it may allow SAs to pro-\ngressively diverge the state estimates from actual system\nstates without detection. On the other hand, a threshold\nthat is too low could result in numerous false alarms.\nTo launch these attacks, an adversary must have access\nto the measurements vector, state estimates, and the pa-\nrameters of the intrusion detector. For the Chi-squared\ndetector, this means knowing the threshold, α. For the\nCUSUM detector, the attacker would need to know the\nvalue of τ, b and the CUSUM statistic from the prior step,\nck−1. The latter is particularly challenging, as ck−1 is not\ntypically communicated externally, which provides an in-\nherent security advantage for the CUSUM detector over\nstatic ID methods [39].\nAlthough these assumptions may be idealized, they al-\nlow us to construct worst-case attack scenarios that serve\nas benchmarks for evaluating the robustness of more re-\nalistic and advanced strategies, as discussed in the next\nsection.\nNext, we propose a Stealthy Constraint-Aware Attack\n(SCAA) strategy that addresses the limitations of SCUAs\nby (i) evading detection by intrusion detection systems,\n(ii) ensuring state estimation converges to valid solutions,\nand (iii) maintaining physically plausible state estimates\nthat satisfy the dynamic and algebraic constraints of the\nNDAE model. This approach quantifies the more limited\nattack space in SCAAs compared to SCUAs, which do\nnot consider these constraints. We introduce two meth-\nods for implementing SCAAs: an optimization-based ap-\nproach that treats the problem as a constrained optimiza-\ntion and an algorithmic method leveraging closed-form so-\nlutions from SCUAs.\n3.2. Stealthy Constraint-Aware Attacks (SCAAs)\nIn contrast to SCUAs that bypass detection without\nconsidering model constraints, Stealthy Constraint-Aware\nAttacks (SCAAs) are designed to evade detection while\nadhering to the algebraic and operational constraints of\nNDAE-modeled power systems.\nThese constraints, de-\nnoted as C, include the algebraic power flow (13a)–(13b)\nand power balance equations (13c)–(13d), as well as the\noperational limits on generator outputs (13e)–(13f), bus\nvoltage magnitudes (13g), and transmission line flows\n(13h)–(13i), as follows:\nPGi =\n1\nx′\ndi\nE′\nqivi sin(δi −θi) −xqi −x′\ndi\n2x′\ndixqi v2\ni sin(2(δi −θi)) (13a)\nQGi =\n1\nx′\ndi\nE′\nqivi cos(δi −θi) −x′\ndi + xqi\n2x′\ndixqi v2\ni\n−xqi −x′\ndi\n2x′\ndixqi v2\ni cos(2(δi −θi))\n(13b)\nPGi + PRi −PLi =\nN\nX\nj=1\nvivj(Gij cos θij + Bij sin θij)\n(13c)\nQGi + QRi −QLi =\nN\nX\nj=1\nvivj(Gij cos θij −Bij sin θij),\n(13d)\nP min\nGi\n≤PGi ≤P max\nGi ,\n(13e)\nQmin\nGi ≤QGi ≤Qmax\nGi ,\n(13f)\nV min\ni\n≤Vi ≤V max\ni\n,\n(13g)\nSfi ≤Fmax,\n(13h)\nSti ≤Fmax,\n(13i)\nwhere Sfi and Sti represent the apparent power flows at\nthe from and to ends of a transmission line, respectively,\nand Fmax denotes the line’s maximum rating. These vari-\nables are functions of active and reactive powers, voltage\nmagnitudes at the corresponding buses, and the line ad-\nmittance. For a detailed description of the variables and\ntheir specific formulations, refer to Appendix A.\nSCAAs aim to manipulate PMU measurements to in-\ntroduce disturbances that can impact the state estima-\ntion process, all while ensuring that the attacked state\nestimates comply with both the algebraic and operational\nconstraints in C.\nTo ensure that the SCAA approach computationally\ntractable for larger systems, we start by defining an attack\nzone that captures how perturbations propagate through\n6\n\n\nthe network topology.\nAlgorithm 2 in Appendix B de-\ntermines this zone by analyzing the network’s admittance\nmatrix structure and bus classifications.\nStarting from\nthe targeted measurement buses, the algorithm propagates\nthrough zero-injection buses while adding non-zero injec-\ntion buses to the boundary of the attack zone. This ap-\nproach captures all buses that could be affected by the\nattack while maintaining a tractable problem size. The\nalgorithm also identifies the specific state variables that\nmust be considered within this zone, including both dy-\nnamic states of generators and algebraic states of buses\nthat either lie within or are directly connected to the at-\ntack zone.\nThis targeted approach allows us to enforce\nconstraints only where they are physically relevant, signif-\nicantly reducing computational complexity compared to\nconsidering the entire system.\nTo formally define the SCAA strategy, we formulate the\nfollowing optimization problem:\nmaximize\nak\np\nX\ni=1\n|ak|\n(14a)\nsubject to\nˆx∗\nA(k) = F(ˆxA(k −1), y∗(k)),\n(14b)\n\f\f\f\nX\ngL(ˆx∗\nA(k))\n\f\f\f ≤ζ,\n(14c)\nh(ˆx∗\nA(k)) ≤0,\n(14d)\nD(ˆx∗\nA(k), y∗(k)) ≤γ,\n(14e)\ny∗(k) = y(k) + Γak\n(14f)\nThe objective function (14a) aims to maximize the sum\nof the absolute values of the attack vector components,\nrepresenting the maximum perturbation an attacker can\ninject into the selected measurements to disrupt the SE\nprocess. The stealthiness and physical plausibility of the\nattack are ensured through a series of constraints imposed\non the manipulated measurements and the resulting al-\ntered state estimates.\nConstraint (14b) represents computing the attacked\nstate estimates resulting from perturbed measurements\nwithin the attack zone. This ensures that the optimiza-\ntion considers how the attack will affect the SE outcome.\nConstraints (14c) and (14d) ensure physical plausibility\nby enforcing power system algebraic and operational con-\nstraints on the states in the set S defined by Algorithm 2 in\nAppendix B. Lastly, constraint (14e) ensures that the ID\noutput D remains below the detector’s threshold γ. This\nconstraint can represent either (5) for the CUSUM statis-\ntic, or (6) for the χ2 statistic, depending on the ID method\nin use.\nTo make the proposed SCAA optimization formulation\ncomputationally feasible, we linearize the algebraic con-\nstraints in (14c) using a first-order Taylor expansion to\nenable more tractable optimization. We ensure that the\nlinear approximation remains valid by periodically updat-\ning the linearization points during the attack.\nThe lin-\nearized algebraic constraints are expressed as\ngL(ˆx∗(k)) = g(ˆx0) + ∇g(ˆx0)(ˆx∗(k) −ˆx0).\nFunction F(·) in (14b), which is used to compute the\nattacked state estimates, can be defined in several ways.\nOne option is to assume the attacker has access to a joint\nobserver, allowing them to estimate the attacked states\nby solving a modified state estimation problem similar\nto (3).\nAlternatively, the attacker could update their\nstate estimates dynamically using a pseudo-inverse ap-\nproach, ˆx∗\na(k) = ˆxa(k −1) + C†y∗(k), assuming mini-\nmal changes between time steps.\nThis approach works\nwell when the power system’s state evolves slowly, and the\npseudo-inverse C† exists and is reliable. However, practi-\ncal limitations, such as measurement redundancy or errors\nin system topology, may affect the rank of C, reducing the\neffectiveness of this method.\nWhile the optimization-based approach provides a for-\nmal framework for SCAAs,\nwe propose an alterna-\ntive, computationally efficient method called the Iterative\nConstraint-Aware Attack Algorithm (ICAA). This algo-\nrithm leverages the closed-form solution of SCUAs and it-\neratively scales it down to satisfy both intrusion detection\nand physical constraints of the NDAE system.\n3.3. Iterative Constraint-Aware Attack Algorithm (ICAA)\nThe key idea behind ICAA is to start with the maxi-\nmum possible attack magnitude that satisfies the intrusion\ndetection constraint. If this initial attack vector satisfies\nall system constraints, it is immediately applied. Other-\nwise, the algorithm iteratively reduces the attack magni-\ntude until all constraints are met. This approach offers\nseveral advantages. It is computationally efficient, avoid-\ning complex optimization solvers and making it suitable for\nreal-time applications. The iterative nature ensures both\nintrusion detection and physical constraints are always sat-\nisfied, adapting to the current system state and potentially\nallowing larger attacks when constraints are less bind-\ning. Unlike the optimization approach, ICAA doesn’t re-\nquire constraint linearization, avoiding approximation er-\nrors and enhancing accuracy in highly nonlinear systems.\nThis method balances attack impact with constraint sat-\nisfaction, providing an alternative to optimization-based\ntechniques. The ICAA is presented in Algorithm 1.\nThe algorithm takes as input the current measurements\ny(k), detector parameters, attack selection matrix Γ, con-\nstraint tolerance ζ, scaling factor β, maximum iterations\nNmax, and detector type. It starts by initializing the at-\ntack vector to zero and setting the detection threshold γ\nbased on the detector type. The initial attack vector is\nthen computed using the SCUA formulation for the cho-\nsen detector. The algorithm then enters a loop where it\niteratively checks if the current attack vector satisfies all\nconstraints. The function F(·) in line 4 computes the at-\ntacked state estimates. This can be implemented as a sin-\ngle step of the joint observer (3) or using a pseudo-inverse\napproach.\nIf all constraints are satisfied, the algorithm\nterminates and returns the current attack vector. Other-\nwise, it scales down the attack vector by a factor of (1−β)\n7\n\n\nAlgorithm 1 Iterative Constraint-Aware Attack\nRequire: y(k), ˆx(k), α (for χ2), τ, b (for CUSUM), Γ, ζ,\nβ, Nmax, detector type\nEnsure: ak\n1: Initialize ak = 0, set γ ←α (χ2) or τ (CUSUM)\n2: ak(Γ) ←attack vector from (8) or (10) based on ID\ntype\n3: y∗(k) ←y(k) + ak\n4: ˆx∗(k) ←F(y∗(k), ˆx(k −1))\n5: for i = 1 to Nmax do\n6:\nif | P g(ˆx∗(k))| ≤ζ and h(ˆx∗(k)) ≤0 and\nD(y∗(k), ˆx∗(k)) ≤γ ((5) or (6)) then\n7:\nbreak\n▷All constraints satisfied\n8:\nend if\n9:\nScale ak by (1 −β)\n▷Reduce attack magnitude\n10:\ny∗(k) ←y(k) + ak\n11:\nˆx∗(k) ←F(y∗(k), ˆx(k −1))\n12: end for\n13: if i = Nmax then\n14:\nak ←0\n▷Attack infeasible, revert to no attack\n15: end if\n16: return ak\nand recomputes the attacked measurements and state es-\ntimates. This process continues for a maximum of Nmax\niterations. If no feasible attack is found within these iter-\nations, the algorithm reverts to no attack.\nThe proposed algorithm is highly scalable, irrespective\nof the size and order of the NDAE model. A key advan-\ntage of the approach is that it does not require solving the\nNDAE model at each iteration, which is typically com-\nputationally expensive.\nInstead, it begins with attacks\ndesigned as upper bounds based on the intrusion detec-\ntion (ID) and state estimation (SE) parameters (referred\nto as SCUAs) and iteratively refines them. Since the initial\nSCUA attack vectors are computed in constant time, O(1),\nand the algorithm’s refinement process involves straight-\nforward scaling operations and constraint checks, its over-\nall computational complexity remains O(1) as well. This\nensures the algorithm’s practical for real-time implemen-\ntation even in systems with high-dimensional state spaces\nor complex dynamics.\nRegardless of the SCAA formulation the attacker\nchooses, it requires them to have comprehensive knowledge\nof both the intrusion detection methods (e.g., (8) or (10))\nand the NDAE system.\nSpecifically, the attacker must\npossess detailed information about the NDAE model’s al-\ngebraic and dynamic equations, operational limits, and the\nstructure of the SE process. Refer to Tab. 1 for the specific\nknowledge requirements for the proposed attack strategies.\nWhile these assumptions might be idealistic, they align\nwith the literature on constructing SAs against AC SE,\nand we leverage them not merely to formulate a perfect\nattack, but rather to explore the efficacy of NDAE mod-\nels in offering enhanced protection against tailored SAs.\nFigure 1: Single-line diagram of the IEEE 39 Bus Network.\nTable 1: Knowledge Requirements for SCUAs and SCAAs/ICAAs\nKnowledge Area\nSCUA\nSCAA/ICAA\nID Parameters\nDetection thresholds (α, τ, b) and resid-\nual covariance matrix (Σ)\nSE Parameters\nObserver gain matrix (L) and measure-\nment matrix (C)\nSystem Topology\nNot required\nY-Bus\nmatrix\n(Ybus) and knowl-\nedge of grid topol-\nogy\nOperational\nCon-\nstraints\nNot considered\nPower\nflow\nequa-\ntions\nand\nopera-\ntional limits within\nthe attack zone A\nSpecifically, we compare the impact of SCUAs and SCAAs\non NDAE-specific SE process to assess whether the inher-\nent coupling in these models reduces the attack space and\nincreases resilience—an aspect that has been overlooked in\nstudies using simplified models.\n4. Case Studies\n4.1. Simulation Setup and Parameters\nWe assess the feasibility and impact of the proposed\nSA strategies on the fourth-order NDAE model discussed\nin Section 2.1. We conduct case studies using the IEEE\n39-bus system. System parameters are obtained from the\nMATPOWER toolbox [41]. For the 39-bus system, follow-\ning [42], we install PMUs at buses 2, 6, 9, 10, 13, 14, 17,\n19, 20, 22, 23, 25, and 29 to ensure complete observability.\nThe attack scenarios are initiated at t = 15 sec, allow-\ning the system to reach steady-state conditions prior to\nthe attack. The simulations are run for a total of 30 sec\nto capture the short-term and long-term impacts of the\nattacks on the power system dynamics, SE process, and\nID performance.\nThe threshold of the χ2 detector is set according to\nα = 2P −1 \u0000 58\n2 , 1 −\n1\n1000\n\u0001\n= 99.175 For a CUSUM detec-\n8\n\n\ntor that uses a combined distance measure zk = r⊤Σ−1r,\nthe threshold is set to τ = 116.28 and the bias it set to\nb = 50.14 to establish the same false alarm rate of the\nχ2 detector.\nFor a CUSUM that uses a vectorized dis-\ntance measure, z = |r|, there are 58 thresholds and 58\nbias parameters, omitted for brevity. The parameters of\nthe ICAA strategy (Algorithm 1) are set to Nmax = 100,\nβ = 0.01, and ζ = 0.22. We discuss how the choice of\nNmax and β affects the attack impact, and how the choice\nof ζ for a system operator affects attack detection through\nconstraint validation.\nRenewables are integrated into the NDAE model by\nmodifying the algebraic power flow equations to account\nfor renewable disturbances. Specifically, the real and reac-\ntive power from renewables (PR and QR) are included as\ncomponents of the algebraic variables, q(t), which repre-\nsent system-wide power flows. The algebraic constraints of\nthe NDAE model are given by: 0 = Aaxa +Fafa(xd, xa)+\nBaq, where q = [P ⊤\nR , Q⊤\nR, P ⊤\nL , Q⊤\nL]⊤, and PR and QR rep-\nresent the power contributions from renewables. To incor-\nporate variability, we model renewable power injections as:\nq(t) = ¯q + ∆q(t), where ¯q represents the nominal steady-\nstate power injection and ∆q(t) captures time-varying dis-\nturbances, including stochastic variations. These distur-\nbances are modeled as Gaussian noise with zero mean and\nvariance proportional to the renewable generation capacity\n[20].\nFig. 1 illustrates the IEEE 39-bus system under study,\nhighlighting the buses targeted in the attack scenarios\n(10 and 11), marked in red.\nThe attack zone, cal-\nculated using Algorithm 2, is determined to be A =\n{5, 6, 10, 11, 12, 13, 31, 32}, as highlighted in the gray box.\nWhile these buses define the primary attack zone for most\nsimulations, alternative sets of target buses may be occa-\nsionally used, and specific changes are noted when appli-\ncable.\n4.2. Impact of SAs on State Estimation Accuracy\nWe compare the impact of the two proposed SA strate-\ngies (SCUAs and SCAAs) on the SE process in Fig. 2. For\nintrusion detection, a CUSUM detector is employed with a\ncombined distance metric for all residuals. The Root Mean\nSquare Error (RMSE) was chosen because of its sensitivity\nto both small and large deviations, making it particularly\nsuitable for capturing the impact of stealthy attacks.\nThe RMSE value under normal operation is 0.3178.\nSCUAs result in a significant increase in this value to\n1.2437.\nThis can also be observed in the deviations in\nboth algebraic and dynamic states. In contrast, SCAAs\ndemonstrate more subtle impacts on state estimates, with\nan RMSE of 0.36286. The frequency, voltage magnitude,\nand rotor angle estimates under SCAAs remain closer to\ntheir true values, with only minor fluctuations.\nThe NDAE model and NDAE-specific SE techniques al-\nlow us to observe how measurement manipulation imme-\ndiately propagates to dynamic generator state estimates.\nThis represents a significant advantage over studies focus-\ning solely on AC SE processes, where only steady-state\nestimates can be monitored.\nThe simultaneous simula-\ntion and estimation of dynamic and algebraic states in\nthe NDAE framework provides attackers with less oppor-\ntunity to manipulate measurements while ensuring that\nresulting state estimates satisfy algebraic constraints and\nevade intrusion detection. This increased difficulty for at-\ntackers likely stems from the interaction terms between\ndynamic and algebraic variables in equations (13a) and\n(13b). These interactions significantly limit the feasible at-\ntack space, as changes in one state variable have cascading\neffects on others that must be accounted for to maintain\nplausibility. This demonstrates how NDAE models inher-\nently provide greater cybersecurity resilience compared to\ndecoupled or simplified power system representations.\nIn Fig. 3, we further illustrate the impact of SCUAs\nand SCAAs on the state estimation process using three\nmetrics:\nthe Mean Absolute Error (MAE) over time\nand the absolute error dynamics for selected states un-\nder both attack strategies.\nThe first subplot highlights\nthat SCAA/ICAA consistently achieves lower MAE val-\nues compared to SCUA, reflecting the reduced impact of\nattacks when algebraic and operational constraints are sat-\nisfied. The second and third subplots display the absolute\nerror dynamics for six representative dynamic states of\ngenerator 1 under SCUA and SCAA/ICAA, respectively.\nThese plots emphasize how constraint-aware attacks limit\nthe attacker’s ability to manipulate the system, as evi-\ndenced by the smaller deviations in state estimates. This\nunderscores the fact that requiring the attacker to satisfy\nthe physical and algebraic constraints of the NDAE model\nsignificantly reduces their room for manipulation, ulti-\nmately enhancing the system’s resilience against stealthy\nattacks.\n4.3. Algebraic Constraint Violations in SCUAs\nFig.\n4 illustrates the number of algebraic constraint\nviolations over time for 50 different SCUA attempts. Con-\nstraint violations are consistently zero before the attack\ninitiation at t = 15 seconds, confirming the validity of the\nNDAE model and SE process under normal conditions.\nUpon attack initiation, there is an immediate spike in\nviolations, this sharp increase demonstrates the SCUA’s\ndisregard for NDAE model constraints. After the initial\nspike, the number of violations generally stabilizes for most\nattack attempts. This plateau suggests that while SCUAs\ncan maintain their intrusion detection evasion, they con-\nsistently violate the underlying physical constraints of the\nNDAE model. These results underscore the importance of\nincorporating NDAE model constraints in attack detection\nschemes.\nWhile SCUAs may evade traditional residual-\nbased detectors, their consistent violation of algebraic con-\nstraints provides an additional layer for identifying mali-\ncious activities in NDAE-modeled power systems.\n9\n\n\n\n\n\n\n !\"#$%!&'\"$()!*\n*+'\"$(($,-\nFigure 2: Comparison of power system states of generator 2 under\nSCUAs (left column) and SCAAs (right column). From top to bot-\ntom: (1) SE error norm, (2) Frequency, (3) Bus voltage magnitudes,\n(4) Generator rotor angle and (5) Generator active power outputs.\nSolid black lines represent true states, while red dashed lines show\nestimated states under attack.\n0\n5\n10\n15\n20\n25\n30\n0\n0.01\n0.02\n0.03\n0\n5\n10\n15\n20\n25\n30\n0\n0.02\n0.04\n0.06\n0\n5\n10\n15\n20\n25\n30\n0\n0.02\n0.04\n0.06\n20.2\n20.4\n20.6\n20.8\n21\n0\n1\n2\n10-3\nFigure 3: Comparison of the Mean Absolute Error (MAE) and Ab-\nsolute Error Dynamics for CUSUM SCUA and SCAA/ICAA.\nFigure 4: Algebraic constraint violations over time during 50 SCUA\nattempts using different targetted buses.\nFigure 5: Comparison between SCAA optimization and SCAA-ICAA\nin 100 differnet runs under chi-squared detection settings\n4.4. Comparison between SCAA strategies\nThe\nIterative\nConstraint-Aware\nAttack\nAlgorithm\n(ICAA) (defined in Algorithm 1) achieves results com-\nparable to the optimization-based SCAA approach (14),\nand in some cases, it even performs better. The key ad-\nvantage of ICAA lies in its simplicity. Instead of solving\na complex optimization problem, ICAA starts with the\nmaximum possible attack vector and iteratively refines it\nin small steps to find a vector that bypasses detection,\nsatisfies state estimation, and adheres to all physical con-\nstraints of the power system.\nAlgorithm 1 governs this\nprocess, focusing only on states in the attack zone defined\nby Algorithm 2, reducing computational overhead signifi-\ncantly. As shown in Fig. 5, results from 100 different runs\nusing chi-squared for ID (with varying measurement noise\nand initial conditions) indicate that the average MAE is\nalmost identical for both approaches. Given these simi-\nlar outcomes, we opt to use ICAA in the analysis of the\nattacks in the case studies, where SCAA/ICAA is con-\nsistently employed for evaluating attack strategies. This\nchoice highlights the practicality and computational effi-\nciency of ICAA as a robust tool for analyzing stealthy\nattacks on power systems.\n4.5. Computational Efficiency of SCAA-ICAA\nTab. 2 presents the relationship between the reduction\nfactor (β), simulation time, and RMSE for SCAA-ICAA\nattacks over a 30-second period.\nThese results demon-\nstrate the trade-off between attack impact and computa-\ntional efficiency in the ICAA approach.\nA β\nvalue of (0.1) results in faster computation\ntimes (0.9932 seconds) while achieving the highest RMSE\n(0.3571), indicating the most impactful attack vector. De-\ncreasing β to 0.01 increases computation time nearly three-\nfold (2.8884 seconds) while resulting in a slightly lower\n10\n\n\nTable 2: Effect of reduction factor (β) on simulation time and RMSE\nfor SCAA attacks over a 30-second period.\nReduction Factor (β)\nSimulation Time (s)\nRMSE\n0.1\n0.9932\n0.3571\n0.01\n2.8884\n0.3467\n0.001\n22.6213\n0.3467\n\n\n\n\n\n1\n \nFigure 6: Impact of algebraic constraint tolerance ζ on Root Mean\nSquare Error (RMSE) of state estimates under Stealthy Constraint-\nAware Attacks (SCAAs)\nRMSE (0.3467), suggesting a marginal decrease in attack\neffectiveness.\nFurther reduction of β to 0.001 leads to\na significant increase in computation time (22.6213 sec-\nonds) without any improvement in RMSE, which remains\nconstant at 0.3467. This indicates that a β value of 0.1\nprovides the optimal trade-off between attack impact and\ncomputational efficiency in our NDAE-modeled power sys-\ntem.\nThe lack of significant improvement in attack ef-\nfectiveness when reducing β below 0.1, despite the sub-\nstantial increase in computation time, suggests that more\nfine-grained iterations do not yield more potent attacks in\nthis scenario. This behavior likely stems from the inherent\nconstraints of the NDAE model, which limit the extent to\nwhich an attacker can manipulate state estimates while\nmaintaining plausibility and evading detection.\n4.6. Sensitivity of SCAAs to Algebraic Constraint Toler-\nance\nFig. 6 demonstrates the significant impact that the toler-\nance threshold ζ for algebraic constraints has on the effec-\ntiveness of SCAAs in NDAE power system models. The\nζ parameter represents the maximum allowed deviation\nfrom zero for the sum of algebraic constraints (g(x) = 0)\nin the NDAE model.\nThe results demonstrate a clear trade-off in NDAE-\nbased power system security. Tighter constraints (lower ζ)\nsignificantly limit an attacker’s ability to manipulate state\nestimates without detection, as evidenced by the lower\nRMSE at ζ = 0.22. However, overly strict constraints may\nlead to false alarms due to normal system fluctuations or\nmeasurement noise. Conversely, looser constraints (higher\nζ) reduce false positives but increase vulnerability to so-\nphisticated attacks, as shown by the sharp RMSE increase\nat ζ = 0.6.\nIt’s important to note that in our simulations, which in-\ncorporate loads, renewables, and various noise sources, we\n\n\n\n\n\n !\"#$%&'()\nFigure 7: Comparison of CUSUM and chi-squared detection under\nSCUAs and SCAAs\nobserve an average constraint violation of 0.22 under nor-\nmal conditions. This baseline deviation from zero stems\nfrom inherent system uncertainties and estimation limi-\ntations. Thus, the chosen ζ values are calibrated to ac-\ncount for these practical considerations, ensuring mean-\ningful constraint validation in operational settings.\n4.7. Comparison of CUSUM and Chi-squared Detectors\nFig. 7 compares the RMSE values for state estimates un-\nder SCUA and SCAA-ICAA strategies, considering both\nCUSUM and chi-squared detectors.\nUnder normal con-\nditions with no attack, both detectors show similar low\nRMSE values (approximately 0.3), validating the SE accu-\nracy in the absence of attacks. For SCUAs, the CUSUM\ndetector shows an RMSE increase to about 1.3, indicat-\ning substantial state estimate deviation, while the chi-\nsquared detector’s RMSE rises to approximately 1.56, sug-\ngesting even greater vulnerability to SCUAs. In the case\nof SCAAs, the CUSUM detector shows a moderate RMSE\nincrease to about 0.4, demonstrating the effectiveness of\nconstraint-aware attacks in limiting detectable impacts,\nwhile the chi-squared detector’s RMSE reaches about 1.3,\nindicating higher susceptibility to SCAAs compared to\nCUSUM.\nThese results highlight several key points. The CUSUM\ndetector generally outperforms the chi-squared detector\nin limiting the impact of both SCUA and SCAA strate-\ngies.\nThis suggests that the CUSUM’s ability to track\ncumulative changes over time provides an advantage in\ndetecting subtle, persistent attacks in NDAE systems.\nSCAAs consistently produce lower RMSE values compared\nto SCUAs for both detector types. This demonstrates how\nincorporating NDAE model constraints significantly re-\nstricts the attacker’s ability to manipulate state estimates\nwhile maintaining stealthiness. The chi-squared detector’s\nhigher RMSE values, especially for SCAAs, indicate its\nlimitations in capturing the complex dynamics of NDAE\nsystems. These findings emphasize the need for advanced,\nNDAE-specific detection methods that leverage both dy-\nnamic residual analysis and constraint validation to en-\nhance power system cybersecurity.\n11\n\n\n\n !\"#\"$%\n&\n'(\n()\nFigure 8: Comparison of RMSE Under SCAA for Aggregated vs.\nIndividual CUSUM Detection\n4.8. Aggregated vs. Individual CUSUM Detection\nFig.\n8 presents a comparison of RMSE values for\nstate estimation under SCAAs using aggregated (single\nscalar distance measure) and individual (vectorized dis-\ntance measure) CUSUM detection, across different num-\nbers of compromised measurements (1, 25, and 50). For a\nsingle compromised measurement, both detection methods\nproduce similar RMSE values. However, as the number of\ncompromised measurements increases, notable differences\nemerge.\nWhen using the aggregated CUSUM approach, RMSE\nprogressively rises as more measurements are compro-\nmised, reaching a value of approximately 2 when 50 mea-\nsurements are involved. This suggests that by aggregating\nresiduals, attackers can spread the impact across multi-\nple measurements, keeping the overall detection statistic\nbelow the threshold. In contrast, the individual CUSUM\napproach shows a decrease in RMSE as the number of com-\npromised measurements increases, with RMSE dropping to\naround 0.5 for 50 measurements. This indicates that mon-\nitoring each measurement individually makes it harder for\nattackers to simultaneously meet all individual thresholds.\nThis represents a trade-off in CUSUM detector design for\nNDAE systems. Aggregated approaches, though compu-\ntationally efficient, may be more susceptible to distributed\nattacks. On the other hand, individual monitoring offers\nstronger resistance against large-scale attacks but comes\nwith increased computational demands and a higher like-\nlihood of false alarms.\n4.9. Addressing the Research Questions\nThe case studies and analyses presented in this section\naddress the three research questions posed in the introduc-\ntion.\n• A1. Impact of NDAE models on SA formulation, detec-\ntion, and impact: NDAE models significantly constrain\nthe feasible attack space due to the coupling between\ndynamic and algebraic states.\nSCUAs, while evad-\ning detection, consistently violate algebraic constraints,\nmaking them detectable through constraint validation.\nSCAAs, respecting these constraints, have a more lim-\nited impact on state estimates. This demonstrates how\nNDAE models provide inherent advantages over sim-\nplified representations by enforcing physical consistency\nbetween dynamic and steady-state behaviors.\n• A2.\nEffectiveness of intrusion detectors for NDAE-\nmodeled systems:\nCUSUM detectors outperform chi-\nsquared detectors in mitigating both SCUA and SCAA\nimpacts, likely due to their ability to track cumulative\nchanges in the coupled dynamic-algebraic state space.\nHowever, both detectors show limitations in fully cap-\nturing NDAE dynamics, particularly when attacks tar-\nget multiple measurements simultaneously. This high-\nlights the need for NDAE-specific detection methods\nthat leverage both temporal residual analysis and in-\nstantaneous constraint validation.\n• A3.\nPerformance of NDAE-specific state monitoring\nalgorithms:\nJoint state estimation, coupled with dy-\nnamic intrusion detection, demonstrates improved re-\nsilience against tailored SAs by simultaneously con-\nstraining both dynamic and algebraic state estimates.\nThe effectiveness of these methods is highly sensitive to\nparameter tuning, particularly the algebraic constraint\ntolerance. Tighter constraints significantly limit an at-\ntacker’s ability to manipulate state estimates without\ndetection, but may increase false positives due to nor-\nmal system fluctuations or measurement noise.\n5. Paper Limitations and Future Work\nThis study presents significant advancements in the un-\nderstanding of stealthy attacks on NDAE-modeled power\nsystems, yet it has several limitations that warrant fur-\nther investigation. First, the proposed attack strategies\nare developed under the assumption that attackers pos-\nsess complete knowledge of the system topology, model\nparameters, and intrusion detection mechanisms. While\nsuch assumptions are standard in existing literature and\nallow for a thorough analysis of worst-case scenarios, real-\nworld attackers may operate with partial or incomplete\ninformation. Future research should explore how incom-\nplete knowledge affects the design and efficacy of stealthy\nattacks.\nSecond, the case studies in this paper are limited to the\nIEEE 39-bus system using a fourth-order generator model.\nWhile this benchmark system effectively demonstrates the\nfeasibility and impact of the proposed methods, it repre-\nsents a simplified view of real-world power systems. In fu-\nture work, the proposed methodologies could be extended\n12\n\n\nto larger systems, such as the IEEE 118-bus or 300-bus\nsystems, and incorporate higher-order generator models\nthat capture additional dynamic features, including tur-\nbine and governor dynamics. Additionally, future studies\ncould include advanced renewable energy models to reflect\nthe increasing penetration of variable generation sources\nsuch as wind and solar power.\nDespite these limitations, it is important to note that the\nscalability of the proposed methods has been rigorously\nanalyzed.\nThe Iterative Constraint-Aware Attack Algo-\nrithm (ICAA) is designed to maintain computational ef-\nficiency, with complexity scaling linearly with the size of\nthe attack zone, making it applicable to larger and more\ncomplex power systems. This ensures that the framework\nremains practical for real-world applications, even as the\nsize and complexity of the system grow.\nFinally, this work highlights the resilience benefits pro-\nvided by the coupling of dynamic and algebraic states\nin NDAE models.\nIt also underscores the need for ad-\nvanced detection methods tailored to the unique dynamics\nof NDAE systems. Future research should focus on inte-\ngrating the proposed methods with emerging intrusion de-\ntection technologies, assessing their performance under di-\nverse operational scenarios, and further enhancing the ro-\nbustness of NDAE-based cybersecurity solutions for smart\ngrids.\n6. Conclusions\nThis study presents an analysis of stealthy false data in-\njection attacks on nonlinear differential algebraic equation\n(NDAE) models of power networks. Case studies demon-\nstrate that NDAE models, by capturing the coupling be-\ntween dynamic and algebraic states, inherently provide\ngreater resistance to tailored cyberattacks compared to\nsimplified power system representations.\nThe use of NDAE models and NDAE-specific state\nmonitoring techniques allows for a more holistic view of\nstealthy attack impacts by revealing how measurement\nmanipulations propagate through both algebraic steady-\nstate power flow variables and dynamic generator states.\nThis comprehensive approach offers insights that may be\noverlooked in studies focusing solely on steady-state AC\npower flow or isolated dynamic state estimation processes.\nOur results highlight the importance of incorporating\nNDAE model constraints in attack detection schemes. The\nconsistent violation of algebraic constraints by certain at-\ntack strategies provides an additional layer for identify-\ning malicious activities, even when traditional residual-\nbased detectors fail.\nThe comparison between CUSUM\nand chi-squared detectors underscores the superiority of\ndynamic detection methods in NDAE-modeled systems,\nthough both show limitations in fully capturing the sys-\ntem’s complex dynamics.\nThe proposed attack strategies focus on specific vul-\nnerabilities within particular intrusion detectors, which\nmay reduce their generalizability. However, our goal was\nnot to develop universally applicable strategies but to\ndemonstrate how NDAE models inherently offer stronger\nresilience compared to simplified system representations.\nAdditionally, the assumption of comprehensive system\nknowledge for attackers may not hold in real-world sce-\nnarios. Future work should consider the impact of partial\ninformation on the effectiveness of such attacks.\nWhile\nNDAE models provide enhanced accuracy in capturing\nsystem dynamics, they come with increased computational\ncomplexity. Research into more efficient numerical meth-\nods for real-time NDAE-based security assessment would\nbe an important next step.\nIn conclusion, this work demonstrates the enhanced cy-\nbersecurity resilience offered by NDAE models in power\nsystems.\nIt underscores the importance of using com-\nprehensive system representations in security analysis and\nlays the groundwork for developing more robust, NDAE-\nspecific detection and mitigation strategies for future\nsmart grids.\nReferences\n[1] S. Sridhar, A. Hahn, and M. Govindarasu, “Cyber-physical\nsystem security for the electric power grid,” Proceedings of\nthe IEEE, vol. 100, no. 1, pp. 210–224, jan 2012. [Online].\nAvailable: http://ieeexplore.ieee.org/document/6032699/\n[2] G. Liang, J. Zhao, F. Luo, S. R. Weller, and Z. Y. Dong, “A\nReview of False Data Injection Attacks Against Modern Power\nSystems,” IEEE Transactions on Smart Grid, vol. 8, no. 4, pp.\n1630–1638, 2017.\n[3] H. T. Reda, A. Anwar, A. N. Mahmood, and Z. Tari, “A Tax-\nonomy of Cyber Defence Strategies Against False Data Attacks\nin Smart Grids,” ACM Computing Surveys, vol. 55, no. 14 S,\n2023.\n[4] L. Jia, R. J. Thomas, and L. Tong, “On the nonlinearity effects\non malicious data attack on power system,” IEEE Power and\nEnergy Society General Meeting, 2012.\n[5] J. Lin, W. Yu, X. Yang, G. Xu, and W. Zhao, “On false data\ninjection attacks against distributed energy routing in smart\ngrid,” Proceedings - 2012 IEEE/ACM 3rd International Con-\nference on Cyber-Physical Systems, ICCPS 2012, pp. 183–192,\n2012.\n[6] T. T. Kim and H. V. Poor, “Strategic protection against data\ninjection attacks on power grids,” IEEE Transactions on Smart\nGrid, vol. 2, no. 2, pp. 326–333, 2011.\n[7] O. Kosut, L. Jia, R. J. Thomas, and L. Tong, “Malicious data\nattacks on the smart grid,” IEEE Transactions on Smart Grid,\nvol. 2, no. 4, pp. 645–658, 2011.\n[8] M. A. Rahman and H. Mohsenian-Rad, “False data injec-\ntion attacks with incomplete information against smart power\ngrids,” Proceedings - IEEE Global Communications Conference,\nGLOBECOM, pp. 3153–3158, 2012.\n[9] R. Nawaz, R. Akhtar, M. A. Shahid, I. M. Qureshi, and M. H.\nMahmood, “Machine learning based false data injection in smart\ngrid,” International Journal of Electrical Power & Energy Sys-\ntems, vol. 130, p. 106819, 2021.\n[10] J. Kim, L. Tong, and R. J. Thomas, “Subspace methods for data\nattack on state estimation:\nA data driven approach,” IEEE\nTransactions on Signal Processing, vol. 63, no. 5, pp. 1102–\n1114, 2015.\n[11] Y. Chen, S. Huang, F. Liu, Z. Wang, and X. Sun, “Evaluation\nof reinforcement learning-based false data injection attack to\nautomatic voltage control,” IEEE Transactions on Smart Grid,\nvol. 10, no. 2, pp. 2158–2169, 2019.\n[12] Z. Guo,\nD. Shi,\nK. H. Johansson,\nand L. Shi,\n“Worst-\ncase stealthy innovation-based linear attack on remote state\n13\n\n\nestimation,” Automatica, vol. 89, pp. 117–124, 2018. [Online].\nAvailable: https://doi.org/10.1016/j.automatica.2017.11.018\n[13] T. Y. Zhang and D. Ye, “False data injection attacks with\ncomplete\nstealthiness\nin\ncyber–physical\nsystems:\nA\nself-\ngenerated approach,” Automatica, vol. 120, p. 109117, 2020.\n[Online]. Available: https://doi.org/10.1016/j.automatica.2020.\n109117\n[14] R. Quinonez, J. Giraldo, L. Salazar, E. Bauman, A. Carde-\nnas, and Z. Lin, “SAVIOR: Securing autonomous vehicles with\nrobust physical invariants,” Proceedings of the 29th USENIX\nSecurity Symposium, pp. 895–912, 2020.\n[15] D. I. Urbina, J. Giraldo, A. A. Cardenas, N. O. Tippenhauer,\nJ. Valente, M. Faisal, J. Ruths, R. Candell, and H. Sandberg,\n“Limiting the impact of stealthy attacks on Industrial Control\nSystems,” Proceedings of the ACM Conference on Computer\nand Communications Security, vol. 24-28-Octo, no. c, pp. 1092–\n1105, 2016.\n[16] P. W. Sauer, M. A. Pai, and J. H. Chow, Power system dynam-\nics and stability: with synchrophasor measurement and power\nsystem toolbox.\nJohn Wiley & Sons, 2017.\n[17] T.\nGroß,\nS.\nTrenn,\nand\nA.\nWirsen,\n“Solvability\nand\nstability\nof\na\npower\nsystem\nDAE\nmodel,”\nSystems\nand\nControl Letters, vol. 97, pp. 12–17, 2016. [Online]. Available:\nhttp://dx.doi.org/10.1016/j.sysconle.2016.08.003\n[18] S.\nA.\nNugroho,\nA.\nF.\nTaha,\nN.\nGatsis,\nand\nJ.\nZhao,\n“Observers\nfor\nDifferential\nAlgebraic\nEquation\nModels\nof\nPower Networks: Jointly Estimating Dynamic and Algebraic\nStates,” IEEE Transactions on Control of Network Systems,\nvol. 9, no. 3, pp. 1531–1543, sep 2022. [Online]. Available:\nhttps://ieeexplore.ieee.org/document/9735348/\n[19] M. H. Kazma and A. F. Taha, “Revisiting the Optimal PMU\nPlacement Problem in Multi-Machine Power Networks,” 2023.\n[Online]. Available: http://arxiv.org/abs/2306.13584\n[20] M. Nadeem, S. A. Nugroho, and A. F. Taha, “Dynamic State\nEstimation of Nonlinear Differential Algebraic Equation Models\nof Power Networks,” IEEE Transactions on Power Systems,\nvol. 38, no. 3, pp. 2539–2552, 2023.\n[21] Z. Ding, A. Qiu, and X. Li, “A descriptor system approach for\nfalse data injection attacks toward power system,” Proceedings\nof 2019 11th CAA Symposium on Fault Detection, Supervision,\nand Safety for Technical Processes, SAFEPROCESS 2019, pp.\n799–804, 2019.\n[22] ——, “A descriptor system approach for false data injection\nattacks toward power system,” in 2019 CAA Symposium on\nFault Detection, Supervision and Safety for Technical Processes\n(SAFEPROCESS), 2019, pp. 799–804.\n[23] A. Y. Lu and G. H. Yang, “Detection and Identification of\nSparse Sensor Attacks in Cyber-Physical Systems with Side In-\nformation,” IEEE Transactions on Automatic Control, vol. 68,\nno. 9, pp. 5349–5364, 2023.\n[24] K. D. Lu and Z. G. Wu, “Multi-Objective False Data Injection\nAttacks of Cyber-Physical Power Systems,” IEEE Transactions\non Circuits and Systems II: Express Briefs, vol. 69, no. 9, pp.\n3924–3928, 2022.\n[25] A. Mahi-al rashid, F. Hossain, A. Anwar, and S. Azam, “False\ndata injection attack detection in smart grid using energy\nconsumption forecasting,”\nEnergies, vol. 15, no. 13, 2022.\n[Online]. Available: https://www.mdpi.com/1996-1073/15/13/\n4877\n[26] G. Hug and J. A. Giampapa, “Vulnerability assessment of AC\nstate estimation with respect to false data injection cyber-\nattacks,” IEEE Transactions on Smart Grid, vol. 3, no. 3, pp.\n1362–1370, 2012.\n[27] J. Liang, L. Sankar, and O. Kosut, “Vulnerability analysis\nand consequences of false data injection attack on power sys-\ntem state estimation,” IEEE Transactions on Power Systems,\nvol. 31, no. 5, pp. 3864–3872, 2016.\n[28] S. Jin,\n“False data injection attack against smart power\ngrid\nbased\non\nincomplete\nnetwork\ninformation,”\nElectric\nPower Systems Research, vol. 230, p. 110294, 2024. [Online].\nAvailable:\nhttps://www.sciencedirect.com/science/article/pii/\nS0378779624001822\n[29] M. A. Rahman and H. Mohsenian-Rad, “False data injection at-\ntacks against nonlinear state estimation in smart power grids,”\nIEEE Power and Energy Society General Meeting, pp. 1–5,\n2013.\n[30] C. Liu, H. Liang, and T. Chen, “Network Parameter Coordi-\nnated False Data Injection Attacks against Power System AC\nState Estimation,” IEEE Transactions on Smart Grid, vol. 12,\nno. 2, pp. 1626–1639, 2021.\n[31] F. Mohammadi and R. Rashidzadeh, “Impact of stealthy false\ndata injection attacks on power flow of power transmission\nlines—a mathematical verification,” International Journal of\nElectrical Power & Energy Systems, vol. 142, p. 108293, 2022.\n[32] M. Göl and A. Abur, “LAV based robust state estimation for\nsystems measured by PMUs,” IEEE Transactions on Smart\nGrid, vol. 5, no. 4, pp. 1808–1814, 2014.\n[33] A. Rouhani and A. Abur, “Linear phasor estimator assisted dy-\nnamic state estimation,” IEEE Transactions on Smart Grid,\nvol. 9, no. 1, pp. 211–219, 2018.\n[34] F. Gustafsson, Adaptive Filtering and Change Detection, 2001,\nvol. 6.\n[35] R. L. Plackett, “Karl Pearson and the Chi-Squared Test,” In-\nternational Statistical Review / Revue Internationale de Statis-\ntique, vol. 51, no. 1, p. 59, 1983.\n[36] Y. Huang, J. Tang, Y. Cheng, H. Li, K. A. Campbell, and\nZ. Han, “Real-time detection of false data injection in smart grid\nnetworks: An adaptive CUSUM method and analysis,” IEEE\nSystems Journal, vol. 10, no. 2, pp. 532–543, 2016.\n[37] Y. Huang, H. Li, K. A. Campbell, and Z. Han, “Defending\nfalse data injection attack on smart grid network using adaptive\nCUSUM test,” 2011 45th Annual Conference on Information\nSciences and Systems, CISS 2011, pp. 1–6, 2011.\n[38] M. Gol and A. Abur, “A modified Chi-Squares test for improved\nbad data detection,” 2015 IEEE Eindhoven PowerTech, Pow-\nerTech 2015, no. 1, pp. 1–5, 2015.\n[39] C. Murguia and J. Ruths, “CUSUM and Chi-squared attack\ndetection of compromised sensors,” 2016 IEEE Conference on\nControl Applications, CCA 2016, pp. 474–480, 2016.\n[40] ——, “CUSUM and Chi-squared attack detection of compro-\nmised sensors,” 2016 IEEE Conference on Control Applica-\ntions, CCA 2016, pp. 474–480, 2016.\n[41] R. D. Zimmerman, C. E. Murillo-Sánchez, and R. J. Thomas,\n“MATPOWER: Steady-state operations, planning, and analysis\ntools for power systems research and education,” IEEE Trans-\nactions on Power Systems, vol. 26, no. 1, pp. 12–19, 2011.\n[42] B. Rimal, N. Paudel, and A. Bhattarai, “Optimal Placement\nof Phasor Measurement Units Ensuring Power System Observ-\nability,” International Conference on Software, Knowledge In-\nformation, Industrial Management and Applications, SKIMA,\nvol. 2022-Decem, no. 3, pp. 7–12, 2022.\n[43] P. S. Kundur, “Power system dynamics and stability,” Power\nSystem Stability and Control, Third Edition, pp. II–1–II–3,\n2017.\n[44] S. A. Nugroho, A. F. Taha, N. Gatsis, and J. Zhao, “Ob-\nservers for Differential Algebraic Equation Models of Power\nNetworks: Jointly Estimating Dynamic and Algebraic States,”\nIEEE Transactions on Control of Network Systems, vol. 9,\nno. 3, pp. 1531–1543, 2022.\nAppendix A. NDAE Model Full Description\nWe consider the fourth-order model of a synchronous\ngenerator. The dynamics of a synchronous generator i ∈G\ncan be represented through: (i) the following set of ODEs\n[43] that model generator physics, given as follows:\n˙δi = ωi −ω0\n(A.1a)\nMi ˙ωi = TMi −PGi −Di(ωi −ω0)\n(A.1b)\n14\n\n\nT ′\nd0i ˙\nE′\nqi = −xdi\nx′\ndi\nE′\nqi + xdi −x′\ndi\nx′\ndi\nvi cos(δi −θi) + Efdi\n(A.1c)\nT ′\nq0i ˙\nE′\ndi = −E′\ndi + xqi −x′\nqi\nxqi\nvi sin(δi −θi),\n(A.1d)\nand (ii) the algebraic constraints:\nPGi =\n1\nx′\ndi\nE′\nqivi sin(δi −θi) −xqi −x′\ndi\n2x′\ndixqi v2\ni sin(2(δi −θi))\n(A.2a)\nQGi =\n1\nx′\ndi\nE′\nqivi cos(δi −θi) −x′\ndi + xqi\n2x′\ndixqi v2\ni\n−xqi −x′\ndi\n2x′\ndixqi v2\ni cos(2(δi −θi))\n(A.2b)\nPGi + PRi −PLi =\nN\nX\nj=1\nvivj(Gij cos θij + Bij sin θij)\n(A.2c)\nQGi + QRi −QLi =\nN\nX\nj=1\nvivj(Gij cos θij −Bij sin θij),\n(A.2d)\nthat consist of the active and reactive power flow equa-\ntions, shown in (A.2a) and (A.2b), and the power balance\nequations among generators, loads and renewables, shown\nin (A.2c) and (A.2d) [43]. The system is characterized by\ndynamic states xd ∈Rnd, including rotor angles δ, an-\ngular velocities ω, transient voltages on the q-axis E′\nqi,\nand transient voltages on the d-axis E′\ndi, where nd is the\noverall number of dynamic states (equals 4ng, where ng is\nthe number of generators in the system). The algebraic\nstates xa ∈Rna comprise generated active and reactive\npowers PG and QG, voltage magnitudes v, and angles θ.\nParameter na defines the number of algebraic states in the\nsystem. Inputs and demands are encapsulated in vectors\nu ∈Rnu, representing mechanical torques and field volt-\nage inputs, and w ∈Rnw, denoting active and reactive\npower demands, with nu and nw defining the number of\ncontrol input and uncertain variables. The NDAE model\nis succinctly represented as:\nGen. Dynamics: ˙xd = Adxd + fd(xd, xa) + Bdu\n(A.3a)\nFlow Constraints: 0 = Aaxa + fa(xd, xa) + Baw.\n(A.3b)\nThe functions fa : Rnd × Rna →Rnfa, and fd : Rnd ×\nRna →Rnfd describe the nonlinearities in the algebraic\nand dynamic states respectively. The state-space matrices\nAa ∈Rna×na, Ba ∈Rna×nq, Ad ∈Rnd×nd, Bd ∈Rnd×nu\nare all detailed in [44]. The model can be more concisely\nexpressed in this standard nonlinear DAE form:\nE ˙x = Ax + f(x) + Buu + Bww,\n(A.4)\nwhere the complete state vector x combines both dynamic\nand algebraic states. This form is facilitated by:\nE =\n\u0014I\nO\nO\nO\n\u0015\n, A =\n\u0014Ad\nO\nO\nAa\n\u0015\n, f(x) =\n\u0014fd(x)\nfa(x)\n\u0015\n,\nBu =\n\u0002Bd O\u0003⊤, Bw =\n\u0002O Ba\n\u0003⊤,\nwhere matrix E is singular, thereby encoding the algebraic\nflow constraints.\nAppendix B. Attack Zone Algorithm\nAlgorithm 2 Attack Zone Definition\nRequire: Target buses T , network admittance matrix Y ,\nbus classifications, depth limit dmax\nEnsure: Attack zone A, required state indices S\n1: Classify buses into zero-injection Z and non-zero in-\njection N sets\n2: Initialize A ←T\n3: Initialize queue Q ←T , visited V ←∅, depth d ←0\n4: while Q ̸= ∅and d < dmax do\n5:\nQnext ←∅\n6:\nfor each bus i ∈Q do\n7:\nFind connected buses Ci ←j : |Yij| > ϵ\n8:\nCi ←Ci \\ V\n9:\nfor each bus j ∈Ci do\n10:\nif j ∈Z then\n11:\nA ←A ∪j\n12:\nQnext ←Qnext ∪j\n13:\nelse if j ∈N then\n14:\nA ←A ∪j\n15:\nend if\n16:\nend for\n17:\nV ←V ∪i\n18:\nend for\n19:\nQ ←Qnext\n20:\nd ←d + 1\n21: end while\n22: Find all connected buses B ←j : ∃i ∈A, |Yij| > ϵ\n23: Initialize S ←∅\n24: for each generator bus i ∈G do\n25:\nif i ∈A ∪B then\n26:\nAdd generator states to S\n27:\nAdd bus voltage and angle states to S\n28:\nend if\n29: end for\n30: for each non-generator bus i ∈A ∪B do\n31:\nAdd bus voltage and angle states to S\n32: end for\n33: return Attack zone A, state indices S\n15\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21146v1.pdf",
    "total_pages": 15,
    "title": "Unmasking Stealthy Attacks on Nonlinear DAE Models of Power Grids",
    "authors": [
      "Abdallah Alalem Albustami",
      "Ahmad F. Taha",
      "Elias Bou-Harb"
    ],
    "abstract": "Smart grids are inherently susceptible to various types of malicious\ncyberattacks that have all been documented in the recent literature.\nTraditional cybersecurity research on power systems often utilizes simplified\nmodels that fail to capture the interactions between dynamic and steady-state\nbehaviors, potentially underestimating the impact of cyber threats. This paper\npresents the first attempt to design and assess stealthy false data injection\nattacks (FDIAs) against nonlinear differential algebraic equation (NDAE) models\nof power networks. NDAE models, favored in industry for their ability to\naccurately capture both dynamic and steady-state behaviors, provide a more\naccurate representation of power system behavior by coupling dynamic and\nalgebraic states. We propose novel FDIA strategies that simultaneously evade\nboth dynamic and static intrusion detection systems while respecting the\nalgebraic power flow and operational constraints inherent in NDAE models. We\ndemonstrate how the coupling between dynamic and algebraic states in NDAE\nmodels significantly restricts the attacker's ability to manipulate state\nestimates while maintaining stealthiness. This highlights the importance of\nusing more comprehensive power system models in cybersecurity analysis and\nreveals potential vulnerabilities that may be overlooked in simplified\nrepresentations. The proposed attack strategies are validated through\nsimulations on the IEEE 39-bus system.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}