{
  "id": "arxiv_2502.21253v1",
  "text": "1 \n \nA novel boundary integrated neural networks for in plane fracture \nmechanics analysis of elastic and piezoelectric materials \nPeijun Zhang1*, Yan Gu2*, Okyay Altay1, Chuanzeng Zhang1, 2 \n1Department of Civil Engineering, University of Siegen, Paul-Bonatz-Str. 9-11, D-57076 Siegen, Germany \n2Faculty of Mechanical Engineering and Mechanics, Ningbo University, Ningbo 315211, PR China \n \nAbstract \nIn this study, we propose a novel approach, termed boundary integrated neural networks (BINNs), \nfor analyzing in-plane crack problems within the framework of linear elastic fracture mechanics. The \nproposed approach integrates artificial neural networks (ANNs) with classical boundary integral \nequations (BIEs), enabling an efficient and accurate evaluation of partial differential equations (PDEs) \nassociated with fracture mechanics. Additionally, novel special ANN-based crack-tip elements, the \nSpecial crack-tip Neural Networks(SPNNs) are developed to improve the modeling of displacement \nand stress fields in regions near crack tips. These specialized elements integrate the asymptotic \ncharacteristics of fracture mechanics into the neural network framework, ensuring enhanced accuracy \nin capturing the intricate singularities and steep gradients near the crack tips. Compared to \nconventional simulation tools in fracture mechanics, the present method offers several distinct \nadvantages. First, by embedding higher-order fracture mechanics principles into the neural networks, \nthe method achieves a more accurate and reliable representation of the near-tip fields, even when \nusing relatively large crack-tip elements. Second, the SPNNs, which incorporates information about \nvarying near-tip singularity orders, improve the method’s versatility in solving problems involving \ncomplex and diverse crack-tips geometries. Moreover, the method demonstrates excellent \ncomputational efficiency due to the dimensionality reduction achieved by employing BIEs. \n \n Corresponding Authors: Yan Gu (guyan1913@163.com), Chuanzeng Zhang (c.zhang@uni-siegen.de) \n\n\n2 \n \nNumerical experiments confirm that the proposed framework serves as a reliable, robust, and accurate \ntool for addressing fracture mechanics problems, offering substantial advantages over conventional \nnumerical approaches.  \nKeywords: Artificial Neural Networks; Boundary Integrated Neural Networks; Linear Piezoelectric \nFracture Mechanics; Boundary Integral Equations; Coupled Mechanical-Electrical Problems. \nNomenclature \nANNs                  Artificial Neural Networks \nBEM \n \n \nBoundary Element Method \nBINNs  \n \nBoundary Integrated Neural Networks \nBIEs \n \n \nBoundary Integral Equations \nCOD \n \n \nCrack Opening Displacement \nCR  \n \n \nSIFs estimation methods proposed by Cotterell and Rice [1] \nCRT \n \n \nSIFs estimation methods, including T-stress terms, proposed by He et al. [2]  \nFEM \n \n \nFinite Element Method \nSIFs \n \n \nStress Intensity Factors \nEDIFs  \n \nElectric Displacement Intensity Factors \nN-SIFs  \n \nNotch Stress Intensity Factors \nPINNs  \n \nPhysics-Informed Neural Networks \nSPNNs  \n \nSpecial crack-tip Neural Networks \nPDEs \n \n \nPartial Differential Equations \nI\nK   \n \n \nMode I SIFs \nII\nK   \n \n \nMode II SIFs \nIV\nK\n  \n \n \nEDIFs \n \n \n \n \n\n\n3 \n \n1 \nIntroduction \nFracture mechanics analysis presents a significant challenge within computational mechanics due to \nthe inherent complexities introduced by cracks. The presence of cracks gives rise to singularities in \nthe stress field, where stress values theoretically approach infinity at the crack tips. To address this \nchallenge, various extended or generalized Finite Element Methods (FEM) have been developed. \nThese methods often incorporate specialized crack-tip elements, such as quarter-point elements [3-\n5], or use enriched elements [6-15] that embed the asymptotic crack-tip field into the finite element \nformulation. Such approaches have demonstrated high accuracy in linear elastic fracture mechanics \nanalysis. \nThe Boundary Element Method (BEM) offers an attractive alternative to FEM for fracture mechanics \nanalysis due to its boundary-only discretization and semi-analytical principles. Unlike FEM, which \nrequires volumetric meshing, BEM reduces the dimensionality of the problem, thereby simplifying \nthe modeling process. Over the past decades, researchers have extensively studied the application of \nBEM to crack problems, exploring both conventional formulations and those enhanced with various \nenrichment techniques [16-23]. One notable advancement in BEM involves the use of specialized \ncrack-tip elements [24-26]. These elements replace traditional polynomial shape functions with \ncrack-tip-specific shape functions, enabling accurate representation of the local asymptotic behavior \nnear the crack tips. This enhancement significantly improves the accuracy of Stress Intensity Factor \n(SIF) calculations, a critical parameter in fracture mechanics that governs crack growth and structural \nintegrity. \nThe introduction of piezoelectric materials into fracture mechanics analysis adds another layer of \ncomplexity to the problem, as these materials exhibit coupled mechanical and electrical behaviors, \nleading to a system of coupled partial differential equations [16, 27-30]. In addition, significant \nchallenges remain in the analysis of piezoelectric fracture mechanics. The process of mesh generation \n\n\n4 \n \nand re-meshing required for simulating crack propagation, particularly in three-dimensional (3D) \npiezoelectric problems, is still labor-intensive and computationally expensive. Moreover, the \nhandling of complex crack geometries in piezoelectric materials further complicates the analysis, \nrequiring the development of specialized numerical techniques and an increase in computational \nresources [31]. The accurate prediction of fracture and failure in piezoelectric materials thus requires \nthe continued development of efficient and robust numerical methods capable of dealing with the \ncoupled nature of electrical and mechanical fields in the presence of cracks. \nTo overcome these challenges, recent advancements in computational mechanics have introduced \nhybrid methods that combine traditional numerical approaches with machine learning techniques, \nsuch as Physics-Informed Neural Networks (PINNs) [32-37] and its variational types [38-46]. PINNs \nseamlessly integrate information from both physical laws and measurement data by embedding the \nunderlying PDEs and their associated boundary/initial conditions into the loss functions of a neural \nnetwork. The unknown parameters of the network are optimized by minimizing these loss functions \nusing advanced optimization algorithms. Within the framework of computational fracture mechanics, \nPINNs have shown great promise in solving complex fracture problems. For instance, Goswami et al. \n[47] proposed a modified PINNs framework that minimizes the system's variational energy to model \nbrittle fracture using phase-field methods. Similarly, Gu et al. [48, 49] introduced enriched PINNs, \nwhich incorporate crack-tip asymptotic functions to improve the accuracy of SIFs predictions in 2D \nfracture mechanics analysis. Wei et al. [50] developed a physics-informed deep learning model that \ncombines a neural network with the lattice particle method (LPM) to efficiently predict material \nfracture patterns under arbitrary microstructures and loading conditions. Furthermore, He et al. [51] \nproposed a PINNs-based framework incorporating sensitive features and life prediction models, \nenhancing both the training process and the predictive accuracy for multiaxial fatigue life prediction. \nChen et al. [52] applied the enhanced PINNs to simulate the crack propagation and predict the fatigue \n\n\n5 \n \nlife. By integrating prior knowledge into machine learning frameworks, these methods provide a \nrobust and efficient alternative to conventional computational approaches. \nRecently, a novel machine learning framework, known as boundary integrated neural networks \n(BINNs) [53-56], has been introduced to effectively solve boundary value problems. BINNs combine \nthe capabilities of artificial neural networks with the well-established BEM to efficiently solve PDEs. \nA distinctive feature of BINNs is its ability to integrate prior knowledge of BIEs into the neural \nnetwork framework. By leveraging the boundary-only discretization provided by BEM, BINNs \nreduce the dimensionality of the problem, resulting in enhanced computational efficiency and \naccuracy. The main idea behind the method can be summarized as follows: First, the original PDEs \nare reformulated into BIEs by utilizing fundamental solutions or Green’s functions, which consist of \nexplicit kernels and unknown boundary quantities. Instead of directly solving the integral equations, \na neural network is constructed to approximate these unknown boundary quantities. The network is \nthen trained to satisfy the given BIEs at a set of collocation points. This training process minimizes a \nloss function, typically derived from the BIEs. Compared to traditional neural network-based methods, \nBINNs offer several distinct advantages. First, the method seamlessly integrates prior knowledge of \nBIEs into the training process, focusing solely on satisfying the boundary integral equations. This \nintegration drastically reduces the amount of training data required, leading to a more efficient and \nfaster learning process. Second, by replacing the differential operator in PDEs with an integral \noperator, BINNs eliminate the need to compute high-order derivatives of the neural networks. This \nsubstitution is particularly advantageous, as high-order derivatives are often a source of numerical \ninstability during training. BINNs, therefore, represent a significant advancement over conventional \nmethods by improving both the accuracy and stability of solutions to complex boundary value \nproblems.  \nIn this paper, we propose a novel machine learning framework that integrates BINNs with a \n\n\n6 \n \nspecialized ANN-based crack-tip element, the Special crack-tip Neural Networks(SPNNs) to address \n2D fracture mechanics problems of piezoelectric materials. The proposed SPNNs are specifically \ndesigned to model local stress singularities near crack-tips, enabling accurate representation of the \ncomplex displacement and stress fields in near-tip regions. These specialized elements incorporate \nprior knowledge of fracture mechanics principles, such as those derived from Williams' expansion \nfor crack-tips, into the neural network architecture, ensuring enhanced accuracy in capturing the \nintricate singularities and steep gradients near the crack tips. The primary objective of this study is to \ndevelop a robust, comprehensive, and precise computational framework capable of effectively \naddressing crack problems across various domain geometries. Through a series of numerical \ninvestigations, we aim to demonstrate the effectiveness and versatility of the proposed method, \nhighlighting its ability to handle various crack configurations, including different crack lengths and \norientations.  \n2 \nProblem Statement and Boundary Integral Equations (BIEs) \n2.1 \nProblem Statement \nBased on the theory of the linear piezoelectricity, the coupled mechanical and electrical equilibrium \nequations for piezoelectric materials, in the absence of body forces and electrical charges, can be \nexpressed as follows [27, 57, 58] \n \n,\n0,\n,\n1,2,\nij j\ni j\n\n=\n=\n  \n(1) \n \n,\n0,\n1,2,\ni i\nD\ni\n=\n=\n  \n(2) \nwith the boundary conditions \n \non\non\nand\n,\non\non\ni\ni\nu\nij\nj\ni\nt\ni\ni\nu\nu\nn\nt\nD n\n\n\n\n\n\n\n=\n\n=\n\n\n\n\n\n=\n\n= −\n\n\n\n\n\n  \n(3) \n\n\n7 \n \nwhere \ni\nD  stands for the electrical displacement vector,  and  denote the surface charge and the \nelectrical potential, respectively. The aforementioned equations constitute the exact mathematical \nrepresentation of the elastostatic and piezoelectric fields in 2D solids. \n2.2 \nBoundary Integral Equations (BIEs) \nBy applying the reciprocity theorem, the governing partial differential equations (PDEs) can be \ntransformed into a set of BIEs. The general representation of the BIEs, applicable to both elastostatic \nand piezoelectric equations, can be expressed as follows  \n \n(\n) ( )\n( )\n( ) ( )\n,\nS\nP\nP\nP Q\nQ dS Q\n=\n−\n\n\nC\nu\nU\nt\n(\n) ( )\n( )\n,\n,\nS\nP Q\nQ dS Q\nT\nu\n  \n(4) \nwhere P   and Q  denote the source and observation points, respectively, the jump term \n( )\nP\nC\n \nsolely depends on the local geometry at the point P  with a specific value of \n( )\n/ 2\nij\nij\nC\nP\n\n=\n for a \nsmooth boundary, S  represents the singular integral with a strong singularity in the sense of the \nCauchy principal value (CPV), u  and t  represent the displacement and traction vectors, U  and T  \nstand for the displacement and traction fundamental solutions, respectively. The explicit expressions \nof the displacement and traction fundamental solutions for the linear elasticity and linear \npiezoelectricity can be found in Appendix A. Fundamental solutions \n \nFig. 1. Local coordinate system for discontinuous quadratic elements \nWithin the BEM framework, the boundary  of the domain under consideration will be subdivided \ninto a collection of N   boundary elements. On these elements, the boundary quantities are \napproximated by using constant, linear, or quadratic shape functions. When employing the \n\n\n8 \n \ndiscontinuous quadratic shape functions (see Fig. 1), the displacement and traction vectors are \nexpressed as follows: \n \n( )\n( )\n( )\n1\n2\n3\n1\n2\n3\nˆ\nˆ\nˆ\n,\nN\nN\nN\n\n\n\n=\n+\n+\nu\nu\nu\nu\n  \n(5) \n \n( )\n( )\n( )\n1\n2\n3\n1\n2\n3\nˆ\nˆ\nˆ\n,\nN\nN\nN\n\n\n\n=\n+\n+\nt\nt\nt\nt\n  \n(6) \nwhere \nk\nu  and \n (\n1,2,3)\nk\nk =\nt\n are the physical quantities at the interpolation points, and ˆ\ni\nN  represents \nthe discontinuous interpolation functions. \nBased on the aforementioned notations, we can now discretize the BIEs (4) in the following manner: \n \n( )\n(\n)\n( ) ( )\n3\n,\n1\n1\n,\n(\n) (\n)\n,\nn\nN\nm\nm\nn k\nm\nn\nkP\nS\nn\nk\nn k\nP\nP\nP\nQ\nN\nJ\nd\n\n\n\n\n=\n=\n=\n−\n\n\n\nC\nu\nt\nU\nu\n( )\n(\n)\n( ) ( )\n3\n1\n1\n,\n,\nn\nN\nm\nn\nkP\nS\nn\nk\nP\nQ\nN\nJ\nd\n\n\n\n\n=\n=\n\nT\n  \n(7) \nwhere N   represents the total number of the boundary elements, \nm\nP   stands for the mth \ncollocation/observation point on the boundary, \n,n k\nt\n  and \n,n k\nu\n  are the physical quantities at the kth \ninterpolation point of the nth boundary element, ( )\nJ  is the Jacobian of the transformation from the \nglobal coordinates to the local coordinates. By solving the discretized BIEs, one can obtain all the \nunknown physical quantities on the boundary. Then, the displacement and stress fields in the interior \nof the considered domain can be evaluated [59]. For further details, interested readers are referred to \nRefs. [59-65]. \nThe above steps describe the basic procedure of the traditional BEM for solving a boundary value \nproblem. While various BEM-based approaches enjoy the advantages of the easy-meshing and high \naccuracy, their efficiency in solving large-scale problems becomes a significant challenge. This is \nprimarily due to the fact that the traditional BEM formulation involves dense and non-symmetric \n\n\n9 \n \nsystem matrices. Although these matrices are smaller in size, they still require a significant amount \nof memory and computational operations when using direct solvers. Although this bottleneck can be \novercome through the development of various acceleration or fast techniques [66-68], it often \ninvolves complex mathematical manipulations that are not convenient for researchers and users to \nimplement.  \n2.3 \nStress intensity factors and the near-tip displacement and stress fields \nIn 2D linear piezoelectric fracture mechanics (LPFM), the electromechanical fields near the crack tip \nare of central importance. As the crack tip is approached, these fields follow a consistent asymptotic \ndistribution [31, 69]. The mechanical stresses and electric displacements, given by Eq. (8), exhibit a \nsquare root singularity, while the electric potential and mechanical displacements, described in Eq. \n(9), vary with \nr . The angular functions \n( )\nijf\n, \n( )\nij\ng\n, \n( )\nij\nd\n, and \n( )\nijv\n depend solely on the \nmaterial properties [31, 70]. \n \n( )\n( )\n( )\n( )\n( )\n( )\nI\nII\nIV\nI\nII\nIV\nI\nII\nIV\nI\nII\nIV\n1\n( , )\n2\n1\n( , )\n2\nij\nij\nij\nij\nj\nij\nij\nij\nr\nK f\nK f\nK\nf\nr\nD r\nK g\nK g\nK g\nr\n\n\n\n\n\n\n\n\n\n\n\n\n\n=\n+\n+\n\n\n\n\n=\n+\n+\n\n\n  \n(8) \n \n( )\n( )\n( )\n( )\n( )\n( )\nI\nII\nIV\nI\nII\nIV\nI\nII\nIV\nI\nII\nIV\n2\n( , )\n2\n( , )\ni\nij\nij\nij\nij\nij\nij\nr\nu r\nK d\nK d\nK d\nr\nr\nK v\nK v\nK v\n\n\n\n\n\n\n\n\n\n\n\n\n\n=\n+\n+\n\n\n\n\n=\n+\n+\n\n\n  \n(9) \nThe mechanical stress intensity factors (SIFs) \nI\nK   and \nII\nK   quantify the intensity of the crack-tip \nsingularity under different loading modes. In piezoelectric materials, an additional parameter, the \nelectric displacement intensity factor (EDIFs) \nIV\nK\n, is introduced to characterize the singularity of the \nelectric displacement field. The K concept is a fundamental framework in LPFM for describing the \nhighly localized crack-tip fields, where the stress follows an inverse square root singularity. The crack \n\n\n10 \n \ntip is typically modeled as a sharp V-notch, with SIFs and EDIFs quantifying the intensity of the \ncrack-tip fields under various loading conditions. \n \nFig. 2. The framework of BINNs for 2D elastostatic problems. \n \n3 \nArtificial Neural Networks and Deep Learning for BIEs \n3.1 \nGeneral architecture of BINNs \nAs a new machine learning framework, BINNs integrate the capabilities of artificial neural networks \nwith the BEM to efficiently solve boundary value problems. Rather than directly tackling the integral \nequation (13), a neural network is constructed to approximate unknown boundary quantities ( )\nQ\nu\n \nand ( )\nQ\nt\n in terms of the inputs \n1x  and \n2x . This neural network is then trained by satisfying the given \nBIEs (13) at a set of collocation points. The input to the network is typically a set of boundary points, \nwhile the output consists of the predicted boundary values, such as displacement and traction. By \nleveraging the boundary-only discretization provided by BEM, BINNs reduce the dimensionality of \nthe problem, offering improved computational efficiency.  \n\n\n11 \n \nThe framework of BINNs for solving 2D elastostatic problems is illustrated in Fig. 2. In this \nframework, the target displacement solutions \n(\n)\n1\n1\n2\n,\nu\nx x\n  and \n(\n)\n2\n1\n2\n,\nu\nx x\n  are approximated using \nneural networks as follows: \n \n(\n)\n(1)\n(0)\n(1)\n1\n1\n2\n1\n1\n1\n( ,\n,\n, )\n,\nM\ni\ni\ni\nu x x\nw\nz\nb\n\n=\n=\n+\n\nw b\n  \n(10) \n \n(\n)\n(1)\n(0)\n(1)\n2\n1\n2\n2\n2\n1\n( ,\n,\n, )\n,\nM\ni\ni\ni\nu x x\nw\nz\nb\n\n=\n=\n+\n\nw b\n  \n(11) \nwith \n \n(0)\n(0)\n(0)\n(0)\n1\n1\n2\n2\n,\ni\ni\ni\ni\nz\nw\nx\nw\nx\nb\n=\n+\n+\n  \n(12) \nHere, ( )\n denotes the activation function, \n(1)\n1i\nw\n and \n(1)\n2i\nw\n are the weights linking the input unit to the \ni-th neuron unit for \n1u  and \n2\nu  respectively, \n(1)\n1b\n and \n(1)\n2b\n are biases associated with the neuron units, \nand M represents the number of neuron units in the hidden layer. Various activation functions such as \nSigmoid, Tanh, Swish, Softplus, Arctan, Mish, and ReLU can be employed based on the problem \nrequirements. To train the trainable parameters w   and b  , the target solutions \n(\n)\n1\n1\n2\n,\nu\nx x\n  and \n(\n)\n2\n1\n2\n,\nu\nx x\n  are substituted into the integral equations (13), and the following loss function is \nminimized: \n \n(\n)\n(\n)\n(\n)\n(1)\n(2)\nBIE\nBIE\n,\n,\n,\n,\nL\nL\nL\n=\n+\nw b\nw b\nw b\n  \n(13) \nwith the notations: \n \n(\n)\n(\n)\n1\n(1)\nBIE\n1\n1\n,\n2\nm\nj j\nS\ntotal\nu\nP\nL\nU t dS\nN\n=\n−\n+\n\n\nw b\n2\n1\n1\n,\ntotal\nN\nj\nj\nS\nm\nT u dS\n=\n  \n(14) \n \n(\n)\n(\n)\n2\n(2)\nBIE\n2\n1\n,\n2\nm\nj j\nS\ntotal\nu\nP\nL\nU t dS\nN\n=\n−\n+\n\n\nw b\n2\n2\n1\n,\ntotal\nN\nj\nj\nS\nm\nT u dS\n=\n  \n(15) \nwhere \n(\n)\n(1)\nBIE\n,\nL\nw b  and \n(\n)\n(2)\nBIE\n,\nL\nw b  represent two loss terms corresponding to the BIEs formulated for \n\n\n12 \n \nsolving 2D elastostatic problems, and \ntotal\nN\n stands for the total number of collocation/ observation \npoints located along the boundary. In BINNs, the specified boundary conditions are inherently \nincorporated into the BIEs, meaning that only the unknown boundary quantities need to be \napproximated. As a result, there is no need to introduce additional weights into the loss function, \nwhich are commonly used in traditional machine learning methods to balance gradients across \ndifferent objective functions. This is another significant advantage of the proposed BINNs approach.  \nThere are currently two primary approaches for generating the BINNs numerical framework. The \nfirst, introduced by the Sun et al. [55], discretizes the boundary into multiple segments, selecting \nGaussian points as the collocation points for training the networks, as shown in equation (16): \n \n( )\n(\n)\n( )\n( ) ( )\n,\n1\n1\n(\n) (\n)\n,\nn\nN\nG\nm\nm\nm\nn g\ng\nn\nS\nn\ng\nP\nP\nP\nQ\nw\nJ\nd\n\n\n\n\n=\n=\n=\n−\n\n\nC\nu\nU\nt\nx\n( )\n(\n)\n( )\n( ) ( )\n,\n1\n1\n,\n,\nn\nN\nG\nm\nn g\ng\nn\nS\nn\ng\nP\nQ\nw\nJ\nd\n\n\n\n\n=\n=\n\nT\nu\nx\n  \n(16) \nIn contrast, similar to the classical BEM, Zhang et al. [53] adopt quadratic shape functions to represent \nphysical quantities on the boundaries. In this approach, collocation points for training the networks \nare directly chosen as boundary nodes, as expressed in equation (17): \n \n( )\n( )\n(\n)\n( ) ( )\n( )\n3\n,\n1\n1\n,\n(\n) (\n)\n,\nn\nN\nm\nm\nn k\nm\nn\nkP\nS\nn\nk\nn k\nP\nP\nP\nQ\nN\nJ\nd\n\n\n\n\n=\n=\n=\n−\n\n\n\nC\nu\nt\nx\nU\nu\nx\n( )\n(\n)\n( ) ( )\n3\n1\n1\n,\n,\nn\nN\nm\nn\nkP\nS\nn\nk\nP\nQ\nN\nJ\nd\n\n\n\n\n=\n=\n\nT\n  \n(17) \nA comparative analysis of the results from both studies reveals no fundamental differences between \ntraining on Gaussian points and training directly at boundary nodes. However, training merely on \nboundary nodes offers several advantages, including smaller datasets, faster training processes, and \nimproved stability.  \n3.2 \nMulti-Domain BINNs(M-BINNs) \nAddressing displacement discontinuity across crack surfaces is crucial in fracture mechanics analysis. \n\n\n13 \n \nThe multi-domain BINNs (M-BINNs) method has emerged as a specialized approach to handle this \nchallenge. The core concept of M-BINNs involves dividing the entire region into separate domains, \nallowing for the explicit treatment of both the upper and lower crack surfaces. By recognizing the \ndistinct behavior of these surfaces, the method effectively captures the displacement jump across the \ncrack. The procedural steps of M-BINNs are straightforward. First, the entire region is divided into \ndistinct domains, each corresponding to either the upper or lower crack surface. Within each domain, \nlocal loss functions are defined based on the BIEs. To ensure compatibility between the two \nsubregions, displacement continuity and traction equilibrium conditions along the interface are \nenforced. These conditions are automatically integrated into the BIEs. \n \n4 \nNovel ANN-based crack-tip elements(SPNNs) \n4.1 \nDefinitions \nDue to the asymptotic behavior of displacements and stresses near the crack tip, traditional quarter-\npoint crack-tip elements are commonly used in finite element and boundary element formulations for \nmodeling cracks in homogeneous elastic materials. These elements accurately capture the \n-\nr\nbehavior in the near-tip displacement field, as well as the 1\n-\nr variation in the near-tip stress field.  \nHowever, the accuracy of calculations using quarter-point crack-tip elements is highly dependent on \nthe quality of the mesh. Specifically, refining the mesh around the crack-tip is crucial for obtaining \nmore accurate results. To address this issue, as illustrated in Fig. 3, this paper proposes a novel ANN-\nbased crack-tip element to improve the modeling of displacement and stress fields in regions near \ncrack tips. \n \n\n\n14 \n \n \nFig. 3. Novel ANN-based crack-tip elements. \nTheoretically, the near-tip displacements and tractions must adhere to the following forms: \n \n( )\n1/2\n3/2\n1\n2\n3\n...\nr\nr\n=\n+\n\n+\n\n+\nu\nd\nd\nd\n  \n(18) \n \n( )\n1/2\n1/2\n1\n2\n3\n...\nr\nr\n\n−\n=\n+\n\n+\n\n+\nt\ne\ne\ne\n  \n(19) \nWhere: \n \n( ) \n\n1\n2\n, \n,  \nu\nu\n\n\n=\nu\n  \n(20) \n \n( ) \n\n1\n2\n, ,  \nt\nt\n\n\n=\nt\n  \n(21) \nBy utilizing the geometric relationship between r   and the local coordinate  , we obtain the \nfollowing relations: \n \n( )\n(\n)\n(\n)\n1/2\n3/2\n1\n2\n3\n1\n1\n...\n\n\n\n=\n+\n\n+\n+\n\n+\n+\nu\nd\nd\nd\n  \n(22) \n \n( )\n(\n)\n(\n)\n1/2\n1/2\n1\n2\n3\n1\n1\n...\n\n\n\n−\n=\n+\n\n+\n+\n\n+\n+\nt\ne\ne\ne\n  \n(23) \nfor crack-tip at \n1\n= − and  \n \n( )\n(\n)\n(\n)\n1/2\n3/2\n1\n2\n3\n1\n1\n...\n\n\n\n=\n+\n\n−\n+\n\n−\n+\nu\nd\nd\nd\n  \n(24) \n \n( )\n(\n)\n(\n)\n1/2\n1/2\n1\n2\n3\n1\n1\n...\n\n\n\n−\n=\n+\n\n−\n+\n\n−\n+\nt\ne\ne\ne\n  \n(25) \n\n\n15 \n \nfor crack-tip at \n1\n= + . The SPNNs are referred to as elements, where the displacements and stresses \nwithin the elements are characterized using the higher-order asymptotic relations described above. \nThe coefficients \nid   and \nie   represent the real-valued trainable parameters in these specialized \nelements, with Gaussian points selected as the training points for the network. In this study, we utilize \nthese specialized elements to model the local displacement and stress fields in the near-tip regions, \nwhile for remaining regions, we employ the BINNs, as outlined in Section 3, to model the far-field \nbehavior.  \nBased on the above analysis, the BIEs for problems involving cracks can now be expressed as follows:  \n( )\n(\n)\n(\n)\n( ) ( )\n1/2\n1\n2\n1\n(\n) (\n)\n,\n1\n...\ni\ni\nG\ni\ng\nn\ncrack tip\ng\nP\nP\nP Q\nw\nJ\nd\n\n\n\n\n\n−\n−\n=\n\n\n=\n+\n\n\n+\n\n\n−\n\n\nC\nu\nU\ne\ne\n( )\n(\n)\n(\n)\n( ) ( )\n( )\n( )\n(\n)\n( ) ( )\n( )\n1/2\n1\n2\n1\n3\n,\n1\n1\n,\nNear-tip-field\n,\n1\n...\n,\nn\nG\ni\ng\nn\ncrack tip\ng\nN\nn k\ni\nn\nkP\nS\nn\nk\nn k\nP Q\nw\nJ\nd\nP Q\nN\nJ\nd\n\n\n\n\n\n\n\n\n\n−\n=\n=\n=\n\n\n\n\n\n+\n\n\n+\n\n\n\n+\n−\n\n\n\n\nT\nd\nd\nt\nx\nU\nu\nx\n( )\n(\n)\n( ) ( )\n3\n1\n1\nFar-field\n,\n,\nn\nN\ni\nn\nkP\nS\nn\nk\nP Q\nN\nJ\nd\n\n\n\n\n=\n=\n\n\n\n\n\nT\n  (26) \n4.2 \nCalculation of the singular integrals in SPNNs \nFor near-tip-field BIEs, the boundary integrals, as illustrated in Eq. (26), involve the calculation of \nthe terms ( )\n(\n)\n1/2\n1\n2\n1\n\n\n=\n+\n\n\nu\nd\nd\n and ( )\n(\n)\n1/2\n1\n2\n1\n\n\n−\n=\n+\n\n\nt\ne\ne\n. The former term is regular and can \nbe accurately calculated using standard Gaussian quadrature, whereas the latter term exhibits \nsingularity of order of 1/ 1 \n\n at \n1\n=\n. In this study, a semi-analytical technique based on the \nintegration-by-parts is employed to evaluate the corresponding singular integrals. For demonstration \npurposes, we focus on the first three terms of the series expansion. Now, let's consider the following \nintegral: \n \n( ) ( )\n( )\n(\n)\n(\n)\n1\n1\n1/2\n1/2\n1\n2\n3\n1\n1\n1\n1\n,\nF\nd\nF\nd\n\n\n\n\n\n\n\n−\n−\n−\n\n\n=\n+\n\n\n+\n\n\n\n\n\n\nt\ne\ne\ne\n  \n(27) \n\n\n16 \n \nwhere \n( )\nF  consist of the Jacobian and the displacement fundamental solutions. Now let: \n \n( )\n(\n)\n(\n)\n1/2\n3/2\n1\n2\n3\n2\n1\n2 / 3\n1\n,\n\n\n\n\n=\n\n\n\n\n\n\n\n\nT\ne\ne\ne\n  \n(28) \nand note the following relationship: \n \n( )\n( ).\n\n\n\n=\nT\nt\n \n(29) \nThe integral (36) can be evaluated as: \n \n( ) ( )\n( )\n( )\n( )\n( )\n1\n1\n1\n1\n1\n1\n,\nF\nd\nF\nF\nd\n\n\n\n\n\n−\n\n\n\n−\n−\n−\n\n= \n\n\n\n\n\nt\nT\nT\n  \n(30) \nwhere the second integral on the right-hand side is now regular and can be accurately evaluated using \nthe standard Gaussian quadrature. It should be noted that when the collocation point P  lies within \nthe integration element, the function \n( )\nF , which contains the displacement fundamental solutions, \nexhibits a weak-singularity of order \n(\n)\nO lnr  . Furthermore, its derivative \n( )\nF \n\n  demonstrates a \nstrong-singularity of order \n(\n)\n1/\nO\nr . To handle integrals with strong singularities, various algorithms \nhave been developed and extensively applied within the BEM community. In this study, we adopt the \nmethod proposed by Guiggiani and Casalini [60] for accurately computing such singular integrals.  \n4.3 \nExtraction of Stress Intensity Factors and Electric Displacement Intensity Factors \nIn the case where the crack surface lies at \n,\n\n\n=\n the SIFs and EDIFs and can be computed via: \n \n( )\n\n\n( )\n\n\n( )\n\n\nI\n2\nII\n1\nIV\n0\n0\n0\n0\n0\n0\nlim\n2\n,\nlim\n2\n,\nlim\n2\nr\nr\nr\nK\nr t\nr\nK\nr t\nr\nK\nr\nr\n\n\n\n\n\n\n\n→\n→\n→\n=\n=\n=\n=\n=\n=\n  \n(31) \nDue to the use of the specialized crack-tip elements, which theoretically incorporate the asymptotic \ndisplacement and stress fields near the crack-tip, the SIFs and EDIFs in this study can be calculated \ndirectly at points very close to the crack tip. \n \n5 \nNumerical Investigations  \nThis section presents the numerical analysis of five benchmark examples to evaluate the performance \n\n\n17 \n \nof BINNs combined with the SPNNs. The first three examples assess the algorithm's accuracy in \nelastic fracture mechanics by comparing the results with reference solutions. The first example also \nincludes a sensitivity analysis of the BINNs architecture and the effect of crack-tip element size. The \nfourth and fifth examples extend the analysis to piezoelectric materials. \nIn all benchmark examples presented in this section, the total number of training points is relatively \nsmall, typically on the order of a few hundred. All numerical experiments are conducted using the \nPython package TensorFlow 2.0, along with the limited-memory BFGS optimization algorithm. The \ncomputations are performed on a system equipped with an Intel i7 2.90 GHz CPU, 32 GB of RAM, \na 500 GB hard drive, and running the Windows 11 operating system. The resulting relative error is \ncomputed using the formula: \n/\nnum\nexact\nexact\nK\nK\nK\n−\n, where \nnum\nK\n and \nexact\nK\n denote the numerical and \nexact SIF solutions, respectively.  \n5.1 \nAn edge-cracked plate under a remote tensile stress loading \nThe first example investigates the performance of the proposed framework in solving a pure mode I \ncrack problem under plane strain conditions. We perform a fracture mechanics analysis of an edge-\ncracked plate under a tensile stress loading, as depicted in Fig. 4 (a). The boundaries and far-field \ninterfaces are discretized into 180 discontinuous quadratic elements, where the boundary solutions u  \nand t are trained using BINNs.  \n5.1.1 Sensitivity analysis of BINNs architecture \nFirstly, we delve into the sensitivity of our numerical results concerning on the set of the neural \nnetworks in the far field, where the conventional BINNs are implemented. Three crucial factors are \nhereby considered: the type of applied activation functions, the number of hidden layers and the \nneurons utilized in each hidden layer. Here we vary the number of neurons per hidden layer within \nthe range of 4 to 32 and the number of hidden layers from 1 to 4. The selected activation functions \n\n\n18 \n \nfor investigation include \"Tanh\", \"Sigmoid\", \"Relu\" and \"Swish\". Here, we focus on comparing the \nnormalized Crack Opening Displacement (COD) at the crack center between the present method and \nthe analytical solution given by [69, 71, 72] \n \nFig. 4. (a). An edge cracked finite plate subjected to tensile stress loading. (b). A finite plate with a slant \ncrack under a tensile stress loading \nIn Fig. 5, the analysis reveals that the accuracy of computed COD remains consistently stable for the \n\"Relu\", \"Tanh\" and \"Swish\" activation functions, even when applied to shallow neural networks. \nConversely, the \"Sigmoid\" activation function yields less accurate outcomes. Notably, among the \nconsidered activation functions, \"Tanh\" emerges as a standout performer, displaying comparatively \nsuperior accuracy and stability. It is important to note that this sensitivity analysis is tailored to a \nstraightforward configuration. For scenarios involving complex geometry or mixed crack opening \nmodes, a new sensitivity analysis becomes imperative to ensure robust conclusions. In the subsequent \nexamples featuring simple configurations, the model employs three hidden layers with 20 neurons \neach for consistency in experimentation. \n\n\n19 \n \n \nFig. 5. Variation of the relative errors with respect to the number of neurons in each hidden layer, the applied \nactivation functions and with: (a)1 hidden layers, (b) 2 hidden layers, (c) 3 hidden layers, (d) 4 hidden layers. \n5.1.2 Sensitivity analysis of SPNNs size \nIn this subsection, we specifically investigate the impact of varying the size of SPNNs within a range \nof 10% to 80% of the crack length, as illustrated exemplarily in Fig. 6. The boundaries and far-field \ninterfaces are discretized into 80 discontinuous quadratic elements. The primary focus is to assess the \nSPNN's ability to accurately represent both displacement and stress fields, extending from the crack-\ntip region to the far field, while maintaining accuracy in predicting SIFs. We systematically vary the \ncrack-length ratio from 0.2 to 0.5 and consider higher order terms in SPNNs ranging from 2 to 7.  \nAdditionally, we conduct a comparative analysis with the BEM utilizing the special crack-tip element \nproposed by Gu [24]. In this comparison, we investigate whether maintaining the same size for the \nspecial crack-tip element as that of SPNNs could still results in sustained accuracy in predicting SIFs. \nThe empirical solution (accuracy < 0.5%) of the mode I SIF \nI\nK  in this problem is given in [73]. \n\n\n20 \n \n \nFig. 6. Implementation of varying SPNNs sizes \nAs evident from Fig. 7, the accuracy of computed SIFs using two-term crack-tip element is notably \ninferior compared to models incorporating higher order terms. This discrepancy arises because the \nsingle asymptotic terms \n2\nd   and \n2e   are valid primarily as r   tends to zero, insufficient to describe \ndisplacement and stress fields at finite distances from the crack-tip. This limitation becomes more \npronounced as the SPNNs size increases, indicating that the square root behavior of displacement and \nthe inverse square root singularity of stress are only reliable in the immediate vicinity of the crack-\ntip.  \nFig. 7 also highlights the necessity of incorporating more than three higher-order terms in crack-tip \nelement as their size increases, ensuring an accurate representation of displacement and stress fields \nover finite distances from the crack tip. Even when the SPNNs size extends to 80% of the crack length, \nhigher-order terms continue to enhance accuracy. In contrast, the accuracy of computed SIFs in the \nBEM framework [24] deteriorates as the size of the crack-tip element grows, particularly for longer \ncrack lengths. Unlike BEM, SPNNs with more than three higher-order terms remain unaffected by \nelement size, eliminating the need for mesh refinement near the crack tip. \nNevertheless, increasing the number of higher-order terms introduces more trainable parameters, \nwhich extends training time and creates a trade-off between accuracy and computational efficiency. \nAs complexity grows, this balancing issue becomes more pronounced, potentially reducing overall \n\n\n21 \n \nefficiency. \nIn practical engineering applications, the typical error margin in SIFs calculations ranges from 1% to \n3%. Within this range, using four or five higher-order terms is generally sufficient to achieve accurate \nand reliable results without incurring excessive computational costs. Therefore, in the following \nnumerical examples, we fix the number of higher-order terms at five and use 50% of the SPNNs size. \n \nFig. 7. Relative errors of \nI\nK  in an edge-cracked plate under a remote tensile stress loading with varying \nSPNNs sizes (BINNs with quadratic elements). The crack-length ratios are taken as: (a) \n/\n0.2\na W =\n, (b) \n/\n0.3\na W =\n, (c) \n/\n0.4\na W =\n, (d) \n/\n0.5\na W =\n. \n5.1.3 Stress intensity factor solutions \nFig. 8 illustrates the variation of the estimated mode I SIF \nI\nK  with respect to the relative plate width \n/\na W  . The results demonstrate that the SIF values calculated using the present method are in \nexcellent agreement with the corresponding empirical results across a wide range of relative plate \nwidths.  \n\n\n22 \n \n \nFig. 8. Variation of the estimated normalized \nI\nK  with the varying crack length ratio \n/\na W . \n5.2 \nA finite plate with a slant crack  \nThis example demonstrates the effectiveness of the proposed framework in analyzing mixed mode \ncrack problems, specifically focusing on SIFs on a finite plate with a central slant crack. The crack-\nlength ratio 2 /\na H  ranges from 0.1 to 0.8, with crack slant angles  set at 15°, 30°, 45°, and 60°. \nThe problem is assumed to be in 2D plane strain condition with a Poisson’s ratio v of 0.3. \nThe network architecture comprises 3 fully-connected hidden layers, each with 30 neurons, trained \nover 20000 iterations. Mode I and mode II SIFs (\nI\nK   and \nII\nK  ) are computed for different   and \n2 /\na H  values and compared with numerical results obtained from the BEM by Gu [24] and Kitagawa \n[74]. \nTable 1. Normalized \nI\nK  for slant cracked plate under tensile stress loading. \n \nMethod \n2 /\na\nH  \n \n \n \n \n \n \n \n0.1 \n0.2 \n0.3 \n0.4 \n0.5 \n0.6 \n0.7 \n0.8 \n15° \nPresent \n0.9384 \n0.9575 \n0.9898 \n1.0394 \n1.1119 \n1.2174 \n1.3770 \n1.6475 \n \nGu[72]  \n0.9380 \n0.9573 \n0.9899 \n1.0397 \n1.1122 \n1.2178 \n1.3774 \n1.6414 \n \nKitagawa[74] \n0.9391 \n0.9577 \n0.9904 \n1.0402 \n1.1128 \n1.2183 \n1.3780 \n1.6530 \n30° \nPresent \n0.7570 \n0.7729 \n0.8021 \n0.8453 \n0.9044 \n0.9830 \n1.0897 \n1.2426 \n \nGu[72]  \n0.7548 \n0.7728 \n0.8023 \n0.8454 \n0.9043 \n0.9836 \n1.0909 \n1.2433 \n\n\n23 \n \n \nKitagawa[74] \n0.7557 \n0.7730 \n0.8025 \n0.8456 \n0.9046 \n0.9840 \n1.0910 \n1.2450 \n45° \nPresent \n0.5059 \n0.5186 \n0.5413 \n0.5723 \n0.6119 \n0.6607 \n0.7199 \n0.7927 \n \nGu[72]  \n0.5038 \n0.5181 \n0.5406 \n0.5718 \n0.6118 \n0.6611 \n0.7213 \n0.7949 \n \nKitagawa[74] \n0.5046 \n0.5181 \n0.5406 \n0.5719 \n0.6119 \n0.6611 \n0.7210 \n0.7950 \n60° \nPresent \n0.2534 \n0.2623 \n0.2748 \n0.2916 \n0.3115 \n0.3350 \n0.3610 \n0.3887 \n \nGu[72]  \n0.2522 \n0.2605 \n0.2734 \n0.2900 \n0.3105 \n0.3332 \n0.3591 \n0.3891 \n \nKitagawa[74] \n0.2527 \n0.2605 \n0.2730 \n0.2896 \n0.3099 \n0.3332 \n0.3590 \n0.3880 \n \nTable 2. Normalized \nII\nK  for an edge slant cracked plate under remote normal stress loading. \n \nMethod \n2 /\na\nH  \n \n \n \n \n \n \n \n0.1 \n0.2 \n0.3 \n0.4 \n0.5 \n0.6 \n0.7 \n0.8 \n15° \nPresent \n0.2499  \n0.2506  \n0.2519  \n0.2554  \n0.2615  \n0.2722  \n0.2930  \n0.3314  \n \nGu[72]  \n0.2458  \n0.2503  \n0.2522  \n0.2553  \n0.2611  \n0.2719  \n0.2923  \n0.3325  \n \nKitagawa[74] \n0.2502  \n0.2510  \n0.2527  \n0.2560  \n0.2619  \n0.2725  \n0.2900  \n0.3070  \n30° \nPresent \n0.4334  \n0.4350  \n0.4416  \n0.4491  \n0.4612  \n0.4800  \n0.5080  \n0.5529  \n \nGu[72]  \n0.4171  \n0.4345  \n0.4386  \n0.4436  \n0.4608  \n0.4715  \n0.5084  \n0.5520  \n \nKitagawa[74] \n0.4339  \n0.4367  \n0.4417  \n0.4497  \n0.4617  \n0.4800  \n0.5080  \n0.5500  \n45° \nPresent \n0.5025  \n0.5065  \n0.5160  \n0.5286  \n0.5455  \n0.5669  \n0.5940  \n0.6289  \n \nGu[72]  \n0.5039  \n0.5072  \n0.5186  \n0.5287  \n0.5448  \n0.5672  \n0.5941  \n0.6290  \n \nKitagawa[74] \n0.5018  \n0.5072  \n0.5162  \n0.5290  \n0.5458  \n0.5674  \n0.5950  \n0.6300  \n60° \nPresent \n0.4346  \n0.4414  \n0.4510  \n0.4653  \n0.4825  \n0.5014  \n0.5230  \n0.5475  \n \nGu[72]  \n0.4337  \n0.4416  \n0.4511  \n0.4658  \n0.4838  \n0.5015  \n0.5239  \n0.5481  \n \nKitagawa[74] \n0.4352  \n0.4417  \n0.4521  \n0.4660  \n0.4827  \n0.5022  \n0.5240  \n0.5490  \n5.3 \nA kinked edge crack in a semi-infinite plate subjected to remote tensile stress loading \nThe problem configuration, illustrated in Fig. 9, involves a kink length l  fixed at a ratio of \n0\n/\n0.1\nl a =\n, \nwith kink angles  varying from -60° to 60° in 10° increments. This study compares the normalized \nSIFs obtained using the present method with those from reference methods, namely CR [1], CRT [2] \nand finite element solutions (FEM). \nFig. 10 presents a comprehensive comparison of the SIF values for \n0\n=  , \n30\n=\n  and \n60\n=\n \nestimated by various methods. The solutions obtained using the present method demonstrate excellent \n\n\n24 \n \nagreement with the finite element solutions, consistently providing more accurate results compared \nto CR[1] and CRT[2] methods across the entire range of kink angles considered. The findings \nunderscore the potential of the present method as a powerful tool for analyzing nonlinear cracks in \nsemi-infinite plates. \n \nFig. 9. An kinked edge crack in a semi-infinite domain subjected to tensile stress loading \n \nFig. 10. Comparison of solutions for an edge kinked crack in a semi-infinite domain under remote tension \n\n\n25 \n \nwith varying kink angles  using present method, FEM, CR and CRT: (a) normalized \nI\nK , \n0\n= , (b) \nnormalized \nI\nK , \n30\n=\n, (c) normalized \nI\nK , \n60\n=\n, (d) normalized \nII\nK , \n0\n= ,(e) normalized \nII\nK , \n30\n=\n,(f) normalized \nII\nK , \n60\n=\n \n \n \nFig. 11. (a). A central cracked piezoelectric strip (b). An edge cracked piezoelectric strip under a tensile stress \nloading and electric displacement \n5.4 \nA center-cracked piezoelectric strip under tensile stress loading and electric displacement \nIn the following analysis, we examine a center-cracked PZT-5H piezoelectric strip subjected to both \ntensile stress and electric displacement loading. The values of the material constants are given by \n11\n12.6,\nc =\n \n13\n8.41,\nc\n=\n \n33\n11.7,\nc\n=\n \n44\n2.3,\nc\n=\n \n31\n6.5,\ne\n= −\n 15\n17.44,\ne\n=\n 11\n15.03,\n=\n 33\n13.0,\n=\n where the \nelastic constants \nij\nc  are in \n10\n2\n10  N/m  , the piezoelectric constants \nije   in \n10\n2\n10  C/m  , and the \npermittivity \nij  in \n9\n10  F/m\n−\n. Our numerical study focuses on the region where electric displacement \nloads are applied, considering specific values of \n(\n)\n0\n33\n33\n/\n/\n0, 1, 2, 3\ny\nD\ne\nc\n=\n . These values are \nchosen to encompass both negative and positive electric fields, allowing for a thorough investigation \n\n\n26 \n \nof their influence on crack behavior.  \nAdditionally, based on the findings of Wang and Mai [75], which suggest that impermeable crack \nboundary conditions offer a more realistic representation for engineering applications, we adopt these \nconditions in our analysis. This ensures alignment with established theoretical principles and \nenhances the applicability of our results. Consequently, all subsequent simulations and discussions \nare conducted under the assumption of impermeable crack boundary conditions. \n \nFig. 12. An kinked edge crack in a semi-infinite domain subjected to tensile stress loading \nThe results illustrated in Fig. 12 (a) and (b) show the distribution of the electric displacement intensity \nfactor \nIV\nK\n  and stress intensity factor \nI\nK   for a central-cracked piezoelectric strip under uniform \ntensile and electric displacement loads. The results calculated using the present BINNs framework \nclosely match the reference solutions from [76], demonstrating the accuracy of this approach for \nanalyzing cracked piezoelectric materials. \nFig. 12 (a) illustrates the variation of the electric displacement intensity factor with crack length. For \nan impermeable crack surface, the electric displacement field at the crack tip increases with the \n\n\n27 \n \napplied electric displacement load. Notably, even in the absence of external electric displacement \nloading, the electric displacement intensity factor \nIV\nK\n  remains non-zero. This demonstrates that \npurely mechanical loading can induce electric field concentration at the crack tip in the finite plate. \nIn contrast, mechanical and electric displacement intensity factors are entirely uncoupled in infinite \npiezoelectric media, where the electric displacement intensity factor remains zero under purely \nmechanical loading [28]. Fig. 12 (b) highlights that the stress intensity factors exhibit negligible \nsensitivity to the applied electric displacement load.  \n5.5 \nAn edge-cracked piezoelectric strip under tensile stress loading and electric displacement \nIn the final example, an edge-cracked piezoelectric strip subjected to tensile stress and electric \ndisplacement loading is considered. The material properties are identical to those in the previous \nexample. Four loading scenarios are considered, \n(\n)\n0\n33\n33\n/\n/\n0, 1, 2, 3\ny\nD\ne\nc\n=\n , including both \npositive and negative electric fields. \nThe computed EDIFs and SIFs are compared with reference solutions [76], as shown in Fig. 12 (c) \nand (d). The results confirm the accuracy and robustness of the proposed approach for analyzing \ncracked piezoelectric materials. \n6 \nConclusions  \nIn this paper, we have presented a novel machine learning platform that combines BINNs and SPNNs \nto address two-dimensional linear piezoelectric fracture mechanics problems. Through a series of \nnumerical investigations, we have demonstrated the effectiveness, versatility, and robustness of the \nproposed method in handling a wide range of crack configurations across various domains. \nThe seamless integration of BINNs and SPNNs has enabled accurate representation of complex stress \nfields, and the accuracy of the platform has been validated against well-established analytical \nsolutions and high-fidelity numerical methods. The method has shown potential for solving complex, \n\n\n28 \n \nreal-world fracture mechanics challenges, offering advantages over traditional computational \nmethods in terms of efficiency and adaptability. \nThe modular structure of the framework allows for easy extension and customization, opening up \nopportunities for future research and development in computational fracture mechanics. In conclusion, \nthe proposed machine learning platform represents a powerful and versatile tool for addressing linear \nelastic fracture mechanics problems, making it a valuable asset for researchers and practitioners in \nthe field. \nAcknowledgements \nThe work described in this paper was supported by the National Natural Science Foundation of China \n(Nos. 11872220, 12111530006), and the Natural Science Foundation of Shandong Province of China \n(Nos. 2019KJI009, ZR2021JQ02). \nData Availability Statement \nThe data that support the findings of this study are available from the corresponding author upon \nreasonable request.  \n \n\n\n29 \n \nAppendix A. Fundamental solutions \nFor 2D elastostatic problems, the fundamental solutions are given by \n(\n)\n(\n) (\n)\n( )\n,\n,\n1\n,\n4\n3 ln\n,\n8\n1\nij\nij\ni\nj\nU\nP Q\nr\nr r\n\n\n\n\n\n\n=\n−\n+\n\n\n−\n \n(A32) \n(\n)\n(\n)\n(\n)\n(\n)(\n)\n,\n,\n,\n,\n1\n,\n1 2\n2\n1 2\n,\n4\n1\nij\nij\ni\nj\ni\nj\nj\ni\nr\nT\nP Q\nr r\nr n\nr n\nr\n\n\n\n\n\n\n\n\n\n= −\n−\n+\n−\n−\n−\n\n\n\n\n−\n\n\n\nn\n \n(A33) \nwhere  represents the shear modulus while  denotes the Poisson’s ratio, \n(\n)\n1\n2\n=\n,\nn n\nn\n represents \nthe unit outward normal vector at the point Q , r = P-Q   stands for the Euclidean distance \nbetween the points P  and Q. For further details, interested readers are referred to Refs. [65, 77, \n78]. \nFor 2D piezoelectric problems, the fundamental solutions are given by \n1\n2\n3\n1\n2\n3\n11\n11\n1\n11\n2\n11\n3\n1\n14\n1\n14\n2\n14\n3\n2\n2\n2\n2\n2\n2\n3\n1\n2\n1\n2\n3\n2\n1\n2\n3\nˆ\nˆ\nˆ\nˆ\nˆ\nˆ\n(\n)\n(\n)\n,\ny\ny\ny\nx\nx\nx\nT\nk A\nk A\nk A\nn\nk A\nk A\nk A\nn\nr\nr\nr\nr\nr\nr\n=\n+\n+\n+\n+\n+\n \n(A34) \n1\n2\n3\n1\n2\n3\n12\n14\n1\n14\n2\n14\n3\n1\n12\n1\n12\n2\n12\n3\n2\n2\n2\n2\n2\n2\n2\n3\n1\n2\n1\n2\n3\n1\n2\n3\nˆ\nˆ\nˆ\n(\n)\nˆ\n(\n)\n,\nˆ\nˆ\nx\nx\nx\nT\nk A\nk A\nk A\nn\nk A\nk A\nk A\nn\nr\nr\nr\nr\ny\ny\ny\nr\nr\n=\n+\n+\n+\n+\n+\n \n(A35) \n3\n1\n2\n1\n2\n3\n1\n2\n1\n2\n3\n1\n2\n3\n13\n15\n1\n15\n2\n15\n3\n1\n13\n1\n13\n2\n13\n3\n2\n2\n3\n2\n2\n2\n2\n2\nˆ\nˆ\nˆ\n(\n)\nˆ\n)\n,\nˆ\n(\nˆ\nx\nx\nx\nT\nk A\nk\ny\nA\nk A\nn\nk A\nk A\nk\ny\nA\nn\nr\nr\nr\nr\nr\ny\nr\n= −\n+\n+\n−\n+\n+\n \n(A36) \n1\n2\n3\n1\n2\n3\n21\n21\n1\n21\n2\n21\n3\n1\n24\n1\n24\n2\n24\n3\n2\n2\n2\n2\n2\n2\n2\n3\n1\n2\n1\n2\n3\n1\n2\n3\nˆ\nˆ\nˆ\n(\n)\nˆ\n(\n)\n,\nˆ\nˆ\nx\nx\nx\nT\nk B\nk B\nk B\nn\nk B\nk B\nk B\nn\nr\nr\nr\nr\ny\ny\ny\nr\nr\n=\n+\n+\n+\n+\n+\n \n(A37) \n1\n2\n3\n1\n2\n3\n22\n24\n1\n24\n2\n24\n3\n1\n22\n1\n22\n2\n22\n3\n2\n2\n2\n2\n2\n2\n3\n1\n2\n1\n2\n3\n2\n1\n2\n3\nˆ\nˆ\nˆ\nˆ\nˆ\nˆ\n(\n)\n(\n)\n,\ny\ny\ny\nx\nx\nx\nT\nk B\nk B\nk B\nn\nk B\nk B\nk B\nn\nr\nr\nr\nr\nr\nr\n=\n+\n+\n+\n+\n+\n \n(A38) \n\n\n30 \n \n1\n2\n3\n1\n2\n3\n23\n25\n1\n25\n2\n25\n3\n1\n23\n1\n23\n2\n23\n3\n2\n2\n2\n2\n3\n1\n2\n2\n2\n1\n2\n3\n1\n2\n3\n2\nˆ\nˆ\nˆ\nˆ\nˆ\n(\n)\n(\n)\n,\nˆ\nx\nx\nx\nT\nk B\nk B\nk B\nn\nk B\nk B\nk B\nn\nr\nr\nr\ny\nr\nr\nr\ny\ny\n= −\n+\n+\n−\n+\n+\n \n(A39) \n1\n2\n3\n1\n2\n3\n31\n21\n1\n21\n2\n21\n3\n1\n24\n1\n24\n2\n24\n3\n2\n2\n2\n2\n2\n2\n2\n3\n1\n2\n1\n2\n3\n1\n2\n3\nˆ\nˆ\nˆ\n(\n)\nˆ\n(\n)\n,\nˆ\nˆ\nx\nx\nx\nT\nk C\nk C\nk C\nn\nk C\nk C\nk C\nn\nr\nr\nr\nr\ny\ny\ny\nr\nr\n=\n+\n+\n+\n+\n+\n \n(A40) \n1\n2\n3\n1\n2\n3\n32\n24\n1\n24\n2\n24\n3\n1\n22\n1\n22\n2\n22\n3\n2\n2\n2\n2\n2\n2\n3\n1\n2\n1\n2\n3\n2\n1\n2\n3\nˆ\nˆ\nˆ\nˆ\nˆ\nˆ\n(\n)\n(\n)\n,\ny\ny\ny\nx\nx\nx\nT\nk C\nk C\nk C\nn\nk C\nk C\nk C\nn\nr\nr\nr\nr\nr\nr\n=\n+\n+\n+\n+\n+\n \n(A41) \n1\n2\n3\n1\n2\n3\n33\n25\n1\n25\n2\n25\n3\n1\n23\n1\n23\n2\n23\n3\n2\n2\n2\n2\n3\n1\n2\n2\n2\n1\n2\n3\n1\n2\n3\n2\nˆ\nˆ\nˆ\nˆ\nˆ\n(\n)\n(\n)\n,\nˆ\nx\nx\nx\nT\nk C\nk C\nk C\nn\nk C\nk C\nk C\nn\nr\nr\nr\ny\nr\nr\nr\ny\ny\n= −\n+\n+\n−\n+\n+\n \n(A42) \n11\n1\n1\n2\n2\n3\n3,\nU\nAlnr\nA lnr\nA lnr\n=\n+\n+\n  \n \n(A43) \n12\n11\n1\n21\n2\n31\n3\n1\n2\n3\nˆ\nˆ\nˆ ,\nˆ\nˆ\nˆ\nx\nx\nx\nU\nAarctan\nA arctan\nA arctan\ny\ny\ny\n\n\n\n=\n+\n+\n  \n(A44) \n13\n12\n1\n22\n2\n32\n3\n1\n2\n3\nˆ\nˆ\nˆ ,\nˆ\nˆ\nˆ\nx\nx\nx\nU\nAarctan\nA arctan\nA arctan\ny\ny\ny\n\n\n\n=\n+\n+\n  \n(A45) \n21\n1\n2\n3\n1\n2\n3\nˆ\nˆ\nˆ ,\nˆ\nˆ\nˆ\nx\nx\nx\nU\nB arctan\nB arctan\nB arctan\ny\ny\ny\n= −\n−\n−\n  \n(A46) \n22\n11\n1\n1\n21\n2\n2\n31\n3\n3,\nU\nBlnr\nB lnr\nB lnr\n\n\n\n=\n+\n+\n  \n(A47) \n23\n12\n1\n1\n22\n2\n2\n32\n3\n3,\nU\nBlnr\nB lnr\nB lnr\n\n\n\n=\n+\n+\n  \n(A48) \n31\n1\n2\n3\n1\n2\n3\nˆ\nˆ\nˆ ,\nˆ\nˆ\nˆ\nx\nx\nx\nU\nC arctan\nC arctan\nC arctan\ny\ny\ny\n= −\n−\n−\n  \n(A49) \n32\n11\n1\n1\n21\n2\n2\n31\n3\n3,\nU\nC lnr\nC lnr\nC lnr\n\n\n\n=\n+\n+\n  \n(A50) \n33\n12\n1\n1\n22\n2\n2\n32\n3\n3,\nU\nC lnr\nC lnr\nC lnr\n\n\n\n=\n+\n+\n  \n(A51) \nwhere \n\n\n31 \n \n(\n)\n0\n0\nˆ\nˆ\n,   \n,\ni\ni\nx\nx\nx\ny\ns\ny\ny\n=\n−\n=\n−\n  \n \n(A52) \n2\n2\n2\nˆ\nˆ ,\ni\ni\nr\nx\ny\n=\n+\n  \n \n(A53) \nand \n1\ni\nj\nk  , \n2\ni\nj\nk\n , \n1,\nia\n  \n2,\nia\n  \n,\niA   \n,\niB   \n,\ni\nC   and \n(\n)\n \n1, 2, 3,   = 1, 2, ..., 5\nis\ni\nj\n=\n  are the parameters related to \nthe material constants as defined in Refs. [27, 28]. \n \nReferences \n[1] Cotterell B, Rice J. Slightly curved or kinked cracks. International Journal of Fracture. 1980;16:155-69. \n[2] He MY, Bartlett A, Evans AG, Hutchinson JW. Kinking of a crack out of an interface: role of in‐plane stress. Journal \nof the American Ceramic Society. 1991;74:767-71. \n[3] Barsoum RS. On the use of isoparametric finite elements in linear fracture mechanics. International Journal for \nNumerical Methods in Engineering. 1976;10:25-37. \n[4] Henshell R, Shaw K. Crack tip finite elements are unnecessary. International Journal for Numerical Methods in \nEngineering. 1975;9:495-507. \n[5] Banks-Sills L, Sherman D. Comparison of methods for calculating stress intensity factors with quarter-point elements. \nInternational Journal of Fracture. 1986;32:127-40. \n[6] Moës N, Dolbow J, Belytschko T. A finite element method for crack growth without remeshing. International Journal \nfor Numerical Methods in Engineering. 1999;46:131-50. \n[7] Belytschko T, Black T. Elastic crack growth in finite elements with minimal remeshing. International Journal for \nNumerical Methods in Engineering. 1999;45:601-20. \n[8] Sukumar N, Moës N, Moran B, Belytschko T. Extended finite element method for three‐dimensional crack modelling. \nInternational Journal for Numerical Methods in Engineering. 2000;48:1549-70. \n[9] Bordas S, Nguyen PV, Dunant C, Guidoum A, Nguyen‐Dang H. An extended finite element library. International \nJournal for Numerical Methods in Engineering. 2007;71:703-32. \n[10] Fries TP, Belytschko T. The extended/generalized finite element method: an overview of the method and its \napplications. International Journal for Numerical Methods in Engineering. 2010;84:253-304. \n[11] Wang Z, Yu T, Bui TQ, Tanaka S, Zhang C, Hirose S, et al. 3-D local mesh refinement XFEM with variable-node \nhexahedron elements for extraction of stress intensity factors of straight and curved planar cracks. Computer Methods in \nApplied Mechanics and Engineering. 2017;313:375-405. \n[12] Sharma K, Bui TQ, Zhang C, Bhargava R. Analysis of a subinterface crack in piezoelectric bimaterials with the \nextended finite element method. Engineering Fracture Mechanics. 2013;104:114-39. \n[13] Bui TQ, Zhang C. Analysis of generalized dynamic intensity factors of cracked magnetoelectroelastic solids by X-\nFEM. Finite Elements in Analysis and Design. 2013;69:19-36. \n[14] Bui TQ, Zhang C. Extended finite element simulation of stationary dynamic cracks in piezoelectric solids under \nimpact loading. Computational Materials Science. 2012;62:243-57. \n[15] Liu P, Yu T, Bui TQ, Zhang C. Transient dynamic crack analysis in non-homogeneous functionally graded \n\n\n32 \n \npiezoelectric materials by the X-FEM. Computational Materials Science. 2013;69:542-58. \n[16] Pan E. A BEM analysis of fracture mechanics in 2D anisotropic piezoelectric solids. Engineering Analysis with \nBoundary Elements. 1999;23:67-76. \n[17] Aliabadi M. Boundary element formulations in fracture mechanics. 1997. \n[18] Bird G, Trevelyan J, Augarde CE. A coupled BEM/scaled boundary FEM formulation for accurate computations in \nlinear elastic fracture mechanics. Engineering Analysis with Boundary Elements. 2010;34:599-610. \n[19] Aliabadi MH, Rooke DP. Numerical fracture mechanics: Springer Science & Business Media, 1991. \n[20] Zhang C, Gross D. On wave propagation in elastic solids with cracks. Southampton, UK: Computational Mechanics \nPublications, 1998. \n[21] Gao XW, Zhang C, Sladek J, Sladek V. Fracture analysis of functionally graded materials by a BEM. Composites \nScience and Technology. 2008;68:1209-15. \n[22] Zhang C. 2D and 3D dynamic Green’s functions and time-domain BIE formulations for piezoelectric solids. 2004. \n[23] García-Sánchez F, Rojas-Díaz R, Sáez A, Zhang C. Fracture of magnetoelectroelastic composite materials using \nboundary element method (BEM). Theoretical and Applied Fracture Mechanics. 2007;47:192-204. \n[24] Gu Y, Zhang C. Novel special crack-tip elements for interface crack analysis by an efficient boundary element method. \nEngineering Fracture Mechanics. 2020;239:107302. \n[25] Pan E, Yuan F. Boundary element analysis of three‐dimensional cracks in anisotropic solids. International Journal \nfor Numerical Methods in Engineering. 2000;48:211-37. \n[26] Marji MF, Hosseini_Nasab H, Kohsary AH. On the uses of special crack tip elements in numerical rock fracture \nmechanics. International Journal of Solids and Structures. 2006;43:1669-92. \n[27] Gu Y, Sun L. Electroelastic analysis of two-dimensional ultrathin layered piezoelectric films by an advanced \nboundary element method. International Journal for Numerical Methods in Engineering. 2021;122:2653-71. \n[28] Ding HJ, Wang GQ, Chen WQ. A boundary integral formulation and 2D fundamental solutions for piezoelectric \nmedia. Computer Methods in Applied Mechanics and Engineering. 1998;158:65-80. \n[29] Garcia-Sanchez F, Sáez A, Dominguez J. Anisotropic and piezoelectric materials fracture analysis by BEM. \nComputers & Structures. 2005;83:804-20. \n[30] Lei J, Chen Y, Bui TQ, Zhang C. Fatigue crack analysis in piezoelectric specimens by a single-domain BEM. \nEngineering Analysis with Boundary Elements. 2019;104:71-9. \n[31] Kuna M. Fracture mechanics of piezoelectric materials–where are we right now? Engineering Fracture Mechanics. \n2010;77:309-26. \n[32] Bai J, Rabczuk T, Gupta A, Alzubaidi L, Gu Y. A physics-informed neural network technique based on a modified \nloss function for computational 2D and 3D solid mechanics. Computational Mechanics. 2023;71:543-62. \n[33] Raissi M, Perdikaris P, Karniadakis GE. Physics-informed neural networks: A deep learning framework for solving \nforward and inverse problems involving nonlinear partial differential equations. Journal of Computational Physics. \n2019;378:686-707. \n[34] Wang S, Teng Y, Perdikaris P. Understanding and mitigating gradient flow pathologies in physics-informed neural \nnetworks. SIAM Journal on Scientific Computing. 2021;43:A3055-A81. \n[35] Lu L, Meng XH, Mao ZP, Karniadakis GE. DeepXDE: A Deep Learning Library for Solving Differential Equations. \nSiam Review. 2021;63:208-28. \n[36] Karniadakis GE, Kevrekidis IG, Lu L, Perdikaris P, Wang S, Yang L. Physics-informed machine learning. Nature \nReviews Physics. 2021;3:422-40. \n[37] Haghighat E, Raissi M, Moure A, Gomez H, Juanes R. A physics-informed deep learning framework for inversion \nand surrogate modeling in solid mechanics. Computer Methods in Applied Mechanics and Engineering. 2021;379:113741. \n\n\n33 \n \n[38] Qiu L, Wang F, Qu W, Gu Y, Qin Q-H. Spectral integrated neural networks (SINNs) for solving forward and inverse \ndynamic problems. Neural Networks. 2024;180:106756. \n[39] Xie G, Fu B, Li H, Du W, Zhong Y, Wang L, et al. A gradient-enhanced physics-informed neural networks method \nfor the wave equation. Engineering Analysis with Boundary Elements. 2024;166:105802. \n[40] Wang Q, Li C, Zhang S, Zhou C, Zhou Y. Physics-Informed Extreme Learning Machine framework for solving linear \nelasticity mechanics problems. International Journal of Solids and Structures. 2025;309:113157. \n[41] Xi Q, Fu Z, Xu W, Xue M-A, Rashed YF, Zheng J. FEM-PIKFNN for underwater acoustic propagation induced by \nstructural vibrations in different ocean environments. Computers & Mathematics with Applications. 2024;176:46-54. \n[42] Zhang N, Xu K, Yin ZY, Li K-Q, Jin Y-F. Finite element-integrated neural network framework for elastic and \nelastoplastic solids. Computer Methods in Applied Mechanics and Engineering. 2025;433:117474. \n[43] Xiao S, Bai J, Jeong H, Alzubaidi L, Gu Y. A meshless Runge-Kutta-based Physics-Informed Neural Network \nframework for structural vibration analysis. Engineering Analysis with Boundary Elements. 2025;170:106054. \n[44] Bai J, Lin Z, Wang Y, Wen J, Liu Y, Rabczuk T, et al. Energy-based physics-informed neural network for frictionless \ncontact problems under large deformation. Computer Methods in Applied Mechanics and Engineering. 2025;437:117787. \n[45] Wang Y, Sun J, Bai J, Anitescu C, Eshaghi MS, Zhuang X, et al. Kolmogorov–Arnold-Informed neural network: A \nphysics-informed deep learning framework for solving forward and inverse problems based on Kolmogorov–Arnold \nNetworks. Computer Methods in Applied Mechanics and Engineering. 2025;433:117518. \n[46] Eshaghi MS, Anitescu C, Thombre M, Wang Y, Zhuang X, Rabczuk T. Variational Physics-informed Neural Operator \n(VINO) for solving partial differential equations. Computer Methods in Applied Mechanics and Engineering. \n2025;437:117785. \n[47] Goswami S, Anitescu C, Chakraborty S, Rabczuk T. Transfer learning enhanced physics informed neural network \nfor phase-field modeling of fracture. Theoretical and Applied Fracture Mechanics. 2020;106. \n[48] Gu Y, Xie L, Qu W, Zhao S. Interface crack analysis in 2D bounded dissimilar materials using an enriched physics-\ninformed neural networks. Engineering Analysis with Boundary Elements. 2024;163:465-73. \n[49] Gu Y, Zhang C, Zhang P, Golub MV, Yu B. Enriched physics-informed neural networks for 2D in-plane crack analysis: \nTheory and MATLAB code. International Journal of Solids and Structures. 2023;276:112321. \n[50] Wei H, Yao H, Pang Y, Liu Y. Fracture pattern prediction with random microstructure using a physics-informed deep \nneural networks. Engineering Fracture Mechanics. 2022;268:108497. \n[51] He G, Zhao Y, Yan C. Multiaxial fatigue life prediction using physics-informed neural networks with sensitive \nfeatures. Engineering Fracture Mechanics. 2023;289:109456. \n[52] Chen Z, Dai Y, Liu Y. Crack propagation simulation and overload fatigue life prediction via enhanced physics-\ninformed neural networks. International Journal of Fatigue. 2024;186:108382. \n[53] Zhang P, Xie L, Gu Y, Qu W, Zhao S, Zhang C. Boundary integrated neural networks for 2D elastostatic and \npiezoelectric problems. International Journal of Mechanical Sciences. 2024;280:109525. \n[54] Zhang H, Anitescu C, Bordas S, Rabczuk T, Atroshchenko E. Artificial neural network methods for boundary integral \nequations. TechRxiv Preprint. 2022;https://doi.org/10.36227/techrxiv.20164769.v1. \n[55] Sun J, Liu Y, Wang Y, Yao Z, Zheng X. BINN: A deep learning approach for computational mechanics problems \nbased on boundary integral equations. Computer Methods in Applied Mechanics and Engineering. 2023;410:116012. \n[56] Qu W, Gu Y, Zhao S, Wang F, Lin J. Boundary integrated neural networks and code for acoustic radiation and \nscattering. International Journal of Mechanical System Dynamics. 2024;4:131-41. \n[57] Liu Y, Fan H. Analysis of thin piezoelectric solids by the boundary element method. Computer Methods in Applied \nMechanics and Engineering. 2002;191:2297-315. \n[58] Sladek J, Sladek V, Wünsche M, Zhang C. Analysis of an interface crack between two dissimilar piezoelectric solids. \nEngineering Fracture Mechanics. 2012;89:114-27. \n\n\n34 \n \n[59] Katsikadelis JT. The boundary element method for engineers and scientists : theory and applications. Second edition. \ned. London: Academic Press, 2016. \n[60] Guiggiani M. The evaluation of cauchy principal value integrals in the boundary element method-A review. \nMathematical and Computer Modelling. 1991;15:175-84. \n[61] Gao X-W, Davies TG. An effective boundary element algorithm for 2D and 3D elastoplastic problems. International \nJournal of Solids and Structures. 2000;37:4987-5008. \n[62] Gu Y, Gao H, Chen W, Zhang C. A general algorithm for evaluating nearly singular integrals in anisotropic three-\ndimensional boundary element analysis. Computer Methods in Applied Mechanics and Engineering. 2016;308:483-98. \n[63] Gao XW. An effective method for numerical evaluation of general 2D and 3D high order singular boundary integrals. \nComputer Methods in Applied Mechanics and Engineering. 2010;199:2856-64. \n[64] Guiggiani M, Casalini P. Direct computation of Cauchy principal value integrals in advanced boundary elements. \nInternational Journal for Numerical Methods in Engineering. 1987;24:1711-20. \n[65] Aliabadi MH. The boundary element method, volume 2: applications in solids and structures: John Wiley & Sons, \n2002. \n[66] Liu YJ. A new fast multipole boundary element method for solving large-scale two-dimensional elastostatic problems. \nInternational Journal for Numerical Methods in Engineering. 2006;65:863-81. \n[67] Wang H, Yao Z. Application of a new fast multipole BEM for simulation of 2D elastic solid with large number of \ninclusions. Acta Mechanica Sinica. 2004;20:613-22. \n[68] Wang PB, Yao ZH. Fast multipole DBEM analysis of fatigue crack growth. Computational Mechanics. 2006;38:223-\n33. \n[69] Gross D, Seelig T. Fracture mechanics: with an introduction to micromechanics: Springer, 2017. \n[70] Cheng C, Yao S, Han Z, Recho N, Niu Z. Evaluation of the singularity exponents and characteristic angular functions \nfor piezoelectric V-notches under in plane and out of plane conditions. Theoretical and Applied Fracture Mechanics. \n2015;76:50-9. \n[71] England AH. A Crack Between Dissimilar Media. Journal of Applied Mechanics. 1965;32:400-2. \n[72] Gu Y, Zhang CZ. Novel special crack-tip elements for interface crack analysis by an efficient boundary element \nmethod. Engineering Fracture Mechanics. 2020;239. \n[73] Tada H, Paris PC, Irwin GR. The Stress Analysis of Cracks Handbook, Third Edition: ASME Press, 2000. \n[74] Kitagawa H, Yuuki R. Analysis of arbitrarily shaped crack in a Ƥnite plate using conformal mapping, 1st report–\nconstruction of analysis procedure andits applicability. Transactions of the Japan Society of Mechanical Engineers. \n1977;43:4354-62. \n[75] Wang B-L, Mai Y-W. Impermeable crack and permeable crack assumptions, which one is more realistic? J Appl \nMech. 2004;71:575-8. \n[76] Wang B, Mai Y-W. A piezoelectric material strip with a crack perpendicular to its boundary surfaces. International \nJournal of Solids and Structures. 2002;39:4501-24. \n[77] Brebbia CA, Telles JCF, Wrobel LC. Boundary Element Techniques: Theory and Applications in Engineering: Kao \nLi, 1984. \n[78] Tanaka M, Yao Z. Boundary element methods: Elsevier, 1996. \n \n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21253v1.pdf",
    "total_pages": 34,
    "title": "A novel boundary integrated neural networks for in plane fracture mechanics analysis of elastic and piezoelectric materials",
    "authors": [
      "Peijun Zhang",
      "Yan Gu",
      "Okyay Altay",
      "Chuanzeng Zhang"
    ],
    "abstract": "In this study, we propose a novel approach, termed boundary integrated neural\nnetworks (BINNs), for analyzing in-plane crack problems within the framework of\nlinear elastic fracture mechanics. The proposed approach integrates artificial\nneural networks (ANNs) with classical boundary integral equations (BIEs),\nenabling an efficient and accurate evaluation of partial differential equations\n(PDEs) associated with fracture mechanics. Additionally, novel special\nANN-based crack-tip elements, the Special crack-tip Neural Networks(SPNNs) are\ndeveloped to improve the modeling of displacement and stress fields in regions\nnear crack tips. These specialized elements integrate the asymptotic\ncharacteristics of fracture mechanics into the neural network framework,\nensuring enhanced accuracy in capturing the intricate singularities and steep\ngradients near the crack tips. Compared to conventional simulation tools in\nfracture mechanics, the present method offers several distinct advantages.\nFirst, by embedding higher-order fracture mechanics principles into the neural\nnetworks, the method achieves a more accurate and reliable representation of\nthe near-tip fields, even when using relatively large crack-tip elements.\nSecond, the SPNNs, which incorporates information about varying near-tip\nsingularity orders, improve the method's versatility in solving problems\ninvolving complex and diverse crack-tips geometries. Moreover, the method\ndemonstrates excellent computational efficiency due to the dimensionality\nreduction achieved by employing BIEs. Numerical experiments confirm that the\nproposed framework serves as a reliable, robust, and accurate tool for\naddressing fracture mechanics problems, offering substantial advantages over\nconventional numerical approaches.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}