{
  "id": "arxiv_2502.21141v1",
  "text": "Tracks to Modernity: Railroads, Growth, and Social\nMovements in Denmark∗\nTom G¨orges, TU Dortmund University\nMagnus Ørberg Rove, University of Copenhagen\nPaul Sharp, University of Southern Denmark\nChristian Vedel,1 University of Southern Denmark\nAbstract\nHow do transport infrastructures shape economic transformation and social change? We\nexamine the impact of railway expansion in nineteenth-century Denmark on local pop-\nulation growth, occupational shifts, and the diffusion of ideas. Using a historical panel\ndataset and a difference-in-differences approach, we document that railway access signifi-\ncantly increased population growth and accelerated structural change. Moreover, railway-\nconnected areas were more likely to establish key institutions linked to civic engagement\nand the cooperative movement. These findings suggest that improved market access was\nnot only a driver of economic modernization but also a catalyst for institutional and\ncultural transformation.\nJEL codes: N73, N93, O18, R42\nKeywords: Railways, Economic Development, Institutional Change\n∗We would like to thank Christian Nielsen for conscientious RA work. We want to thank Nina Boberg-Fazlic for valuable\nfeedback.\nThis project was presented at the 2023 HEDG Miniworkshop (SDU) and the 5th Annual Meeting of the\nScandinavian Society for Economic and Social History (Oslo BI), Microdata in Economic History (CES Munich), the\nRome Workshop on Transport and History (Rome, Tor Vergata). We would like to thank every participant at these\nevents for insightful questions and comments. The codebase behind this paper as well as the paper itself benefited from\nimprovements suggested by ChatGPT.\nAll code to reproduce all the steps from raw data to the final regressions is available at\nhttps://github.com/christianvedels/Tracks to modernity\n1 Corresponding author: Christian Vedel, christian-vs@sam.sdu.dk\narXiv:2502.21141v1  [econ.GN]  28 Feb 2025\n\n\n1\nIntroduction\nIn the late nineteenth century, Denmark underwent a profound transformation. Once a largely agrarian\neconomy, the country rapidly industrialized and developed inclusive institutions that laid the founda-\ntion for its modern prosperity. A central driver of this transformation was the cooperative movement,\nparticularly in dairy production, which revolutionized agricultural productivity and created a model\nof collective economic organization that persisted into the twentieth century (Boberg-Fazlic, Jensen,\nLampe, & et al., 2023; Lampe & Sharp, 2018). But what made this development possible? While\nexisting research has highlighted the importance of factors such as access to capital, technological\ninnovation, and institutional frameworks, a crucial piece of the puzzle remains underexplored: the role\nof railways. Did railway expansion merely facilitate economic growth, or did it also serve as a catalyst\nfor deeper institutional and cultural shifts?\nThe present work examines whether railways not only promoted economic expansion but also played a\nfundamental role in shaping Denmark’s institutional landscape. Specifically, we ask: Did the expansion\nof Denmark’s railway network in the nineteenth century contribute to both economic development and\nthe spread of institutions, particularly assembly houses and folk high schools?\nThese institutions,\nclosely linked to the Grundtvigian movement, a revivalist Lutheran movement central to Danish\nnational identity (Bentzen, Boberg-Fazli´c, Sharp, Skovsgaard, & Vedel, 2023, 2024), played a critical\nrole in fostering civic engagement, education, and collective decision-making — key prerequisites for\nthe rise of cooperative enterprises. By analyzing the link between railway access, development, and the\nemergence of these institutions, we provide new insights into how infrastructure development shaped\nboth markets and ideas.\nTo answer this question, we employ a historical panel dataset that links railway expansion to economic\nand cultural outcomes at the parish level. We use a difference-in-differences framework to estimate\nthe causal effect of railway access on population growth, occupational structure, and the spread of\nassembly houses and folk high schools. Recognizing concerns about heterogeneous treatment effects\nand staggered adoption, we apply the method of Callaway and Sant’Anna (2021) to ensure that our\nestimates accurately capture the impact of rail connectivity over time.\nOur results show that railway expansion had a significant and persistent impact on economic and social\noutcomes. First, we find that parishes connected to the railway experienced substantial population\ngrowth, confirming findings from other contexts, such as Sweden (Berger & Enflo, 2017) and Prussia\n(Hornung, 2015), where railways drove long-term demographic shifts. This growth was not merely a\nmatter of redistribution; railway access also accelerated structural change, increased employment in\nmanufacturing and other non-agricultural sectors, consistent with evidence from England and Wales\n(Bogart, You, Alvarez-Palau, Satchell, & Shaw-Taylor, 2022) and the United States (Atack, Haines,\n& Margo, 2011; Donaldson & Hornbeck, 2016; Hornbeck & Rotemberg, 2024).\nSecond, we document a strong relationship between railway access and the spread of Grundtvigian\ninstitutions. Assembly houses and folk high schools - key venues for political discourse and collective\norganization - were significantly more likely to emerge in railway-connected parishes. This aligns with\n1\n\n\nresearch showing that railways facilitated the diffusion of social movements, such as the temperance\nmovement in the U.S. (Garc´ıa-Jimeno, Iglesias, & Yildirim, 2022) and grassroots political mobilization\nin Sweden (Melander, 2020). Our findings suggest that, beyond economic integration, railways also\nplayed a role in fostering civic participation and new institutional forms.\nOur study contributes to several strands of literature. First, it builds on the extensive research on\nrailways and economic development by showing that their impact extended beyond market access\nand trade expansion to shaping institutional change. While prior work has emphasized the role of\nrailways in industrialization (Atack et al., 2011; Atack, Margo, & Rhode, 2022), we highlight their\nrole in fostering the social infrastructure necessary for Denmark’s cooperative movement. Second, we\ncontribute to the literature on social movements and political change by demonstrating that phys-\nical infrastructure can serve as a conduit for ideological diffusion. Finally, our findings contribute\nto the broader literature on economic history by providing empirical evidence on the long-debated\nrelationship between market access, institutional development, and economic modernization.\nThe paper proceeds as follows. Section 2 reviews the related literature, situating our study within\nthe broader research on railways, economic development, and institutional change. Section 3 outlines\nthe conceptual framework, illustrating the mechanisms through which railway expansion influenced\nboth economic growth and the spread of Grundtvigian institutions and why this is important to\nunderstand how Denmark got to Denmark. Section 4 provides historical background on Denmark’s\nrailway expansion, its economic impact, and its role in shaping local institutions. Section 5 describes\nthe data sources and empirical strategy, detailing our approach to estimating the causal effects of\nrailway expansion. Section 6 presents the main results, examining the impact of railways on population\ngrowth, occupational shifts, and the diffusion of assembly houses and folk high schools. Finally, Section\n7 concludes with broader implications for understanding how infrastructure investments contribute to\nboth economic modernization and social transformation.\n2\nLiterature Survey\nRailroads have long been at the center of debates about their role in economic development. Fogel\n(1964) argued that railroads were not essential to U.S. economic growth, as waterways and canals\ncould have served as viable substitutes. This view challenged earlier narratives that positioned rail-\nroads as the driving force behind nineteenth-century American development. However, more recent\nwork has provided strong evidence of their transformative impact. For instance, Atack, Bateman,\nHaines, and Margo (2010) document that while rail access had only a modest effect on population\ndensity, it was instrumental in driving urbanisation in the American Midwest between 1850 and 1860.\nMoreover, Donaldson and Hornbeck (2016) show that railroads significantly expanded market access\nfor U.S. producers, leading to substantial increases in agricultural land values. Finally, Hornbeck and\nRotemberg (2024) demonstrate that railroads contributed far more to aggregate productivity growth\nthan previously estimated, particularly when accounting for inefficiencies in market access. These\nfindings underscore that railroads were not merely an alternative transportation mode but a crucial\n2\n\n\nfactor in shaping market integration and long-term economic growth.\nBeyond the United States, extensive research has examined the relationship between railways and\npopulation growth, particularly in urban areas. Several studies highlight that early access to railways\nled to lasting changes in settlement patterns and economic activity. Berger and Enflo (2017) show that\nin Sweden, towns that gained early railway access experienced persistent population growth. However,\nlater-connected towns did not necessarily catch up, suggesting limited convergence effects. The results\nwe present here are the opposite: We demonstrate that in the Danish context, the later lines were more\nimportant. Similarly, Hornung (2015) finds that railroad access significantly boosted urban growth in\n19th-century Prussia, underscoring the role of transport infrastructure in shaping urbanization. The\nlong-term effects of railway infrastructure are also evident in cases where rail access was later removed.\nGibbons, Heblich, and Pinchbeck (2024) show that the large-scale closure of railway lines in Britain\nhad persistent negative consequences. Studies from other European contexts provide further evidence\nof railway-driven population growth.1 However, so far, there is yet to be produced similar evidence for\nthe case of Denmark, with the exception of Vedel (2024) for the case of waterways. While our main\nfocus here, is to contribute to a wider literature, we think it is worth noting that we are also filling\nthis gap.\nWhile railways influenced population dynamics, their impact extended beyond this. Bogart et al.\n(2022) find that railways also caused an occupational shift away from agriculture. Similarly, Berger\n(2019) documents that railway expansion in 19th century Sweden played a crucial role in the transition\nfrom agricultural to industrial employment. Similarly, Atack et al. (2011); Hornbeck and Rotemberg\n(2024) show that the railway is associated with a shift into new forms of production. Korn and Lacroix\n(2024) finds that railways caused within sector reallocations, which they measure using bankruptcy\ndata. Our paper demonstrates a similar result. Railways also facilitate internal migration. Enflo,\nAlvarez-Palau, and Marti-Henneberg (2018) highlight that railways played a critical role in Nordic\nindustrialization by enabling resource exports, supporting rural industry, driving migration toward\nexpanding economic centers, and reducing regional inequality. B¨uchel and Kyburz (2018) show that\npopulation growth was seemingly at the cost of localized displacement. Mojica and Mart´ı-Henneberg\n(2011) document how railway expansion in France, Portugal, and Spain facilitated urban growth\nby attracting populations to cities while simultaneously accelerating rural depopulation. Escamilla-\nGuerrero (2024) finds that railroad expansion in Mexico significantly facilitated mass migration to the\nU.S..\nRailways also played a crucial role in enabling social movements. Melander (2020) finds that the\nexpansion of Sweden’s railway network between 1881 and 1910 facilitated the spread of grassroots\nsocial movements by increasing individual mobility and connectivity, leading to faster membership\ngrowth, more organizations, and greater political mobilization in the 1911 election. Similarly, Garc´ıa-\nJimeno et al. (2022) show that railroads and the telegraph helped spread the 1873–1874 Temperance\nCrusade in the U.S., highlighting how traditional communication networks enhanced the reach and\n1Esteban-Oliver (2023) for Spain, Braun and Franke (2022) for W¨urttemberg, Koopmans, Rietveld, and Huijg (2012)\nfor the Netherlands\n3\n\n\norganizational capacity of social movements.\nThese findings align with broader literature linking\nimproved communication infrastructure to political mobilization. We demonstrate that railways were\na driver of an important cultural shift towards inclusive institutions.\nRailways also had other important demographic effects, particularly on fertility.\nExpanding rail-\nway networks slowed fertility decline by increasing market access, which raised incomes affecting the\nquantity-quality trade-off (Ciccarelli, Fenske, & Mart´ı Henneberg, 2023). In industrializing England\nand Wales, Galofr´e-Vil`a (2024) finds that railway expansion increased local fertility rates by approxi-\nmately 3 percent, suggesting that improved economic conditions and connectivity may have encouraged\nlarger families. The relationship between railways and technological progress is also well-documented.\nAndersson, Berger, and Prawitz (2023) show that the expansion of the Swedish railway network fa-\ncilitated a market for ideas by reducing communication and transport costs, enabling inventors to\ndevelop and commercialize innovations beyond their local economies. In Italy, however, the link be-\ntween railroads and innovation was delayed. Martinez, Nuvolari, and Vasta (2024) find that railway\nexpansion spurred innovation only after several decades and primarily benefited independent inventors\nand low-quality patents, with the most pronounced effects occurring during the state-driven first wave\nof railway construction (1861–1878).\nOther studies emphasize railways’ broader economic, social,\nand educational impacts.\nIn Sweden, Cerme˜no, Enflo, and Lindvall (2022) show that nineteenth-\ncentury railways helped school inspectors monitor education, leading to higher attendance rates and\nan increased emphasis on nation-building subjects, while more remote schools remained under local\nreligious control. In England and Wales, Costas-Fern´andez, Guerra, and Mohnen (2020) find that\nrailroad access increased intergenerational mobility. Additionally, railway expansion has been linked\nto improvements in literacy in India (Chaudhary & Fenske, 2023) and rising school enrollment in the\nU.S. (Atack, Margo, & Perlman, 2012), underscoring how transport infrastructure influenced human\ncapital accumulation.\nThe findings suggest that infrastructure development interacts with preexisting economic and social\nstructures in complex ways, shaping long-term development trajectories. Building on this, we examine\nthe role of railways in Denmark’s nineteenth-century transformation, with a particular focus on both\neconomic and cultural change.\nWhile previous research has extensively documented how railways\ninfluenced population growth, industrialization, and market integration, less attention has been paid\nto their role in shaping social institutions and cultural movements. By analyzing the relationship\nbetween railway expansion and the spread of Grundtvigian institutions, we contribute to a growing\nbody of work that considers the broader societal impacts of transport infrastructure.\n3\nConceptual Framework\nGetting to Denmark has become a widely adopted analogy describing the challenge of establishing\nmodern, stable, and democratic institutions. Fukuyama (2011) emphasizes that such institutions do\nnot emerge fully formed but rather develop through complex historical processes, requiring a stable\nbalance of the state, rule of law, and accountable government.\nThe case of Denmark exemplifies\n4\n\n\nthis gradual evolution. In the eighteenth century, Denmark was an absolutist and militarized state\ncomprising multiple cultural and linguistic groups. The transition to a more cohesive and democratic\nsociety was far from predetermined. Central to this transformation was the role of N.F.S. Grundtvig,\na theologian and nationalist thinker whose ideas about education, civic engagement, and national\nidentity shaped Denmark’s institutional and cultural trajectory (Boberg-Fazlic et al., 2023; Fukuyama,\n2015).\nGrundtvigianism, emerging in the mid-nineteenth century, played a crucial role in fostering demo-\ncratic participation and rural enlightenment. The movement promoted education through folk high\nschools, which emphasized lifelong learning, civic responsibility, and national identity. These institu-\ntions provided an ideological foundation for the cooperative movement, which became a hallmark of\nDenmark’s economic model. Alongside these schools, assembly houses (forsamlingshuse) were estab-\nlished as venues for public discourse, education, and political organization. These spaces reinforced\nthe participatory ethos that underpinned Denmark’s political and economic modernization, with im-\npact far beyond Denmark’s shores (Bentzen et al., 2023, 2024; Boberg-Fazlic et al., 2023). At the\nsame time, cooperative creameries came to play a crucial role in this transformation (Boberg-Fazlic\net al., 2023). These cooperatives not only facilitated agricultural modernization but also reinforced\ninclusive institutions that underpinned long-term development. However, their formation required\nboth tangible and intangible preconditions. On the practical side, successful creameries depended on\nkey inputs such as centrifuges, a reliable supply of high-quality milk, and access to energy sources\nlike coal. Just as importantly, cooperatives required social and institutional foundations - a space for\ndeliberation and decision-making (the constitutional general assembly) and the conceptual framework\nfor collective organization (Lampe & Sharp, 2018).\nWe suggest that railways played an important role in enabling both the practical and institutional el-\nements of Denmark’s transformation. By improving transportation infrastructure, railways facilitated\nthe movement of coal, equipment, and finished dairy products, ensuring the viability of cooperative\nproduction. Just as critically, railways also contributed to the diffusion of modern ideas, particularly\nthrough their role in fostering Grundtvigianism, which emphasized communal organization, educa-\ntion, and civic engagement. The expansion of assembly houses, closely linked to the Grundtvigian\nmovement, provided the physical and ideological foundation for cooperative organization. In other\nwords, railway development was not merely a means of economic integration but also a conduit for\nnew forms of social organization and participatory governance.\nThe conceptual framework in Figure 1 illustrates these dynamics, showing how railway expansion con-\ntributed to both economic growth and institutional development.2 Railways enabled market access and\nstructural transformation, which, in turn, facilitated the emergence of folk high schools and assembly\nhouses—key institutions that fostered civic engagement and cooperative organization. These institu-\ntions played a crucial role in supporting the cooperative movement, which became a defining feature\nof Denmark’s modernization. By linking improved connectivity to economic and cultural change, this\n2This should not be interpreted formally as a causal model (such as a DAG), but is instead included for illustrative\npurposes.\n5\n\n\nframework highlights how infrastructure investment shaped Denmark’s long-run development.\nFigure 1: Conceptual framework: Railways, Institutional Development, and Modern Denmark\nNotes: This figure demonstrates the informal conceptual framework that we suggest to interpret the role of\nrailways in Denmark. Railways caused both economic growth and institutional diffusion, which in turn led to\nthe cooperative movement and modern Denmark.\nTable 1 presents correlational evidence from 1915, illustrating the relationship between railway connec-\ntions, assembly houses, and the presence of cooperative creameries. Column 1 indicates that parishes\nwith railway access are 10.7 percent more likely to host a cooperative creamery. Column 2 shows that\nlocations with an assembly house exhibit an even stronger correlation, being 13.8 percent more likely to\nhave a cooperative creamery. Column 3 supports that both relationships remain robust when railway\naccess and assembly houses are included simultaneously. Finally, Column 4 aggregates the analysis to\nthe hundred level, where the number of cooperatives, assembly houses, and railway-connected parishes\nare considered together. The results suggest that each additional railway connection is associated with\nan 10.9 percent increase in the number of cooperative creameries, while each assembly house corre-\nsponds to a 2.93 percent increase.\nThese findings reinforce the idea that both infrastructure and\ninstitutional factors played a crucial role in the emergence of Denmark’s cooperative movement.\nFigure 2 visually illustrates the correlation between cooperative creameries, assembly houses, and\nrailway connections. The development of modern Denmark was contingent on both the spread of\nmodern ideas—facilitated by assembly houses as centers for discussion and organization—and the\nexpansion of railways, which provided the necessary infrastructure for economic growth. This paper\n6\n\n\nTable 1: Determinants of Cooperation\nOutcome:\nAt least one cooperative creamery\nCount of coops\nParish Level\nHundred Level\n(1)\n(2)\n(3)\n(4)\nOLS\nOLS\nOLS\nPoisson\nConstant\n0.5565∗∗∗\n0.5511∗∗∗\n0.4945∗∗∗\n1.303∗∗∗\n(0.0172)\n(0.0158)\n(0.0200)\n(0.0672)\nRailway\n0.1072∗∗∗\n0.1050∗∗∗\n0.1099∗∗∗\n(0.0228)\n(0.0226)\n(0.0082)\nAssembly house\n0.1385∗∗∗\n0.1368∗∗∗\n0.0293∗∗∗\n(0.0224)\n(0.0223)\n(0.0055)\nObservations\n1,855\n1,855\n1,855\n155\nNotes: Correlation between railways, assembly houses, and the location of\ncooperative creameries. Assembly houses from (Sharp et al., 2024), railways\nfrom (Fertner, 2013), assembly house locations from (Bentzen et al., 2023).\nClustered standard errors in parenthesis *** p < 0.01 ** p < 0.05 * p < 0.10\nseeks to understand how railways contributed to prosperity, which in turn fostered the emergence of\nassembly houses and the diffusion of cooperative ideals. Fundamentally, we document how improved\nmarket access served as a precursor to Denmark’s economic takeoff and argue that railways played a\npivotal role in shaping the trajectory of modern Denmark.\n7\n\n\nFigure 2: Comparison of Assembly Houses and Connected Rail with Coops\nA. Assembly Houses vs Coops\nB. Railway connections vs Coops\nNotes: Correlation between railways, assembly houses, and the location of cooperative creameries at the parish\nlevel. Assembly houses from (Sharp et al., 2024), railways from (Fertner, 2013), assembly house locations from\n(Bentzen et al., 2023).\nThe emergence of cooperative creameries, a cornerstone of Denmark’s modern economy, depended not\nonly on the availability of key physical inputs—such as milk supplies, centrifuges, and energy—but also\non the necessary social and institutional infrastructure. Assembly houses provided a venue for deliber-\nation and the organizational capacity needed to establish cooperatives, while railways facilitated both\nthe movement of goods and ideas. Importantly, the sequence of events matters: cooperative creameries\nemerged after railways, suggesting that it cannot be that infrastructure was driven by cooperatives.\nIf anything it could only be the other way around: Infrastructure development preceded and enabled\ninstitutional innovation. This implies that economic modernization and cultural transformation were\ndeeply intertwined, with railways serving as both a direct driver of economic change and an indirect\ncatalyst for the spread of cooperative ideals. Before we empirically examine these relationships, in\nsection 5, we detail the historical background of the spread of the Danish railways below.\n4\nHistorical Background\nThe Danish trunk railway lines were constructed between 1847 and the mid-1870s, with the state\nplaying a central yet evolving role in their development. As only the state could grant concessions\nfor railway construction, the design and expansion of the network were deeply intertwined with con-\ntemporary political debates. Consequently, the layout and timing of the railways reflected political\ninterests rather than purely economic considerations (Olesen, 1990; Thestrup, 1997).\nTwo competing perspectives shaped the debate over railway planning. One faction, primarily consist-\ning of Jutlandic peasants engaged in cattle exports, advocated for a north-south railway linking Jutland\nwith Hamburg and Husum to facilitate livestock trade. In contrast, the national-liberal movement\n8\n\n\nsought to reduce Denmark’s dependence on German markets, particularly Hamburg, by strengthening\ndirect trade routes to England. Their preferred railway layout emphasized east-west connections from\nJutland to ports on the Limfjord and the western coast, ensuring efficient access to English markets\nwhile maintaining strong links to Copenhagen and key merchant towns (Hansen, 1972).\nDenmark’s first railway line, within the then-personal union with Schleswig-Holstein, opened in 1842\nbetween Kiel and Altona near Hamburg. Although proposals for a railway linking the Baltic and North\nSeas dated back to 1831, the Danish government initially resisted such plans, as they threatened\nto bypass the lucrative Øresund toll, which accounted for over a quarter of state revenue in 1847.\nHowever, geopolitical pressures eventually forced Denmark’s hand, leading to the construction of the\nKiel-Altona railway (Thestrup, 1997). At the same time, national-liberal proponents had suggested an\nalternative railway from Flensburg to Tønning, which would have strengthened Denmark’s connection\nwith England. However, in an effort to maintain Holstein within the union, the Danish government\nultimately favored the Kiel-Altona line. This pattern illustrates how railway planning was subject\nto national priorities and political considerations rather than strictly economic efficiency (Lampe &\nSharp, 2015).\nIn 1854, British entrepreneur Sir Morton Peto successfully proposed the Flensburg-Tønning line,\nadding a side track to Rendsburg to connect with the existing Kiel-Altona railway. His vested inter-\nest in steamship operations between England and Tønning partly motivated this project (Thestrup,\n1997). In modern-day Denmark, the first domestic railway line opened in 1847, linking Copenhagen\nwith Roskilde. By 1856, the extension to Korsør dramatically reduced travel times across the country,\nfacilitating connectivity between Copenhagen and Altona in just 14 hours - compared to the 36-hour\nsteamboat journey from Copenhagen to Kiel prior to rail construction (Buch & Gomard, 1933). As\nearly as 1852, Peto proposed an additional railway connecting Flensburg with Ballum on Jutland’s\nwestern coast, intending to create a direct link for agricultural exports to England. His plan included\na northward extension through Viborg, Aalborg, and Frederikshavn. This proposal, which prioritized\ncost-effectiveness over accessibility, received strong support from Jutlandic peasants. However, na-\ntional liberals criticized it for neglecting populous cities along Jutland’s eastern coast and for failing\nto provide a direct connection to Copenhagen (Thestrup, 1997).\nAfter years of political disagreement and economic uncertainty, a compromise was reached in 1861.\nThe final plan reflected national-liberal priorities by including an east-west railway from Aarhus to\nLimfjorden, enabling steamship connections to England via the newly emerged Agger Channel (Vedel,\n2024). The north-south railway route was also adjusted to pass through the fortress town of Fredericia,\nfulfilling strategic military objectives following Denmark’s experiences in the First Schleswig War.\nAdditionally, a railway across Funen, linking Nyborg and Middelfart, was approved, along with a\ndirect line from Flensburg to Kolding, completing the north-south connection to Hamburg (Olesen,\n1990).\nThe Second Schleswig War in 1864, which resulted in Denmark’s loss of southern Jutland, further\nreinforced the strategic shift towards direct trade with England. This transition was already underway\nin the 1850s, as evidenced by price integration between the Danish and British butter markets (Lampe\n9\n\n\n& Sharp, 2015). The loss of Schleswig and Holstein accelerated this reorientation, making reliance on\nHamburg politically and economically unviable. In response, Denmark prioritized the construction of\nEsbjerg harbor on Jutland’s southwest coast, along with railway connections from Holstebro, Varde,\nand Vejle. The harbor’s rapid development reflected the new commercial reality, as it provided a\ncrucial alternative to Hamburg for agricultural exports (Thestrup, 1997).\nDenmark experienced significant economic growth from the late nineteenth century through the early\ntwentieth century, shifting from a primarily grain-based economy to one focused on animal products.\nThis transition was facilitated by the expansion of railway infrastructure, which enabled efficient\nlivestock transportation and supported the growing dairy industry. The railway network also allowed\nfor the import of critical inputs such as fertilizers and coal, which were essential for large-scale dairy\nproduction (Henriques & Sharp, 2016). Moreover, the spread of railways contributed to the rise of\nnew urban centers, often referred to as railway towns. These settlements emerged around railway\nstations, developing as local transport and commercial hubs. Many of these towns hosted creameries,\ngrain mills, and other industries tied to the agricultural sector, reinforcing Denmark’s position as a\nleading exporter of dairy products. Lang˚a, for example, became an important railway junction, and\nits rapid development highlights how railway connectivity spurred localized economic growth (Groth\n& Fertner, 2013).\n5\nData and Empirical Strategy\nWe have two primary empirical objectives. First, we aim to estimate the growth effects of the in-\ntroduction of railways. Second, we seek to assess the cultural impact of railway expansion. These\ntwo dimensions are closely intertwined, and we do not attempt to establish a strict causal hierarchy\nbetween them. Rather than determining whether one factor directly caused the other, our approach\nfocuses on testing whether both are causally linked to the introduction of railways. In doing so, we\nachieve a quantitative measure of the extent to which railways played a pivotal role in shaping the\nemergence of modern Denmark.\nTo achieve this, we have matched railway lines from Fertner (2013) to parishes from Digdag.dk (2021),\nallowing us to construct a panel dataset that records whether a parish was connected to the railway\nin any given year. Economic outcomes are measured using census data from Mathiesen, Robinson,\nThomsen, and Revuelta-Eugercios (2022), from which we extract parish-level population counts and\ncalculate the child-women ratio. Additionally, we compute a measure of migration based on the number\nof individuals residing in a different county from their birthplace. Occupational data is standardized\nusing Dahl, Johansen, and Vedel (2024), which converts occupational descriptions into HISCO codes.3\nFrom this, we compute the number of non-agricultural workers, workers in manufacturing, and the\nparish-level average HISCAM scores. We classify all occupations with HISCO codes starting with 7,\n8, or 9 as manufacturing and those starting with 6 as agricultural workers.\nTo measure the spread of Grundtvigianism, we follow Bentzen et al. (2023), utilizing data on the\n3We tested 200 random samples and report a 95 percent accuracy rate.\n10\n\n\nconstruction of assembly houses and folk high schools, originally sourced from Trap, Falbe-Hansen,\nWestergaard, and Weitemeyer (1906) and Trap and Knudsen (1928). We employ two types of outcome\nvariables: A dummy variable indicating the presence of an assembly house or folk high school in a\ngiven parish and, to account for establishments in neighboring parishes, the local density of these\ninstitutions as an alternative measure. The local density of Grundtvigian institutions is calculated\nusing an inverse distance-weighted measure of market access, following Harris (1954). This approach\nassigns greater influence to nearby institutions while still accounting for the presence of more distant\nones. Specifically, for each parish i, market access is defined as\nMAi =\nX\n∀x\ndist(i, x)−1,\n(1)\nwhere dist(i, x) represents the great circle distance to from parish i each institution x. A higher value of\nthis measure indicates a greater local concentration of assembly houses or folk high schools, suggesting\nstronger regional diffusion of Grundtvigianism. Conversely, a lower value reflects institutional sparsity,\nimplying weaker exposure to these ideas. This measure captures spatial spillovers, as the presence\nof institutions in neighboring parishes contributes to the local density, reflecting the extent to which\nGrundtvigian influence transcends parish boundaries. Table 2 presents summary statistics for all these\nvariables.\n11\n\n\nTable 2: Summary statistics\nVariable\nN\nMean\nSD\nMin\nMax\nA. Census\nConnected railway\n6356\n0.17610\n0.3809\n0.00\n1.000\nChild women ratio\n6336\n0.48830\n0.1115\n0.00\n1.364\nHISCAM avg\n6355\n48.63000\n1.5030\n44.24\n82.850\nMigration\n6356\n263.20000\n390.6000\n0.00\n4299.000\nPopulation\n6356\n793.80000\n590.5000\n37.00\n13090.000\nlog(Manufacturing + 1)\n6356\n4.16400\n0.8498\n0.00\n7.941\nlog(Not agriculture + 1)\n6356\n4.47100\n0.8548\n0.00\n8.148\nB. Grundtvig\nConnected railway\n119200\n0.25760\n0.4373\n0.00\n1.000\nShare of parishes with a folk high school\n119200\n0.02945\n0.1691\n0.00\n1.000\nShare of parishes with an assembly house\n119200\n0.17150\n0.3769\n0.00\n1.000\nLocal density of assembly houses (MA)\n119200\n4.46400\n5.4040\n0.000000\n20.350\nLocal density of folk high schools (MA)\n119200\n0.70240\n0.4257\n0.005426\n3.784\nNotes: Summary statistics for our main variables. Panel A contains census data from Mathiesen et al. (2022),\npanel B contains data on Grundtvigianism in the form of assembly houses and folk high schools from Bentzen\net al. (2023).\nOur baseline empirical strategy employs a difference-in-differences estimator:\nyit = αt + αi + connected railwayitβ + εit,\n(2)\nwhere yit represents the outcome of interest, αi and αt denote parish and year fixed effects, respectively,\nand connected railwayit is an indicator variable for whether a parish has a railway passing through it\nin a given year. The coefficient β captures the average effect of railway connection on yit.\nA key concern with this specification is the presence of heterogeneous treatment effects and staggered\nadoption, which can lead to problematic comparisons where already treated units are used as controls\n(Goodman-Bacon, 2021). To address this, we follow the approach of Callaway and Sant’Anna (2021),\nwhich estimates a series of 2 × 2 classical difference-in-differences models, allowing for flexible aggre-\ngation to identify group-specific effects. Specifically, we use a specification in which the control group\nconsists of parishes that will eventually receive a railway connection but have not yet been treated.\nAnother concern is whether connected parishes are selected into being connected, and specifically\nwhether parishes, that would be connected were done so, because they were on a differential trajectory,\nwhich would bias our estimate. Figure 3 shows density estimates for the main census outcomes in\n12\n\n\n1850 (before any railway connection), as well as a number of long-run growth related covariates. The\nsimilarity in the density plots between parishes that eventually gained railway access and those that\ndid not suggests that selection bias is likely minimal. Specifically, this implies that parishes connected\nto the railway were not systematically different in key pre-treatment characteristics before the railway\nexpansion began.4\nSimilarly, for the binary Grundtvigian outcomes we compute the share of parishes with assembly\nhouses and folk high schools over time by railway status.\nThis is illustrated in figure 4.\nPlaces\nthat were connected to the railway diverged in terms of assembly houses and folk high schools, both\nassociated with Grundtvigianism.\nFurther we adopt an IV strategy, which captures well, the main lines of the expansion of the railway,\nnamely whether a least-cost path (given by the terrain) between important market towns connects\nthe parish to the railway. This is described in more detail in Appendix B.\nFigure 5 illustrates the expansion of Denmark’s railway network from 1850 to 1901, corresponding\nto the census years used in our analysis of development outcomes.5 The construction of the railway\nnetwork was a gradual process, reflecting a combination of economic imperatives and political consid-\nerations, as discussed in the historical background. Each panel depicts a different census year. Panel\nA depicts Denmark’s first railway line, opened in 1847 between Copenhagen and Roskilde. Important\nnodes,6 are also shown. Panel B, showing the railway network in 1860, highlights the extension from\nRoskilde to Korsør, which was intended to facilitate transport across the Great Belt. However, a direct\nrailway ferry connection was not established until 1883. Hence, prior to this, the absence of a fixed rail\nlink imposed frictions in connectivity, increasing transport costs and travel times for passengers, goods\nand mail across the Belt between Zealand and Funen. Panel C, capturing the state of the railway\nnetwork in 1880, marks a period of rapid expansion. Between 1860 and 1880, the railway network\ngrew significantly, linking major towns across Denmark. By this stage, rail access was beginning to\ninfluence both economic activity and social change. Panel D, presenting the network in 1901, shows a\nnear-complete railway system.\n4Appendix A supplements this with density plots, which are grouped by when the parish was connected. Qualitatively\nthis demonstrates the same. Despite of this we also try a specification with controls in Appendix C.\n5Appendix B supplements this with maps including least cost paths.\n6Defined as market towns with above the 75th percentile of population in 1801 as well as important nodes for crossing\nwater, Korsør and Middelfart, and the West coast Esbjerg, Ringkøbing, Holstebro, and Varde. These were some of the\nterminal points that politicians aimed for, when Denmark was connected.\n13\n\n\nFigure 3: Distribution of variables in 1850\nNotes: Density estimates of a number of variables from the census data and other covariates by railway status.\n8 parishes (of 1589), which were already connected in 1850, were excluded from these plots.\n14\n\n\nFigure 4: The distribution of Grundtvigianism over time\nNotes: This illustrates the spread of Grundtvigianism over time in the form of folk high schools and assembly\nhouses.\n15\n\n\nFigure 5: Danish Railway Expansion\n(A) 1850\n(B) 1860\n(C) 1880\n(D) 1901\nNotes: This figure displays the Danish railroad network, based on data from Fertner (2013), as solid black\nlines for the years 1850 (Panel A), 1860 (Panel B), 1880 (Panel C) and 1901 (Panel D). Important nodes,\nthat would be connected, are shown as black dots. The administrative boundaries of Denmark are taken from\nhttps://dataforsyningen.dk/. For illustrative purposes, the small island of Bornholm is excluded.\n16\n\n\n6\nResults\nTable 3 presents the regression results for key economic outcomes. Panel A reports the Two-Way Fixed\nEffects (TWFE) estimates, while Panel B displays the Callaway and Sant’Anna (2021) estimates.\nColumn (1) shows that railway access is associated with a population increase of approximately 6.5\npercent. Column (2) indicates no significant impact on fertility, as measured by the child-women ratio.\nColumn (3) demonstrates a significant increase in the number of individuals working in manufactur-\ning, while Column (4) shows a similar positive effect for occupations outside agriculture. Notably,\nboth of these effects exceed the overall population growth effect, suggesting that railway expansion\nwas not merely facilitating demographic expansion but also shifting occupational structures. Column\n(5) provides evidence of an increase in the average parish-level HISCAM score, indicating an overall\nimprovement in occupational status. Finally, Column (6) shows a rise in the number of individuals\nborn in a different county, suggesting that railways facilitated internal migration. These results col-\nlectively indicate that railways played a transformative role in local economic development, not only\nby increasing population but also by reshaping labor markets and patterns of migration.7\nTable 4 suggests a positive causal relationship between railway connection and the spread of Grundtvi-\ngianism, as measured by the presence of assembly houses and folk high schools. Panel A presents the\nTwo-Way Fixed Effects (TWFE) estimates, while Panel B reports the Callaway and Sant’Anna es-\ntimates. Columns (1) and (2) show results using an indicator variable for whether a parish had an\nassembly house or a folk high school. The TWFE estimates indicate that railway access is associated\nwith a statistically significant increase in the probability of a parish having an assembly house (Column\n1) and, to a lesser extent, a folk high school (Column 2). The Callaway and Sant’Anna estimates also\nshow a significant increase in the probability of a parish having a folk high school but no significant\neffect on assembly houses. Columns (3) and (4) use local density, measured via market access, as the\noutcome variable instead. While the TWFE estimates in Column (3) do not show a significant effect\non the density of assembly houses, Column (4) suggests a positive and significant effect on the den-\nsity of folk high schools. The Callaway and Sant’Anna estimates in Panel B reinforce these findings,\nshowing a significant increase in both density measures.8 Overall, these results suggest that railway\naccess facilitated the expansion of Grundtvigian institutions, reinforcing the role of infrastructure in\nshaping the emergence of modern Denmark. However, the apparently different results between the two\n7We note, that the density plots shown above does not call for any controls to be added. Yet, to err on the side of\ncaution, Appendix C shows results using extensive controls in the classical way for TWFE results and using the Sant’Anna\nand Zhao (2020) Doubly Robust method for the Callaway and Sant’Anna (2021) results. The TWFE estimates in Table\nA1 Panel A remain similar, with the exception of the average HISCAM, which is still positive but now insignificant.\nFor Table A1 Panel B, the parameter signs are similar in size an magnitude, but only the result for population growth\nremain statistically significant.\n8Once again, we note, that the density plots shown above does not call for any controls to be added. Yet, to err on\nthe side of caution, Appendix C shows results using extensive controls in the classical way for TWFE results and using\nthe Sant’Anna and Zhao (2020) Doubly Robust method for the Callaway and Sant’Anna (2021) results. The TWFE\nestimates in Table A2 Panel A remain similar. For Table A1 Panel B, the sign of the estimates remains positive but\nnothing is significant.\n17\n\n\nmethods, for especially the Grundtvigian outcomes, motivates a further decomposition of dynamics.9\nWe turn to this next.\nTo gain deeper insight into the dynamics at play, we must consider how the impact of railway con-\nnection varied over time. Figure 6 presents the results of decomposing the census data results by the\nperiod in which a parish was connected — before 1860, between 1861 and 1880, or between 1881 and\n1901 — aligned with census years. For each of these groups we compute the average effect over the en-\ntire period in which it was connected. Panel A illustrates that population growth was either negligible\nor slightly negative for parishes connected in the first wave but became positive for later connections.\nPanel B suggests a borderline negative effect on the child-women ratio for the 1860 group, with no\nsignificant effect for the subsequent periods. Panel C indicates a positive impact on manufacturing\nemployment, but only for parishes connected in the 1880 and 1901 waves, with an uncertain effect for\nthe earliest group. Panel D follows a similar pattern, showing growth in non-agricultural occupations\nprimarily for later-connected parishes. Panel E highlights that the only group experiencing a consis-\ntent positive impact on HISCAM scores was the 1880 cohort. Finally, Panel F reveals a substantial\npositive effect on migration (approximately 30 percent) exclusively for the 1901 group, whereas earlier\nconnections saw either no effect or a slight decline. This suggests that migration to railway towns\nonly became a significant factor in the later phases of railway expansion. It should be noted that our\nmeasure of internal migration only captures migration from other counties, whereas we cannot pick\nup local migration within counties.10\n9Complementing this, the results of the IV estimation are provided in Appendix D. However, it is important to note\nthat our instrument primarily captures the main line rollout. As the decomposition of these results demonstrate below,\nthese early expansions were associated with lower responsiveness, particularly concerning development outcomes. The IV\nresults still lend support to our earlier findings. Specifically, both the Two-Way Fixed Effects (TWFE) regressions, using\nthe LCP instrument for railway access, and the Callaway and Sant’Anna specifications, which employ the instrument\ndirectly in a reduced-form approach, reveal statistically significant positive effects of railway access on population growth,\naverage social status, and the local density of assembly houses and folk high schools. Notably, the IV estimates also\nalign well with the expected timing, as suggested by the effect decompositions in Figures 6 and 7, which are introduced\nbelow.\n10An alternative decomposition is offered in Appendix E, where we compute the average effect irrespective of connection\ntiming for each census year. The same the same qualitative patterns remain.\n18\n\n\nTable 3: Railways and Local Development\nOutcome:\nlog(Pop.)\nlog(Child women ratio)\nlog(Manufacturing + 1)\nlog(Not Agriculture + 1)\nHISCAM avg\nlog(Migration)\n(1)\n(2)\n(3)\n(4)\n(5)\n(6)\nA. TWFE estimates\nConnected railway\n0.0654∗∗∗\n-0.0003\n0.1200∗∗∗\n0.0950∗∗∗\n0.1723∗∗∗\n0.1124∗∗∗\n(0.0106)\n(0.0032)\n(0.0195)\n(0.0190)\n(0.0604)\n(0.0417)\nObservations\n6,356\n6,336\n6,356\n6,356\n6,355\n6,356\nMean of outcome\n6.4738\n0.39484\n4.1637\n4.4711\n48.631\n4.4012\nB. Callaway and Sant’Anna estimates\nConnected railway\n0.06736∗∗∗\n0.001052\n0.09863∗∗∗\n0.07238∗∗∗\n0.2207∗∗∗\n0.09671∗∗\n(0.01127)\n(0.003378)\n(0.02224)\n(0.02218)\n(0.07203)\n(0.04505)\nObservations\n6324\n6244\n6324\n6324\n6320\n6324\nMean of Outcome\n6.472\n0.3949\n4.161\n4.468\n48.62\n4.394\nNotes: This table presents regression results for key economic outcomes. Panel A shows Two-Way Fixed Effects (TWFE) estimates, and\nPanel B shows estimates from Callaway and Sant’Anna (2021). Columns (1) through (6) report the effects of railway access on population,\nfertility (child-women ratio), manufacturing employment, non-agricultural employment, HISCAM scores, and internal migration. Clustered\n(Parish) standard errors in parenthesis *** p < 0.01 ** p < 0.05 * p < 0.10\n19\n\n\nTable 4: Railways and Grundtvigianism\nOutcome:\nAssembly house\nFolk high school\nDensity Assembly\nDensity Folk High\nhouses (MA)\nSchools (MA)\n(1)\n(2)\n(3)\n(4)\nA. TWFE estimates\nConnected railway\n0.0405∗∗∗\n0.0106∗\n-0.0237\n0.0144∗∗\n(0.0134)\n(0.0058)\n(0.0697)\n(0.0073)\nObservations\n119,175\n119,175\n119,175\n119,175\nMean of outcome\n0.17150\n0.02945\n4.4639\n0.70244\nB. Callaway and Sant’Anna estimates\nConnected railway\n-0.003269\n0.01582∗∗\n0.1198∗\n0.0348∗∗∗\n(0.01398)\n(0.006652)\n(0.0714)\n(0.007533)\nObservations\n119200\n119200\n119200\n119200\nMean of Outcome\n0.1715\n0.02945\n4.464\n0.7024\nNotes: This table presents the relationship between railway access and the spread of Grundtvi-\ngian institutions. Panel A shows Two-Way Fixed Effects (TWFE) estimates, and Panel B\nshows estimates from Callaway and Sant’Anna (2021). Columns (1) and (2) report the prob-\nability of having assembly houses and folk high schools. Columns (3) and (4) report the local\ndensity of these institutions. Clustered (Parish) standard errors in parenthesis *** p < 0.01 **\np < 0.05 * p < 0.10\nFigure 7 provides a parallel decomposition for the spread of assembly houses and folk high schools,\nserving as proxies for Grundtvigianism. However, since we have year by year data, there are many\ngroups to compare, and for that reason, we prefer the decomposition by calendar time. That is, we\ntake the average effect for all connected parishes experienced in some particular year. While statistical\npower is limited, the estimates largely align with the patterns observed for economic and demographic\noutcomes. Panel A, shows that for assembly houses, the estimated effect remains close to zero or\nslightly negative until the 1880s, after which it becomes modestly positive. Panel B displays a similar\npattern for folk high schools, where initial volatility in the 1860s and 1870s gives way to small positive\neffects toward the late 19th century. Panels C and D report density measures, capturing not only the\npresence but also the local concentration of these institutions. For assembly houses in Panel C, the\neffect is negligible until around the mid-1880s, then rises substantially, while for folk high schools in\nPanel D, the density effect also shifts from minimal to small positive values post-1880. Overall, all\npanels consistently illustrate that the railway’s influence on Grundtvigian institutions was minimal\nbefore the 1880s and emerged more strongly afterward, highlighting the evolution of these cultural\nand institutional outcomes over calendar time.11\nTo interpret these results, it key here, to understand that neither assembly houses or folk high schools\nhad any inherent need of the railway, once they were first established. It only requires the idea to\n11An alternative decomposition is offered in Appendix F, where we compute the average effect by treatment year, but\nrounding down to the closest decade. The same the same qualitative patterns remain.\n20\n\n\nFigure 6: Effect decomposed by when a parish was treated (census)\n(A) log(Pop.)\n(B) log(Child women ratio)\n(C) log(Manufacturing + 1)\n(D) log(Not Agriculture + 1)\n(E) HISCAM avg\n(F) log(Migration)\nNotes: These figures shows the effects of the railway on economic outcomes decomposed by year.\narrive (here by railways) and someone to be motivated to manifest these ideas into institutions. The\nrailway mattered for the spread of Grundtvigianism, but it mattered for the local density of these\nideas, and less strongly so, for the particular parishes which were connected.\nThe results presented in this section provide strong evidence that the introduction of railways played\na crucial role in shaping both economic and cultural transformations in Denmark. Rail connections\nfacilitated population growth, occupational shifts towards manufacturing and non-agricultural work,\ninternal migration and generally better occupational outcomes as reflected in higher HISCAM scores.\nAt the same time, railways appear to have contributed to the spread of Grundtvigianism, particularly\nthrough the establishment of assembly houses and folk high schools. However, these effects were not\nimmediate - especially economic changes materialized with a lag, becoming more pronounced towards\nthe late nineteenth century, whereas the new ideas arrived earlier. This suggests that infrastructure\ndevelopment did not merely accelerate preexisting trends but actively contributed to the emergence\nof modern Denmark by reshaping patterns of economic activity, migration, and cultural organization.\n21\n\n\nFigure 7: Effect decomposed by year (Grundtvig)\n(A) Assembly house\n(B) Folk high school\n(C) Assembly house (density)\n(B) Folk high school (density)\nNotes: These figures shows the effect of the railway decomposed by when it was connected to a specific parish.\n7\nConclusion\nWe have examined the role of railway expansion in shaping Denmark’s economic transformation and\nthe spread of social movements during the nineteenth century. While previous research has documented\nthe economic impact of railways in facilitating trade, urbanization, and structural change, our study\ngoes further by exploring their role in fostering social and cultural shifts. Specifically, we provide\nevidence that railways not only contributed to population growth and occupational change but also\nplayed a key role in the diffusion of Grundtvigian institutions, which in turn supported the emergence\nof cooperative enterprises.\nOur empirical findings lend support to the idea that railway access significantly increased local popu-\nlation growth, consistent with findings from other historical contexts. This expansion was not merely\nredistributive; instead, it facilitated a broader transition away from agriculture and towards manufac-\n22\n\n\nturing and services, reflecting structural change that was fundamental to Denmark’s modernization.\nImportantly, we show that these economic effects were complemented by institutional changes, as\nrailway-connected areas were more likely to develop assembly houses and folk high schools. These\ninstitutions, which were central to the Grundtvigian movement, provided the organizational frame-\nwork for civic engagement and collective decision-making, key preconditions for the emergence of\nDenmark’s cooperative creameries. By establishing a causal link between railway expansion and the\nspread of Grundtvigian institutions, our findings contribute to a broader literature on the interplay\nbetween infrastructure development and social change. While prior studies have examined how rail-\nways facilitated market integration and technological diffusion, we highlight their role as a conduit\nfor ideological transformation. The case of Denmark illustrates how improved connectivity can serve\nas both an economic and cultural catalyst, reinforcing inclusive institutions that promote long-term\ndevelopment.\nMoreover, our findings underscore the importance of sequencing in the development process.\nWe\ndocument that railways preceded the establishment of cooperatives, suggesting that economic mod-\nernization created the conditions necessary for institutional innovation. This sequence aligns with\nbroader theories of development, which emphasize the interaction between physical infrastructure,\nmarket access, and institutional capacity. In Denmark’s case, railways not only enabled economic\ngrowth but also created the social preconditions for cooperative organization, which became a corner-\nstone of the country’s economic model.\nThese insights have broader implications for understanding how infrastructure investments shape\nnational trajectories. While the Danish case is historically specific, it resonates with contemporary\ndebates on the role of transport networks in fostering inclusive development. Our findings suggest\nthat policymakers should consider not only the economic benefits of infrastructure investments but\nalso their potential to influence institutional and cultural change. By fostering civic participation,\neducation, and collective decision-making, infrastructure projects can have far-reaching effects beyond\ntheir immediate economic returns.\nTaken together, our results highlight that the impact of railways extended beyond commerce and\nindustry—they helped shape the very institutions that underpinned Denmark’s modern economic\nand social model. Future research could build on this work by further investigating the mechanisms\nthrough which transport networks influence institutional evolution, as well as exploring how similar\ndynamics have played out in other historical and contemporary contexts.\n23\n\n\nReferences\nAagesen, A. (1949). Geografiske studier over jernbanerne i danmark. I Kommission: H. Hagerup.\nRetrieved from https://books.google.de/books?id=cKYbAAAAIAAJ\nAndersson, D., Berger, T., & Prawitz, E. (2023, 03). Making a Market: Infrastructure, Integration,\nand the Rise of Innovation. The Review of Economics and Statistics, 105(2), 258-274. Retrieved\nfrom https://doi.org/10.1162/rest a 01067 doi: 10.1162/rest a 01067\nAtack, J., Bateman, F., Haines, M., & Margo, R. A. (2010). Did Railroads Induce or Follow Economic\nGrowth? Urbanization and Population Growth in the American Midwest, 1850-1860. Social\nScience History, 34(2), 171–197. Retrieved 2025-02-12, from http://www.jstor.org/stable/\n40587344\nAtack, J., Haines, M., & Margo, R. A. (2011). Railroads and the Rise of the Factory: Evidence for\nthe United States, 1850-1870. In P. R. Rhode & D. Weiman (Eds.), Economic evolution and\nrevolutions in historical time (pp. 162–179). Palo Alto, CA: Stanford University Press.\nAtack, J., Margo, R., & Perlman, E.\n(2012).\nThe Impact of Railroads on School Enrollment in\nNineteenth Century America. Unpublished Working Paper, Boston University.\nAtack, J., Margo, R. A., & Rhode, P. W. (2022). Industrialization and urbanization in nineteenth\ncentury america. Regional Science and Urban Economics, 94, 103678. Retrieved from https://\nwww.sciencedirect.com/science/article/pii/S0166046221000387 (Urban Economics and\nHistory) doi: https://doi.org/10.1016/j.regsciurbeco.2021.103678\nBentzen, J. S., Boberg-Fazli´c, N., Sharp, P., Skovsgaard, C. V., & Vedel, C. (2023). Holy cows and\nspilt milk-the impact of religious conflict on firm-level productivity (Tech. Rep.).\nBentzen, J. S., Boberg-Fazli´c, N., Sharp, P., Skovsgaard, C. V., & Vedel, C. (2024). Assimilate for\ngod: The impact of religious divisions on danish american communities (Tech. Rep.).\nBerger, T.\n(2019).\nRailroads and Rural Industrialization:\nevidence from a Historical Policy\nExperiment.\nExplorations in Economic History, 74, 101277.\nRetrieved from https://\nwww.sciencedirect.com/science/article/pii/S0014498318302080\ndoi: https://doi.org/\n10.1016/j.eeh.2019.06.002\nBerger, T., & Enflo, K.\n(2017).\nLocomotives of local growth: The short- and long-term impact\nof railroads in sweden. Journal of Urban Economics, 98, 124-138. Retrieved from https://\nwww.sciencedirect.com/science/article/pii/S0094119015000595\n(Urbanization in De-\nveloping Countries: Past and Present) doi: https://doi.org/10.1016/j.jue.2015.09.001\nBoberg-Fazlic, N., Jensen, P. S., Lampe, M., & et al.\n(2023).\nGetting to denmark: the role of\nagricultural elites for development. Journal of Economic Growth, 28, 525–569. Retrieved from\nhttps://doi.org/10.1007/s10887-023-09226-8 doi: 10.1007/s10887-023-09226-8\nBogart, D., You, X., Alvarez-Palau, E. J., Satchell, M., & Shaw-Taylor, L. (2022). Railways, di-\nvergence, and structural change in 19th century england and wales.\nJournal of Urban Eco-\nnomics, 128, 103390. Retrieved from https://www.sciencedirect.com/science/article/\npii/S0094119021000723 doi: https://doi.org/10.1016/j.jue.2021.103390\nBraun, S. T., & Franke, R.\n(2022).\nRailways, growth, and industrialization in a developing\ngerman economy, 1829–1910.\nThe Journal of Economic History, 82(4), 1183–1221.\ndoi:\n24\n\n\n10.1017/S0022050722000377\nBuch, M., & Gomard, C. I. (1933). Danmarks jernbaner. historisk og biografisk haandbog (Vol. 1).\nAlex Kappels Forlag.\nB¨uchel, K., & Kyburz, S. (2018, 12). Fast track to growth? railway access, population growth and\nlocal displacement in 19th century switzerland. Journal of Economic Geography, 20(1), 155-195.\nRetrieved from https://doi.org/10.1093/jeg/lby046 doi: 10.1093/jeg/lby046\nCallaway, B., & Sant’Anna, P. H. (2021). Difference-in-differences with multiple time periods. Journal\nof Econometrics, 225(2), 200-230. Retrieved from https://www.sciencedirect.com/science/\narticle/pii/S0304407620303948\n(Themed Issue: Treatment Effect 1) doi: https://doi.org/\n10.1016/j.jeconom.2020.12.001\nCerme˜no, A. L., Enflo, K., & Lindvall, J.\n(2022).\nRailroads and reform: How trains strength-\nened the nation state.\nBritish Journal of Political Science, 52(2), 715–735.\ndoi: 10.1017/\nS0007123420000654\nChaudhary, L., & Fenske, J. (2023). Railways, Development, and Literacy in India. The Journal of\nEconomic History, 83(4), 1139–1174. doi: 10.1017/S0022050723000372\nCiccarelli, C., Fenske, J., & Mart´ı Henneberg, J. (2023). Railways and the European Fertility Transi-\ntion (The Warwick Economics Research Paper Series (TWERPS) No. 1477). University of War-\nwick, Department of Economics. Retrieved from https://ideas.repec.org/p/wrk/warwec/\n1477.html\nCostas-Fern´andez, J., Guerra, J.-A., & Mohnen, M. (2020). Train to Opportunity: The Effect of\nInfrastructure on Intergenerational Mobility. Documento CEDE(48).\nDahl, C. M., Johansen, T., & Vedel, C. (2024). Breaking the hisco barrier: Automatic occupational\nstandardization with occcanine. Retrieved from https://arxiv.org/abs/2402.13604\nDigdag.dk. (2021). DigDag - Digital Atlas of the Danish Historical-Administrative Geography. Copen-\nhagen: Rigsarkivet (Danish National Archives). Retrieved from www.digdag.dk/\nDonaldson, D., & Hornbeck, R. (2016, 02). Railroads and American Economic Growth: A “Market\nAccess” Approach.\nThe Quarterly Journal of Economics, 131(2), 799-858.\nRetrieved from\nhttps://doi.org/10.1093/qje/qjw002 doi: 10.1093/qje/qjw002\nEnflo, K., Alvarez-Palau, E., & Marti-Henneberg, J. (2018). Transportation and Regional Inequality:\nThe Impact of Railways in the Nordic Countries, 1860–1960. Journal of Historical Geography,\n62, 51–70.\nEscamilla-Guerrero, D. (2024). All aboard! Railroad access and Mexico-US mass migration (Oxford\nEconomic and Social History Working Papers No. 212). University of Oxford, Department of\nEconomics. Retrieved from https://EconPapers.repec.org/RePEc:oxf:esohwp: 212\nEsteban-Oliver, G.\n(2023, 04).\nOn the right track?\nrailways and population dynamics in spain,\n1860–1930. European Review of Economic History, 27(4), 606-633. Retrieved from https://\ndoi.org/10.1093/ereh/head007 doi: 10.1093/ereh/head007\nFertner, C.\n(2013).\nHistorical Railroads in Denmark.\nhttps://researchprofiles.ku.dk/en/\ndatasets/historiske-jernbaner-i-danmark-geodatas%C3%A6t.\n(Geodataset, accessed on\n06.02.2025)\n25\n\n\nFogel, R. W. (1964). Railroads and American Economic Growth. Johns Hopkins Press Baltimore.\nFukuyama, F.\n(2011).\nThe origins of political order: From prehuman times to the french rev-\nolution.\nFarrar, Straus and Giroux.\nRetrieved from https://books.google.dk/books?id=\neyEONn0WUmMC\nFukuyama, F.\n(2015).\nNation building and state building.\nIn J. A. Hall, O. Korsgaard, &\nO. K. Pedersen (Eds.), Building the nation: N.f.s. grundtvig and danish national identity (pp.\n29–50).\nMcGill-Queen’s University Press.\nRetrieved from http://www.jstor.org/stable/\nj.ctt13x0p07.5\nGalofr´e-Vil`a, G. (2024). Railroads, fertility and the demographic transition in England and Wales.\nCliometrica, 1–19.\nGarc´ıa-Jimeno, C., Iglesias, A., & Yildirim, P. (2022, January). Information networks and collective\naction: Evidence from the women’s temperance crusade. American Economic Review, 112(1),\n41–80. Retrieved from https://www.aeaweb.org/articles?id=10.1257/aer.20180124\ndoi:\n10.1257/aer.20180124\nGibbons, S., Heblich, S., & Pinchbeck, E. W. (2024). The spatial impacts of a massive rail disinvest-\nment program: The beeching axe. Journal of Urban Economics, 143, 103691. Retrieved from\nhttps://www.sciencedirect.com/science/article/pii/S0094119024000615\ndoi: https://\ndoi.org/10.1016/j.jue.2024.103691\nGoodman-Bacon, A. (2021). Difference-in-differences with variation in treatment timing. Journal of\nEconometrics, 225(2), 254-277. Retrieved from https://www.sciencedirect.com/science/\narticle/pii/S0304407621001445\n(Themed Issue: Treatment Effect 1) doi: https://doi.org/\n10.1016/j.jeconom.2021.03.014\nGroth, N. B., & Fertner, C. (2013). Stationsbyer i dag. Realdania.\nHansen, S. A. (1972). Økonomisk vækst i danmark (Vol. I: 1720-1914). København: Universitetsfor-\nlaget i København.\nHarris, C. D. (1954). The Market as a Factor in the Localization of Industry in the United States.\nAnnals of the Association of American Geographers, 44(4), 315–348.\nHenriques, S. T., & Sharp, P. (2016). The danish agricultural revolution in an energy perspective: A\ncase of development with few domestic energy sources. The Economic History Review, 69(3),\n844–869. doi: 10.1111/ehr.12294\nHerzog, I. (2016). The potential and limits of optimal path analysis. In Computational approaches to\narchaeological spaces (pp. 179–211). Routledge.\nHornbeck, R., & Rotemberg, M.\n(2024).\nGrowth off the rails:\nAggregate productivity growth\nin distorted economies.\nJournal of Political Economy, 132(11), 3547-3602.\nRetrieved from\nhttps://doi.org/10.1086/730548 doi: 10.1086/730548\nHornung, E.\n(2015, 08).\nRailroads and Growth in Prussia.\nJournal of the European Economic\nAssociation, 13(4), 699-736.\nRetrieved from https://doi.org/10.1111/jeea.12123\ndoi:\n10.1111/jeea.12123\nKoopmans, C., Rietveld, P., & Huijg, A. (2012). An accessibility approach to railways and municipal\npopulation growth, 1840–1930. Journal of Transport Geography, 25, 98-104. Retrieved from\n26\n\n\nhttps://www.sciencedirect.com/science/article/pii/S0966692312000361\n(Special Sec-\ntion on Accessibility and Socio-Economic Activities: Methodological and Empirical Aspects)\ndoi: https://doi.org/10.1016/j.jtrangeo.2012.01.031\nKorn, T., & Lacroix, J.\n(2024).\nThe Bankruptcy Express:\nMarket Integration, Organizational\nChanges, and Financial distress in 19th century Britain (Hannover Economic Papers (HEP)).\nLeibniz Universit¨at Hannover, Wirtschaftswissenschaftliche Fakult¨at. Retrieved from https://\nEconPapers.repec.org/RePEc:han:dpaper:dp-731\nLampe, M., & Sharp, P. (2015). How the danes discovered britain: The international integration of\nthe danish dairy industry before 1880. European Review of Economic History, 19(4), 432–453.\ndoi: 10.1093/ereh/hev013\nLampe, M., & Sharp, P. (2018). A Land of Milk and Butter. University of Chicago Press. Retrieved\nfrom https://ideas.repec.org/b/ucp/bkecon/9780226549507.html\nLewis, J.\n(2023).\nleastcostpath:\nModelling pathways and movement potential within a land-\nscape [Computer software manual]. Retrieved from https://CRAN.R-project.org/package=\nleastcostpath (R package version 2.0.12)\nMartinez, M., Nuvolari, A., & Vasta, M.\n(2024).\nRails of Progress?\nExploring the Nexus be-\ntween Railroad Access and Innovation in Italy (19th-20th Centuries). SSRN Working Paper.\n(Available at SSRN: https://ssrn.com/abstract=5066156 or http://dx.doi.org/10.2139/\nssrn.5066156)\nMathiesen, N., Robinson, O., Thomsen, A., & Revuelta-Eugercios, B. (2022). Link-Lives Data v.1.2.1.\nDenmark: Danish National Archives/University of Copenhagen. Retrieved from https://www\n.rigsarkivet.dk/udforsk/link-lives-data/\nMelander, E. (2020). Transportation Technology, Individual Mobility and Social Mobilisation (CAGE\nOnline Working Paper Series). Competitive Advantage in the Global Economy (CAGE). Re-\ntrieved from https://EconPapers.repec.org/RePEc:cge:wacage:471\nMojica, L., & Mart´ı-Henneberg, J. (2011, 06). Railways and Population Distribution: France, Spain,\nand Portugal, 1870–2000. The Journal of Interdisciplinary History, 42(1), 15-28. Retrieved\nfrom https://doi.org/10.1162/JINH a 00203 doi: 10.1162/JINH a 00203\nOlesen, M. N. (1990). Danske jernbaner gennem tiderne (2. udg. ed.). Lamberths Forlag.\nSant’Anna, P. H., & Zhao, J. (2020). Doubly robust difference-in-differences estimators. Journal of\nEconometrics, 219(1), 101-122. Retrieved from https://www.sciencedirect.com/science/\narticle/pii/S0304407620301901 doi: https://doi.org/10.1016/j.jeconom.2020.06.003\nSharp, P., Henriques, S., McLaughlin, E., Tsoukli, X., & Vedel, C. (2024). A microlevel analysis of\ndanish dairy cooperatives: Opportunities for large data in business history – erratum. Enterprise\n&; Society, 25(3), 698–698. doi: 10.1017/eso.2023.13\nThestrup, P. (1997). Dampen binder danmark sammen (Vol. I Til 1914). Jernbanemuseet.\nTrap, J. P., Falbe-Hansen, V., Westergaard, H., & Weitemeyer, H. (1906). Kongeriget danmark (3rd\ned.). Copenhagen: Universitetsboghandler G. E. C. Gad.\nTrap, J. P., & Knudsen, G. (1928). Kongeriget danmark (4th ed., Vol. 4). Copenhagen: Universitets-\nboghandler G. E. C. Gad.\n27\n\n\nVedel, C. (2024). A perfect storm: First-nature geography and economic development. Retrieved from\nhttps://arxiv.org/abs/2408.00885\n28\n\n\nAppendix\nA\nDensity plots by year\nThe density plots shown in Figure A1 offer a visual comparison of key variables from the census data,\ngrouped by the period during which each parish was connected to the railway. These groups consist\nof parishes connected to the railway before 1860, between 1861 and 1880, between 1881 and 1901,\nand those that were never connected. The distinction between the periods of connection is crucial\nas it helps us assess whether there were systematic differences between parishes that received railway\nconnections at different points in time. The very first lines, connecting Copenhagen differs slightly,\nbut not enough that we should be concerned that there is a lack of common support (non-overlapping\ndistributions).\ni\n\n\nFigure A1: Distribution of variables in 1850 of dependent on period in which the parish was connected\nto the railway\nNotes: Density estimates of a number of variables from the census data and other covariates, separated by the\nyear when each parish was connected to the railway. Parishes that were already connected in 1850 (8 out of\n1589) are excluded from these plots.\nii\n\n\nB\nDetails about the computation of the instrument\nDenmark is mostly flat, with the highest natural point, Møllehøj, only 170 meters above sea level.\nNevertheless, according to Aagesen (1949), the terrain played a crucial role in determining the his-\ntoric Danish railway routes. Specifically, the landscape, especially in East and Central Jutland, is\ncharacterized by hilly moraine areas and deep tunnel valleys, and the limited power of early engines\nrestricted the ability to overcome steep inclines. Consequently, paths of least resistance - such as val-\nleys and terraces with minimal gradients - were preferred wherever possible. Building on this insight,\nwe construct least-cost paths between key nodes for our instrumental variable approach, capturing the\ntopographically determined routes that are most feasible given these historical constraints.\nWe define nodes as the top 25% of market towns in 1801 based on population size. This criterion\nensures that the most economically significant urban centers (exogenously determined before the\ninvention of railways) are captured. To achieve comprehensive geographic coverage, we add Esbjerg,\nRingkøbing, Holstebro, and Varde (to represent the west coast) and Korsør and Middelfart (to ensure\nconnectivity across Funen and Sealand). All of this aligns well with what we describe in Section 4 on\nthe Historical Background.\nThe least-cost paths (LCP) are computed using Lewis (2023), applying a slope-dependent cost function\nfor wheeled transport suggested by Herzog (2016):\ncost(s) = 1 +\n\u0010s\nˆs\n\u00112\n,\n(3)\nwhere s denotes the percentage slope, and ˆs represents a critical percentage slope parameter. According\nto Herzog (2016), this critical slope parameter typically ranges between 8% and 16% for wheeled\ntransport, reflecting the point at which switchbacks become more efficient than direct routes.\nGiven Denmark’s predominantly flat topography we tested all integer critical slope values from 1% to\n16% to assess the ability of the resulting LCPs to predict the historical railway network. To determine\nwhich critical slope value best predicted the actual lines, we calculated the root mean square error\n(RMSE) between the realized railway lines and those predicted by the respective LCPs. The critical\nslope value of 1% yields the lowest RMSE, indicating the closest alignment between the predicted and\nactual railway routes. This suggests that even small inclines significantly influenced route planning.\nFor each pair of nodes, we compute the least-cost path in the specific year they were historically\nconnected, generating a panel of parish connections based purely on topographical considerations.\nThis method results in a network resembling the main railway lines established around Denmark by\n1876. However, the approach does not capture smaller branch lines constructed after 1876. And as\nour paper shows, these were in some regards more important, which is the clear drawback of this\ninstrument, that made us relegate it to this appendix.\nFigure A2 replicates Figure 5 but adds the LCP lines. Panel A depicts Denmark’s first railway line,\nopened in 1847 between Copenhagen and Roskilde, and the corresponding LCP, which closely follows\nthe actual route. The nodes used in the construction of the LCPs are also visible. Panel B, showing\niii\n\n\nthe railway network in 1860, highlights the extension from Roskilde to Korsør, which was intended\nto facilitate transport across the Great Belt.\nHowever, a direct railway ferry connection was not\nestablished until 1883. Panel C, capturing the state of the railway network in 1880, marks a period of\nrapid expansion. Between 1860 and 1880, the railway network grew significantly, linking major towns\nacross Denmark. This period also coincides with the last variation in the LCP instrument in 1876. By\nthis stage, rail access was beginning to influence both economic activity and social change, particularly\nthrough improved market integration and the spread of civic institutions. Panel D, presenting the\nnetwork in 1901, shows a near-complete railway system. By this time, many of the lines predicted\nby our LCP instrument had materialized, including key connections such as Copenhagen to Helsingør\nand Randers to Aalborg.\niv\n\n\nFigure A2: Danish Railway Expansion and LCP Instrument\n(A) 1850\n(B) 1860\n(C) 1880\n(D) 1901\nNotes: This figure displays the Danish railroad network, based on data from Fertner (2013), as solid black\nlines for the years 1850 (Panel A), 1860 (Panel B), 1880 (Panel C) and 1901 (Panel D). The constructed least-\ncost paths are shown as dashed red lines, and the nodes used in their construction are shown as black dots.\nThe administrative boundaries of Denmark are taken from https://dataforsyningen.dk/. For illustration\npurposes, the island of Bornholm is excluded.\nv\n\n\nC\nRegressions with controls\nTables A1 and A2 present estimates of the effect of railway access on local development and Grundtvi-\ngian institutions, now including additional controls.\nTable A1 reports the results for economic and demographic outcomes. In Panel A, which shows the\ntwo-way fixed effects (TWFE) estimates, railway access is associated with a statistically significant\n6.6 pct increase in population (Column 1). The effect on the child-women ratio (Column 2) remains\neffectively zero, suggesting that fertility patterns, on average, were unaffected by railway expansion.\nColumn 3 shows a 12.4 pct increase in manufacturing employment, and Column 4 reports a 10.4 pct\nincrease in non-agricultural occupations, reinforcing the idea that railway access facilitated structural\nchange away from agriculture. However, there is no significant impact on average occupational status\nas measured by HISCAM scores (Column 5). Lastly, Column 6 indicates that railway access led to\nan increase in internal migration of around 10.1 pct, suggesting that improved connectivity enabled\nlabor mobility.\nPanel B presents estimates using the Callaway and Sant’Anna approach, which accounts for hetero-\ngeneous treatment effects across cohorts and staggered adoption. These estimates indicate a 5.1 pct\nincrease in population but suggest a smaller effect on employment shifts compared to the TWFE\nestimator. Manufacturing and non-agricultural employment effects are positive but imprecisely esti-\nmated, while the migration effect remains sizable, though not statistically significant. Overall, both\nspecifications reinforce the conclusion that railway access facilitated urbanization and occupational\nshifts, primarily through migration and employment transitions outside agriculture.\nTable A2 examines the relationship between railway access and the expansion of Grundtvigian institu-\ntions (assembly houses and folk high schools). The TWFE estimates in Panel A suggest that railway\naccess increased the likelihood of a parish having an assembly house by 4.0 percentage points (Column\n1) and a folk high school by 1.1 percentage points (Column 2), with the latter result being marginally\nsignificant. However, when considering density measures (Columns 3 and 4), railway access does not\nsignificantly influence the local concentration of assembly houses but does increase the density of folk\nhigh schools.\nIn contrast, the Callaway and Sant’Anna estimates (Panel B) find no statistically significant effects\nacross any of the measures, suggesting that the timing of railway expansion relative to the diffusion\nof Grundtvigian institutions may be more complex than initially assumed. While the TWFE results\nindicate some positive correlations, these effects appear weaker when accounting for potential selection\ninto treatment using alternative estimators.\nTaken together, these results suggest that railway access played a clear role in fostering local economic\ntransformation, particularly through migration and employment shifts, while its impact on the spread\nof Grundtvigian institutions appears more modest and less robust across specifications.\nWe note here, that the pre-treatment distributions shown in Figure 3, does not indicate a need for\nsuch controls. The primary issue with the estimates presented in Tables A1 and A2 is the lack of\ndecomposition across time periods or treatment cohorts.\nWithout decomposing the effects, these\nvi\n\n\nresults only capture the average impact of railway access over the entire period, potentially masking\nimportant variation in the timing and dynamics of the effects, which reassuringly reappear once we\ndecompose the effects.\nvii\n\n\nTable A1: Railways and Local Development (with controls)\nOutcome:\nlog(Pop.)\nlog(Child women ratio)\nlog(Manufacturing + 1)\nlog(Not Agriculture + 1)\nHISCAM avg\nlog(Migration)\n(1)\n(2)\n(3)\n(4)\n(5)\n(6)\nA. TWFE estimates\nConnected railway\n0.0664∗∗∗\n0.0011\n0.1237∗∗∗\n0.1036∗∗∗\n0.0862\n0.1013∗∗\n(0.0094)\n(0.0032)\n(0.0203)\n(0.0193)\n(0.0645)\n(0.0399)\nObservations\n6,356\n6,336\n6,356\n6,356\n6,355\n6,356\nMean of outcome\n6.4738\n0.39484\n4.1637\n4.4711\n48.631\n4.4012\nB. Callaway and Sant’Anna estimates\nConnected railway\n0.05082∗∗∗\n0.001728\n0.03566\n0.02279\n-0.005995\n0.1097\n(0.01507)\n(0.005953)\n(0.03963)\n(0.03352)\n(0.1454)\n(0.07472)\nObservations\n6324\n6244\n6324\n6324\n6320\n6324\nMean of Outcome\n6.472\n0.3949\n4.161\n4.468\n48.62\n4.394\nNotes: Clustered (Parish) standard errors in parenthesis *** p < 0.01 ** p < 0.05 * p < 0.10\nviii\n\n\nTable A2: Railways and Grundtvigianism (with controls)\nOutcome:\nAssembly house\nFolk high school\nDensity Assembly\nDensity Folk High\nhouses (MA)\nSchools (MA)\n(1)\n(2)\n(3)\n(4)\nA. TWFE estimates\nConnected railway\n0.0405∗∗∗\n0.0106∗\n-0.0237\n0.0144∗∗\n(0.0134)\n(0.0058)\n(0.0697)\n(0.0073)\nObservations\n119,175\n119,175\n119,175\n119,175\nMean of outcome\n0.17150\n0.02945\n4.4639\n0.70244\nB. Callaway and Sant’Anna estimates\nConnected railway\n-0.002901\n0.0002402\n0.03798\n0.00112\n(0.02078)\n(0.01124)\n(0.03091)\n(0.0118)\nObservations\n119200\n119200\n119200\n119200\nMean of Outcome\n0.1715\n0.02945\n4.464\n0.7024\nNotes: Measures of Grundtvigianism and the spread of the railway. Clustered (Parish)\nstandard errors in parenthesis *** p < 0.01 ** p < 0.05 * p < 0.10\nD\nInstrumented regressions\nTables A3 and A4 present instrumental variable (IV) estimates of the effect of railway access on\nlocal development and Grundtvigian institutions. These estimates leverage a least-cost-path (LCP)\ninstrument to isolate exogenous variation in railway expansion, ensuring that the estimated effects\nare not driven by endogenous placement decisions. We exclude the nodes of the LCP, so all treated\nparishes we observe here, are connected because they - by chance - are on the LCP between other\nimportant places. Additionally, we exclude parishes whose centroids are located within 10 km of a\nnode to account for potential spillover effects.\nIt is important to note, that the Callaway and Sant’Anna (2021) estimates reported in Panel B\nare based on reduced-form regressions, where the outcome variables are directly regressed on the\nLCP instrument rather than railway access itself. This approach is necessary because, to the best\nof our knowledge, there is currently no established method for incorporating an instrument into a\nstaggered adoption difference-in-differences framework. As a result, the reduced-form estimates should\nbe interpreted as the effect of predicted railway access (as determined by least-cost-path placement)\nrather than the effect of actual railway construction.12\nA key consideration when interpreting these results is that the instrument primarily captures the effect\nof early railway expansion, as the least-cost-path approach is most relevant for identifying the routes\nof the main railway lines, which were established first. This is important because, as demonstrated\n12To avoid comparing to places which are connected by actual railways later, we exclude these from this particular\nregression.\nix\n\n\nelsewhere in the paper, the early railways often had smaller or even negative effects compared to later\nexpansions.\nTable A3 presents the instrumented effects of railway access on economic and demographic outcomes.\nThe IV estimates in Panel A suggest that railway access led to a 20.6 pct increase in population\n(Column 1), a much larger estimate than in the baseline regressions. However, effects on manufacturing\nand non-agricultural employment (Columns 3 and 4), while positive, are not statistically significant,\nreinforcing the earlier finding that early railway lines were less effective in driving structural change\ncompared to later expansions.\nSimilarly, while railway access significantly increased occupational outcomes as measured by HISCAM\nscores (Column 5, 1.58 points, significant at 5 pct), the effect on migration (Column 6) is negative\nand imprecise, which is consistent with earlier findings that early railway lines did not immediately\ndrive migration into railway-connected areas. Instead, it was later expansions, coinciding with broader\nindustrialization, that had stronger migration effects.\nPanel B presents reduced-form estimates using the Callaway and Sant’Anna (2021) approach, which\nreinforces these conclusions. The population effect (3.9 pct) is still positive and significant, but the\neffects on employment shifts and migration remain smaller and less robust, further supporting the idea\nthat the main railway lines, established first, had weaker transformative effects than later expansions.\nTable A5 show the first stage. The F statistic, at 40.854 is above conventional level to limit concerns\nof weak instruments. A parish on the least cost path is 14.46 pct more likely to be connected to the\nrailway.\nTable A4 examines the impact of railway access on the spread of Grundtvigian institutions. The IV\nestimates in Panel A suggest that railway access increased the likelihood of having an assembly house\nby 25.5 percentage points (Column 1), though this estimate is imprecisely measured. The effect on folk\nhigh schools is negative but not statistically significant (Column 2). However, the density measures\n(Columns 3 and 4) suggest that railway access significantly increased the regional concentration of\nboth assembly houses (4.53 points) and folk high schools (0.20 points).\nThese findings must be understood in the context of railway expansion timing. Since the IV estimates\nprimarily capture the effect of main railway lines, they suggest that early railway connections facili-\ntated the regional spread of Grundtvigian institutions, even if they were not directly responsible for\nestablishing them in individual parishes (effects in parishes are insignificant, but local densities are\ngenerally more significant).\nThe reduced-form Callaway and Sant’Anna (2021) estimates in Panel B, where the LCP is directly\nregressed on the outcomes, suggest no significant effect on assembly houses but a positive effect\non folk high schools (1.58 percentage points, Column 2). Furthermore, railway access significantly\nincreased the density of both assembly houses and folk high schools, reinforcing the idea that early\nrailways were instrumental in the regional diffusion of cultural and political movements, even if their\nimmediate impact was weaker than later expansions.\nTable A6 show the first stage. The F statistic, at 730.01 is highly above conventional level to limit\nx\n\n\nconcerns of weak instruments. A parish on the least cost path is 16.79 pct more likely to be connected\nto the railway.\nxi\n\n\nTable A3: Railways and Local Development (instrumented)\nOutcome:\nlog(Pop.)\nlog(Child women ratio)\nlog(Manufacturing + 1)\nlog(Not Agriculture + 1)\nHISCAM avg\nlog(Migration)\n(1)\n(2)\n(3)\n(4)\n(5)\n(6)\nA. TWFE estimates\nConnected railway\n0.2064∗\n-0.0109\n0.2917\n0.2055\n1.583∗∗\n-0.6508\n(0.1240)\n(0.0364)\n(0.2599)\n(0.2601)\n(0.7932)\n(0.5248)\nObservations\n5,500\n5,487\n5,500\n5,500\n5,499\n5,500\nMean of outcome\n6.4738\n0.39805\n4.1564\n4.4656\n48.613\n4.4131\nB. Callaway and Sant’Anna estimates (reduced form)\nConnected railway\n0.0392∗\n0.002019\n0.04416\n0.03679\n0.4256∗∗∗\n0.03686\n(0.02224)\n(0.007529)\n(0.04479)\n(0.04104)\n(0.1628)\n(0.07324)\nObservations\n3568\n3528\n3568\n3568\n3568\n3568\nMean of outcome\n6.397\n0.3976\n4.088\n4.397\n48.58\n4.354\nNotes: Clustered (Parish) standard errors in parenthesis *** p < 0.01 ** p < 0.05 * p < 0.10\nxii\n\n\nTable A4: Railways and Grundtvigianism (instrumented)\nOutcome:\nAssembly house\nFolk high school\nDensity Assembly\nDensity Folk High\nhouses (MA)\nSchools (MA)\n(1)\n(2)\n(3)\n(4)\nA. TWFE estimates\nConnected railway\n0.2545\n-0.0872\n4.533∗∗∗\n0.2019∗\n(0.1737)\n(0.0791)\n(1.196)\n(0.1038)\nObservations\n103,125\n103,125\n103,125\n103,125\nMean of outcome\n0.17054\n0.02898\n4.3991\n0.69150\nB. Callaway and Sant’Anna estimates\nConnected railway\n-0.003269\n0.01582∗∗\n0.1198∗\n0.0348∗∗∗\n(0.01398)\n(0.006652)\n(0.0714)\n(0.007533)\nObservations\n119200\n119200\n119200\n119200\nMean of Outcome\n0.1715\n0.02945\n4.464\n0.7024\nNotes: Measures of Grundtvigianism and the spread of the railway. Clustered (Parish)\nstandard errors in parenthesis *** p < 0.01 ** p < 0.05 * p < 0.10\nTable A5: Railways and Local Development (first stage)\nConnected railway\n(1)\nVariables\nConnected LCP\n0.1446∗∗∗\n(0.0387)\nFit statistics\nF-test (1st stage)\n40.854\nNotes:\nFirst stage of Table A3 Clustered\n(Parish) standard errors in parenthesis ***\np < 0.01 ** p < 0.05 * p < 0.10\nxiii\n\n\nTable A6: Railways and Grundtvigianism (first stage)\nConnected railway\n(1)\nVariables\nConnected LCP\n0.1679∗∗∗\n(0.0371)\nFit statistics\nF-test (1st stage)\n730.01\nNotes:\nFirst stage of Table A4 Clustered\n(Parish) standard errors in parenthesis ***\np < 0.01 ** p < 0.05 * p < 0.10\nE\nCensus decompose calendar\nFigure A3 presents the estimated effect of railway access on the six main census-based outcomes by\ncalendar year, rather than by the time each parish was connected. Panel A shows the impact on the\nlog of total population, indicating that while the effect is somewhat negative around 1860, it becomes\nclearly positive by 1880 and 1900, suggesting that the railway’s boost to local population took hold after\nan initial lag. Panel B depicts the log of the child-women ratio—our proxy for fertility—revealing only\nminor or slightly negative effects in the early years, with little discernible change thereafter. In Panel\nC, we see the effect on log(manufacturing + 1), where “manufacturing” is the number of individuals\nemployed in HISCO-coded occupations starting with 7, 8, or 9. The estimates become more positive\nover time, reflecting a growing presence of manufacturing in railway-connected parishes.\nTurning to broader occupational structure, Panel D displays the effect on log(non-agricultural em-\nployment + 1), combining manufacturing and other non-farm activities. This pattern largely mirrors\nmanufacturing, underscoring a general shift toward non-agricultural work. Panel E shows the average\nHISCAM score—an index of occupational status—exhibiting a moderate but steady rise from 1860\nto 1900 in connected parishes, suggesting that railway access was linked to a gradual upgrading of\nlocal occupational structures. Finally, Panel F plots the effect on log(migration), where migration\nis measured as the number of parish residents born in a different county. Here, the estimates are\nlarge and positive around 1860, dip somewhat by 1880, and then rise again by 1900, indicating waves\nof in-migration to connected parishes as the railway network and economic opportunities expanded.\nOverall, these results support that railways had increasingly positive effects on population, employ-\nment composition, occupational status, and migration over the latter half of the 19th century.\nxiv\n\n\nFigure A3: Effect decomposed by year (census)\n(A) log(Pop.)\n(B) log(Child women ratio)\n(C) log(Manufacturing + 1)\n(D) log(Not Agriculture + 1)\n(E) HISCAM avg\n(F) log(Migration)\nNotes: These figures shows the effects of the railway on economic outcomes decomposed by year.\nF\nGrundtvig decompose by decade\nFigure A4 plots the estimated effect of the railway on Grundtvigian outcomes, with the results decom-\nposed by decade, by rounding down each treatment year to the closest decade. In Panel A, the only\nstatistically significant effect emerges in the 1880–1890 period, where assembly houses are 8.7 percent\nmore likely (S.E. 0.00963) to be established in railway-connected parishes. For folk high schools (Panel\nB), no statistically significant effects are observed, though the estimates remain positive across most\nperiods. Panels (C) and (D) present the density-based measures, incorporating neighboring parishes.\nThe parishes connected in the period 1860-1869 experienced a large positive effect on the local den-\nsity of the Grundtvigian institutions, while there was a slight negative effect on assembly houses in\n1870-1879 and no significant results elsewhere.\nxv\n\n\nFigure A4: Effect decomposed by period, when a parish was connected (Grundtvig)\n(A) Assembly house\n(B) Folk high school\n(C) Assembly house (density)\n(D) Folk high school (density)\nNotes: These figures show the effect of the railway decomposed by when a specific parish was connected.\nxvi\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21141v1.pdf",
    "total_pages": 45,
    "title": "Tracks to Modernity: Railroads, Growth, and Social Movements in Denmark",
    "authors": [
      "Tom Görges",
      "Magnus Ørberg Rove",
      "Paul Sharp",
      "Christian Vedel"
    ],
    "abstract": "How do transport infrastructures shape economic transformation and social\nchange? We examine the impact of railway expansion in nineteenth-century\nDenmark on local population growth, occupational shifts, and the diffusion of\nideas. Using a historical panel dataset and a difference-in-differences\napproach, we document that railway access significantly increased population\ngrowth and accelerated structural change. Moreover, railway-connected areas\nwere more likely to establish key institutions linked to civic engagement and\nthe cooperative movement. These findings suggest that improved market access\nwas not only a driver of economic modernization but also a catalyst for\ninstitutional and cultural transformation.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}