{
  "id": "arxiv_2502.21214v1",
  "text": "arXiv:2502.21214v1  [quant-ph]  28 Feb 2025\nWhat is ontic and what is epistemic in the\nQuantum Mechanics of Spin?\nAriel Caticha\nDepartment of Physics, University at Albany-SUNY,\nAlbany, NY 12222, USA.\nAbstract\nEntropic Dynamics (ED) provides a framework that allows the re-\nconstruction of the quantum formalism by insisting on ontological and\nepistemic clarity and adopting entropic methods and information geome-\ntry. Our present goal is to extend the ED framework to account for spin.\nThe result is a realist ψ-epistemic model in which the ontology consists\nof a particle described by a deﬁnite position plus a discrete variable that\ndescribes Pauli’s peculiar two-valuedness. The resulting dynamics of prob-\nabilities is, as might be expected, described by the Pauli equation. What\nmay be unexpected is that the generators of transformations – Hamiltoni-\nans and angular momenta including spin, are all granted clear epistemic\nstatus. To the old question ‘what is spinning?’ ED provides a crisp an-\nswer: nothing is spinning.\n1\nIntroduction\nThe framework of Entropic Dynamics (ED) allows the formulation of dynamical\ntheories as an application of the method of maximum entropy [1][2][3]. It allows,\namong other things, a derivation of the Schr¨odinger equation including its linear\nand complex structure, and it also clariﬁes the most controversial aspect of\nquantum mechanics (QM) — its interpretation [3][4][5]. The controversy centers\naround the question of what is real or ontic at the microscopic quantum level.\nFurthermore, it is not clear either how the epistemic aspects of the theory are\nhandled. Are probabilities already present at the microscopic level or do they\nonly arise at the macroscopic classical level when measurements are performed?\nCould we perhaps need some altogether diﬀerent type of quantum or exotic\nprobability?\nIn the ED approach the main concern is to achieve ontological and epistemo-\nlogical clarity and, therefore, before any further discussion it may be desirable\nto be explicit about the terminology: The paradigmatic ontic concept is mat-\nter; a quantity is said to be ‘ontic’ when it refers to something real, substantial.\nThe paradigmatic epistemic quantities are probabilities and wave functions; a\nconcept is ‘epistemic’ when it refers to the state of belief, opinion, or knowledge\n1\n\n\nof an agent (who, for our current purposes, we shall assume to be an ideally\nrational agent). Models such as ED that invoke ontic variables (e.g., position)\nwhile the wave function remains fully epistemic are often described as “realist\nψ-epistemic models.” There exist powerful no-go theorems that rule out large\nfamilies of such models — the so-called “ontological” models — because they\ndisagree with QM. For an extended list of references and a discussion of how\nED evades those no-go theorems see [6]. Brieﬂy, ED is realist and ψ-epistemic,\nbut it is not an ontological model.\nOn a related issue, it is important to emphasize that the distinction on-\ntic/epistemic is not the same as the distinction objective/subjective. Probabil-\nities, for example, are always fully epistemic (because they codify credences or\ndegrees of belief) but they can lie anywhere in the spectrum from objective to\nsubjective. To be explicit: probabilities in QM are fully objective, but in other\ncontexts probabilities can be subjective because two agents could hold diﬀerent\nbeliefs as a result of diﬀerent priors or diﬀerent data. This paper, however, is\nnot about philosophy; it is about extending the ED framework to the discussion\nof the quantum mechanics of spin.\nIn 1923 Pauli introduced a “peculiar, classically not describable two-valuedness”\n[7][8] associated to spin and to the exclusion principle. Spin is an angular mo-\nmentum and that, in itself, is not particularly strange, but ever since Uhlenbeck\nand Goudsmit’s 1925 idea of spin [9], the nature of what, if anything, is actually\nspinning, and the nature of the peculiar two-valuedness has been and continues\nto be a subject of interest and of numerous studies.\nThe standard Copenhagen interpretation is silent on these questions; it for-\ngoes the possibility of any visualizable spin models. In other interpretations,\nhowever, spin can be an ontic variable that is variously attributed either to\na spinning particle, or to the helical motion of a point particle as guided by\na wave function, and the latter might be a Bohmian wave function, a Pauli\nspinor, a Dirac spinor, a real spinor function in the language of geometric alge-\nbra, or stochastic mechanics, or more closely related to quantum information.\nA non-exhaustive list of references includes [10]-[23]; in particular, [14] and\n[16] deal with the interpretation of relativistic spin and the Dirac equation, and\n[21] [22] [23] contain a wealth of recent references, both to foundational and more\ncomputational applications. None of these models, however, provide insights as\nto why the Pauli equation takes the particular form it does (e.g., how does one\nderive the linearity, the adoption of complex numbers, and so on).\nIn a previous work [24][25] we presented a nonrelativistic ED model for a\nsingle spin-1/2 point particle. The position of the particle was assumed to be\nthe only ontic variable and spin was recovered as a property of its epistemic\nwave function. The model was successful in the sense that it provided a recon-\nstruction of the single-particle Pauli equation but two features have hindered its\nsatisfactory extension to several particles. The ﬁrst is that the four real degrees\nof freedom of the single particle spinor allow an elegant geometric interpreta-\ntion in terms of a probability density plus the three Euler angles that deﬁne the\nrotation from a ﬁxed lab frame to a spatially varying “spin” frame attached to\nthe particle [24]. Unfortunately, this very appealing feature does not generalize\n2\n\n\nto several particles because it is not in general possible to attach a separately\nrotating spin frame to each individual particle. One speciﬁc goal of the present\npaper is to provide an ED reconstruction of the Pauli equation that could in\nprinciple be extended to several particles because it does not rely on individual\nspin frames.\nThe second feature is relevant to the eventual extension to identical par-\nticles. The purpose of deploying an information-based framework such as ED\nto reconstruct QM is to provide natural explanations for the typical quantum\neﬀects — interference, entanglement, tunneling, etc. The Pauli exclusion prin-\nciple, however, has so far proved resistant in the sense that it could only be\nimplemented by force, that is, by an ad hoc, unexplained antisymmetrization of\nthe wave function. Here we take a ﬁrst step towards a more natural explanation.\nIt turns out that, among all quantum eﬀects, the exclusion principle is unique\nin that it is remarkably robust. While eﬀects such as interference, entanglement,\ntunneling, etc., are all destroyed by noise, the exclusion principle can survive\nunder the most extreme conditions such as, for example, in the interior of stars.\nA natural explanation would follow from the observation that quantum eﬀects\nthat are sensitive to noise and decoherence can all be traced to the wave function,\nthat is, to the epistemic sector of ED. The robustness of the exclusion principle\nstrongly suggests that its explanation lies in the ontic sector.\nWe shall reconstruct the non-relativistic one-particle Pauli equation by en-\nlarging the ontology to include both the position of the point particle and Pauli’s\ndiscrete two-valued variable. This answers the question ‘what is real?’ and de-\nﬁnes what variables we are uncertain about (Section 2). The probabilities of\nthese variables form a statistical manifold — the epistemic conﬁguration space\n— and its associated cotangent bundle constitutes the epistemic phase space.\nNext, in Section 3, we brieﬂy discuss the kinematics of Hamilton-Killing ﬂows,\nwhich singles out those special curves that are adapted to the natural geomet-\nrical structures of the epistemic phase space. The discussion of which among\nthose special curves qualify to describe evolution in time — this is the actual\nentropic dynamics — starts in Section 4 where we study the ED of inﬁnitesi-\nmally short steps, followed by the construction of an entropic notion of time in\nSection 5, and the derivation of a continuity equation for the evolution for prob-\nability in Section 6. In Section 7 we derive the corresponding Hamiltonian and\nthe Pauli equation. The reconstruction of orbital and spin angular momenta as\ngenerators of those Hamilton-Killing ﬂows that also generate rotations is given\nin Section 8. Some ﬁnal thoughts and conclusions are collected in Section 9.\nTo make this paper somewhat self-contained some material presented in [4] is\nreproduced here. However, the present paper reﬂects substantial diﬀerences: it\nderives subquantum trajectories that are non-diﬀerentiable and Brownian, while\nin [4] they are smooth like Bohmian trajectories; furthermore, the addition of a\ndiscrete two-valued variable requires a revised treatment of time.\n3\n\n\n2\nThe ontic and the epistemic sectors\nThe ﬁrst step is to specify the subject matter — the ontology. We consider\na point particle living in a ﬂat Euclidean space. The particle is assumed to\nhave a deﬁnite position described as x = {xa, a = 1, 2, 3} in Cartesian coor-\ndinates. In addition we assume the particle occupies a deﬁnite state denoted\nk = {−1, +1}, which corresponds to Pauli’s peculiar, “classically not describable\ntwo-valuedness”. Both the assumption of a deﬁnite x and of a deﬁnite k already\nrepresent a major departure from the standard Copenhagen interpretation.\nNext, we discuss the epistemic sector. ED is a dynamics of probabilities. The\ngoal is to study the evolution of the joint probability distribution ρ(k, x) and\nits canonically conjugate momentum ξ(k, x). We adopt the following notation:\nwe shall often abbreviate k = ±1 by k = ± and write\nρ(k, x) = ρkx = ρ±x\nand\nξ(k, x) = ξkx = ξ±x .\n(1)\nAs discussed in [3][4][5] it is convenient to transform from the generalized coor-\ndinates (ρ, ξ) to complex coordinates, known as the wave function,\nΨ(x) =\n\u0012ψ+x\nψ−x\n\u0013\nwhere\nψ±x = ψkx = ρ1/2\nkx exp i\nℏξkx .\n(2)\nClearly, the wave function Ψ(x) also belongs in the epistemic sector. The new\ncanonically conjugate pairs are (ψkx, iℏψ∗\nkx) and the transformation (ρkx, ξkx) →\n(ψkx, iℏψ∗\nkx) is a canonical transformation. The generators of translations and\nrotations, the momentum ˜P[ρ, ξ] and the angular momentum ˜J[ρ, ξ], are quan-\ntities that obviously also belong in the epistemic sector.\nThe weight of tradition leads us to refer to k as ‘spin’ but this might not\nbe fully appropriate because k is ontic while spin, being an angular momen-\ntum, is an epistemic quantity. We might also refer to k as a ‘qubit’ but some\ncaution, however, is called for because of the need to distinguish an ontic qubit\n(a discrete two-valued ontic variable like k) from an epistemic qubit (a two-\ndimensional Hilbert space). It seems clear that talking about spin or about\nqubits without being aware of what is ontic and what is epistemic in QM will\nlead to considerable confusion. Interestingly, the same kind of confusion can\narise with the classical term ‘bit’ which applies both to the ontic bit (which\nrefers to binary subsystem in the physical memory of a digital computer) and\nto the epistemic bit (which refers to a unit of amount of information as measured\nby the Shannon entropy). This kind of confusion is often reﬂected in expressions\nsuch as “information is physical”. Nevertheless, tradition weighs heavy, and we\nshall often use the terms ‘spin’ or ‘qubit’ and trust that whether one refers to\nthe ontic or the epistemic version can be understood from the context.\n3\nKinematics: Hamilton-Killing ﬂows\nThe discussion of Hamilton-Killing or HK ﬂows can be carried out by a straight-\nforward extension of the treatment for discrete variables (e.g., the quantum die)\n4\n\n\nin [5] and for continuous variables (particle positions) in [4]. Here we shall omit\nmost technical details; for a pedagogical discussion see [3].\nOnce local coordinates {ρkx, ξkx} on the e-phase space, have been established\nthere is a natural choice of symplectic form,\nΩ\ndef\n=\nZ\ndxP\nk\n\u0010\n˜∇ρkx ⊗˜∇ξkx −˜∇ξkx ⊗˜∇ρkx\n\u0011\n,\n(3)\nwhere ˜∇is the gradient in e-phase space. Alternatively, we can do a canonical\ntransformation to complex coordinates {ψkx, iℏψ∗\nkx}, eq.(2), and let the coordi-\nnates of a point Ψ in e-phase space be\nΨµx =\n\u0000Ψ1x, Ψ2x, Ψ3x, Ψ4x\u0001\n=\n\u0000ψ+x, iℏψ∗\n+x, ψ−x, iℏψ∗\n−x\n\u0001\n,\n(4)\nthen\nΩ\ndef\n=\nZ\ndxP\nk\n\u0010\n˜∇ψkx ⊗˜∇iℏψ∗\nkx −˜∇iℏψ∗\nkx ⊗˜∇ψkx\n\u0011\n,\n(5)\nand the tensor components of Ωare\n[Ωµx,µ′x′] =\n\n\n0\n1\n0\n0\n−1\n0\n0\n0\n0\n0\n0\n1\n0\n0\n−1\n0\n\nδ(x, x′) .\n(6)\n(Notation: [Ωµx,µ′x′] is a 4×4 matrix the elements of which, Ωµµ′, are functions\nof x and x′.)\nConsider a curve Ψµx(τ) on the e-phase space parametrized by τ and let\n¯H = d\ndτ = Hµx\nδ\nδΨµx\nwith\nHµx[Ψ] = dΨµx\ndτ\n(7)\nbe the tangent vector at Ψ. We are interested in those special curves that are\nnaturally adapted to the symplectic geometry in the sense that they preserve\nΩ, that is,\n£ ¯\nHΩ= 0 ,\n(8)\nwhere £ ¯\nH is the Lie derivative along ¯H[Ψ] (this is a directional derivative on a\ncurved space). By Poincare’s lemma, requiring £ ¯\nHΩ= 0 (a vanishing “curl”)\nimplies that the covector Ωµx,µ′x′Hµ′x′ is the gradient of a scalar function [26],\ndenoted ˜H[Ψ],\nΩµx,µ′x′Hµ′x′ =\nδ\nδΨµx ˜H[Ψ] .\n(9)\n( ˜H[Ψ] is the scalar function associated to the vector ¯H[Ψ].) Substituting (6)\nand (7) this is rewritten as\ndψkx\ndτ\n=\nδ ˜H\nδ(iℏψ∗\nkx)\nand\nd(iℏψ∗\nkx)\ndτ\n= −δ ˜H\nδψkx\n,\n(10)\n5\n\n\nwhich are recognized as Hamilton’s equations for a Hamiltonian function ˜H.\nThis is the reason for Hamiltonians in physics: the congruence of curves that\npreserve the natural symplectic geometry, £ ¯\nHΩ= 0 are called Hamilton ﬂows.\nThey are generated by Hamiltonian vector ﬁelds ¯H or, equivalently, by their\nassociated Hamiltonian functions ˜H. Our challenge, to be addressed next, is to\nﬁnd Hamiltonians ˜H that yield interesting ﬂows.\nIt turns out that in addition to the symplectic geometry Ω, the e-phase also\nhas a natural metric geometry inherited from the information geometry of the e-\nconﬁguration space, which is a statistical manifold. A straightforward extension\nfrom [3][4][5] yields a particularly simple line element,\nδℓ2 =\nZ\ndxdx′ P\nµµ′Gµx,µ′x′δΨµxδΨµ′x′ = 2ℏ\nZ\ndxP\nk\nδψkxδψ∗\nkx .\n(11)\nThe components of the metric tensor G and its inverse are\n[Gµx,µ′x′] = −i\n\n\n0\n1\n0\n0\n1\n0\n0\n0\n0\n0\n0\n1\n0\n0\n1\n0\n\nδ(x, x′) ,\n[Gµx,µ′x′] = i\n\n\n0\n1\n0\n0\n1\n0\n0\n0\n0\n0\n0\n1\n0\n0\n1\n0\n\nδ(x, x′).\n(12)\nA remarkable further development is that the contraction of the symplectic form\nΩ, eq.(6), with the inverse metric G−1 allows us to construct a tensor J with\ncomponents\nJµxµ′x′ = −\nZ\ndx′′P\nµ′′Gµx,µ′′x′′Ωµ′′x′′,µx′\nand\n[Jµxµ′x′] =\n\n\ni\n0\n0\n0\n0\n−i\n0\n0\n0\n0\ni\n0\n0\n0\n0\n−i\n\nδ(x, x′) .\n(13)\nWhat makes the tensor J special is that its square is\nZ\ndx′′P\nµ′′Jµxµ′′x′′Jµ′′x′′\nµ′x′ = −δµµ′δ(x, x′) .\n(14)\nIn words, the action of J2 is equivalent to multiplying by −1, which means that\nJ provides a complex structure. This is the reason for complex numbers in QM\nand explains why it was convenient to introduce wave functions (i.e., complex\ncoordinates) in the ﬁrst place.\nNext, we take advantage of the metric geometry and seek those special curves\nthat preserve both the symplectic and the metric geometries,\n£ ¯\nHΩ= 0\nand\n£ ¯\nHG = 0 .\n(15)\nWe want ¯H to be both a Hamilton and a Killing vector ﬁeld; then the asso-\nciated Hamiltonian function ˜H will generate Hamilton-Killing ﬂows. Imposing\nfurther that the HK ﬂows preserve the normalization of probabilities restricts\nthe Hamiltonian function to those that are bilinear in ψkx and ψ∗\nkx,\n6\n\n\n˜H =\nZ\ndxdx′P\nkk′ψ∗\nkx ˆHkx,k′x′ψk′x′ .\n(16)\n˜H is the Hamiltonian that generates evolution on the e-phase space – the epis-\ntemic phase space – and is, accordingly, called the e-Hamiltonian. From eq.(10)\nthe corresponding equation of evolution is\niℏ∂ψkx\n∂τ\n= δ ˜H\nδψ∗\nkx\n=\nZ\ndx′P\nk′\nˆHkx,k′x′ψk′x′ ,\n(17)\nwhich is recognized as a Schr¨odinger equation.\nAt this point in the development τ is just a parameter along a curve; there\nis no implication that the curve represents time evolution and τ is time, or\nthat the curve is generated by rotations about an axis and τ is a rotation\nangle. To identify those special curves demands that additional information be\nincorporated into the analysis in order to constrain the e-Hamiltonian function\n˜H beyond the generic bilinear form, eq.(16).\n4\nThe Entropic Dynamics of short steps\nBeyond the reconstruction of the framework of QM including its interpretation,\nanother central goal of ED is the formulation of an information-based notion\nof time. This involves the introduction of the concept of an instant, the notion\nthat the instants are suitably ordered, and a convenient deﬁnition of duration.\nRemarkably, by its very construction, associated to an entropic dynamics there\nis a natural arrow of entropic time.\nThe physically relevant information that will allow us to recover a satisfac-\ntory concept of time is that the particle follows a continuous trajectory in space.\nThe continuity allows the dynamics to be analyzed as a sequence of a large num-\nber of inﬁnitesimally short steps kx →k′x′. The diﬃculty in the presence of\nspin is that the term ‘short’ refers to a short spatial step,\n∆xa = x′a −xa →0 ,\n(18)\nbut the ∆k steps could be discontinuous, either ∆k = 0 or ±1. Thus, in order\nto incorporate the physical information that trajectories are continuous the k\nvariables must, at least provisionally, be removed. This is achieved by averaging\nover the initial k and the ﬁnal k′.\nThe evolution of the joint probability ρkx is given by\nρ′\nk′x′ =\nZ\ndxP\nkP(k′x′|kx)ρkx .\n(19)\nAveraging over the ﬁnal k′ and using the product rule,\nρkx = ρxρk|x\nwhere\nρx = P\nk\nρkx ,\n(20)\n7\n\n\ngives\nρ′\nx′ =\nZ\ndxP\nkk′P(k′x′|kx)ρkx =\nZ\ndx\n\u0014P\nkk′P(k′x′|kx)ρk|x\n\u0015\nρx .\n(21)\nTherefore, the spatial probability ρx evolves according to\nρ′\nx′ =\nZ\ndx P(x′|x)ρx\nwhere\nP(x′|x) = P\nkk′P(k′x′|kx)ρk|x .\n(22)\nOur immediate goal is to derive the spatial transition probability P(x′|x).\nOur argument closely follows the ED of scalar particles. The transition proba-\nbility P(x′|x) is found by maximizing the entropy,\nS[P, Q] = −\nZ\ndx′ P(x′|x) log P(x′|x)\nQ(x′|x) ,\n(23)\nrelative to a prior Q(x′|x) and subject to constraints that implement the phys-\nically relevant information that we associate with quantum evolution [1][2][3].\nWe require the prior Q(x′|x) to codify the physical information that all short\nsteps have in common, namely, they are inﬁnitesimally short, but Q should\notherwise remain maximally non-informative; it should not induce a preferred\ndirectionality to the motion. Such a prior can itself be derived by maximizing\nan entropy,\nS[Q, µ] = −\nZ\ndx′ Q(x′|x) log Q(x′|x)\nµ(x′|x) ,\n(24)\nrelative to some suﬃciently smooth distribution µ(x′|x) and subject to normal-\nization and the rotationally invariant constraint,\n⟨δab∆xa∆xb⟩= κ ,\n(25)\nwith the small quantity κ to be speciﬁed below.\nThe result is a Gaussian\ndistribution,\nQ(x′|x) ∝exp −1\n2αδab∆xa∆xb ,\n(26)\nwhere α is a Lagrange multiplier. To enforce short steps we shall eventually\ntake the limit α →∞, which amounts to taking κ →0. (In the α →∞limit\nthe prior Q(x′|x) becomes independent of the choice of the distribution µ(x′|x)\nprovided it is suﬃciently smooth.)\nThe physical information about directionality and correlations is introduced\nvia a “phase” constraint that follows the standard ED strategy.\nFor scalar\nparticles one introduces a “drift potential” ϕx that is canonically conjugate to\nthe probability distribution ρx; it obeys the canonical Poisson brackets,\n{ρx, ϕx′} = δxx′ , {ρx, ρx′} = 0 = {ϕx, ϕx′} .\n(27)\n(Eventually a canonical transformation is performed that replaces ϕx by a more\nconvenient momentum ξx.) Then, the relevant dynamical information is im-\nposed via a constraint on the component of the expected displacement ⟨∆xa⟩\nalong the gradient of ϕ,\n⟨∆xa⟩∂aϕ = κ′.\n(28)\n8\n\n\nHere, to account for spin, we introduce two drift potentials, ϕk(x) = ϕkx, that\nare canonically conjugate to the distribution ρkx,\n{ρkx, ϕk′x′} = δkk′δxx′ , {ρkx, ρk′x′} = 0 = {ϕkx, ϕk′x′} .\n(29)\nSince continuity, i.e., short steps, reﬂects the purely spatial aspect of the tran-\nsition probability P(x′|x), the phase constraint takes the form\n⟨∆xa⟩x∂aϕx = κ′,\nwhere\n⟨∆xa⟩x =\nZ\ndx′ P(x′|x) ∆xa ,\n(30)\nand where the eﬀective gradient ∂aϕ is obtained by averaging the gradients\n∂aϕkx over k,\n∂aϕx = P\nk\nρk|x∂aϕkx ,\n(31)\nand ρk|x = ρkx/ρx. The eﬀect of interactions with an external electromagnetic\nﬁeld is handled in the same way as for scalar particles: the gauge constraint is\n⟨∆xa⟩xAa(⃗x) = κ′′ .\n(32)\nAs is usual in applications of the maximum entropy method the speciﬁcation\nof the numerical values of κ′ and κ′′ is most conveniently handled indirectly\nthrough the corresponding Lagrange multipliers.\nNext we maximize eq.(23) subject to (30), (32), and normalization. The\nresult is\nP(x′|x) ∝exp{−α\n2 δab∆xa∆xb + α′ \u0000∂aϕx −βAax\n\u0001\n∆xa}\n(33)\nwhere the Lagrange multipliers α, α′ will be speciﬁed shortly, and the multiplier\nβ will eventually be interpreted as the electric charge, β = q/c. Alternatively,\nwe can rewrite P(x′|x) as\nP(x′|x) = 1\nZ exp\nh\n−α\n2 δab (∆xa −∆xa\nx)\n\u0000∆xb −∆xb\nx\n\u0001i\n(34)\nwhere\n∆xa\nx = α′\nα δab \u0002\n∂bϕx −βAbx\n\u0003\n= ⟨∆xa⟩x\n(35)\nis the expected displacement. Using eq.(22) we can check that\n∆xa\nx =\nZ\ndx′ P(x′|x) ∆xa\n= P\nkρk|x\nZ\ndx′ P\nk′P(k′x′|kx) ∆xa = P\nkρk|x⟨∆xa⟩kx\n(36)\nis just the spatial displacement averaged over the k variable. (For ﬁxed x the\nexpectations over k and x′ commute.)\n9\n\n\nFrom 34, a generic displacement ∆xa can be expressed as the sum of an\nexpected drift, eq.(35), plus a ﬂuctuation ∆wa,\n∆xa = x′a −xa = ∆xa + ∆wa ,\n(37)\nwhere\n⟨∆wa⟩x = 0\nand\n⟨∆wa∆wb⟩x = 1\nαδab .\n(38)\n5\nEntropic time: instants and duration\nIn ED time is introduced as a book-keeping device designed to keep track of the\naccumulation of short steps ([4])([3]). It involves identifying suitable notions\nof ordered “instants” and of the separation or duration between “successive”\ninstants. Just as the prototype of a classical clock is a free particle that “mea-\nsures” equal intervals by registering equal displacements, the prototype of a\nquantum clock is the quantum system itself. This implies that in order to re-\ncover a notion of time as a continuous succession of instants it is necessary to\nappeal to the continuity of spatial trajectories.\nReferring to the discussion in the previous section, specifying the duration\nor interval ∆t = t′ −t between successive instants amounts to specifying the\nrelation between ∆t and the multipliers α and α′ [4]. The basic criterion is\nconvenience: “duration is deﬁned so that motion looks simple”. To reﬂect the\ntranslational symmetry of a non-relativistic Newtonian space and time we choose\nα′ and α to be independent of x and t so that time ﬂows “equably everywhere\nand everywhen.” We deﬁne ∆t so that α′/α ∝∆t. Then, as we see from (35),\nthe particle has a well deﬁned expected velocity.\nFor later convenience the\nproportionality constant is written as 1/m,\nα′\nα = 1\nm∆t .\n(39)\nAt this point the constant m has no special signiﬁcance but, once we derive the\nPauli equation, it will be recognized as the particle’s mass. It remains to specify\nα. We choose α so that for suﬃciently short steps the expected ﬂuctuations,\n⟨∆wa∆wb⟩x, increase by equal amounts in equal intervals ∆t.\nReferring to\neq.(38) this is achieved by setting\n1\nα = η\nm∆t\nso that\nα′ = 1\nη .\n(40)\nwhere a new constant η is introduced.\nWe emphasize that these choices of\nα and α′ are not arbitrary as they lead to a natural physical interpretation:\nduration is deﬁned so it reﬂects the symmetries of Newtonian space and time,\nand so that over short steps particles have well deﬁned expected velocities while\nequal intervals of entropic time correspond to equal increases of the variance\n⟨∆w2⟩. Indeed, substituting (40) into eqs.(35) and (38) we ﬁnd that a generic\ndisplacement is\n10\n\n\n∆xa = ∆xa\nx + ∆wa = ba\nx∆t + ∆wa ,\n(41)\nwhere\nba\nx = ⟨∆xa⟩x\n∆t\n= 1\nmδab \u0002\n∂aϕx −βAbx\n\u0003\n,\n(42)\nis the drift velocity, and the spatial ﬂuctuations ∆wa obey\n⟨∆wa⟩x = 0\nand\n⟨∆wa∆wb⟩x = η\nmδab∆t .\n(43)\nWe are now ready to investigate the consequences of the spatial transition\nprobability,\nP(x′|x) = 1\nZ exp\n\u0014\n−m\n2η∆t δab (∆xa −∆xa\nx)\n\u0000∆xb −∆xb\nx\n\u0001\u0015\n,\n(44)\nby rewriting the equation of evolution for the spatial distribution ρ(x), eq.(22),\nas a diﬀerential equation.\n6\nThe probability evolution equation\nMultiply eq.(22) by a smooth test function fx′ and integrate over x′,\nZ\ndx′ ρ′\nx′fx′ =\nZ\ndx′\nZ\ndx P(x′|x)ρxfx′ =\nZ\ndx\n\u0014Z\ndx′P(x′|x) fx′\n\u0015\nρx .\n(45)\nThe test function fx′ is assumed suﬃciently smooth precisely so that it can be\nexpanded about x. Terms (∆x)2 contribute to O(∆t). Then, dropping all terms\nof order higher than ∆t, the integral in the brackets is\n[· · · ] =\nZ\ndx′ P(x′|x)\n\u0012\nfx + ∂fx\n∂xa ∆xa + 1\n2\n∂2fx\n∂xa∂xb ∆xa∆xb + . . .\n\u0013\n= fx + ba\nx∆t ∂f\n∂xa + 1\n2∆t η\nmδab\n∂2f\n∂xa∂xb + . . .\n(46)\nwhere we used eqs.(42) and (43). Dropping the primes on the left hand side of\n(45), substituting (46) into the right, and dividing by ∆t, gives\nZ\ndx 1\n∆t [ρ′\nx −ρx] fx =\nZ\ndx\n\u0014\nba\nx\n∂fx\n∂xa + 1\n2\nη\nmδab ∂2fx\n∂xa∂xb\n\u0015\nρx .\n(47)\nNext integrate by parts on the right and let ∆t →0. Since the test function\nf(x) is arbitrary, we conclude that\n∂tρ = −∂a(baρ) + 1\n2\nη\nmδab∂a∂bρ .\n(48)\nThis can be written in the alternative form,\n∂tρt = −∂a (va\nxρx) ,\n(49)\n11\n\n\nwhich is a continuity equation, where\nva\nx = ba\nx −η\n2mδab∂b log ρx\n(50)\nis the “current” velocity of the probability ﬂow.\n7\nThe e-Hamiltonian and the Pauli equation\nThe whole purpose of this exercise has been to formulate the physical fact that\nparticle paths are continuous in a way that allows us to identify a suitable notion\nof time. It is natural to require that acceptable Hamiltonians be such that they\ngenerate evolution along a time deﬁned in terms of the very same “clock” (the\nsystem itself) that provides the measure of time.\nTherefore, our immediate\ngoal is to identify those Hamiltonians ˜H that reproduce the continuity equation\n(49). On the other hand, using eqs.(1) and (3) we can write ∂ρx/∂t directly in\nHamiltonian form. Since (ρkx, ξkx) are canonically conjugate, then\nρx = ρ+x + ρ−x\nand\nξx = 1\n2 (ξ+x + ξ−x)\n(51)\nare canonically conjugate too (we can check that {ρx, ξx′} = δxx′) which leads\nto\n∂ρx\n∂t = ∂ρ+x\n∂t\n+ ∂ρ−x\n∂t\n= δ ˜H\nδξ+x\n+ δ ˜H\nδξ−x\n= δ ˜H\nδξx\n.\n(52)\nAs we see from eqs.(49) and (52), at this point in our argument we have two\nindependent expressions for ∂ρx/∂t and, therefore, there must exist some inti-\nmate connection between the drift potentials ϕkx and the phases ξkx. To ﬁnd\nwhat this relation might be, examine eqs.(42) and (50) and rewrite the current\nvelocity as\nva\nx = 1\nmδab∂b\nP\nk\nρk|x\n\u0010\nϕkx −η\n2 log ρx\n\u0011\n−β\nmAa\nx .\n(53)\nWe propose that the desired relation is\nξkx = ϕkx −η log ρ1/2\nx\n,\n(54)\nso that\nva\nx = δab\nm\n\u0012P\nk\nρk|x∂bξkx −βAbx\n\u0013\n.\n(55)\nWe note that eq.(54) is a simple canonical transformation; since ϕkx and ξkx\ndiﬀer by a function of the generalized coordinate ρkx they are equally legitimate\nchoices of canonical momenta — the choice of ξkx over ϕkx is purely a matter\nof convenience.\nThe other piece of information guiding our choice of e-Hamiltonian is the fact\nthat for HK ﬂows the e-Hamiltonian is bilinear in the wave functions, eq.(16).\n12\n\n\nThe next step, therefore, is to write eqs.(49) and (55) in terms of the wave\nfunctions, ψkx = ρ1/2\nkx exp i\nℏξkx. After a little algebra we ﬁnd\n∂ρx\n∂t = ℏi\n2m\nP\nk\n∂a\n\u0002\nψ∗\nk (Daψk) −ψk (Daψk)∗\u0003\n,\n(56)\nwhere Da = ∂a −iq\nℏcAa is the covariant derivative. Further rearranging yields\n∂ρx\n∂t =\nℏ\n2mi\n\u0002\nψk (DaDaψk)∗−ψ∗\nkDaDaψk\n\u0003\n= δ ˜H\nδξx\n,\n(57)\nwhich is a linear functional diﬀerential equation for ˜H that is easily integrated,\n˜H[ψ, ψ∗] = −ℏ2\n2m\nZ\ndx P\nkψ∗\nkxDaDaψkx + ˜V ,\n(58)\nwhere the integration constant ˜V is independent of ξx. This is easily checked:\nlet ξx →ξx + δξx and use\nδψkx = i\nℏψkx δξx\nand\nδψ∗\nkx = −i\nℏψ∗\nkx δξx ,\n(59)\nto get\nδ ˜H =\nℏ\n2mi\nZ\ndx P\nk\n\u0002\nψkx (DaDaψkx)∗−ψ∗\nkxDaDaψkx\n\u0003\nδξx\nqed.\n(60)\nThus we see that the kinetic energy in the e-Hamiltonian (58) is traced to the\nentropic updating that led to the spatial continuity equation, while the potential\nenergy is introduced as an integration constant. To determine ˜V we note that\nin order for ˜H to generate an HK ﬂow we must require that ˜V be bilinear in ψ,\n˜V [ψ, ψ∗] =\nZ\ndxdx′P\nkk′ψ∗\nkx ˆVkx,k′x′ψk′x′\n(61)\nfor some Hermitian kernel ˆVkx,k′x′ and, furthermore, to reproduce the ED evo-\nlution in eq.(57), ˜V must be independent of ξx = (ξ+x + ξ−x)/2,\nδ ˜V\nδξx\n=\nδ\nδξx\nZ\ndxdx′P\nkk′ρ1/2\nkx ρ1/2\nk′x′ ˆVkx,k′x′ exp i\nℏ(ξk′x′ −ξkx) = 0 .\n(62)\nTo satisfy (62) for arbitrary choices of ρkx and ρk′x′ we require that the kernel\nˆVkx,k′x′ be local in x,\nˆVkx,k′x′ = δxx′ ˆVkk′(x) ,\n(63)\nThe local Hermitian kernel ˆVkk′(x) is a Hermitian 2 × 2 matrix which can be\nexpanded in terms of Pauli matrices,\nˆVkk′(x) = V0(x)δkk′ + Va(x)σa\nkk′ ,\n(a = 1, 2, 3) ,\n(64)\n13\n\n\nwhere V0(x) and Va(x) are four scalar functions,\n˜V [ψ, ψ∗] =\nZ\ndx\n\u0012\nV0x\nP\nk\nψ∗\nkxψkx + Vax\nP\nkk′ψ∗\nkxσa\nkk′ψk′x\n\u0013\n(65)\n(and we can easily check that, indeed, δ ˜V /δξx = 0). The ﬁnal expression for\nthe e-Hamiltonian\n˜H =\nZ\ndx P\nkk′ ψ∗\nkx\n\u0014\u0012−ℏ2\n2m DaDa + V0\n\u0013\nδkk′ + Vaσa\nkk′\n\u0015\nψk′x ,\n(66)\ntakes the form of an expected value. The corresponding Schr¨odinger equation\n— the Pauli equation — is\niℏ∂ψkx\n∂t\n= δ ˜H\nδψ∗\nkx\n= −ℏ2\n2m δabDaDbψkx + V0xψkx + Vaxσa\nkk′ψk′x .\n(67)\nIncidentally, at this stage in the development we see that the constants ℏ, m,\nand q/c can be safely given their usual meanings, and also that the entropic\ntime t is the actual time measured by clocks — after all, it is by using equations\nsuch as the Schr¨odinger or the Pauli equations that we calibrate our measuring\ndevices.\nFor a point particle, such as an electron, the Pauli equation takes its simplest\nform,\niℏ∂tΨx =\n1\n2m\n\u0012ℏ\ni\n⃗∂−q\nc\n⃗A\n\u00132\nΨx + qA0Ψx −ℏq\n2mcBaσaΨx ,\n(68)\nor\niℏ∂tΨx =\n1\n2m\n\u0014\nˆσa\n\u0012ℏ\ni ∂a −q\ncAa\n\u0013\u00152\nΨx + qA0Ψx ,\n(69)\nwhere Ψx is given in eq.(2) and\nV0x = qA0(x)\nand\nVax = −ℏq\n2mcBa(x)\n(70)\nrepresent the interactions of the charge with the scalar electric potential A0(x)\nand of the magnetic dipole with the magnetic ﬁeld Ba. Equation (67) is more\ngeneral in that it could describe extended particles such as protons and neu-\ntrons with anomalous magnetic moments, or even particles with electric dipole\nmoments. (The latter would violate time-reversal invariance and have not been\nobserved so far.)\nOne may note that Hilbert spaces have not been mentioned; strictly, they\nare not needed. However, the linearity of eq.(67) suggests that a Hilbert space is\na convenient calculational tool [4][3]. Here, for completeness, we brieﬂy mention\nhow to introduce vectors |Ψ⟩in a linear Hilbert space. The map to the Dirac\nnotation, ψkx ↔|Ψ⟩, is deﬁned by\n|Ψ⟩=\nZ\ndxP\nk\n|kx⟩ψkx\nwhere\nψkx = ⟨kx|Ψ⟩,\n(71)\n14\n\n\nwhere, in this “kx” representation, the vectors {|kx⟩} form a basis that is or-\nthogonal and complete,\n⟨kx|k′x′⟩= δkk′δxx′\nand\nZ\ndxP\nk\n|kx⟩⟨kx| = ˆ1 .\n(72)\nThe Hilbert scalar product ⟨Ψ1|Ψ2⟩is then deﬁned by exploiting the structures\nalready available to us, eqs.(4), (6), and (12) for Ψµx, the symplectic form Ω\nand the metric G,\n⟨Ψ1|Ψ2⟩\ndef\n=\n1\n2ℏ\nZ\ndxdx′ P\nµµ′ (Gµx,µ′x′ + iΩµx,µ′x′) Ψµx\n1 Ψµ′x′\n2\n.\n(73)\nA straightforward calculation yields the familiar expression\n⟨Ψ1|Ψ2⟩=\nZ\ndx P\nk\nψ∗\n1kxψ2kx .\n(74)\nThe e-Hamiltonian is given by the expected value,\n˜H = ⟨Ψ| ˆH|Ψ⟩\nwith\nˆHkx,k′x′ = ⟨kx| ˆH|k′x′⟩,\n(75)\nwhere the matrix element ˆHkx,k′x′ can be read oﬀeq.(66).\n8\nOrbital and spin angular momenta\nWe ﬁnally come to the “reconstruction” of spin.\nThe central input is that\nangular momentum is the generator of rotations. Under a rotation ⃗ζ = ζ⃗n by\nan inﬁnitesimal angle ζ about the axis ⃗n we have ,\n⃗x →⃗xζ = ⃗x + ζ⃗n × ⃗x .\n(76)\nThe action of rotations on the spatial probability distribution ρ(x) is given by\nρ(x) →ρζ(x)\nwith\nρζ(xζ) = ρ(x)\nor\nρζ(x) = ρ(x−ζ) .\n(77)\nso that\nδζρ(x) = ρζ(x) −ρ(x) = −ζ⃗n · ⃗x × ⃗∂ρx = −εabcζnaxc∂cρx .\n(78)\nTherefore\n∂ρx\n∂ζ = −εabcnaxb∂cρx .\n(79)\nOn the other hand, since rotations about na are generated by the Hamiltonian\nfunction ˜Jana, and as we saw in eq.(51) {ρx, ξx} are canonically conjugate, we\ncan write the Hamilton equation\n∂ρx\n∂ζ = ∂ρ+x\n∂t\n+ ∂ρ−x\n∂t\n= δ ˜Ja\nδξ+x\nna + δ ˜Ja\nδξ−x\nna = δ ˜Ja\nδξx\nna .\n(80)\n15\n\n\nCombining with (79) leads to\n−εabcnaxc∂cρx = δ ˜Ja\nδξx\nna ,\n(81)\nwhich is a linear diﬀerential equation for ˜Jana. The integration is easy and\nsince (81) holds for any choice of na, we ﬁnd\n˜Ja =\nZ\ndx P\nkψ∗\nkx\n\u0012\nεabcxb\nℏ\ni ∂c\n\u0013\nψkx + ˜Sa .\n(82)\nThe ﬁrst integral is recognized as orbital angular momentum, and ˜Sa is an\nintegration constant independent of ξx, which we identify as the spin functional.\n(Eq.(82) is easy to check: just let ξx →ξx + δξx with δψkx = iψkx δξx/ℏ, then\nintegrate by parts using εabc∂cxb = 0.)\nTo determine the spin functional ˜Sa we impose two natural conditions: The\nﬁrst, mentioned in section 3, is that ˜Jana is a Hamiltonian function — it gener-\nates an HK ﬂow. The second condition is motivated by the choice of ontology:\nthe two-valuedness of k requires that the action of ˜Sa on the wave functions\ngiven by eq.(2) results in a 2-dimensional representation of the rotation group.\nConcerning the ﬁrst condition: in order for ˜Ja in (82) to generate an HK\nﬂow we require that ˜Sa be also bilinear in ψ,\n˜Sa[ψ, ψ∗] =\nZ\ndxdx′P\nkk′ψ∗\nkx ˆSa\nkx,k′x′ψk′x′ ,\n(83)\nfor some Hermitian kernel ˆSa\nkx,k′x′. Furthermore, to reproduce eq.(81), ˆSa\nkx,k′x′\nmust be independent of ξx = (ξ+x + ξ−x)/2,\n0 = δ ˜Sa\nδξx\n=\nδ\nδξx\nZ\ndxdx′P\nkk′ρ1/2\nkx ρ1/2\nk′x′ ˆSa\nkx,k′x′ exp i\nℏ(ξk′x′ −ξkx) ,\n(84)\nfor arbitrary choices of ρkx and ρk′x′. It follows that ˆSa\nkx,k′x′ must be local in x,\nˆSa\nkx,k′x′ = δxx′ ˆSa\nkk′(x)\nor\n˜Sa =\nZ\ndxP\nkk′ψ∗\nkx ˆSa\nkk′(x)ψk′x .\n(85)\nTo implement the second condition we recall that a 2-dimensional repre-\nsentation of rotations in terms of Cayley-Klein parameters was already known\nbefore the discovery of QM (see, e.g.,[27]). In a 2 × 2 matrix representation a\ngeneric vector ⃗x is represented by\n⃗x = xaσa =\n\u0014\nx3\nx1 −ix2\nx1 + ix2\n−x3\n\u0015\n,\n(86)\nwhere the basis vectors ⃗ea are represented by Pauli matrices σa, and a rotation\nby ζ about the axis ⃗n is represented by\n⃗x′ = ˆUζ⃗x ˆU −1\nζ\nwhere\nˆUζ = exp(−inaσaζ/2) .\n(87)\n16\n\n\nSo far this has nothing to do with QM but the 2 × 2 matrices ˆUζ form a group\nand the corresponding rotation of the wave function Ψ is given by\nΨ(x) →Ψζ(xζ) = ˆUζΨ(x)\nor\nΨζ(x) = ˆUζΨ(x−ζ) ,\n(88)\nwhich suggests we rewrite\nˆUζ = exp\n\u0010\n−i ˆSaζ/ℏ\n\u0011\nwith\nˆSa\nkk′ = ℏ\n2σa\nkk′ .\n(89)\nFrom (85) the spin functional we seek is\n˜Sa[ψ, ψ∗] =\nZ\ndxP\nkk′ψ∗\nkx\nℏ\n2σa\nkk′ψk′x .\n(90)\nThe translation to Hilbert space in Dirac notation is, once again, straightfor-\nward. For example, the spin functional is the expected value,\n˜Sa = ⟨Ψ| ˆSa|Ψ⟩\nwith\nˆSa\nkx,k′x′ = ⟨kx| ˆSa|k′x′⟩,\n(91)\nwhere the matrix element ˆSa\nkx,k′x′ can be read oﬀeq.(90). This concludes the\nreconstruction of spin.\n9\nDiscussion and conclusions\nWe have reconstructed the mathematical formalism for the QM of a spin-1/2\nparticle and recovered the linearity of the Pauli equation, the emergence of com-\nplex numbers, the peculiar properties of spin 1/2, and more. This guarantees\nthat the ED predictions are in complete agreement with experiments, which\nis a feature that ED shares with so many other interpretations of QM. Where\nED claims an additional dose of success is in achieving ontological and epis-\ntemic clarity. On the ontological side, it provides a crisp answer to the question\n“what is real?”: position and “k-ness” are real. ED aﬀords clear epistemic sta-\ntus to probabilities, wave functions, energies, and angular momenta, including\nspin, and does this while enlisting the proven methods of modern quantitative\nepistemology, namely entropic methods and information geometry, without the\nneed to invoke exotic or quantum probabilities. In this latter sense ED is a\nrather conservative model. However, ED turns out to be radically non-classical\nin that it is a dynamics of probabilities and not of particles. ED denies the ontic\nstatus of dynamics and it is the latter aspect of ED that violates our classical\nintuitions. To be clear, if at one instant probabilities are large in one place, and\nat a later instant they are large somewhere else, we are correct to believe that\nthe particles have moved — but nothing in ED describes the causal mechanism\nthat pushed the particles around. As far as we can tell, there is none; ED is a\nmechanics without a mechanism.\nNow that the dynamics has been fully developed we can revisit some ques-\ntions raised back in Section 1. What is this mysterious, not classically describ-\nable k?\nWhat is spin?\nHow are k and spin related?\nWhat, if anything, is\nspinning?\n17\n\n\nNot much can be said about k except that it takes two values and it belongs\nin the ontic sector. Perhaps this is just the way the world is and it is all one\ncan ever hope to say. Concerning spin, much has been said in the previous\nsection: it belongs in the epistemic sector, it generates HK ﬂows and rotations,\nand much of its spinor structure follows from the two-valuedness of k.\nThe relation between k and spin is not without interest. The important\ndiﬀerence is that the former is ontic and the latter epistemic — as diﬀerent as\ndiﬀerent can be. However, there tends to exist a 1-1 correspondence between the\nontic microstates (k = +1 and k = −1) and the epistemic states that represent\ncertainty about them (the spinors\n\u00001\n0\n\u0001\nand\n\u00000\n1\n\u0001\n) and this might be a source of\nconfusion. But some mystery is bound to remain. Consider a system in the\nepistemic state described by\n\u00001\n0\n\u0001\n; we are certain that k = +1.\nSuppose the\nsystem is then rotated by θ = π/2 about the ⃗ey axis,\nexp\n\u0012\n−iσy\nπ/2\n2\n\u0013 \u00121\n0\n\u0013\n=\n1\n√\n2\n\u00121\n1\n\u0013\n.\n(92)\nThe outcome of this physical operation is that now we ought to believe that there\nis a 50% probability that a transition from k = 1 to k = −1 has occurred. ED\nis silent about what could have caused this transition to happen. The weirdness\nof a mechanics without a mechanism can manifest itself not just in dynamics\nbut also in the context of rotations or other operations.\nFinally, there is the question of what is spinning? The assertions that prob-\nability, energy, momentum, and angular momentum including spin are not on-\ntic but epistemic quantities force an extreme revision of our intuitions about\nphysics. Probabilities may change but they neither move nor ﬂow; they are not\nsubstances. Similarly, accepting that spin is an epistemic concept forces us to\nrevisit the intuition that something substantial is actually spinning. ED is just\na model that describes a ﬁctitious world. The real world out there may contain\nall sorts of things, but the ﬁctitious world described in this paper contains a\nsingle point particle characterized by its position and its discrete k value, that’s\nall. Within this ED model the answer is clear: there is nothing there that could\nspin and, therefore, nothing is spinning.\nThe question, of course, is whether the ED models provide successful guid-\nance in the real world, and not just in their own ﬁctitious worlds.\nSo far,\neverything indicates they do.\nAcknowledgments\nI would like to thank N. Carrara, S. Nawaz, and K.\nVannier for valuable discussions on the entropic dynamics of spin and their\ncontributions at various stages of this program.\nI would also like to thank\nF. Holik for a useful exchange about the Pauli Exclusion Principle at the X\nConference on Quantum Foundations in Buenos Aires, Argentina, 2021.\n18\n\n\nReferences\n[1] E. T. Jaynes: Papers on Probability, Statistics and Statistical Physics, Ed.\nby R. D. Rosenkrantz (Reidel, Dordrecht, 1983).\n[2] E. T. Jaynes, Probability Theory: The Logic of Science edited by G. L.\nBretthorst (Cambridge UP, 2003).\n[3] A. Caticha, Entropic Physics: Probability, Entropy, and the Foundations\nof Physics; Available online: https://www.arielcaticha.com (draft version\n07/26/2022, accessed on 01/31/2025).\n[4] A. Caticha, “The Entropic Dynamics approach to Quantum Mechanics,”\nEntropy 21, 943 (2019); arXiv.org:1908.04693.\n[5] A. Caticha, “Quantum mechanics as Hamilton-Killing ﬂows on a statistical\nmanifold,” Phys. Sci. Forum 2021, 3, 12; arXiv:2107.08502.\n[6] A. Caticha, “Entropic Dynamics and Quantum ”Measurement”, Phys. Sci.\nForum 1, 36 (2022); arXiv:2208.02156.\n[7] W. Pauli, “Remarks on the History of the Exclusion Principle,” Science\n103, No.2669, 213-215 (1946).\n[8] M.\nJammer,\nThe\nConceptual\nDevelopment\nof\nQuantum\nMechanics\n(McGraw-Hill, New York 1966).\n[9] G. E. Uhlenbeck and S. Goudsmit, “Spinning electrons and the structure\nof spectra,” Nature 117, 264-265 (1926).\n[10] D. Bohm, R. Schiller, and J. Tiomno, “A Causal Interpretation of the Pauli\nEquation (A),” Suppl. Nuovo Cimento 1, 48 (1955).\n[11] T. G. Dankel, “Mechanics on manifolds and the incorporation of spin into\nNelson’s Stochastic Mechanics,” Arch. Ration. Mech. Anal. 37, 192-221\n(1970).\n[12] J.S. Bell, “Introduction to the hidden-variable question,” Proc. Int. Sch.\nPhys. ‘Enrico Fermi’, course IL, 171-181 (1971); reprinted in Speakable\nand Unspeakable in Quantum Mechanics (2nd. edition, Cambridge U.P.,\nCambridge, 2004).\n[13] T. Takabayasi, “Vortex, Spin and Triad for Quantum Mechanics of Spin-\nning Particle. I” Prog. Theor. Phys. 70, 1 (1983).\n[14] H. C. Ohanian, “What is spin?” Am. J. Phys. 54, 500 (1986).\n[15] C. Dewdney, P.R. Holland, A. Kyprianidis, and J. P. Vigier, “Spin and\nnon-locality in quantum mechanics,” Nature 336, 536 (1988).\n[16] D. Hestenes, “The Zitterbewegung Interpretation of Quantum Mechanics,”\nFound. Phys. 20, 1213 (1990).\n19\n\n\n[17] D. Bohm and B.J. Hiley, The Undivided Universe. An ontological interpre-\ntation of quantum theory (Routlege, London, 1993).\n[18] P. R. Holland, The Quantum Theory of Motion (Cambridge U.P., Cam-\nbridge, 1993).\n[19] C. Doran, A. Lasenby, S. Gull, S. Somaroo, and A. Chalinor, “Spacetime\nalgebra and electron physics,” Adv. Imag. Elect. Phys. 95, 271 (1996);\narXiv:quant-ph/0509178.\n[20] S. Nawaz, “Momentum and Spin in Entropic Dynamics,” Ph.D. thesis, Uni-\nversity at Albany 2014; https://search.proquest.com/docview/1657352302.\n[21] A. Budiyono, D. Rohrlich, “Quantum mechanics as classical statistical\nmechanics with an ontic extension and an epistemic restriction.” Nature\nComm. 8, 1306 (2017).\n[22] M. Beyer, W. Paul, “Particle spin described by quantum Hamilton equa-\ntions.” Ann. Phys. 535(1), 2200433 (2023).\n[23] S. Powers, G. Xu, H. Fotso, T. Thomay, D. Stojkovic, “Statistical model\nfor quantum spin and photon number states.” Phys. Rev. A, 111, 012217\n(2025).\n[24] A.\nCaticha,\nN.\nCarrara,\n“The\nEntropic\nDynamics\nof\nSpin”,\narXiv:2007.15719.\n[25] N. Carrara,\n“The Foundations of Inference and its Application to\nFundamental physics” Ph.D. Dissertation, University at Albany, 2021;\nhttps://scholarsarchive.library.albany.edu/legacy-etd/2649/\n[26] B. Schutz, Geometrical Methods of Mathematical Physics (Cambridge U.P.,\nUK, 1980).\n[27] H. Goldstein, C. Poole, J. Safko, Classical Mechanics (3rd edition, Addison\nWesley, San Francisco, 2000).\n20\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21214v1.pdf",
    "total_pages": 20,
    "title": "What is ontic and what is epistemic in the Quantum Mechanics of Spin?",
    "authors": [
      "Ariel Caticha"
    ],
    "abstract": "Entropic Dynamics (ED) provides a framework that allows the reconstruction of\nthe quantum formalism by insisting on ontological and epistemic clarity and\nadopting entropic methods and information geometry. Our present goal is to\nextend the ED framework to account for spin. The result is a realist\n{\\psi}-epistemic model in which the ontology consists of a particle described\nby a definite position plus a discrete variable that describes Pauli's peculiar\ntwo-valuedness. The resulting dynamics of probabilities is, as might be\nexpected, described by the Pauli equation. What may be unexpected is that the\ngenerators of transformations -- Hamiltonians and angular momenta including\nspin, are all granted clear epistemic status. To the old question `what is\nspinning?' ED provides a crisp answer: nothing is spinning.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}