{
  "id": "arxiv_2502.21144v1",
  "text": "Integer-valued valuations\nAndrii Ilienko1,2, Ilya Molchanov1, and Tommaso Vison`a1\n1University of Bern\n2Igor Sikorsky Kyiv Polytechnic Institute\nMarch 3, 2025\nAbstract\nWe obtain a complete characterization of planar monotone σ-continuous valuations\ntaking integer values, without assuming invariance under any group of transformations.\nWe further investigate the consequences of dropping monotonicity or σ-continuity and\ngive a full classification of line valuations. We also introduce a construction of the\nproduct for valuations of this type.\nKeywords: valuation, normal cone, polyconvex set, product of valuations\nMSC2020: 52A10\n1\nIntroduction\nA valuation φ is an additive map from the family of compact convex subsets of a finite-\ndimensional vector space to an abelian semigroup. Additivity means that, for any compact\nconvex sets K and L such that K ∪L is also convex, the following identity holds:\nφ(K ∪L) + φ(K ∩L) = φ(K) + φ(L),\nsee [8, Chapter 6] for a detailed exposition. Additionally, we will always include the empty\nset in the domain of φ and assume that φ(∅) = 0. Most of the literature on valuations\nfocuses on valuations with values in the set of real or complex numbers or in the family of\ncompact convex sets equipped with Minkowski addition.\nA common assumption in the study of valuations is their invariance under a group of\ntransformations. In most cases, valuations are assumed to be translation invariant, meaning\nthat φ(K +x) = φ(K) for all translations x. Alternatively, valuations are also studied under\nthe assumption of rotation invariance or invariance under the group of all rigid motions.\nAnother frequently imposed condition is continuity with respect to the Hausdorff metric on\n1\narXiv:2502.21144v1  [math.MG]  28 Feb 2025\n\n\ncompact convex sets. This condition is sometimes relaxed to σ-continuity, which requires\nthat φ(Kn) →φ(K) whenever Kn ↓K.\nLet Kd be the family of convex bodies (i.e., compact convex sets) in Rd.\nWhile the\nempty set is typically not considered a convex body, we adopt the convention that it is\nincluded in Kd. By Hadwiger’s theorem, any real-valued continuous and invariant under\nrigid motions valuation on Kd can be expressed as a weighted sum of the intrinsic volumes\nVi(K), i = 0, . . . , d. Furthermore, MacMullen’s theorem states that the vector space of all\ncontinuous translation-invariant valuations can be decomposed into a direct sum of subspaces\nconsisting of valuations that are homogeneous of order k = 0, . . . , d. A more refined result\nis given by the theorem of Klain and Schneider. It states that if φ is a continuous simple\ntranslation-invariant valuation, then\nφ(K) = cVd(K) +\nZ\nSd−1 f(u) dSd−1(K, u),\nwhere c ∈R, f is an odd continuous function, and Sd−1(K, ·) stands for the area measure of\nK. Here, simplicity means that φ vanishes on all lower-dimensional sets.\nIn this paper, we consider valuations taking values in the group Z of integers under\naddition. Clearly, the only continuous valuations with values in Z are multiples of the Euler\ncharacteristic\nχ(K) =\n(\n1,\nK ̸= ∅,\n0,\nK = ∅.\nIt is straightforward to see that a sum of Euler characteristics like\nφ(K) =\nN\nX\ni=1\nχ(K ∩Ci)\nfor convex bodies C1, . . . , CN defines an integer-valued monotone σ-continuous valuation.\nDue to the intersection operation, φ is no longer continuous in the Hausdorff metric. Adding\nnegative terms to this sum preserves additivity and σ-continuity and may still retain the\nmonotonicity property, as our examples demonstrate.\nOur paper focuses on integer-valued monotone σ-continuous valuations without imposing\nany invariance assumptions and provides their complete characterization in dimensions 1 and\n2. In the main results, we establish that each integer-valued, monotone, and σ-continuous\nvaluation in dimensions 1 and 2 can be represented as an at most countable sum of Euler\ncharacteristics with weights ±1. The convex bodies Ci necessarily form a locally finite family,\nand the bodies appearing in the negative terms satisfy a strict admissibility property with\nrespect to the positive ones. In other words, each integer-valued monotone σ-continuous\nvaluation corresponds to a locally finite integer-valued measure on the family of convex\nbodies.\nA key step in proving the representation involves the support F of a valuation φ, which\nis the set of points x such that φ({x}) ≥1. We show that each integer-valued σ-continuous\nvaluation is uniquely determined by its values on singletons and that the intersection of F\n2\n\n\nwith any convex body is polyconvex. For the latter, we apply Eggleston’s theorem, which\nlinks polyconvexity to the structure of invisible points.\nThe absence of such a result in\ndimensions 3 and higher makes it impossible to generalize our technique beyond the planar\ncase.\nThe main result in dimension 2 is proved in Section 3. In Section 4 we characterise\nall real-valued valuations on the line.\nIn Section 5, we introduce countably generated\nvaluations, which generalize the weighted sums of Euler characteristics discussed above.\nWe then define the multiplication of such valuations by arbitrary σ-continuous ones and\nexamine the properties of this product. Section 6 contains a collection of open problems and\nconjectures.\n2\nPreliminaries on integer-valued valuations\nA set function φ : Kd →R is called monotone if φ(K) ≤φ(L) whenever K ⊂L.\nIn\nparticular, this implies nonnegativity: φ(K) ≥φ(∅) = 0.\nFollowing [8, p. 338], we call a valuation φ σ-continuous if\nφ(K) = lim\nn→∞φ(Kn)\n(1)\nfor any sequence (Kn) of convex bodies such that Kn ↓K. First of all, we note that, for\ninteger-valued valuations, it suffices to check σ-continuity only at singletons.\nProposition 2.1. Let φ be an integer-valued valuation on Kd such that (1) holds for all\nK = {x}, x ∈Rd. Then φ is σ-continuous.\nProof. Assume that the claim is false, and (1) fails to hold for some Kn ↓K. Then φ(Kn) ̸=\nφ(K) for infinitely many n. For all such n and for any hyperplane H1 meeting K and dividing\nRd into closed half-spaces H−\n1 and H+\n1 , we have\nφ(K) = φ(K ∩H−\n1 ) + φ(K ∩H+\n1 ) −φ(K ∩H1),\nφ(Kn) = φ(Kn ∩H−\n1 ) + φ(Kn ∩H+\n1 ) −φ(Kn ∩H1).\nHence, there is H•\n1 ∈{H−\n1 , H+\n1 , H1} such that φ(K ∩H•\n1) ̸= φ(Kn ∩H•\n1) for infinitely many\nn. Proceeding with this division process and choosing Hm and H•\nm at the m-th step in such\na way that K ∩H•\n1 ∩. . . ∩H•\nm shrink to a singleton {x} as m →∞, we obtain\nφ(K ∩H•\n1 ∩. . . ∩H•\nm) ̸= φ(Kn ∩H•\n1 ∩. . . ∩H•\nm)\n(2)\nfor each fixed m and infinitely many n.\nHowever, due to the σ-continuity of φ at {x},\nboth sides of (2) converge to φ({x}) as m, n →∞simultaneously. Since both sides are\ninteger-valued, this contradicts (2).\nDenote H−\nu,t = {x ∈Rd : ⟨u, x⟩≤t}. The following criterion is useful for verifying the\nmonotonicity of a (not necessarily additive) σ-continuous set function.\n3\n\n\nProposition 2.2. A non-negative σ-continuous set function φ on Kd is monotone if and\nonly if φ(H−\nu,t ∩M) is non-decreasing in t for each fixed u ∈Sd−1 and M ∈Kd.\nProof. The necessity is clear. To prove sufficiency, let K ⊂L, choose an x1 ∈∂K, and\ndraw through x1 a supporting hyperplane H1 to K. Denote by L1 the part of L cut off by\nH1 and containing K. Using the assumption with u orthogonal to H1 and M = L, we get\nφ(L) ≥φ(L1). Proceeding with this process and choosing xn ∈∂K and Hn at each step\nin such a way that Ln ↓K, we obtain, by applying the assumption to M = Ln−1, that\nφ(Ln−1) ≥φ(Ln). Thus, φ(L) ≥φ(Ln), and, by σ-continuity, φ(L) ≥φ(K).\nNote that, as follows from the proof, this proposition remains valid even if σ-continuity\nis replaced by a significantly weaker condition φ(K) ≤supn≥1 φ(Kn) for any Kn ↓K.\nWe now give a somewhat unexpected property of integer-valued σ-continuous valuations,\nwhich plays a fundamental role in what follows.\nProposition 2.3. Let φ and φ′ be integer-valued σ-continuous valuations on Kd that coincide\non singletons: φ({x}) = φ′({x}) for any x ∈Rd. Then φ = φ′.\nProof. We employ reasoning similar to that used in the proof of Proposition 2.1. Suppose\nthe claim is false and φ(K) ̸= φ′(K) for some K ∈Kd. Drawing a hyperplane H that meets\nK and denoting the closed half-spaces it cuts off by H−and H+, we have\nφ(K ∩H−) + φ(K ∩H+) −φ(K ∩H) = φ(K)\n̸= φ′(K) = φ′(K ∩H−) + φ′(K ∩H+) −φ′(K ∩H).\nThus, φ(K1) ̸= φ′(K1) for some K1 ∈{K ∩H−, K ∩H+, K ∩H}. Proceeding with this\nprocess so that Kn ↓{x} for some x ∈Rd, we have φ(Kn) ̸= φ′(Kn) for all n, while, by\nσ-continuity,\nlim\nn→∞φ(Kn) = φ({x}) = φ′({x}) = lim\nn→∞φ′(Kn).\nThis is impossible due to the integer-valued property of φ and φ′.\nProposition 2.3 implies that no simple (i.e., vanishing on lower-dimensional sets) integer-\nvalued σ-continuous valuations exist. Any such valuation must vanish on singletons and is\ntherefore identically zero.\n3\nThe structure of planar integer-valued valuations\nIn this section, we describe the structure of planar integer-valued monotone σ-continuous\nvaluations. Recall that the normal cone to a closed convex set C at a point x ∈C is defined\nby\nNC(x) =\n\b\nu ∈Rd : ⟨u, y −x⟩≤0 for all y ∈C\n\t\n(3)\n4\n\n\nand adopt the convention NC(x) = ∅for x /∈C. In particular,\n1NC(x)(0) = 1C(x),\n(4)\n1NC(x)(u) = 1C(x) · 1{C ∩\n◦H+\nu (x) = ∅},\nu ̸= 0,\n(5)\nwhere\n◦H+\nu (x) = {y ∈Rd : ⟨u, y −x⟩> 0}.\nThis means that NC(x) is empty for x /∈C, contains only 0 for x ∈int C, and is a non-\ndegenerate closed convex cone for x ∈∂C. Also denote N0 = N ∪{0, ∞}.\nDefinition 3.1.\n(i) A family of N ∈N0 closed convex sets Cn is said to be locally finite if only finitely\nmany of them hit any fixed K ∈Kd.\n(ii) A locally finite family (C−\nn ) of cardinality N −is said to be admissible with respect to\na locally finite family (C+\nn ) of cardinality N + if\nN−\nX\nn=1\n1NC−\nn (x)(u) ≤\nN+\nX\nn=1\n1NC+\nn (x)(u)\n(6)\nfor all x, u ∈Rd.\nIn particular, (6) implies that S\nn C−\nn ⊂S\nn C+\nn by letting u = 0 and using (4). Further-\nmore, (6) yields that S\nn ∂C−\nn ⊂S\nn ∂C+\nn . Otherwise, for any x violating this inclusion, the\nright-hand side of (6) vanishes for all u ̸= 0, while the left-hand side does not for some u.\nThe simplest example of an integer-valued monotone σ-continuous valuation is provided\nby the Euler characteristic\nχ(K) = 1{K ̸= ∅},\nK ∈Kd.\nThe following theorem provides a complete description of such valuations for d = 2.\nTheorem 3.2. A function φ : K2 →Z is an integer-valued monotone σ-continuous valuation\nif and only if there exist N +, N −∈N0 and two locally finite families of N + and N −nonempty\nclosed convex sets C+\nn and C−\nn with the latter being admissible with respect to the former,\nsuch that, for any K ∈K2,\nφ(K) =\nN+\nX\nn=1\nχ\u0000K ∩C+\nn\n\u0001\n−\nN−\nX\nn=1\nχ\u0000K ∩C−\nn\n\u0001\n.\n(7)\nThe families (C+\nn ) and (C−\nn ) are not uniquely determined: (C+\nn ), (C−\nn ) and ( eC+\nn ), ( eC−\nn ) define\nthe same valuation if and only if\nN+\nX\nn=1\n1C+\nn (x) −\nN−\nX\nn=1\n1C−\nn (x) =\ne\nN+\nX\nn=1\n1 eC+\nn (x) −\ne\nN−\nX\nn=1\n1 eC−\nn (x)\n(8)\nfor all x ∈R2.\n5\n\n\nThe non-uniqueness of the representation (7) is confirmed by the following example.\nExample 3.3. Let C1 and C2 be two convex bodies such that C1 ∪C2 is convex. Then the\nvaluation φ(K) = χ(K ∩(C1 ∪C2)) can be alternatively represented as\nφ(K) = χ(K ∩C1) + χ(K ∩C2) −χ(K ∩(C1 ∩C2)).\nSince both sides agree on singletons, this follows from Proposition 2.3.\nThe following examples demonstrate that not all monotone valuations can be constructed\nusing only C+\nn .\nExample 3.4. Let a, b and c be segments positioned as shown in Figure 1(a) with O denoting\ntheir intersection point.\n(a)\n(b)\nFigure 1\nConsider the valuation\nφ(K) = χ(K ∩a) + χ(K ∩b) + χ(K ∩c) −χ(K ∩{O}),\nK ∈K2.\nThis valuation is integer-valued σ-continuous and monotone. To prove monotonicity, note\nthat φ(K) = 0 means that K and a∪b∪c are disjoint, and φ(K) = 1 means that K intersects\nexactly one of these segments. Thus, for φ(K) ≤1 and K′ ⊂K, we have φ(K′) ≤φ(K). If\nφ(K) = 2, the latter inequality holds because φ(K′) ≤2 for all K′ ∈K2.\nAnother way to prove the monotonicity of φ is to verify the admissibility of ({O}) with\nrespect to (a, b, c). From (3), it easily follows that N{O}(O) = R2, and for any s ∈{a, b, c},\nNs(O) is a closed half-plane that does not contain int s, with its boundary passing through\nO and orthogonal to s. Since the union of these three half-planes is the entire plane, (6)\nholds for x = O. At all other points, (6) holds trivially, as its left-hand side vanishes for any\nu. Hence, φ is monotone by Theorem 3.2.\n6\n\n\nExample 3.5. Now consider the valuation\nφ = χ(· ∩A) + χ(· ∩B) + χ(· ∩{O}) −χ(· ∩A ∩B),\nsee Figure 1(b). It is also integer-valued σ-continuous and monotone; both proofs of monotonicity\nare similar to those in Example 3.4. Note that without the term χ(·∩O), the valuation would\nbe non-monotone. Altering the positions of the lines bordering A∩B (while maintaining their\nnonempty intersection) does not change the valuation but leads to its different representation.\nWe will precede the proof of Theorem 3.2 with two auxiliary lemmas. For the first one,\nwe call a point set P an invisibility set if φ({x}) ≥1 for each x ∈P, and, for any x, y ∈P,\nthere exists a point z ∈(x, y) such that φ({z}) = 0. We denote the convex hull of a set P by\nconv P and write card P for the cardinality of P. Note that the bound on the cardinality of\nP in the following result is apparently far from optimal one, but it suffices for our purposes.\nLemma 3.6. Let φ be an integer-valued monotone valuation on K2 and n ∈N. If there\nexists an invisibility set P with card P ≥4n, then φ(conv P) > n\n2.\nProof. We proceed by induction on n. For n = 1, the claim is clear. Assume it holds for\nn −1. Arguing by contradiction, suppose that φ(conv P) ≤n\n2.\nAs before, for a line H, we denote by H−and H+ the two closed half-planes into which\nH divides R2. Draw H in such a way that card(P ∩H−) ≥22n−1 and card(P ∩H+) ≥22n−1.\nWith a slight adjustment, H can always be made to pass through some x, y ∈P. Mark\nz ∈(x, y) with φ({z}) = 0, and denote by a, b the intersection points of H and ∂conv P.\nConnect z by line segments to some u, v ∈∂conv P in such a way as to divide P ∩H−\nand P ∩H+ into four closed convex polygons Q−−, Q−+, Q+−, Q++ with card Qij ≥4n−1,\ni, j ∈{−, +}, see Figure 2 for n = 2.\nFigure 2\nOne of the polygons Q−−∪Q+−or Q−+∪Q++ is convex, depending on whether the angle\n∠uzv is ≤π or ≥π. Assume the former. Since\nφ([a, z]) = φ([a, b]) + φ({z}) −φ([z, b]) ≤φ(conv P) −φ({y}) ≤n\n2 −1,\n7\n\n\napplying the induction hypothesis to Q−−and Q+−yields the contradiction:\nn\n2 ≥φ(conv P) ≥φ(Q−−∪Q+−)\n= φ(Q−−) + φ(Q+−) −φ([a, z]) > 2 n −1\n2\n−\n\u0010n\n2 −1\n\u0011\n= n\n2.\nRecall that a set is said to be polyconvex if it is a finite union of (not necessarily disjoint)\nconvex sets. In particular, the empty set is also considered as polyconvex.\nLemma 3.7. Let φ be an integer-valued monotone σ-continuous valuation defined on closed\nconvex subsets of some W ∈K2. Then its support\nF = {x ∈W : φ({x}) ≥1}\nis polyconvex, and all its convex components are closed.\nBefore proceeding to the proof, we recall a fact from convex geometry. For m ≥2, a\nset S ⊂R2 is called m-convex if, for any m distinct points in S, at least one of the line\nsegments connecting them lies in S. In particular, 2-convex sets are just convex. According\nto Eggleston’s theorem [3], a closed m-convex set is polyconvex. Note that an extensive\nliterature has been devoted to deriving upper bounds on the number of convex components,\nsee [2], [6], [7], etc.\nProof of Lemma 3.7. We first note that F is closed.\nIndeed, if F ∋xk →x, then, for\nsome closed convex neighbourhood Vx of x and some k ≥1, we have by σ-continuity and\nmonotonicity that\nφ({x}) = φ(Vx) ≥φ({xk}) ≥1.\nThis implies x ∈F.\nTake any set P of m = 42φ(W) points from F. At least one of the line segments connecting\nthem lies entirely in F: otherwise, they would form an invisibility set, and by Lemma 3.6,\nwe would arrive at the contradiction φ(W) ≥φ(conv P) > φ(W). Hence, by Eggleston’s\ntheorem, F = Sl\ni=1 Ki for some l ≥0 and convex Ki. Taking the closures of both sides of\nthis equality and recalling that F is closed, we arrive at the desired representation.\nProof of Theorem 3.2.\nSufficiency. The set function φ given by (7) is an integer-valued σ-continuous valuation, since\nit is a sum of such valuations and, due to local finiteness, this sum has only finitely many\nnonzero terms for each K. The only thing that remains to be proved is its monotonicity.\nTaking u = 0 in (6) and using (4), we have\nφ({x}) =\nN+\nX\nn=1\n1C+\nn (x) −\nN−\nX\nn=1\n1C−\nn (x) ≥0,\nx ∈R2.\n(9)\nWe will now show that K ⊂L implies φ(K) ≤φ(L). In particular, combined with (9), this\nensures φ(K) ≥0 for any K.\n8\n\n\nDenote by F0 the family of all sets C+\nn and C−\nn which appear in (7). Fix K0 = K ⊂L,\nand define F1 to be the family of all sets from F0 that hit L while missing K0. Due to local\nfiniteness, F1 is finite, and it is possible to find a δ > 0 such that the family of sets from\nF0 which hit L + Bδ(0) while missing K0 is exactly F1. Here + stands for the Minkowski\naddition. Now replace all sets C±\nn from the family F1 by their intersections with L. This\ndoes not affect the values of φ on L and its subsets.\nWe claim that there exist\n1) a point x1 ∈L on the boundary of some set from F1,\n2) a supporting line H1 at x1 to this set that separates its interior from K0,\n3) a segment Sε1 on H1 of small length 2ε1 with ε1 < δ/ card F1 centered at x1, such that\nSε1 hits the same sets from F0 as {x1} and conv(K0 ∪Sε1) \\ Sε1 does not intersect any\nset from F1,\nsee Figure 3, where, for simplicity, the sets C+\nn and C−\nn , shown in gray, are depicted as\ndisjoint. The above construction can be carried out by choosing x1 to be the minimizer r of\nthe function x 7→infz∈K0 ∥z −x∥for all points x from any of the sets in the family F1. In\nthe case of multiple minimizers, any of them can be chosen. Note as well that this minimizer\nmay belong to several sets, say Ci1, . . . , Cip, from F1. The r-parallel set Kr\n0 is smooth at x,\nso there is a unique supporting line which then becomes H1. Since any other set from F1 is\nfarther away from K0 than r, none of them intersects conv(K0 ∪Sε1) for a sufficiently small\nsegment Sε1 on H1 centered at x1. Furthermore, since ∂Kr\n0 is smooth at x1, no set from\nCi1, . . . , Cip intersects conv(K0 ∪Sε1) \\ Sε1.\nFigure 3\nDenote K1 = conv(K0 ∪Sε1) and observe that K0 ⊂K1 ⊂L + Bε1(0). Let F2 be the\nfamily of sets from F0 (actually, from F1) that hit L while missing K1. Now repeat the\n9\n\n\nabove process first with K1, F2, x2, H2, ε2 instead of K0, F1, x1, H1, ε1, and, similarly, at the\nsubsequent steps. This process terminates at step m ≤card F1, when Fm+1 = ∅. Then\nKm ⊂L + Bε(0) with ε = P εi < δ. Then the sets Km, L, and L + Bε(0) hit the same sets\nfrom the collection F0. Hence, φ(Km) = φ(L), and, to prove monotonicity, it remains to\nshow that φ(Ki−1) ≤φ(Ki) for each i = 1, . . . , m.\nSince conv(Ki−1 ∪Sεi) \\ Sεi does not hit any set from Fi, the increment of φ between\nKi−1 and Ki is determined exclusively by those C+\nn and C−\nn that hit Sεi but miss the open\nhalf-plane\n◦H+\nui(xi) bounded by Hi and containing Ki−1. By the choice of εi, such a set hits\nSεi if and only if it contains xi. Hence,\nφ(Ki) −φ(Ki−1) =\nN+\nX\nn=1\n1C+\nn (xi) · 1{C+\nn ∩\n◦H+\nui(xi) = ∅}\n−\nN−\nX\nn=1\n1C−\nn (xi) · 1{C−\nn ∩\n◦H+\nui(xi) = ∅},\nwhich is non-negative by (5) and (6).\nNecessity. We first prove that (7) holds with some locally finite families (C+\nn ) and (C−\nn ) and\nafterwards address the admissibility of (C−\nn ) with respect to (C+\nn ). To begin with, assume\nthat φ is supported by a subset of a fixed set W ∈K2. By monotonicity,\nMφ = sup\nx∈W\nφ({x}) ≤φ(W) < ∞.\nWe will proceed by induction on Mφ.\nIf Mφ = 0, then, comparing φ with the zero valuation using Proposition 2.3, we get\nφ = 0, so that the claim holds with N + = N −= 0.\nNow let Mφ = k, k ≥1, and suppose the claim has been established for any valuation\nφ′ on W such that Mφ′ ≤k −1. By Lemma 3.7, the support of φ is F = Sl\ni=1 Ki for some\nl ≥1 and closed convex sets K1, . . . , Kl ⊂W. Denote by φ|L = φ(· ∩L) the restriction of φ\nto L ∈K2, and consider the valuation\nφ∗= χ|F +\nl\nX\nr=1\n(−1)r−1\nX\n1≤i1<...<ir≤l\n(φ −χ)|Ki1∩...∩Kir.\n(10)\nThe valuations φ and φ∗coincide on singletons: if x ∈F belongs to exactly m sets from\nK1, . . . , Kl and φ({x}) = p, then\nφ∗({x}) = 1 + (p −1)\nm\nX\nr=1\n(−1)r−1\n\u0012m\nr\n\u0013\n= p.\nHence, by Proposition 2.3, φ = φ∗.\nThe valuation φ′ = (φ −χ)|Ki1∩...∩Kir is integer-\nvalued monotone σ-continuous, and Mφ′ ≤k −1. Thus, by the induction hypothesis, it\n10\n\n\nis of the required form. Substituting the expression (7) for φ′ into (10) yields the required\nrepresentation for φ∗= φ.\nNow consider an integer-valued monotone σ-continuous valuation φ on the entire K2. For\ni, j ∈Z, denote\nQi,j = [i, i + 1] × [j, j + 1],\nEi,j = [i, i + 1] × {j},\nE′\ni,j = {i} × [j, j + 1],\nVi,j = {i} × {j}.\nNote that R2 = S\ni,j∈Z Qi,j, and double, triple, and quadruple intersections of distinct\ncomponents take the form of Ei,j, E′\ni,j, or Vi,j, while the intersections of higher orders are\nempty. The restriction of φ to any of these sets is an integer-valued monotone σ-continuous\nvaluation as well.\nHence, by the reasoning above, these restrictions are of the required\nform. Applying an analogue of (10) to the countable collection of sets Qi,j with intersections\nbeyond the fourth order being empty, we obtain the required form of φ.\nWe now prove that (C−\nn ) is admissible with respect to (C+\nn ). Since φ({x}) ≥0 for any\nx, we have\nN−\nX\nn=1\n1C−\nn (x) ≤\nN+\nX\nn=1\n1C+\nn (x),\nwhich, by (4), implies (6) for u = 0. Fix some x and u ̸= 0, and let\np+ =\nN+\nX\nn=1\n1C+\nn (x),\np−=\nN−\nX\nn=1\n1C−\nn (x),\nq+ =\nN+\nX\nn=1\n1C+\nn (x) · 1{C+\nn ∩\n◦H+\nu (x) = ∅},\nq−=\nN−\nX\nn=1\n1C−\nn (x) · 1{C−\nn ∩\n◦H+\nu (x) = ∅}.\n(11)\nIf (6) is violated for x and u, then by (5), we have q+ −q−< 0. It follows from (11) that\nN+\nX\nn=1\n1C+\nn (x) · 1{C+\nn ∩\n◦H+\nu (x) ̸= ∅} −\nN−\nX\nn=1\n1C−\nn (x) · 1{C−\nn ∩\n◦H+\nu (x) ̸= ∅}\n= (p+ −q+) −(p−−q−) = (p+ −p−) −(q+ −q−) > (p+ −p−) = φ({x}).\n(12)\nDue to local finiteness, there are a disk Bε(x) that hits the same C+\nn and C−\nn as {x} and a\nclosed convex set K, approximating Bε(x) ∩\n◦H+\nu (x) from the inside, that hits the same C+\nn\nand C−\nn as Bε(x) ∩\n◦H+\nu (x). Hence, the left-hand side of (12) is φ(K), while the right-hand\nside is φ(Bε(x)), which contradicts monotonicity.\nTo prove the final claim of the theorem, it suffices to note that (8) means the equality\nof the corresponding valuations on singletons. By Proposition 2.3, this implies their overall\nequality.\nRemark 3.8. Note that, in fact, we constructed the representation (7) with components C+\nn\nand C−\nn that are not only closed and convex but also bounded, meaning they belong to\nK2. However, using unbounded components is often convenient. For example, for the Euler\ncharacteristic χ, we can simply take N + = 1, N −= 0 and C+\n1 = R2.\n11\n\n\nThe proof that the admissibility of (C−\nn ) with respect to (C+\nn ) is both necessary and\nsufficient for the monotonicity of φ extends to any dimension along the same lines.\nIn\nother words, if a valuation φ on Kd has the form (7) with some locally finite families (C+\nn )\nand (C−\nn ), then it is monotone if and only if (C−\nn ) is admissible with respect to (C+\nn ) in\nthe sense of Definition 3.1(ii). However, the necessity of the representation (7) beyond the\ntwo-dimensional setting remains an open question: the most critical part of the proof relies\non an application of Eggleston’s theorem, and little is known about its validity in higher\ndimensions.\nThe σ-continuity condition imposed in Theorem 3.2 is crucial. If it is omitted, the class of\ninteger-valued monotone valuations expands. This is illustrated by the following examples,\nwhich work in spaces of any dimension.\nExample 3.9. If N −= 0, then the right-hand side of (7), written in the form of\nφ =\nN+\nX\nn=1\n1{· ∩C+\nn ̸= ∅},\ndefines an integer-valued monotone valuation even if the sets C+\nn are not necessarily closed.\nExample 3.10. For u ∈Sd−1, denote by Hu the supporting hyperplane of K with outer\nnormal u and set Ku = K \\ (K ∩Hu). Thus, Ku is K with one exposed face removed. For\nN + ∈N0, a set {un} ⊂Sd−1 and a locally finite set {xn} ⊂Rd, both of cardinality N +,\ndefine\nφ(K) =\nN+\nX\nn=1\n1{xn ∈Kun},\nK ∈Kd.\n(13)\nThe monotonicity of (13) is clear. To prove additivity, we first note that, for K, L ∈Kd with\nconvex union,\n(K ∪L)u = Ku ∪Lu\nand\n(K ∩L)u = Ku ∩Lu.\nThe only two non-trivial inclusions here are the direct one in the first equality and the\nreverse one in the second.\nLet H+\nu,x stand for the open half-space with inner normal u\nwhose boundary contains x. If x ∈(K ∪L)u, then x belongs to, say, K, and there exists\ny ∈H+\nu,x ∩(K ∪L). If y ∈K, we have x ∈Ku. If, however, y ∈L, then, due to convexity\nof K ∪L, there exists z ∈[x, y] ∩K ∩L. If z = x, we have x, y ∈L, and thus x ∈Lu. If\nz ̸= x, then x, z ∈K, and so x ∈Ku. This proves the direct inclusion in the first equality.\nNow let x ∈Ku ∩Lu. Then x ∈K ∩L and there exist y1 ∈H+\nu,x ∩K, y2 ∈H+\nu,x ∩L.\nAgain, due to convexity of K ∪L, there is z ∈[y1, y2] ∩K ∩L. Hence, z ∈H+\nu,x ∩(K ∩L),\nand so x ∈(K ∩L)u. This proves the reverse inclusion in the second inequality.\nThe additivity of each summand in (13) follows from the identity\n1{xn ∈Kun} + 1{xn ∈Lun} = 1{xn ∈Kun ∪Lun} + 1{xn ∈Kun ∩Lun}\n= 1{xn ∈(K ∪L)un} + 1{xn ∈(K ∩L)un}.\nThe general case follows by linearity and, if necessary, by passing to the limit.\n12\n\n\nIt is interesting to note that, in the one-dimensional case, all discontinuous integer-valued\nmonotone valuations are fully characterized by a combination of these two examples. This\nfollows from Theorem 4.1(iv) in the next section.\nOn the other hand, for σ-continuous\nvaluations with the monotonicity condition dropped, the representation (7) may also fail\neven in the one-dimensional setting, as demonstrated by Examples 4.2 and 4.3 in the next\nsection. This confirms that the Jordan decomposition does not hold for integer-valued σ-\ncontinuous valuations.\n4\nValuations on the line\nIn this section, we will explore the structure of valuations on K1, with a focus on integer-\nvalued valuations that possess some additional properties such as monotonicity or σ-conti-\nnuity. In particular, it will be shown that, in the one-dimensional analogue of Theorem 3.2, it\nis always possible to set N −= 0, thus restricting the right-hand side of (7) to positive terms\nonly. The one-dimensional case is, of course, much simpler than the planar one, which allows\nus to provide in the following theorem a complete characterization of all one-dimensional\nvaluations with certain properties.\nWe will use the double angle brackets ⟨⟨p, q⟩⟩, −∞≤p ≤q ≤∞, to denote any of the\nfour types of intervals: closed, semi-open, or open. If p = −∞or q = ∞, the interval on the\ncorresponding side can only be open. If p = q, then ⟨⟨p, q⟩⟩= [p, p] = {p}.\nTheorem 4.1. Let φ be an arbitrary valuation on K1 = {[a, b]: a ≤b}. Then there exist\ntwo unique functions f, g: R →R with f(0) = 0 such that φ([a, b]) = g(b) −f(a) for any\na ≤b. Conversely, any such pair of functions defines a valuation. Moreover,\n(i) φ is integer-valued if and only if f and g are integer-valued;\n(ii) φ is monotone if and only if f and g are non-decreasing and f ≤g;\n(iii) φ is σ-continuous if and only if f is left-continuous and g is right-continuous;\n(iv) φ is integer-valued and monotone if and only if there exist N1, N2, N3 ∈N0, a locally\nfinite family of N1 intervals ⟨⟨pn, qn⟩⟩, and two locally finite sets of N2 (resp., N3) points\nrn (resp., sn), such that, for each [a, b] ∈K1,\nφ([a, b]) =\nN1\nX\nn=1\n1\n\b\n[a, b] ∩⟨⟨pn, qn⟩⟩̸= ∅\n\t\n+\nN2\nX\nn=1\n1{rn ∈(a, b]} +\nN3\nX\nn=1\n1{sn ∈[a, b)};\n(14)\n(v) φ is integer-valued monotone and σ-continuous if and only if there exist N ∈N0 and\na locally finite family of N closed intervals [pn, qn], such that, for each [a, b] ∈K1,\nφ([a, b]) =\nN\nX\nn=1\n1\n\b\n[a, b] ∩[pn, qn] ̸= ∅\n\t\n.\n13\n\n\nNote that, unlike the terms in the last two sums of (14), 1{t ∈(a, b)} is not a valuation:\nadditivity is violated, e.g., for K = [t −1, t] and L = [t, t + 1]. Moreover, (14) can be seen\nas a combination of Examples 3.9 and 3.10 in the one-dimensional setting.\nProof of Theorem 4.1. The difference g(b) −f(a) clearly satisfies additivity and so defines a\nvaluation. Conversely, for the valuation φ, define\nf(x) =\n(\nφ([0, x]) −φ({x}),\nx ≥0,\nφ({0}) −φ([x, 0]),\nx < 0,\ng(x) =\n(\nφ([0, x]),\nx ≥0,\nφ({x}) + φ({0}) −φ([x, 0]),\nx < 0.\n(15)\nThen f(0) = 0 and, for 0 ≤a ≤b, we have by additivity\nφ([a, b]) = φ([0, b]) −φ([0, a]) + φ({a}) = g(b) −f(a).\nThe other two cases, a ≤b < 0 and a < 0 ≤b, are treated similarly.\nIn (i), the “only” part follows from (15), while the “if” part from φ([a, b]) = g(b) −f(a).\nThe same equality easily yields both parts in (ii) and (iii).\nThe “if” part in (iv) follows from Examples 3.9 and 3.10. We now prove the “only if”\npart in (iv). Let φ({c}) = m = minx∈R φ({x}) and φ′ = φ(· −c) −m. Then φ′ is an\ninteger-valued monotone valuation with φ′({0}) = 0. Hence, for its functions f and g, we\nhave f(0) = g(0) = 0. It follows from the previous claims that f and g are non-decreasing\nstep functions with integer jumps, and f ≤g. To each point x > 0 where g has a left\ndiscontinuity, i.e., g(x) −g(x−) ≥1, we associate a pattern of g(x) −g(x−) consecutive\nidentical entries “[x”. In a similar manner, handle the right discontinuities of g, denoting\ntheir positions as “(x”, x ≥0. Then proceed similarly with the left and right discontinuities\nof f, using the notation “x)” and “x]”, respectively.\nFinally, combine these patterns in\nincreasing order of x into a single, at most countable sequence. In the case of patterns with\nthe same x, they should be arranged in the following order: [x . . . (x . . . x) . . . x] . . .. The\nresulting sequence encodes both f and g on [0, ∞).\nFor example, for the functions\nf = 21(0,2) + 31{2} + 51(2,4] + 71(4,6] + 101(6,∞),\ng = 31(0,1] + 41(1,2] + 51(2,4) + 61{4} + 71(4,6) + 81{6} + 121(6,∞),\nusing this algorithm, we obtain the following sequence:\n(0 (0 (0 0] 0] (1 (2 2) 2] 2] [4 (4 4] 4] [6 (6 (6 (6 (6 6] 6] 6].\nNow, for the first opening bracket, find the nearest closing one on the right, note the resulting\ninterval, remove the used pair from the sequence and repeat the procedure. If there are not\n14\n\n\nenough closing brackets, use ∞) as many times as needed. In the above example, we arrive\nat the following set of intervals:\n(0, 0], (0, 0], (0, 2), (1, 2], (2, 2], [4, 4], (4, 4], [6, 6], (6, 6], (6, 6], (6, ∞), (6, ∞).\nThe resulting intervals can be real, such as the four types of ⟨⟨p, q⟩⟩, or virtual, such as\n[r, r) and (s, s]. A virtual interval (t, t) is impossible by construction due to the condition\nf ≤g. Along the same lines, a similar list of real and virtual intervals can be constructed\non (−∞, 0].\nConsider the valuation φ′′ constructed according to (14), by incorporating the real inter-\nvals ⟨⟨pn, qn⟩⟩into the terms of the first sum, and the points rn, sn defining the virtual\nintervals into the terms of the second and third sums. Calculating by (15) the functions\nfn and gn corresponding to all six types of terms in (14), it is easy to see that the step\nfunctions f and g for φ′′ have the same positions and structure of discontinuities as those\nfor φ′. Hence, these functions coincide, and so φ′′ = φ′. Thus, φ′ takes the form of (14).\nShifting φ′ to the right by c and adding m = m1{[a, b] ∩(−∞, ∞) ̸= ∅}, we arrive at the\nrequired representation for φ.\nThe “if” part in (v) is clear. The “only if” part follows from (iv) and the fact that all\nother terms in (14) are easily seen not to be σ-continuous.\nWe can now give the examples announced at the end of Section 3, which demonstrate\nthat, even in the one-dimensional case, the representation (7) may fail if the monotonicity\ncondition on the valuation is dropped.\nExample 4.2. Let\nf = 0\nand\ng =\n∞\nX\nn=1\n1[ 2n−1\n2n ,\n2n\n2n+1).\nBy Theorem 4.1, φ([a, b]) = g(b) −f(a) = g(b) defines an integer-valued σ-continuous\nvaluation on K1. Since the pair (fp,q, gp,q) = (0, 1[p,q)) corresponds to the valuation\nφp,q([a, b]) = 1{b ∈[p, q)} = 1{[a, b] ∩[p, q] ̸= ∅} −1{[a, b] ∩{q} ̸= ∅},\nwe arrive at the representation\nφ([a, b]) =\n∞\nX\nn=1\n1{[a, b] ∩C+\nn ̸= ∅} −\n∞\nX\nn=1\n1{[a, b] ∩C−\nn ̸= ∅}\n=\n∞\nX\nn=1\nχ{[a, b] ∩C+\nn } −\n∞\nX\nn=1\nχ{[a, b] ∩C−\nn },\n(16)\nwhere C+\nn =\n\u00022n−1\n2n ,\n2n\n2n+1\n\u0003\n, C−\nn =\n\b\n2n\n2n+1\n\t\n, and ∞−∞= 0 by convention. The families (C+\nn )\nand (C−\nn ) are not locally finite.\n15\n\n\nExample 4.3. Let f = 0 and g(x) =\n\u0004\n1\n1−x\n\u0005\n· 1(−∞,1), x ∈R. Since g = P∞\nn=1 1[ n−1\nn ,1),\nthe above reasoning leads to (16) with C+\nn =\n\u0002n−1\nn , 1\n\u0003\n, C−\nn = {1} for all n, and the same\nconvention. This time, the families (C+\nn ) and (C−\nn ) are neither locally finite, nor is the sum\nin (8) even well defined.\nIn both of the above examples, there are no other locally finite families ( eC+\nn ) and ( eC−\nn ).\nIndeed, denoting yk =\nk\nk+1, we have by (16) that φ({yk}) ̸= φ({yk+1}) for k ≥1. Hence, on\neach interval [yk, yk+1], there must be a point from some ∂eC+\nn or ∂eC−\nn . This contradicts the\nlocal finiteness.\n5\nMultiplication of countably generated valuations\nTheorems 3.2 and 4.1(v) lead us to the following general definition.\nDefinition 5.1. A valuation φ on Kd is called countably generated if there exist N ∈N0, a\nlocally finite family of N nonempty closed convex sets Cn, and a set of N real numbers αn\nsuch that\nφ(K) =\nN\nX\nn=1\nαn χ\u0000K ∩Cn\n\u0001\n,\nK ∈Kd.\n(17)\nWhile in Definition 5.1 the sets Cn were assumed to be only closed and convex, an\nequivalent representation with compact Cn follows from the inclusion-exclusion argument\nused in the proof of Theorem 3.2.\nThe above theorems show that any integer-valued monotone σ-continuous valuation on\nK1 or K2 is countably generated with all αn = 1 if d = 1 and αn = ±1 if d = 2.\nAny countably generated valuation is clearly σ-continuous. Let Vd stand for the vector\nspace of all σ-continuous valuations on Kd equipped with the natural operations of addition\nand multiplication by real numbers, and denote by Gd its subspace of countably generated\nvaluations. Note that elements of Gd are completely determined by their values on singletons:\nif φ, φ′ ∈Gd are defined by N, (αn), (Cn) and N ′, (α′\nn), (C′\nn), respectively, then φ = φ′ if and\nonly if\nN\nX\nn=1\nαn1Cn =\nN′\nX\nn=1\nα′\nn1C′n.\n(18)\nThis can be proved along the same lines as Proposition 2.3.\nFor a countably generated valuation, multiplication by a σ-continuous valuation can be\ndefined as follows. For ψ ∈Vd and φ ∈Gd given by (17), define\n(φ · ψ)(K) =\nN\nX\nn=1\nαnψ(K ∩Cn),\nK ∈Kd.\n(19)\nThe terms on the right-hand side are well defined, since K∩Cn ∈Kd for all n. If N = ∞, only\na finite number of them are non-zero due to the local finiteness of (Cn). Finally, the value of\n16\n\n\nthe sum on the right-hand side of (19) does not depend on the specific choice of N, (αn), (Cn)\nin the representation of φ by (17). Indeed, this sum is the Groemer integral of PN\nn=1 αn1K∩Cn\nwith respect to ψ, see [5]. This integral is well defined for ψ ∈Vd by Theorem 3 in the same\npaper. It remains to note that, for another set N ′, (α′\nn), (C′\nn) corresponding to φ, we have\nN′\nX\nn=1\nα′\nn1K∩C′n = 1K ·\nN′\nX\nn=1\nα′\nn1C′n = 1K ·\nN\nX\nn=1\nαn1Cn =\nN\nX\nn=1\nαn1K∩Cn\nby (18).\nIn the following proposition, we list the basic properties of this product.\nProposition 5.2. For fixed K ∈Kd,\n(i) (φ, ψ) 7→(φ · ψ)(K) is a bilinear map from Gd × Vd to R;\n(ii) (φ · ψ)(K) = (ψ · φ)(K) on Gd × Gd;\n(iii) (χ · ψ)(K) = ψ(K), where χ is the Euler characteristic.\nFor fixed φ ∈Gd and ψ ∈Vd,\n(iv) (φ · ψ)(·) is a σ-continuous valuation, that is, this operation acts from Gd × Vd into\nVd, moreover, (φ · ψ)({x}) = φ({x})ψ({x}) for each x ∈Rd;\n(v) if ψ ∈Gd, then φ · ψ ∈Gd as well, more precisely, if φ is defined by N, (αn), (Cn), and\nψ by N ′, (α′\nn), (C′\nn), then φ · ψ is defined by NN ′, (αnαm′ ), (Cn ∩Cm′ ).\nProof. (i) follows directly from (19). For\nφ = 1{· ∩C ̸= ∅}\nand\nψ = 1{· ∩C′ ̸= ∅},\n(20)\nwe have\n(φ · ψ)(K) = ψ(K ∩C) = 1{K ∩C ∩C′ ̸= ∅} = φ(K ∩C′) = (ψ · φ)(K).\n(21)\nThe general case of (ii) follows by linearity. Statement (iii) directly results from χ = 1{· ∩\nRd ̸= ∅}.\nFor (iv), if φ = 1{· ∩C ̸= ∅}, then (φ · ψ)(K) = ψ(K ∩C), which is a σ-continuous\nvaluation, then use linearity. The equality in (iv) follows from\n(φ · ψ)({x}) =\nN\nX\nn=1\nαnψ({x} ∩Cn) =\nN\nX\nn=1\nαn χ({x} ∩Cn)ψ({x}) = φ({x})ψ({x}).\nFor (v), under (20), the result follows from (21). In the general case, again use linearity.\n17\n\n\nThe valuation φ · ψ can be naturally called the product of φ and ψ for the following\nreason. The multiplication of smooth valuations introduced by S. Alesker [1] can be, in the\ntranslation-invariant case, succinctly described as follows. Let φ0 stand for the volume, and\ndefine φA = φ0(· + A), A ∈Kd, with + being the Minkowski addition. The Alesker product\nis defined by setting\n(φA · φB)(K) = φ0\n\u0000∆(K) + A × B\n\u0001\n,\nK ∈Kd,\n(22)\nwhere ∆: Rd →Rd × Rd stands for the diagonal embedding x 7→(x, x). This product then\nextends by linearity and continuity to all pairs of smooth translation-invariant valuations.\nExcept for the multiples of the Euler characteristic, countably generated valuations are\nneither smooth nor translation-invariant. Therefore, to use this approach, the basic valuation\nφ0 needs to be redefined. Let φ0 = 1{0 ∈·}. Then φA = φ0(· + A) = 1{· ∩(−A) ̸= ∅} for\nany (not necessarily bounded) nonempty closed convex set A. It follows from (22) that\n(φA · φB)(K) = 1\n\b\n∆(K) ∩\n\u0000(−A) × (−B)\n\u0001\n̸= ∅\n\t\n= 1{K ∩(−A) ∩(−B) ̸= ∅},\nK ∈Kd,\nwhich is consistent with the description of the product given in Proposition 5.2(v). This\nis in line with the intersectional approach to the Alesker product given in [4] within the\nframework of smooth manifolds.\n6\nOpen problems\nIn this section, we outline some open problems and conjectures.\nFirst, a major issue is\nto consider the case of general dimensions. This cannot be done by mimicking the proof\nof Theorem 3.2 due to the absence of a result relating m-convexity and polyconvexity in\ndimensions 3 and more.\nProblem 6.1. Characterize integer-valued monotone σ-continuous valuations in dimensions\n3 and higher.\nCounterexamples show that it is not possible to obtain meaningful results for valuations\nwhich are not σ-continuous. However, relaxing the monotonicity condition may be interesting\nalso in dimension 2.\nProblem 6.2. Obtain characterization results under weaker variants of the monotonicity\ncondition, e.g., assuming nonnegativity or local boundedness of variation in the sense of\nsup\nL⊂K, L∈Kd φ(L) ≤CK,\nK ∈Kd,\nwhere CK is a constant depending on K.\nProblem 6.3. Which property of an integer-valued monotone σ-continuous valuation φ ensu-\nres that its representation (7) contains no negative terms? This question can be posed in\ngeneral dimension, assuming that the representation (7) holds.\n18\n\n\nThe representation (7) can be interpreted as follows. Consider an integer-valued signed\nmeasure on the space of convex closed sets in R2 of the form\nµ =\nN+\nX\nn=1\nδC+\nn −\nN−\nX\nn=1\nδC−\nn ,\nwhere δC stands for the unit mass at C. By Remark 3.8, we may assume that this measure\nis defined only on K2. Then (7) can be written in the following integral form\nφ(K) =\nZ\nK2\nχ(K ∩C) µ(dC),\nK ∈K2.\nMore generally, by (17), any countably generated valuation on Kd can be written in the same\nform with µ = PN\nn=1 αnδCn for real numbers αn.\nWe call a measure µ on Kd (with its Borel σ-algebra generated by the Hausdorff metric)\nlocally finite if µ(CK) < ∞for all K ∈Kd, where CK = {C ∈Kd : K ∩C ̸= ∅}. An arbitrary\nlocally finite signed measure µ on Kd yields a valuation by letting\nφ(K) =\nZ\nKd\nχ(K ∩C) µ(dC) =\nZ\nKd 1{K ∩C ̸= ∅} µ(dC) = µ(CK).\n(23)\nSince CKn ↓CK as Kn ↓K, this valuation is σ-continuous due to the σ-additivity of the\nmeasure µ.\nProblem 6.4. Identify σ-continuous valuations on Kd such that (23) holds for a locally finite\nsigned measure µ on Kd? Note that, as follows from Example 3.3, such a measure need not\nbe unique.\nThe set of valuations admitting an integral representation of the form (23) is far from\nbeing limited to countably generated valuations. For instance, the d-dimensional volume can\nbe expressed in this form with a measure µ concentrated on singletons\nµ({x}: x ∈B) = λd(B),\nB ∈B(Rd),\nwhere λd stands for the d-dimensional Lebesgue measure. Similar representations hold for\nintrinsic volumes.\nWe conjecture that (23) holds for a very broad family of valuations. Examples 4.2 and 4.3\ndemonstrate that this does not hold for all σ-continuous valuations, since the families (C+\nn )\nand (C−\nn ) in these examples do not satisfy the local finiteness condition and so the measure\nµ is not locally finite. This may be explained by the lack of monotonicity in these valuations.\nProblem 6.5. Is the family of countably generated valuations dense (in some sense) in the\nspace of all σ-continuous valuations?\nThe following problems address changing the range of values and/or the definition domain\nof valuations.\nProblem 6.6. Characterize valuations taking values in other semigroups, such as (Z/nZ, +),\n(Z/nZ, ×), (Q, +), etc.\nProblem 6.7. Characterize integer-valued valuations on convex functions. It is very likely\nthat this can be done using our methods.\n19\n\n\nAcknowledgment\nAI was supported by the Swiss National Science Foundation, Grant No. 229505.\nTV was supported by the Swiss National Science Foundation, Grant No. 10001553.\nReferences\n[1] S. Alesker. The multiplicative structure on continuous polynomial valuations. Geom.\nFunct. Anal., 14(1):1–26, 2004.\n[2] M. Breen and D. C. Kay. General decomposition theorems for m-convex sets in the plane.\nIsrael J. Math., 24(3-4):217–233, 1976.\n[3] H. G. Eggleston. A condition for a compact plane set to be a union of finitely many\nconvex sets. Proc. Cambridge Philos. Soc., 76:61–66, 1974.\n[4] J. H. G. Fu.\nIntersection theory and the Alesker product.\nIndiana Univ. Math. J.,\n65(4):1347–1371, 2016.\n[5] H. Groemer. On the extension of additive functionals on classes of convex sets. Pacific\nJ. Math., 75(2):397–410, 1978.\n[6] J. Matouˇsek and P. Valtr. On visibility and covering by convex sets. Israel J. Math.,\n113:341–379, 1999.\n[7] M. A. Perles and S. Shelah. A closed (n + 1)-convex set in R2 is a union of n6 convex\nsets. Israel J. Math., 70(3):305–312, 1990.\n[8] R. Schneider. Convex Bodies: the Brunn-Minkowski Theory. Cambridge University Press,\nCambridge, 2014.\n20\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21144v1.pdf",
    "total_pages": 20,
    "title": "Integer-valued valuations",
    "authors": [
      "Andrii Ilienko",
      "Ilya Molchanov",
      "Tommaso Visonà"
    ],
    "abstract": "We obtain a complete characterization of planar monotone $\\sigma$-continuous\nvaluations taking integer values, without assuming invariance under any group\nof transformations. We further investigate the consequences of dropping\nmonotonicity or $\\sigma$-continuity and give a full classification of line\nvaluations. We also introduce a construction of the product for valuations of\nthis type.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}