{
  "id": "arxiv_2502.20967v1",
  "text": "Effects of non-parallelism on standard and\nmagnetorheological measurements\nR. Rodrigues1,3, F.J. Galindo-Rosales2,3, and L. Campo-Deaño1,3†\n1CEFT - Centro de Estudos de Fenómenos de Transporte, Depto. de Engenharia Mecânica,\nFaculdade de Engenharia, Universidade do Porto, Rua Dr. Roberto Frias, 4200-465, Porto,\nPortugal\n2CEFT - Centro de Estudos de Fenómenos de Transporte, Depto. de Engenharia Química,\nFaculdade de Engenharia, Universidade do Porto, Rua Dr. Roberto Frias, 4200-465, Porto,\nPortugal\n3ALiCE - Laboratório Associado em Engenharia Química, Faculdade de Engenharia,\nUniversidade do Porto, Rua Dr. Roberto Frias, 4200-465, Porto, Portugal\n†Email: campo@fe.up.pt\nHuman blood has a complex composition and unique rheological properties, making\nit challenging to measure accurately. In addition to this, its mechanical properties\nmay be influenced by external magnetic fields, which, despite being a characteristic of\nsignificant interest in the development of new treatment therapies, remains relatively\nunexplored. To achieve an accurate magnetorheological description of blood, the\nemployed equipment must achieve accurate results taking into account its low viscous\nand elastic character. However, low and inconsistent apparent-viscosity values were\nobserved systematically in a rotational rheometer equipped with a magnetorheological\ncell, without the applied magnetic field. In this work, a parametric study was\nconducted, experimentally and numerically, to evaluate this error source. Steady\nshear measurements were carried out with low-viscosity Newtonian fluids with two\ngeometries: a parallel-plate, at different gap heights, and a cone-plate. An additional\nstandard bottom plate for non-magnetic testing was also employed for comparison.\nThe standard bottom plate returned constant viscosities near the expected values,\nwhereas the plate attached to the magnetorheological cell showed a clear decrease of\nmeasured viscosity with parallel-plate gap reduction and an increase in cone-plate-\nmeasured viscosity. Numerical results corroborated the experimental observations,\npointing towards an inclination of the bottom magnetic plate which can significantly\naffect the flow. Additional experimental and numerical work was conducted to\nevaluate the effects of the setup imperfection on magnetorheological measurements,\nunveiling magnetorheology’s deep dependence on the geometric characteristics.\nKeywords: Rotational rheometry; Steady shear; Gap-error; Magnetorheology;\nlow-viscous fluids\n1\narXiv:2502.20967v1  [physics.flu-dyn]  28 Feb 2025\n\n\n1 Introduction\nBlood is a complex fluid because of its composition and mechanical properties. It is\nessentially a suspension of blood cells in plasma. Blood cells can be characterised as\nthrombocytes (or platelets), leukocytes (white blood cells or WBCs) and erythrocytes\n(red blood cells or RBCs), the latter being the most predominant in blood, with volume\nconcentration, or haematocrit (Htc), between 40 to 54% in men and 36 to 48% in women,\ndepending on other factors such as diseased state, altitude, etc.1 Blood rheology highly\ndepends on plasma viscoelasticity, haematocrit and RBCs’ mechanical properties and\naggregation mechanisms. In terms of viscous response, blood is a shear-thinning fluid with\na relatively low high-shear viscosity2 (around 3 mPa·s). Moreover, RBCs are composed\nof haemoglobin, which incorporates iron. When not carrying oxygen (deoxyhaemoglobin),\nfree electrons make it paramagnetic (attracted to an external magnetic field), while\ncarrying oxygen (oxyhaemoglobin), it remains diamagnetic (slightly repulsed)3. This\nmakes RBCs and, as a consequence, whole blood susceptible to magnetic fields. In recent\nyears, the efforts of the scientific community to understand the effects of magnetic fields\non blood’s rheological properties have grown. Magnetic fields have been studied as means\nof guidance for microrobots and particles for a multitude of medical applications4–7 and\nalso to knowingly alter blood’s properties themselves8, making magnetohaemorheology\na field of significant interest. However, experimental data are still lacking, and a full\nmagnetorheological description of whole blood has yet to be achieved.\nMeasurements with low-viscosity fluids, such as blood, can be strenuous even when\nconsidering simple fluids. Rotational rheometers, equipped with a magnetorheological cell\nto generate a uniform magnetic field, are commonly used to perform magnetorheological\ncharacterisations of this kind of fluids. Therefore, addressing some common error sources\nin rotational rheometry that could negatively affect the results is essential. A more\nin-depth walkthrough of such experimental difficulties is given in the seminal work of\nEwoldt et al.. Relevant to this work, we shall focus on the flow of low-viscosity Newtonian\nfluids and suspensions under steady shear in planar geometries (parallel-plates, PP, and\ncone-plate, CP).\nThe steady shear viscosity, η, can be obtained through the shear stress, σ, and the\nshear ratei, ˙γ, as given in the following equation9:\nη = σ\n˙γ = FτT\nFγΩ,\n(1)\nwhere T is the torque, Ωis the rotational velocity and Fτ and Fγ are functions of\ngeometrical characteristics, which for PP and CP geometries are given by9:\nPP :\nFτ =\n2\nπR3\nand\nFγ = R\nh ,\n(2)\nCP :\nFτ =\n3\n2πR3\nand\nFγ = 1\nβ ,\n(3)\niEither can be the controlled input, depending on the instrument.\n2\n\n\nwhere R is the geometry radius, h is the gap between parallel-plates and β is the CP\ncone angle.\nSteady shear measurements are limited by the minimum and maximum torques of the\nrheometer, Tmin and Tmax, and the maximum angular velocity is Ωmax. Given that the\nviscosity results are usually plotted as a function of the shear rate, the valid range in the\nη(˙γ) space is limited by the following expressions:\nFτTmin\n˙γ\n< η < FτTmax\n˙γ\n,\n(4)\n˙γ < FγΩmax .\n(5)\nTo obtain viscosity curves, it is common to collect viscosity data at several shear rates\nin a single test, which implies a shear rate step between data points. This requires some\nattention to obtain quality data, first due to the non-infinite acceleration of the rheometer\nand, second, because the flow does not instantly regain a steady state. Thus, a constant\ntime interval is usually defined for the rheometer to wait between the shear rate step and\nthe measurement. Another approach is to define a time function that establishes this\nwaiting period, dependent on the shear rate, whether linear, exponential, logarithmic,\nor other. This latter method is helpful because, usually, the flow stabilises faster for\nlarger rotational velocities; thus, having the time step diminish with the shear rate may\nreduce the overall measurement time. In any case, it is usual to perform preliminary\nconstant-shear-rate measurements (at different shear rates) to evaluate the required time\nintervals. If this is not considered, one may be gathering unsteady flow data.\nCentrifugal forces at sufficiently high rotational velocities lead to an outward radial\nvelocity component at the moving boundary and, at the static plate, from mass conserva-\ntion, an inward radial component, i.e., secondary flows. This phenomenon leads to an\nincrease in measured torque and is responsible for an apparent shear-thickening at high\nshear rates. From an analysis of experimental data, Turian arrived at an expression which\nallows us to estimate the experimental region free from secondary flows. By adjusting\ntheir expression, we can obtain another experimental limit:\nη < ρ˙γR2\n4Fγ3 .\n(6)\nIncreasing the rotational velocity further, the sample may escape the geometry, leading\nto decreased sample volume and an abrupt drop in measured viscosity.\nConsidering the loading conditions of the sample, over- and underfilling can lead to\nsignificant errors. Overfilling the geometry may lead to additional torque depending on\nthe amount of extra sample volume and geometrical characteristics11. On the other hand,\nunderfilling will result in a lower apparent viscosity because the sample cannot completely\nfill the geometry. Additionally, the symmetry of the sample/air interface is paramount\nfor low shear measurements. Johnston and Ewoldt concluded from mathematical analysis\nthat an additional torque can arise from non-constant surface tension, or non-constant\ncontact angle, between the fluid sample and the plates. Essentially, asymmetries in\nthe contact line lead to surface tension forces that pull along the fluid/air interface,\n3\n\n\nresulting in an additional torque, which is more significant at low shear, thus leading\nto an apparent shear-thinning behaviour that vanishes at sufficiently high shear rates.\nSample evaporation and over/underfilling are also sources of surface tension torque12.\nThis issue can be mitigated by accurate sample volume, reducing sample evaporation\nand diminishing the fluid’s surface tension12. Moreover, placing the sample perfectly at\nthe centre of the geometry aids in reducing contact line asymmetry as far as the wetting\nconditions of the plates allow. Despite all the efforts to counteract this phenomenon, it\ncan still lead to torque artefacts up to two orders of magnitude larger than the rheometer’s\nminimum torque. Thus, it has been common practice to multiply the low-torque limit by\na safety coefficient, shifting it to a higher shear.\nGeometrical characteristics can also affect measurement quality. Deviations from the\nnominal dimensions and unwanted rougher surface finishing from fabrication errors or wear\ncan result in incorrectly measured viscosities. Apart from the geometries’ characteristics,\nerrors in the gap height between the plates (or the cone and plate) can also lead to\nsignificant errors. Gap-errors can arise from a multitude of factors13. Setting zero-gap is\nusually done by lowering the moving plate until an increase in normal force is sensed,\nsignalling solid-solid contact. However, if the threshold force for contact assumption\nis not sufficiently high (≲5 N), normal forces arising from air squeeze can incorrectly\nserve as the contact input, leading to a deviation of the zero-gap by a few micrometers14.\nDeviations in the surface finishing of either plate and non-parallelism of the geometry\nmay also lead to gap errors. In any case, the usual gap-error leads to the actual/average\ngap in the geometry being more significant than the commanded gap in the rheometer\ninterface around 10 to 50 µm9, which leads to experimental issues. Not accounting\nthe gap-error can result in sample underfilling if the correct geometry loading is not,\nor cannot be verified before initiating the measurements. Moreover, even with perfect\nloading, gap-errors must not be disregarded, particularly for small gaps. Having that\nthe error is constant for a set of experiments, it results in lower apparent viscosities for\nsmaller gaps, whereas, for progressively larger gaps, the results approach the fluid’s actual\nviscosity due to the decreased relevance of the gap-error. Now, considering a PP system\n(for CP geometries, the gap is fixed by default), having the real gap as the sum of the\ncommanded gap and a gap-error: hr = hc + ϵ, a divergence between the commanded and\napplied shear rates arises: ˙γc = (R/hc) Ω, ˙γr = (R/(hc + ϵ))Ω. With some manipulation,\nwe can obtain:\nhc\nηm\n=\n\u0012 1\nηr\n\u0013\nhc + ϵ\nηr\n,\n(7)\nwhere ηm and ηr are the measured and real viscosities, respectively. This expression is a\nvariation of the one given by Kramer et al. and allows for an estimation of the fluid’s true\nviscosity, ηr, and the gap-error, ϵ, by conducting measurements at multiple gap heights.\nIt is, however, noteworthy that through this analysis slip effects cannot be decoupled\nfrom a gap-error as these return a similar measured-viscosity decrease with gap height\nreduction16.\nRegarding suspensions, several phenomena must be taken into account. Here we focus\non dilute/semi-dilute suspensions of spherical particles (volume fractions below 0.25).\nBrownian motion, inertial effects and the overall ability of the particles to follow the\n4\n\n\nfluid flow are important and should be evaluated. The Peclet (Pe), (particle) Reynolds\n(Rep) and Stokes (St) numbers are used to quantify these respective effects which may\nbe generally disregarded if the following adimensional quantities are sufficiently small17:\n1\nPe =\nkB T\n6 π η (dp/2)3 ˙γ ,\n(8)\nRep = ρ (dp/2)2 ˙γ\nη\n,\n(9)\nSt = ρp d2\np ˙γ\n18 η\n.\n(10)\ndp and ρp are the particle diameter and density, respectively, kB is the Boltzmann\nconstant and T is the temperature. Additionally, gravitational effects can be relevant if\nthe density difference between the dispersed and continuous phases is significant, and\nparticle migration may occur either from shear rate gradients within the flow or particle\nsurface roughness and collisions17. This particle movement may lead to the formation\nconcentration gradients, originating depletion layers near the solid boundaries or even\nshear banding. Particle depletion near the geometry walls provokes an apparent slip of\nthe dispersed phase and is common in suspension rheology, resulting in a viscosity gap-\ndependence and may be corrected a posteriori or counteracted by increasing the surface\nroughness or detailing the geometry (milled or serrated, for example)18,19. Suspensions\nmay also display time-dependent behaviour as the microstructure takes time to adjust\nto the applied shear. Moreover, the rheological response is also dependent on the shear\nhistory, particularly for small shear rates or after a resting period where the suspension\nmay achieve a metastable state17.\nConcerning magnetorheological measurements, the application of an external magnetic\nfield induces magnetic dipoles in the individual particles, causing them to aggregate\ninto elongated chains aligned with the magnetic field lines17. As such, a reversible and\ncontrollable microstructure is enabled that can significantly alter the bulk rheological\nproperties20. Additional experimental concerns arise from the time-dependent nature\nof the structure formation/destruction mechanisms and heating from magnetic field\ngeneration, which can be significant for strong fields.\nAll these experimental limitations and phenomena can compromise measurement\nquality and, because whole blood is a precious fluid, it is vital to identify the possible\nerror sources and define an experimental window before tackling its magnetorheological\ncharacterisation. In this work, steady shear measurements were performed with different\nNewtonian fluids in two static bottom plates and two planar geometries (PP and CP), and\nthe experimental limits were defined and discussed. Measurements were also conducted\nwith a Newtonian fluid seeded with magnetic particles in different concentrations under\nan external magnetic field of varying intensity. Numerical simulations were conducted\nto evaluate the effects of a possible error source on standard and magnetorheological\nmeasurements.\n5\n\n\n2 Materials and methods\n2.1 Rheometer and accessories\nAn Anton Paar MCR302-e stress-controlled rotational rheometer, shown in Figure 1(a),\nwas used for the rheological characterisation. According to the supplier, the instrument’s\nlimitations were: Tmin = 1 nN·m, Tmax = 230 mN·m and Ωmax = 314 rad/s.\nTwo static bottom plates were used; one was designed explicitly for magnetorheological\nmeasurements (Magnetic Plate, or MP) and the other for standard testing (Standard\nPlate or SP), both are shown in Figure 1(b). The SP had a diameter of 50 mm and\nallowed for careful temperature control through a Peltier system. On the other hand,\nthe MP had a diameter of about 30 mm and was attached to a magnetorheological cell,\nwhich fit into the rheometer and was connected to a power source (being responsible for\nthe generation of the magnetic field) and to an external cooling system filled with water,\nwhich allowed to dissipate heat from the magnetic field generation, but keeping a precise\ntemperature control within the fluid sample still remained challenging. The MP itself\nwas fixed to the cell by two screws and centred by three radial fixtures, as can be seen in\nFigure 1(b2).\nTwo upper geometries were considered, one parallel-plate (PP20 MRD) and one trun-\ncated cone-plate (CP20 MRD), specially designed for magnetorheological measurements.\nBoth had a diameter of 20 mm, and the CP had a cone angle of 1.981◦and a truncation\nheight of 0.084 mm. Both geometries can be seen in Figure 1(c). Either MRD geometry\nhas an outer region consisting of two rings with different depths (both lesser than the\nplate itself) that hinder the visualisation of the loading quality. In the SP, we could\nstill visualise the sample’s profile with a high-contrast background (white walls in our\ncase). On the other hand, the MP also had an outer rim, which completely blocked our\nvision of the contact line in the MRD geometries, making evaluating the loading quality\nimpossible. Figure 2 shows a schematic of the PP20 MRD with either bottom plate.\nThe magnetorheological cell was able to generate a magnetic field perpendicular to the\nflow direction, measured with an FH 54 teslameter (MAGNET-PHYSIK) inserted into a\nslot underneath (depicted in Figure 2). The geometries (PP20 MRD and CP20 MRD)\nwere non-magnetic, which prevented radial forces from acting on the shafts, and the\nmagnetic circuit was closed with a yoke placed on top of the geometry21. In this study,\na working fluid was seeded with M-270 Carboxylic Acid Dynabeads™(Thermo Fisher\nScientific) paramagnetic particles with 2.8 µm diameter, density of 1600 kg/m3 and their\nmagnetisation curve is given by Grob et al. (saturation of 6.4 Am2/kg for B ⪆500 mT).\n2.2 Working fluids\nFour different Newtonian fluids were used: a calibration oil provided by Anton Paar (Cal.\nOil), two aqueous solutions of glycerol in mass concentrations of 75.20 and 93.05 wt%\n(75.20Gly and 93.05Gly, respectively), and an aqueous solution of 52 wt% of Dimethyl\nsulfoxide (DMSO) (Newtonian blood analogue23, NBa). Table 1 gives each working\nfluid’s compositions, expected densities, and viscosities at the experimental temperature\nof 20◦C.\n6\n\n\n(a) MCR302-e\n(b1) SP\n(b2) MP\n(c1) PP20 MRD\n(c2) CP20 MRD\nFigure 1: Experimental setup: (a) Anton Paar MCR302-e rotational rheometer, (b) SP and MP\nbottom plates, and (c) PP20 MRD and CP20 MRD geometries.\nFigure 2: Schematic of the PP20 MRD geometry on either bottom plate (not to scale) and\nassociated difficulties with evaluating the loading quality.\n7\n\n\nTable 1: Composition and expected viscosity, η, and density, ρ, of the working fluids (at 20◦C).\nCalibration oil data from the supplier (Anton Paar). Glycerol and water estimates from\nVolk and Kähler. DMSO data from Budeanu and Dumitrescu\nSample\nWater\n[wt%]\nGlycerol\n[wt%]\nCal. Oil\n[wt%]\nDMSO\n[wt%]\nρ [kg/m3]\nη [mPa·s]\nCal. Oil\n-\n-\n100\n-\n816.1\n3.66\n75.20Gly\n24.80\n75.20\n-\n-\n1194.9\n36.98\n93.05Gly\n6.95\n93.05\n-\n-\n1243.0\n365.68\nNBa\n48.00\n-\n-\n52.00\n1051\n3.32\n2.3 Experimental procedure\nBefore any measurement, the zero-gap was set, the inertia of both the drive and the\nmeasuring system was acquired, and a motor adjustment function was conducted according\nto the RheoCompass™(Anton Paar) procedure.\nThe set zero-gap and inertia call\noperations were repeated at every rheometer reset and bottom plate/geometry switch.\nAlso, both plates were thoroughly cleaned of any previous sample residues and dust\nparticles, cleansed with ethanol and dried with compressed air. The sample volume\n(previously determined and given as supplementary material) was accurately measured\nwith a VWR® standard line precision pipette and carefully applied at the centre of the\nbottom plate. Measurements with the calibration oil required the fluid sample to be\napplied on the top plate/cone instead, or a combination of both, due to the fluid’s low\nsurface tension. The rheometer head was then lowered with the predefined viscoelastic\nmovement profile. When possible, the loading quality was evaluated before measurement\nstarted, looking for any signs of under/overfilling and contact line asymmetry.\nThe viscosity was measured by imposing a shear rate logarithmic ramp-up with about\n10 points per decade, between 10-1 and 104 s-1. A constant waiting time of a few seconds\nwas defined between shear rate shift and data acquisition, guaranteeing steady flow. For\nall measurements, at least 5 tests were conducted for statistical robustness, posteriorly\naveraged, and the 95% confidence intervals calculated using Student’s t-distribution.\nWith the SP, the Peltier system was set to maintain a constant temperature (20◦C),\nwhereas no such fine temperature control was achievable with the MP. Our approach\nwas to conduct the measurements when the room temperature did not diverge too much\nfrom the analogous tests with the SP (maximum ± 5◦C) while keeping the average\ntemperature of the measurement set close to the targeted 20◦C.\nConcerning the magnetorheological measurements, prior to loading, the samples were\nthoroughly mixed to redisperse the sedimented particles and to break any possible\nmicrostructure that may have formed at rest. The steady shear viscosity data was\ngathered at a constant shear rate and 10 magnetic field density values were applied up to\nB ≤720 mT. The time interval between field density change and data acquisition was set\nto 20 s to guaranty a steady state, avoiding gathering data before the magnetic-induced\n8\n\n\nmicrostructure was formed.\n3 Results and discussion\nPreliminary experimental results pointed towards a non-negligible gap-error of the MP.\nLarger sample volumes are required to fill geometries on the MP than on the SP, and\na viscosity dependence on the gap height was found, with lower measured viscosities\nfor smaller gaps. The discussion on these preliminary measurements is presented as\nsupplementary material.\n3.1 Standard measurements\nWe set out to test the measurement quality with three Newtonian fluids of different\nviscosities (Cal. Oil, 75.20Gly and 93.05Gly) on both geometries (PP20 MRD and CP\nMRD) and both bottom plates (SP and MP). The PP20 MRD gap height was varied\nbetween 0.05 and 0.35 mm and Figure 3 shows the obtained viscosity curves. The\nmeasured viscosity was plotted along with the experimental limits associated with the\nrheometer’s specifications: torque, Tmax/min, and rotational velocity, Ωmax, and the\nprediction of secondary flow onset (expressions 4-6); if any are not visible it is because\nthey fall out of the experimental window and are, thus, not relevant for those particular\nmeasurements.\n10\n1\n10\n0\n10\n1\n10\n2\n10\n3\n10\n4\n [1/s]\n10\n0\n10\n1\n10\n2\n10\n3\n [mPa s]\nCP20 MRD\nPP20 MRD\nSP\n10\n1\n10\n0\n10\n1\n10\n2\n10\n3\n10\n4\n [1/s]\n10\n0\n10\n1\n10\n2\n10\n3\n [mPa s]\nMP\nPP20 MRD: 0.05 mm\nPP20 MRD: 0.10 mm\nPP20 MRD: 0.15 mm\nPP20 MRD: 0.20 mm\nPP20 MRD: 0.25 mm\nPP20 MRD: 0.30 mm\nPP20 MRD: 0.35 mm\nCP20 MRD\n70 × Tmin\nmax\nSec. Flow\nfluid @ 20°C\nFigure 3: Viscosity curves obtained with three Newtonian fluids: Cal. Oil (circular markers),\n75.20Gly (triangular markers) and 93.05Gly (cross markers), on either bottom plate:\n(left) SP and (right) MP. Data gathered with the CP20 MRD and PP20 MRD (gap\nheights between 0.05 and 0.35 mm).\n9\n\n\nThe results obtained with the SP show generally constant viscosities for all three tested\nfluids, with no significant differences between either geometry or PP gap heights. Large\nerrors can be seen at low shear with the two lower viscosity fluids, which should be\nassociated with low-torque issues. Because the rheometer’s minimum torque limit is\noutside the experimental window (at lower shear rates for the shown viscosity range), we\nbelieve these low-shear errors are probably due to surface tension torque from contact\nline asymmetry12. Applying an adjustment factor of 70 to the minimum-torque limit\n(70 × Tmin) seems to predict the low-shear errors accurately but significantly limits\nthe experimental window. Despite our effort to carefully evaluate the correct sample\nvolume, the design of the MRD geometries makes it a strenuous task, not allowing for a\nvisualisation of the contact line throughout the measurement, which may have allowed\nsmall loading errors to remain unnoticed. The adjusted torque 70 × Tmin = 70 nN·m\nhowever, is, despite significant, not shocking. Johnston and Ewoldt report measured\ntorques with water up to 1 µN·m at low shear from loading errors. Other works, despite\nemploying lesser adjustment factors also had less torque resolution at low shear26–28.\nAt high shear, a slight viscosity increase can be observed for the less viscous fluid on\nthe larger PP gaps and the CP, which is related to secondary flow onset and is accurately\npredicted by the respective limit10. The most viscous solution shows evidence of viscous\nheating, visible through an acute viscosity decrease at high shear (there was no evidence\nof sample loss). Even though the SP can guarantee a near-constant temperature via the\nPeltier system, the temperature sensor is not in direct contact with the fluid sample.\nThus, delays in temperature control are not surprising when dealing with very sharp\ntemperature variations in the sample. Additionally, with the 93.05Gly solution a slight\nviscosity decrease is noted throughout the whole viscosity curve. At low to medium shear\nthis should not be a symptom of viscous heating, as the imposed rotational velocity is\nrelatively low, but it might be due to water absorption over time, which may be more\nnoticeable for small gaps29. The same effect may not be as noticeable for the 75.20Gly\ndue to its lesser glycerol concentration.\nWith the MP, the adjusted low-torque and secondary flow limits also predict the\nlow-shear errors and high-shear measured viscosity increment and the viscous heating\neffects on the most viscous solution are not significantly more pronounced with the MP.\nCompared to the SP data, on the MP, the CP20 MRD returned slightly larger viscosities,\nwhile with the PP20 MRD, there is a clear viscosity reduction with a gap decrease.\nFocusing on the PP20 MRD results, we can conduct a more in-depth analysis by\nevaluating useful data at multiple gap-heights. To avoid experimental errors, the data\nselected from each fluid was limited to a particular shear rate range that avoided low-shear\nuncertainties and secondary flow/viscous heating issues at high shear: 20 ≤˙γCal.Oil ≤\n2000, 3 ≤˙γ75.20Gly ≤6000 and 0.2 ≤˙γ93.05Gly ≤3000 s-1. The data obtained at each\ngap height was averaged over the selected shear rate range, ηm, and compared to the\nexpected value, ηexp. (Table 1), through a relative error:\nR.E. = ηm −ηexp.\nηexp.\n,\n(11)\nwhich is shown, for each fluid, in Figure 4.\n10\n\n\n0.05\n0.10\n0.15\n0.20\n0.25\n0.30\n0.35\nhc [mm]\n40\n20\n0\nR. E.  [%]\nSP\n0.05\n0.10\n0.15\n0.20\n0.25\n0.30\n0.35\nhc [mm]\nMP\nCal. Oil\n75.20Gly\n93.05Gly\nFigure 4: Mean viscosity relative errors and respective 95% confidence intervals for all three\nfluids: Cal. Oil (circular markers), 75.20Gly (triangular markers) and 93.05Gly (cross\nmarkers), gathered on both geometries: PP20 MRD (filled markers) and CP20 MRD\n(empty markers), and on either bottom plate: (left) SP and (right) MP. Confidence\nintervals for the CP20 MRD always within marker size.\nThe measured viscosity dependence with PP gap height is evident with the MP. With\nthis bottom plate, for the lowest PP gap of 0.05 mm, the relative error is significant,\nbetween -45 and -30%, but it diminishes with increasing gap height to errors between\n-18 and -4% for hc = 0.35 mm. With the CP20 MRD, however, positive relative errors\nare noticed for the two least viscous fluids (2 and 7%), while the most viscous solution\n(93.05Gly) returned a negative error of -9%. It is important to remember that with the\n93.05Gly solution, we did notice a viscosity decrease along the curve, possibly due to\nwater absorption, which may be why this fluid shows more significant relative errors.\nAlthough the SP’s relative errors are not as striking as the MP’s, we can still notice a\nslight dependence of the measured viscosity with gap height. The Cal. Oil and 93.05Gly\ntend to a null relative error with gap increase, while the 75.20Gly solution presents a weak\ntendency towards a 7% positive error which could be due to a inaccurate preparation\nof the solution, where the glycerol concentration was slightly larger than intended. The\nCP20 MRD returned lesser errors than on the MP, with the two less viscous fluids\napproaching a null error.\nBecause this viscosity gap-dependence is not observed on the SP, we believe there is\na systematic gap-error on the MP and that slip effects are negligible. As such, fitting\nthis gap-varying data to Equation 7, we can estimate the gap-error, ε, and correct the\nmeasured viscosity to an estimated value15: ηr = ηm (1+ε/hc). The fitting procedure was\ndone using Python’s Statsmodels GLM functionalities, and Figure 5 shows the estimated\ngap-errors and corrected viscosities for each fluid.\nOn the SP, the 75.20Gly solution returned a practically null gap-error, while small\nvalues are observed for the Cal. Oil and the 93.05Gly. These non-zero estimated gap-errors\nmay have arisen from measurement uncertainty with the low-viscosity Cal. Oil, whereas\nfor the high-concentration glycerol solution it may be a result of the previously-mentioned\nwater absorption. From these results we assume hereafter that there is no gap-error on\n11\n\n\nCal. Oil\n75.20Gly\n93.05Gly\n0\n10\n20\n30\n [ m]\nSP\nCal. Oil\n75.20Gly\n93.05Gly\nMP\n0.05 0.10 0.15 0.20 0.25 0.30 0.35\nhc [mm]\n10\n0\n10\n1\n10\n2\n10\n3\n [mPa s]\n0.05 0.10 0.15 0.20 0.25 0.30 0.35\nhc [mm]\nCal. Oil\n75.20Gly\n93.05Gly\nFigure 5: Gap-error, ε, and true viscosity estimates, ηr (filled markers, with averaged measured\nviscosity, ηm, in open markers for comparison) for all three fluids: Cal. Oil (circular\nmarkers), 75.20Gly (triangular markers) and 93.05Gly (cross markers), on either bottom\nplate: (left) SP and (right) MP.\n12\n\n\nthe SP. Contrarily, on the MP the Cal. Oil and 75.20Gly point towards a gap error of\napproximately 22.8 µm, while the 93.05Gly solution again presents a larger estimation.\nThe corrections on the MP returned slightly lesser viscosities than on the SP, which could\nbe due to deviations of the mean room temperature from 20◦C during measurement (the\nrecorded mean temperatures were 21.1, 20.3 and 20.8◦C, for the Cal. Oil, 75.20Gly and\n93.05Gly), but overall the actual viscosity estimates do seem to effectively predict the\nfluids’ true viscosities.\nOnce an efficient method to estimate the fluids’ actual viscosities is validated, we can\ncorrect the experimental viscosity curves through two approaches. The first consists\nof correcting the viscosity by performing gap-error and true viscosity estimates at all\nshear rates which could return some statistically interesting data, but this method would\nalso be accounting for errors associated with the experimental limits when considering\nviscosity data obtained at extreme shear rates (either too low, from the rheometer’s\nminimum torque or surface tension torque from contact line asymmetry, or too high, from\nsecondary flow onset and viscous heating). The alternative is to employ the previously\nobtained MP gap-error (εMP ≈22.8 µm) to correct the measured viscosity at all shear\nrates (ηm (1 + ε/hc)). As the gap-error was estimated through viscosity data within the\nexperimental window, we opted for this second method and Figure 6 shows the corrected\nviscosity curves (the SP data remained unaltered).\n10\n1\n10\n0\n10\n1\n10\n2\n10\n3\n10\n4\n [1/s]\n10\n0\n10\n1\n10\n2\n10\n3\n [mPa s]\nCP20 MRD\nPP20 MRD\nSP\n10\n1\n10\n0\n10\n1\n10\n2\n10\n3\n10\n4\n [1/s]\n10\n0\n10\n1\n10\n2\n10\n3\n [mPa s]\nMP\nPP20 MRD: 0.05 mm\nPP20 MRD: 0.10 mm\nPP20 MRD: 0.15 mm\nPP20 MRD: 0.20 mm\nPP20 MRD: 0.25 mm\nPP20 MRD: 0.30 mm\nPP20 MRD: 0.35 mm\nCP20 MRD\n70 × Tmin\nmax\nSec. Flow\nfluid @ 20°C\nFigure 6: Viscosity curves corrected for the gap error (εSP = 0 and εMP ≈22.8 µm) obtained\nwith three Newtonian fluids: Cal. Oil (circular markers), 75.20Gly (triangular markers)\nand 93.05Gly (cross markers), on either bottom plate: (left) SP and (right) MP. Data\ngathered with the CP20 MRD and PP20 MRD (gap heights between 0.05 and 0.35\nmm).\nComparing to the raw viscosity curves (Figure 3), the MP results are drastically altered,\n13\n\n\nwith the correction rectifying the experimental data effectively. Thus, hereafter we will\nfocus on elucidating the cause of the gap-error and why the CP20 MRD seems immune\nto the measured viscosity reduction and prone to yielding larger viscosities.\nBecause the SP does not show such severe gap-error symptoms, issues regarding the\nsetting zero-gap procedure seem unlikely, as it was the same for either bottom plate. The\nsame can be said about surface finishing issues; even if the material for either plate is\ndifferent, both were acquired from the same supplier (Anton Paar) and, thus, should\nhave somewhat similar surface characteristics (the same reasoning for slip negligibility).\nAssuming that the MP is straight, as we hypothesise the SP is, the most simple cause\nshould be an inclination of the MP that leads to geometry non-parallelism.\n3.2 Numerical analysis of the non-parallelism on standard measurements\nTo validate our hypothesis, we set out to model both geometries (PP20 and CP20) with\nvarying inclinations of the bottom plate to study them numerically in a 3D simulation. The\nmodel of a non-parallel PP is very straightforward, but a CP requires some consideration.\nWhen executing the zero-gap procedure, the rheometer assumes a zero gap when contact\nis made between the cone and the bottom plate. In our case, we have a truncated cone\nwith an angle of 1.981◦and truncation height of 0.084 mm. If the inclination angle is\nlesser than the cone angle, φ < β, contact is made at the truncation radius, Rt. On the\nother hand, if φ > β, contact is made on the outer radius of the cone, R, just like a PP\ngeometry. When the inclination is equal to the cone angle, φ = β, both models are valid\nas contact is made along a radial segment. Figure 7 shows schematics of the modelled\nPP and CP geometries (not to scale). hc is the commanded gap, or the truncation height\nin the case of the CP (0.084 mm), and the radius for both geometries was R = 20 mm\n(PP20 and CP20).\nThe fluid flow was then calculated in COMSOL MultiPhysics, solving for the laminar,\nincompressible and isothermal flow of a Newtonian fluid of equal characteristics to the\nCal. Oil at 20◦C (Table 1). The steady state equations for conservation of mass and\nmomentum are solved:\nρ (u · ∇) u = −∇p + η∇2u + F ,\n(12)\n∇· u = 0 .\n(13)\nThe applied boundary conditions were no-slip at the top and bottom walls. A rotational\nvelocity, Ω, was imposed at the top wall (the measuring system) while the bottom wall\nremained fixed. The sample/air interface was simplified in two ways. First, the shape of\nthe interface was considered straight and vertical (Figure 7), while in real applications,\nwe aim to have a perfect convex meniscus shape, whose contact angle with the solid parts\nis dependent on fluid surface tension. Second, the fluid/air interface was modelled as a\nfree-slip condition for the sake of simplicity.\nThe mesh was constructed in COMSOL by defining it first on the top and outer\nwalls and then using a swept mesh operation to mesh the whole volume. The whole\nrevolution was divided into 5◦slices, and the outer wall (fluid/air interface) was defined\nby partitioning the gap height, along the z direction, into 20 equal-sized elements. The\n14\n\n\n(a) PP20\n(b) CP20\nFigure 7: Schematics (not to scale) of the modelled geometries with inclined bottom plate: (a)\nPP and (b) CP. The CP model differs depending on the magnitude of the inclination\nangle, φ, relative to the cone angle, β. Cylindrical coordinate system is assumed.\ntop wall was divided into two sections, with a threshold diameter of 0.5 mm. On the\nouter region, 0.5 mm ≤r ≤R, the radial direction was divided into 30 elements, being\nprogressively refined as we approach the outer rim of the geometry (r →R) to improve\nthe resolution where we expect maximum gradients (arithmetic progression with growth\nfactor of 5). The inner region, 0 ≤r ≤0.5 mm, was constructed by dividing it into\nangular sections of 60◦and filled with small triangular elements. Figure 8 shows the top\nand side views and a zoom-in on the inner region. More information regarding the mesh\nconstruction and analysis is given as supplementary material.\nThe models were validated by verifying the velocity profiles obtained with perfectly\nparallel geometries (φ = 0) at a shear rate range 10−1 ≤˙γ ≤104 s-1. The profiles never\ndeviated from the expected Couette shape except at high shear rates when secondary\nflows onset, which was also accurately captured by the models (data not shown here). The\nviscosity \"measured\" by our modelled rheometer was calculated, according to Equation 1,\nby evaluating the torque, which was computed by integrating the wall shear stress on\nthe top, rotating wall:\nT =\nZZ\nS\nτzθ r dS .\n(14)\nThe models returned constant measured viscosity equal to the defined fluid viscosity\nexcept when secondary flows onset at high shear, which led to a measured viscosity\nincrease (data presented as supplementary material).\nHaving evaluated the model’s capability, we introduce the non-parallelism of the\ngeometries by varying the inclination angle of the bottom plate, φ. To compare with\nour experimental data, the shear rate was fixed at ˙γ = 115 s-1 (data point within the\n15\n\n\n(a) Top View\n(b) Side view\n(c) Inner region\nFigure 8: Domain of the fluid sample model: (a) top view, (b) side view and (c) detail of the\ntop/bottom wall inner region.\nexperimental window) and twenty values for the inclination angle were tested, ten lesser\nthan the cone angle, 0.1◦≤φ ≤β, and ten larger, β ≤φ ≤5◦. In Figure 9 are shown the\nvelocity profiles (velocity components: ur, uθ and uz) at r = R/2 in opposite sides of the\ninclination (θ = 0 and θ = π) for five inclination angles: φ = 0, 0.1, 0.936, 1.981(= β) and\n5◦, on both geometries (only two PP20 gap heights are shown: hc = 0.05 and 0.35 mm).\nThe results show that the inclination of the bottom plate leads to divergences from\nthe canonical Couette flow (Figure 9). Whereas the CP20 and the larger PP20 gap seem\nrelatively unaffected by the lesser tested inclination (φ = 0.1◦), the flow on the lesser\nPP20 gap is clearly altered because of the relative significance of the inclination. Despite\nthe non-parallelism of PP geometries provoking only an increase of the local gap, the\nangular velocity profiles on either side of the 0.05 mm gap geometry are curved differently.\nNotably, aggravating the non-parallelism leads to interesting velocity profiles. On the one\nhand, at the lesser local gaps (θ = 0), there seems to be a velocity overshoot, noticed first\nfor the lesser PP20 gap and then for the CP20, while on the opposite location (θ = π)\nnegative rotational velocities are seen near the bottom wall, reaching very significative\nproportions particularly for the CP20 at a geometry inclination matching the cone angle\n(φ = β = 1.981◦). To further analyse the flow, Figures 10 and 11 show, respectively,\nthe velocity magnitude fields (at the vertical plane θ = 0) and the streamlines (at the\nhorizontal plane crossing the inclined bottom plate at r = Rt, θ = 0) for either geometry\nmodel and both PP20 gaps (hc = 0.05 and 0.35 mm), and three bottom plate inclinations.\nIt seems there are fundamental differences between the flow on either non-parallel\ngeometry.\nRegarding the PP20, from the velocity magnitude fields we can see the\ninclination of the bottom plate leads to a tilt of the flow’s axis of rotation, being more\npronounced for smaller gaps. This explains the negative angular velocities displayed on\nthe profiles (Figure 9) as they were gathered taking into account the geometry’s axis and\nnot the flow’s. On the other hand, the flow behaviour on the non-parallel CP is more\ncomplex and, for inclinations around and larger than β, near the bottom of the geometry\nthe flow counters the rotation imposed on the top wall. This phenomenon should be\n16\n\n\n \n0\n1\nz/h\n= 0.000\nr = R/2, \n= 0\n \n \nr = R/2, \n=\n \n0\n1\nz/h\n= 0.100\n \n \n \n0\n1\nz/h\n= 0.936\n \n \n \n0\n1\nz/h\n= 1.981\n \n \n0\n1\nu/(  R)\n0\n1\nz/h\n= 5.000\n0\n1\nu/(  R)\n \nu\nur\nuz\nPP20: 0.05 mm\nPP20: 0.35 mm\nCP20\nFigure 9: Velocity profiles obtained from the modelled flow of the Cal. Oil, along opposing vertical\nlines: θ = 0 and π for r = R/2, at several inclination angles (φ = 0, 0.1, 0.936, 1.981, 5◦)\nin the PP20 (hc = 0.05 and 0.35 mm) and the CP20.\n17\n\n\nFigure 10: Velocity magnitude fields (U =\np\nu2\nθ + u2r + u2z) gathered at the vertical plane θ = 0\non either geometry model and two PP gap heights (hc = 0.05 and 0.35 mm) for bottom\nplate inclinations of φ = 0.936◦, 1.981◦and 5.000◦. The colorbar range was limited\nto 40% of the data range (0 ≤U ≤0.4 ΩR) and the plots were stretched vertically\n(stretching factor of 5) to facilitate visualization.\ndue to the contraction-expansion provoked by the inclination, which has a maximum\nstrangulation when it matches the cone angle. Increasing the inclination past this point\nshifts the most narrow section from the truncation radius to the outer radius, widening\nthe contraction and, therefore, beginning to slowly dissipate the counter-rotating region.\nIn Figure 12 is shown the viscosity \"measured\" by our modelled rheometer (η∗\nm, relative\nto the input Cal. Oil viscosity, ηexp, given in Table 1) with the PP20 (0.05 ≤hc ≤0.35\nmm) and CP20 geometries with varying inclination (0 ≤φ ≤5◦). With the PP20, the\nmeasured viscosity decreases as the inclination is increased, tending to zero as φ →90◦\nwith a decreasing rate. Despite seemingly behaving as a usual gap-error on perfectly-\nparallel geometries, the gap-error formulation returned viscosity estimates lower than\nthe models’ input value, possibly due to the flow alterations displayed in Figures 10\nand 11. This can also explain the correction of experimental data undershooting for\nthe MP (Figure 5). Nonetheless, relatively acceptable errors (<10%) are still achievable\nthrough the gap-error formulation for inclinations φ ≲1◦. With the CP20, the measured\nviscosity is initially increased until reaching a maximum when the inclination matches\nthe cone angle, about 77% higher than the actual viscosity. This should be due to the\nprogressive \"pinching\" of the contraction-expansion. On one side of the geometry, θ = 0,\nthe increase in inclination reduces the flow depth, leading to enhanced velocity gradients\nand, therefore, larger torque contributions. Whereas on the other side, θ = π, there is an\nincrease in flow depth, but the counter-rotating region is formed near the bottom wall,\nallowing for the maintenance of significant velocity gradients and, thus, the overall torque\nis increased. Increasing the inclination past the cone angle, the contraction is progressively\nreduced, which naturally leads to, on one hand, a reduction of the velocity gradients at\nthe constricted section and, on the other hand, to the dissipation of the recirculation\n18\n\n\nFigure 11: Streamlines gathered at an horizontal plane (crossing the inclined bottom plate at\nr = Rt and θ = 0) on either geometry model and two PP gap heights (hc = 0.05 and\n0.35 mm) for bottom plate inclinations of φ = 0.936◦, 1.981◦and 5.000◦. Imposed\nrotational velocity on the top wall is counter-clockwise.\n19\n\n\nregion, which additionally reduces the velocity gradients, leading to a measured viscosity\ndecrease.\n0\n1\n2\n3\n4\n5\n [ ]\n100\n50\n0\n50\n100\n(\n*\nm\nexp. )/\nexp [%]\nPP20: 0.05 mm\nPP20: 0.1 mm\nPP20: 0.15 mm\nPP20: 0.2 mm\nPP20: 0.25 mm\nPP20: 0.3 mm\nPP20: 0.35 mm\nCP20\nPP20 - Corrected\nFigure 12: Modelled Cal. Oil numerical viscosity (η∗\nm, relative to the input value, ηexp, given\nin Table 1) with varying inclination of the bottom plate (0 ≤φ ≤5◦) on the PP20\n(0.05 ≤hc ≤0.35 mm) and CP20 geometries.\nThese results agree with the experimental ones that showed PP20-measured viscosity\ndecreasing with gap reduction and a slight increase in CP20-measured viscosity. A\nstandard gap-error on perfectly parallel geometries (arising, for example, from miss-\njudged zero-gap, due to air squeeze or other phenomena) would only lead to a viscosity\ndecrease (this was also evaluated for our models and is presented as supplementary\nmaterial). Thus, according to the previous experimental data we can infer that the\nbottom MP is likely slightly inclined. Fitting of the numerical viscosity, a gap-error of\nε = 22.8 µm should be estimated from an inclination between 0.10 < φ < 0.31, but, if\nso, according to Figure 12, the CP-viscosity increase should not be noticeable, contrary\nto our experimental observations. Other surface defects could have a similar effect on\nexperimental results; however, the issue may lie not with the quality of the plate’s surface\nbut with its coupling to the magnetorheological cell. Looking again at Figure 1(b2), we\ncan observe that the MP is fixed to the cell via two screws and either dimensional issues\nwith the screws themselves or surface defects on the bottom of the plate where contact is\nmade could be responsible for this inclination.\nGeometry non-parallelism can be predicted and corrected fairly well for PP geometries\nthrough the gap-error formulation and viscosity data at multiple gap heights. However,\nas far as we know, there is no equivalent approach for CP geometries. The flow dynamics\ncan become relatively complex, and the measurements can return unexpected results as\nwe generally assume geometry non-parallelism to result similarly to a general gap error.\n20\n\n\nFrom this numerical work, we can gather that reasonably acceptable errors (<10%) can\nbe obtained for standard measurements with a CP20 geometry for inclinations: φ ≲1◦.\nFor 3◦≲φ ≲4◦the CP also returns small errors, but the divergence from the canonical\nflow can significantly impact the behaviour of the used sample. Until now, we have\nfocused on single-phase Newtonian fluids, but measurements of more complex samples\nmay be affected differently. In the following Sections, we shall discuss the impacts of\ngeometry non-parallelism on magnetorheological measurements.\n3.3 Experimental magnetorheological measurements\nMeasurements were performed to evaluate the setup capability of generating a measurable\nmagnetorheological response and how the bottom plate and used geometry impacts the\nresults. To this end we employed the Newtonian blood analogue — NBa (composition\nand expected density and viscosity in Table 1).\nInitially, the analogue’s viscosity curves were obtained without particles and no magnetic\nfield application, using both geometries and bottom plates. Tests were conducted with\nfour different gap heights for the PP, ranging from 0.05 to 0.35 mm. The resulting\nviscosity curves are illustrated in Figure 13. Again, the data is similarly affected by\nthe gap-error, showing decreased PP-measured viscosity with gap height reduction and\nincreased CP-measured viscosity. On the other hand, the NBa seems more sensitive to\nlow-shear issues than the Cal. Oil, particularly for larger gaps on the MP, which could\nbe due to the analogue’s more significant surface tension.\n10\n1\n10\n0\n10\n1\n10\n2\n10\n3\n10\n4\n [1/s]\n10\n0\n10\n1\n10\n2\n [mPa s]\nCP20 MRD\nPP20 MRD\nSP\n10\n1\n10\n0\n10\n1\n10\n2\n10\n3\n10\n4\n [1/s]\n10\n0\n10\n1\n10\n2\n [mPa s]\nMP\nPP20 MRD: 0.05 mm\nPP20 MRD: 0.15 mm\nPP20 MRD: 0.25 mm\nPP20 MRD: 0.35 mm\nCP20 MRD\n70 × Tmin\nmax\nSec. Flow\nfluid@20 C\nFigure 13: Viscosity curves obtained with the Newtonian blood analogue (NBa), on either bottom\nplate: (left) SP and (right) MP. Data gathered with the CP20 MRD and PP20 MRD\n(gap heights between 0.05 and 0.35 mm). No magnetic field was applied (B = 0).\nThe magnetorheological steady shear measurements were conducted with the NBa\nseeded with three concentrations of the M270 particles: 5, 10 and 15 wt%, which\n21\n\n\nare equivalent to volume fractions of ϕ ≈3.4, 6.9 and 10.6 vol% (corresponding to\ndilute/semi-dilute suspensions17). The shear rate was kept constant at ˙γ = 500 s-1\n(within the experimental window of the unseeded NBa) and the magnetic field intensity\nwas varied up to B ≤720 mT. The measurements were conducted on the MP, with both\ngeometries (PP20 MRD and CP20 MRD). With the PP20 MRD, the fluid viscosity was\nmeasured at different gap heights: 0.05 ≤hc ≤0.35 mm, (left column of Figure 14), and\nthe data gathered at an intermediate gap, hc = 0.15 mm, was corrected for the gap-error\nε = 22.8 µm (right column of Figure 14).\n2\n5\n8\n [mPa s]\n0 wt%\n2\n5\n8\n [mPa s]\n5 wt%\n2\n5\n8\n [mPa s]\n10 wt%\n0\n200\n400\n600\nB [mT]\n2\n5\n8\n [mPa s]\n15 wt%\n0\n200\n400\n600\nB [mT]\nPP20 MRD 0.05 mm\nPP20 MRD 0.15 mm\nPP20 MRD 0.25 mm\nPP20 MRD 0.35 mm\nCP20 MRD \nPP20 MRD - Corrected\nBatchelor's estimation\nFigure 14: Viscosity data (at ˙γ = 500 s-1) of the NBa seeded with magnetic particles at different\nmass concentrations (0, 5, 10 and 15 wt%), on the MP with varying magnetic field\ndensity (B ≤720 mT). Data gathered with the CP20 MRD and PP20 MRD (gap\nheights between 0.05 and 0.35 mm). In the right column, the PP20 data gathered\nat hc = 0.15 mm is shown corrected for the gap-error (ε = 22.8 µm). Horizontal\nblack lines correspond to Batchelor’s estimated viscosity of the seeded NBa at 20◦C\n(Equation 16).\nBefore discussing the results, we address some possible experimental issues. Evaluating\nthe Peclet, Reynolds and Stokes numbers, the results to Equations 8-10 are, respectively:\n1/Pe ≈4.7 × 10−5, Rep ≈3.1 × 10−4 and St ≈1.0 × 10−4, which are ≪1, meaning\n22\n\n\nwe can disregard Brownian and inertial effects. Regarding particle sedimentation, the\nsettling velocity in a dilute system can be given by:\nVs = (1 −6.55 ϕ) (dp/2)2 ∆ρ g\n18η\n,\n(15)\nwhere the term (1 −6.55 ϕ) accounts for the hindered backflow of the continuous phase\ndue to the presence of the particles, ∆ρ is the density difference between dispersed and\ncontinuous phases and g is the gravitational acceleration30. The resulting sedimentation\nvelocities are, for 5, 10 and 15 wt% concentrations, respectively: Vs ≈0.55, 0.39 and 0.22\nµm/s, which may be significant given our small gap heights, even if the total measurement\ntime was relatively short (200 s). However, because the magnetic field is aligned with the\ngap, the magnetic dipole forces will counter the gravitational effects, further hindering\nthe particle sedimentation.\nLooking at the results obtained without magnetic field application, B = 0 there is an\nincrease in viscosity with magnetic particle concentration, which is reasonably predicted\nby Batchelor’s expression31:\nη∗= η (1 + 2.5ϕ + 6.2ϕ2) ,\n(16)\n(shown in Figure 14 as horizontal black lines) where ϕ is the particle volume fraction.\nRegarding the magnetic field effects, the results present the expected response: an\nincrease in viscosity is noted with enhanced magnetic field density, which is more significant\nthe larger the particle concentration. This is because the particle-chains formed from the\nmagnetic-induced dipole interactions are aligned (with the field) perpendicular to the\nflow direction, hindering it, provoking an additional torque and, therefore, an increase in\nmeasured viscosity. There is a discrepancy between the PP20 and CP20 results, with\nthe latter always presenting larger measured viscosities, and may seem dependent on the\nparticle concentration and the magnetic field density. Nevertheless, this could be the same\neffect of the bottom plate inclination as previously discussed, because the relative error\nbetween the two geometries remained relatively constant ((ηCP −ηPP)/ηCP ≈13.5%), it\njust becomes visually prominent due to the viscosity increase with magnetorheological\nenhancement.\nIt is worth mentioning that because we employed smooth geometries, our data is likely\naffected by apparent slip of the dispersed phase which would significantly reduced the\nmeasured magnetorheological response18,32. As such, these results serve only to verify that\nthe employed setup is able to generate a significant magnetorheological response and to\ncompare between the discussed geometries. We do note that inhibiting slip, either through\nroughened or detailed geometries, should return a much stronger magnetorheological\nbehaviour with measured viscosities perhaps up to orders of magnitude larger.\nLastly, and on a side note, heating effects from the magnetic field generation were\nobserved from a very slight temperature rise at the largest field densities, but it should\nnot have significantly affected the results (< 0.3◦C).\n23\n\n\n3.4 Numerical analysis of the non-parallelism on magnetorheological\nmeasurements\nAs the SP is not applicable for magnetorheology, decoupling the effects of the MP’s\ninclination on this type of measurement was not possible. Thus, the flow of magnetised\nparticles seeded in the NBa was evaluated numerically using the rheometer models. The\nexperimental procedure would ideally be replicated to assess the impact of non-parallelism\non bulk viscosity measurements and particle chain dynamics accurately. However, the\nnumber of modelled particles needed for this replication results in extensive simulations\nthat are, unfortunately, beyond our current computational capabilities.\nTaking a different approach, the effects of geometry non-parallelism on particle-chain\nbehaviour can be assessed by evaluating only a few chains with a small number of\nparticles placed strategically in the flow. We placed particle chains at half the geometry\nradius: r = R/2 at four equally-distanced angular positions: θ ∈[0, π/2, π, 3π/2].\nTo have coherency between the geometries, the effective gaps at r = R/2 were equal:\nhPP20\nc\n= hCP20|R/2 = (R/2) tan(β).\nCOMSOL’s particle tracing for fluid flow module was used. The forces considered to\nbe acting on the particles were the viscous drag due to the fluid flow and dipole-dipole\ninteractions due to particle magnetisation. Particle sedimentation has already been\ndiscussed in the previous Section and again addressing Brownian motion, Melle et al.\ndefined an adimensional ratio between magnetic and thermal energies:\nλ =\nµ0 µf m2\n16 π (dp/2)3 kB T ,\n(17)\nwhere kB is the Boltzmann constant and T is the temperature, which we defined as 20◦C.\nUsing the M270 saturation magnetisation22(mM270\nsat.\n= 6.4 × Vp ρp [Am2], where Vp is the\nparticle volume), we obtain λ ≈32000 ≫1, meaning the magnetic effects dominate over\nBrownian motion.\nViscous drag was computed using COMSOL’s in-built Stokes drag force:\nFd = 3 π η dp(uf −up) ,\n(18)\nwhere (uf −up) is the particle velocity (up) relative to the fluid (uf). The dipolar forces\nwere computed through particle-particle interactions following the expression given by\nMelle et al.:\nFa,ij = 3 µ0 µf m2\n4 π r4\nij\nh\u0010\n1 −5 ( ˆm · ˆrij)2\u0011\nˆrij + 2 ( ˆm · ˆrij) ˆm\ni\n,\n(19)\nwhere µ0 and µf are the vacuum and fluid permeabilities, respectively (the latter being\nthe relative permeability and considered µf = 1). This expression assumes all particles\nare equally affected by the external field, i.e., their magnetisation is identical and aligned\nwith the magnetic field, which, in this case, was considered uniform and perpendicular to\nthe flow direction, as in the magnetorheological cell. The magnetic force depends on two\n24\n\n\nvector components: the magnetic moment m and the inter-particle distanceii rij (with\nmagnitude m and rij, and adimensional directions ˆm and ˆrij, respectively).\nThe particles are considered hard spheres and, to approximate this behaviour, a\nrepulsive excluded-volume force was applied33,34:\nFr,ij = 2 3 µ0 µf m2\n4 π d4p\nexp\n\"\n−30\n \nrij\ndp\n−1\n!#\nˆrij .\n(20)\nAligned with the field, the excluded volume force perfectly balances the magnetic at-\ntraction when two particles are in mechanical contact (r = dp). Whereas, when the\ninter-particle distance is r = 1.1 dp, the excluded-volume force is approximately 14 times\nsmaller than the magnetic attraction force, not provoking unwanted forces in other\nsurrounding particles34. Both these forces were computed as particle-particle interactions,\nand, therefore, we define a general magnetic force acting on the particles as:\nFm,ij = Fa,ij + Fr,ij .\n(21)\nIn truth, the presence of the particles induces changes in the fluid flow. But, despite\nCOMSOL allowing for the coupling of different physics, this would further complicate\nthe model. Therefore, we opted only to evaluate the effects of the fluid on the particle\nchains and disregard the inverse phenomenon. Furthermore, as we have already simplified\nthe problem to analyse only a few chains, these effects on the total torque measurement\nwould be negligible and not representative of the impact on a real measurement. The\nparticle boundary condition forced the particles that collide with the geometry walls or\nthe simplified fluid/air interface to adhere to them with no slip, reducing their velocity to\nzero. As we are only interested in the behaviour of a general particle chain for a qualitative\nanalysis, we could alter the particle diameter to reduce the required number of particles\nper chain and their magnetisation, which, when decreased, allows lesser magnetic forces\nto facilitate convergence. To have a clear idea of the possible effects of the geometrical\nchanges on the particle chains, we wanted to set the system properties so that the chains\nremain unbroken in the perfectly parallel geometries while keeping the models relatively\nlight. Therefore, we had an interplay between particle size, particle magnetisation and\nflow velocity, where small particles, i.e., large chains34, low magnetisation and large shear\nrates led to chain break. We performed simulations of a single chain on the parallel\nCP20 to test the limits of these characteristics. The particle diameter was varied between\n35 and 16 µm, leading to chains of 4 to 10 particlesiii and the shear rate ranged from\n0.01 to 1 s-1, guaranteeing that the the particles are capable of effectively following the\nflow (for dp = 35 µm, from Equation 10: St ≈3.3 × 10−5 ≪1). The magnetisation was\nprogressively decreased using a factor, 1 ≤Cm ≤50, such that the tested magnetisation\nwas: m∗= mM270\nsat. /Cm. From these simulations, three behaviours were observed: a) the\nchain remained unbroken, b) the chain undergoes subdivision (including combinations\niiThe inter-particle distance is the vector between particle centres.\niiiThe number of particles in each chain was calculated by rounding down (to the nearest integer) the\nrequired particle number to span the local gap height: n = [h/dp], where dp is the modelled particle\ndiameter.\n25\n\n\nof minor chains and isolated particles), and c) the chain completely breaks down into\nindividual particles. Examples of these behaviours are showcased in Figure 15, and the\nresults can be seen in Figure 16.\n(a) Unbroken\n(b) Subdivision\n(c) Breakdown\n0\n1\n|vp|/(\nR/2)\nFigure 15: Magnetised-particle chain (dp = 16 µm, np = 10) on the CP geometry model (without\nbottom plate inclination) with imposed shear rate ˙γ = 1 s-1 with varying magnetisation\nfactor: (a) Cm = 5, (b) Cm = (left) 10 and (right) 20, (c) Cm = 30. The particles are\ninitially placed in a vertical uniform distribution (vertical line segment on the left, of\nlength, R/2 tan(β)) and the shown images were taken at t = 4 s. Flow is left to right.\nUsually, a Mason number, Mn, that describes the ratio between viscous and magnetic\neffects is used to identify the transitions in chain dynamics33, and a multitude of different\nformulations have been previously employed33–36. With our data, the Mason number\ndefined by de Gans et al. suitably predicts the complete breakdown of the chains when\napproaching unity:\nMn = 128 π2 (dp/2)6 η ˙γ\nµ0 µf m∗2\n= 1 ,\n(22)\nwhich can be seen, plotted in black, in Figure 16. From its definition, this Mason number\nseems dependent on the particle size, but having that:\nMM270\nsat.\n= 6.4 × ρp = mM270\nsat. /Vp [A/m] ,\n(23)\nand, therefore, M∗= MM270\nsat.\n/Cm, we can simplify the Mason number to:\nMn =\n72 η ˙γ\nµ0 µf M∗2 .\n(24)\n26\n\n\n1\n25\n50\nCm\n4 particles (dp = 35 m)\n1\n25\n50\nCm\n6 particles (dp = 25 m)\n1\n25\n50\nCm\n8 particles (dp = 20 m)\n10\n2\n10\n1\n10\n0\n [1/s]\n1\n25\n50\nCm\n10 particles (dp = 16 m)\nUnbroken\nSubdivision\nBreakdown\nFigure 16: Magnetised-particle chain behaviour under steady shear in a planar geometry with\nvarying particle diameter (number of particles per chain), particle magnetisation\n(through the scaling constant Cm) and shear rate (˙γ). In black, chain complete-\nbreakdown prediction through the Mason number defined by de Gans et al.: Mn = 1.\n27\n\n\nAs such, the chain complete breakdown is only dependent on the fluid properties, which\nwere set to the NBa’s, the shear rate and the particle magnetisation, independent of the\nnumber of particles and their size, as corroborated by the results in Figure 16. The same\ncannot be said about chain subdivision, which has a clear dependence on particle number,\nmaking larger chains easier to break. We have yet to find a second Mason number that\naccurately predicts our chain subdivision, but it is an issue that is out of the scope of\nthis work.\nWe could select a shear rate and particle magnetisation through the gathered data that\nminimised the computational effort while maintaining unbroken chains in the perfectly\nparallel geometries. It is pertinent to have the same defined shear rate (rim shear rate,\n˙γ(R)) for both geometries, similar to the experimental procedure and, having determined\nthe PP gap height as hc = R/2 tan(β):\n˙γ(R) = ˙γPP(R) = ˙γCP(R) ⇔\nR\nR/2 tan(β) ΩPP = 1\nβ ΩCP ⇔ΩPP ≈ΩCP\n2\n.\n(25)\nThus, at the defined location for chain deployment (R/2), the local shear rate on the PP\ngeometry:\n˙γPP(R/2) =\nR/2\nR/2 tan(β) ΩPP = ˙γ(R)\n2\n.\n(26)\nThis dictates a parameter choice where, for the chosen particle number and magnetisation\nparameter Cm, the chains remain unbroken at two local shear rates: ˙γ(R) and ˙γ(R)/2.\nWe opted for chains with only 4 particles (dp = 35 µm) and a rim shear rate of ˙γ(R) = 1\ns-1, having, thus, the maximum particle magnetisation factor before chain subdivision:\nCm = 10 (particle magnetisation: M∗= 6.4 ρ/Cm = 1024 A/m).\nBefore heading to the results, it is worth mentioning that the characteristics of the\ngeometries are significant to the chain dynamics. The CP’s constant shear rate along the\nradius (when disregarding the truncated region) corresponds to the maximum shear rate\ninduced on the PP (at the rim), therefore, for chains of equal length with an arbitrarily\nimposed rim shear rate, the CP is more likely to break the chains. On the other hand,\nthe CP gap height depends on the radial position, which leads to smaller, harder to\nbreak chains as we approach the centre. As such, an interplay between varying shear rate\n(on the PP) and chain length (on the CP) can diverge the magnetorheological results of\neither geometry.\nIn Figure 17 are shown the particle trajectories in both geometries (without bottom\nplate inclination) at time t = 650 s (the trajectories at other times, t = 70 and 200 s,\nare not included here for the sake of conciseness, but are provided as supplementary\nmaterial). The chains remain unbroken, travelling along the plane r = R/2 on either\ngeometry, but moving faster on the CP20, where they are subject to a larger rotational\nvelocity (ΩCP ≈2 ΩPP).\nIntroducing a bottom plate inclination of φ = 1◦(the maximum for acceptable viscosity\nmeasurements), the analogous results are shown in Figure 18. Before discussing the chain\ndynamics, the introduced geometry non-parallelism affects the number of particles in each\nchain. For the PP, it increases particle number from 4 in each chain to chains of 7, 9 and\n28\n\n\nφ = 0\nPP20\nCP20\nt = 650 s\n0\n1\n|vp|/(\nR/2)\nFigure 17: Magnetised-particle trajectories (dp = 35 µm and M ∗= 1024 A/m) on the (left) PP20\nand (right) CP20 models (without bottom plate inclination: φ = 0) with imposed\nshear rate ˙γ = 1 s-1 at time t = 650 s.\n12 particles. For the CP, because the inclination is lesser than the cone angle (φ < β),\nthe gap is reduced at the constrained region, θ = 0, (see Figure 7) before increasing as\nwe descend along the inclination, which leads to chains of 3, 6 and 8 particles.\nConsidering the PP results (left column of Figure 18), initially only the largest chain,\nof 12 elements, subdivides, consequently separating. Compared to the particle flow on the\nparallel geometry (Figure 17), the chains begin to diverge from the R/2 plane because\nthe inclination of the geometry also leads to an inclination of the rotational axis. This\nbecomes more evident as we move forward in time, particularly for t = 650 s, where the\ntrajectories of most chains overlap. There are some additional observations regarding\nwall interactions. Because the intermediate chains (of 9 particles at θ = π/2 and 3π/2)\ndo not subdivide, while travelling along the tilted geometry, they collide with the bottom\nwall and lose the particle that adheres to it. With a similar behaviour, the subdivided\nportion of the largest chain closest to the bottom wall also collides with it, but instead\nof further subdividing or losing the contact particle, because the local shear rate is not\nsufficiently strong, the whole chain is stuck to the wall.\nConsidering the CP (right column of Figure 18), only the smaller chain of 3 elements\nremains unbroken. As the imposed rotational velocity is larger in this geometry, the\nenlarged shear rate leads to their subdivision despite the intermediate chains being three\nelements smaller than on the PP. In this case, because the intermediate chains are also\nbroken, the three subdivided portions closest to the bottom wall stick to it when contact\nis made. Despite significantly altering the flow, this slight inclination does not reveal\nthe counter-rotating region near the bottom wall. However, increasing the inclination\nangle to φ = β = 1.981◦does generate a much stronger recirculation region (see Figure\n29\n\n\nφ = 1◦\nPP20\nCP20\nt = 70 s\nt = 200 s\nt = 650 s\n0\n1\n|vp|/(\nR/2)\nFigure 18: Magnetised-particle trajectories (dp = 35 µm and M ∗= 1024 A/m) on the (left\ncolumn) PP20 and (right column) CP20 models with a bottom plate inclination of\nφ = 1◦, with imposed shear rate ˙γ = 1 s-1 at different times (t = 70, 200 and 650 s).\n30\n\n\n9), which significantly affects the chain dynamics. For the sake of clarity, the particle\ntrajectories for φ = β are not shown here but are presented as supplementary material.\nThe bottom plate inclination calls for larger chains, which are easier to break, but\nthe subdivided portions may be close in size to the original chains we ought to have\nin the perfectly parallel geometries. However, the issue with the magnetorheological\nmeasurements is not the chain size directly but the consequent chain velocity. Near\nthe measuring geometry (top wall in this case), the closer the chain velocity is to the\nflow velocity, the lesser the influence on the measured torque and, therefore, the lesser\nthe magnetic influence is felt. The particle trajectories shown in Figures 17 and 18\nwere plotted with a colour scheme in which the particle velocity is scaled with the\nmaximum velocity at deployment (ΩR/2), which allows us to see that the particles near\nthe measuring plate/cone (on top) have a larger velocity on the tilted geometries than on\nthe parallel ones, which will reduce the magnetically-induced measured-viscosity increase.\n4 Conclusions\nIn this work we set out to evaluate the suitability of an experimental setup for steady\nshear magnetorheological measurements of whole blood. An experimental campaign\nwas conducted with Newtonian fluids in two planar geometries specially designed for\nmagnetorheological measurements, one parallel-plate (PP20 MRD) and one cone-plate\n(CP20 MRD), and on two bottom plates, one for standard measurements (SP) and one\nfor magnetic testing (MP).\nIt was found that the rheometer’s minimum torque multiplied by a 70× factor reasonably\ndelimited low shear errors and the apparent shear-thickening at high shear was accurately\npredicted by the onset of secondary flows. On the MP we encountered a dependence\nof the PP-measured viscosity with gap height, returning lower viscosities as the gap is\nreduced, and larger CP-measured viscosities with this bottom plate than with the SP.\nThe gap-error formulation15 effectively corrected the PP-measured viscosity data and\nthe error itself was found to be around ε ≈22.8 µm and most probably provoked by an\ninclination of the MP.\nNumerical models of non-parallel geometries corroborated the experimental results,\npointing towards an MP inclination between 0.10 < φ < 0.31◦. The numerical work\nalso revealed that the geometry non-parallelism can lead to notable flow alterations,\nparticularly for CP geometries which essentially give rise to contraction-expansion flow\nand may lead to the emergence of counter-rotating regions as the inclination approaches\nthe cone angle.\nMagnetorheological measurements were also conducted with a Newtonian blood ana-\nlogue seeded with magnetic particles and the results showed a viscosity increase with\nparticle concentration and magnetic field density. The flow of a few particle chains\nwas modelled and it was observed that geometry non-parallelism can significantly affect\nmagnetorheological measurements, seemingly diminishing the magnetic effects.\n31\n\n\nSupplementary material\nAs supporting material we present: preliminary measurements, a description and discus-\nsion on the mesh employed on the numerical work, numerical estimations of the effects of\na general gap-error on viscosity measurements with parallel geometries, and trajectories of\nmagnetised particles in perfectly parallel geometries and with a bottom plate inclination\nequal to the angle of the employed Cone-Plate (obtained numerically).\nAcknowledgements\nThis work was financially supported by national funds through the FCT/MCTES (PID-\nDAC), under the project PTDC/EME-APL/3805/2021 (DOI 10.54499/PTDC/EME-\nAPL/3805/2021), LA/P/0045/2020, UIDB/00532/2020 and UIDP/00532/2020, and the\nprogram Stimulus of Scientific Employment, Individual Support-2020.03203.CEECIND.\nReferences\n[1] H. H. Billett. Hemoglobin and Hematocrit. Clinical Methods: The History, Physical,\nand Laboratory Examinations. 3rd edition, 1990.\n[2] A. Z. Valant, L. Žiberna, Y. Papaharilaou, A. Anayiotos, and G. C. Georgiou. The\ninfluence of temperature on rheological properties of blood mixtures with different\nvolume expanders—implications in numerical arterial hemodynamics simulations.\nRheologica acta, 50:389–402, 2011.\n[3] M. Zborowski, G. R. Ostera, L. R. Moore, S. Milliron, J. J. Chalmers, and A. N\nSchechter. Red Blood Cell Magnetophoresis. Biophysical journal, 84(4):2638–2645,\n2003.\n[4] I. Khalil, H. Dijkslag, L. Abelmann, and S. Misra. MagnetoSperm: A microrobot\nthat navigates using weak magnetic fields. Applied Physics Letters, 104(22):223701,\n2014.\n[5] Q. Fu, S. Guo, Y. Yamauchi, H. Hirata, and H. Ishihara. A novel hybrid microrobot\nusing rotational magnetic field for medical applications. Biomedical microdevices, 17\n(2):1–12, 2015.\n[6] J. Mathieu and S. Martel. Aggregation of magnetic microparticles in the context of\ntargeted therapies actuated by a magnetic resonance imaging system. Journal of\napplied physics, 106(4):044904, 2009.\n[7] S. Shaw and P. Murthy. Magnetic Drug Targeting in the Permeable Blood Ves-\nsel—The Effect of Blood Rheology. Journal of Nanotechnology in Engineering and\nMedicine, 1(2), 2010.\n32\n\n\n[8] R. Tao and K. Huang. Reducing blood viscosity with magnetic fields. Physical\nReview E, 84(1):011905, 2011.\n[9] R. H. Ewoldt, M. T. Johnston, and L. M. Caretta. Experimental challenges of shear\nrheology: how to avoid bad data. In Complex fluids in biological systems, pages\n207–241. Springer, 2015.\n[10] R. M. Turian. Perturbation Solution of the Steady Newtonian Flow in the Cone and\nPlate and Parallel Plate Systems. Industrial & Engineering Chemistry Fundamentals,\n11(3):361–368, 1972.\n[11] R. Cardinaels, N. K. Reddy, and C. Clasen. Quantifying the errors due to overfilling\nfor Newtonian fluids in rotational rheometry. Rheologica Acta, 58:525–538, 2019.\n[12] M. T. Johnston and R. H. Ewoldt. Precision rheometry: Surface tension effects\non low-torque measurements in rotational rheometers. Journal of Rheology, 57(6):\n1515–1532, 2013.\n[13] G. A. Davies and J. R. Stokes. Thin film and high shear rheology of multiphase\ncomplex fluids. Journal of Non-Newtonian Fluid Mechanics, 148(1-3):73–87, 2008.\n[14] G. A. Davies and J. R. Stokes. On the gap error in parallel plate rheometry that\narises from the presence of air when zeroing the gap. Journal of Rheology, 49(4):\n919–922, 2005.\n[15] J. Kramer, J. T. Uhl, and R. K. Prud’Homme. Measurement of the viscosity of guar\ngum solutions to 50,000 s-1 using a parallel plate rheometer. Polymer Engineering\n& Science, 27(8):598–602, 1987.\n[16] G. Vleminckx and C. Clasen. On the Inseparability of Slip and Gap-Error. Journal\nof Rheology, 60(4):549–557, 2016.\n[17] J. Mewis and N. J. Wagner. Colloidal suspension rheology, volume 10. Cambridge\nUniversity Press, 2012.\n[18] Richard Buscall. Wall slip in dispersion rheometry. Journal of Rheology, 54(6):\n1177–1183, 2010.\n[19] A. Yoshimura and R. K. Prud’homme. Wall slip corrections for Couette and parallel\ndisk viscometers. Journal of Rheology, 32(1):53–67, 1988.\n[20] M. T. López-López, P. Kuzhir, S. Lacis, G. Bossis, F. González-Caballero, and\nJ. D. G. Durán. Magnetorheology for suspensions of solid particles dispersed in\nferrofluids. Journal of Physics: Condensed Matter, 18(38):S2803, 2006.\n[21] J. Laeuger, K. Wollny, H. Stettin, and S. Huck. A new device for the full rheological\ncharacterization of magneto-rheological fluids. International Journal of Modern\nPhysics B, 19(07n09):1353–1359, 2005.\n33\n\n\n[22] D. T. Grob, N. Wise, O. Oduwole, and S. Sheard. Magnetic susceptibility charac-\nterisation of superparamagnetic microspheres. Journal of Magnetism and Magnetic\nMaterials, 452:134–140, 2018.\n[23] L. Campo-Deaño, R. Dullens, D. G. Aarts, F. T. Pinho, and M. S. N. Oliveira. Vis-\ncoelasticity of blood and viscoelastic blood analogues for use in polydymethylsiloxane\nin vitro models of the circulatory system. Biomicrofluidics, 7(3), 2013.\n[24] A. Volk and C. J. Kähler. Density model for aqueous glycerol solutions. Experiments\nin Fluids, 59(5):75, 2018.\n[25] M. M. Budeanu and V. Dumitrescu. Densities, viscosities and excess properties for\ndimethyl sulfoxide with diethylene glycol and Methyldiethanolamine at different\ntemperatures. Applied Sciences, 12(1):116, 2021.\n[26] J. Soulages, M. S. N. Oliveira, P. C. Sousa, M. A. Alves, and G. H. McKinley.\nInvestigating the stability of viscoelastic stagnation flows in T-shaped microchannels.\nJournal of Non-Newtonian Fluid Mechanics, 163(1-3):9–24, 2009.\n[27] M. S. N. Oliveira, R. Yeh, and G. H. McKinley. Iterated stretching, extensional\nrheology and formation of beads-on-a-string structures in polymer solutions. Journal\nof non-Newtonian fluid mechanics, 137(1-3):137–148, 2006.\n[28] L.E. Rodd, T. P. Scott, D. V. Boger, J. J. Cooper-White, and G. H. McKinley. The\ninertio-elastic planar entry flow of low-viscosity elastic fluids in micro-fabricated\ngeometries. Journal of Non-Newtonian Fluid Mechanics, 129(1):1–22, 2005.\n[29] J. T. Ault, S. Shin, A. Garcia, A. Perazzo, and H. A. Stone. Viscosity measurements\nof glycerol in a parallel-plate rheometer exposed to atmosphere. Journal of Fluid\nMechanics, 968:A2, 2023.\n[30] G. K. Batchelor. Sedimentation in a dilute dispersion of spheres. Journal of fluid\nmechanics, 52(2):245–268, 1972.\n[31] G. K. Batchelor. The effect of Brownian motion on the bulk stress in a suspension\nof spherical particles. Journal of fluid mechanics, 83(1):97–117, 1977.\n[32] J. de Vicente, M. T. López-López, J. D. G. Durán, and F. González-Caballero. Shear\nflow behavior of confined magnetorheological fluids at low magnetic field strengths.\nRheologica acta, 44:94–103, 2004.\n[33] S. Melle, O. G. Calderón, M. A. Rubio, and G. G. Fuller. Microstructure evolution\nin magnetorheological suspensions governed by Mason number. Physical Review E,\n68(4):041503, 2003.\n[34] Y. Gao, M. A. Hulsen, T. G. Kang, and J. M. J. Den Toonder. Numerical and\nexperimental study of a rotating magnetic particle chain in a viscous fluid. Physical\nReview E—Statistical, Nonlinear, and Soft Matter Physics, 86(4):041503, 2012.\n34\n\n\n[35] B. de Gans, H. Hoekstra, and J. Mellema. Non-linear magnetorheological behaviour\nof an inverse ferrofluid. Faraday Discussions, 112:209–224, 1999.\n[36] D. J. Klingenberg, J. C. Ulicny, and M. A. Golden. Mason numbers for magnetorhe-\nology. Journal of Rheology, 51(5):883–893, 2007.\n35\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20967v1.pdf",
    "total_pages": 35,
    "title": "Effects of non-parallelism on standard and magnetorheological measurements",
    "authors": [
      "R. Rodrigues",
      "F. J. Galindo-Rosales",
      "L. Campo-Deaño"
    ],
    "abstract": "Human blood has a complex composition and unique rheological properties,\nmaking it challenging to measure accurately. In addition to this, its\nmechanical properties may be influenced by external magnetic fields, which,\ndespite being a characteristic of significant interest in the development of\nnew treatment therapies, remains relatively unexplored. To achieve an accurate\nmagnetorheological description of blood, the employed equipment must achieve\naccurate results taking into account its low viscous and elastic character.\nHowever, low and inconsistent apparent-viscosity values were observed\nsystematically in a rotational rheometer equipped with a magnetorheological\ncell, without the applied magnetic field. In this work, a parametric study was\nconducted, experimentally and numerically, to evaluate this error source.\nSteady shear measurements were carried out with low-viscosity Newtonian fluids\nwith two geometries: a parallel-plate, at different gap heights, and a\ncone-plate. An additional standard bottom plate for non-magnetic testing was\nalso employed for comparison. The standard bottom plate returned constant\nviscosities near the expected values, whereas the plate attached to the\nmagnetorheological cell showed a clear decrease of measured viscosity with\nparallel-plate gap reduction and an increase in cone-plate-measured viscosity.\nNumerical results corroborated the experimental observations, pointing towards\nan inclination of the bottom magnetic plate which can significantly affect the\nflow. Additional experimental and numerical work was conducted to evaluate the\neffects of the setup imperfection on magnetorheological measurements, unveiling\nmagnetorheology's deep dependence on the geometric characteristics.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}