{
  "id": "arxiv_2502.20588v1",
  "text": "A finite sufficient set of conditions for catalytic majorization\nDavid Elkouss,1, ∗Ananda G. Maity,1, † Aditya Nema,2, ‡ and Sergii Strelchuk3, §\n1Networked Quantum Devices Unit, Okinawa Institute of Science and Technology Graduate University, Onna-son, Okinawa 904-0495, Japan\n2Institute of Quantum Information, RWTH Aachen, Germany\n3Department of Computer Science, University of Oxford\nThe majorization relation has found numerous applications in mathematics, quantum information and re-\nsource theory, and quantum thermodynamics, where it describes the allowable transitions between two physical\nstates. In many cases, when state vector x does not majorize state vector y, it is nevertheless possible to find a\ncatalyst – another vector z such that x ⊗z majorizes y ⊗z. Determining the feasibility of such catalytic trans-\nformation typically involves checking an infinite set of inequalities. Here, we derive a finite sufficient set of\ninequalities that imply catalysis. Extending this framework to thermodynamics, we also establish a finite set\nof sufficient conditions for catalytic state transformations under thermal operations. For novel examples, we\nprovide a software toolbox implementing these conditions.\nI.\nINTRODUCTION\nIrreversibility is a phenomenon in the realm of physics that\nserves as a key indicator for transitions from orderly to dis-\norderly states of the systems. It is typically described by the\nlaws of thermodynamics, yet its relevance extends far beyond\nthermodynamics, influencing diverse fields across physics and\nmathematics. Intuitively, a process is considered reversible\nwhen no dissipation occurs, allowing the system to remain in\nequilibrium throughout its evolution. Accurately characteriz-\ning irreversibility is thus paramount, with important applica-\ntions in areas such as quantum state transformations, entan-\nglement dynamics, characterization of thermal machines and\nheat engines.\nThere is a broader notion of irreversibility which extends\nbeyond thermodynamic irreversibility, treating it as a special\ncase. Central to this approach is the concept of majorization,\nwhich provides a powerful tool for distinguishing between re-\nversible and irreversible processes.\nMajorization and its implications had a major impact on\nvarious scientific disciplines such as mathematics [1], ma-\nchine learning [2, 3], and economics [1]. In recent times, it\nhas played a crucial role in quantum information theory [4–\n8], quantum thermodynamics [9–11], and more generally on\nresource theories [12]. See [1] for a review on early applica-\ntions. In the latter cases, it gives insights into the entangle-\nment structure of quantum states, thermodynamic resources\nand provides an elegant operational criterion which deter-\nmines when it is possible to convert one quantum state into\nanother.\nNevertheless, majorization alone falls short of offering\na comprehensive characterization of state transformations.\nThere are instances where transforming one quantum state\ninto another is not possible within a specific class of opera-\ntions. Yet, the introduction of an ancillary state can some-\ntimes facilitate this transformation under the same operations,\n∗david.elkouss@oist.jp\n† anandamaity289@gmail.com\n‡ aditya.nema30@gmail.com\n§ sergii.strelchuk@cs.ox.ac.uk\nAll authors have contributed equally in this work.\nwith the ancillary state ultimately returning to its original and\nexact form [5]. This additional system that alleviates restric-\ntions on apparently prohibited transitions serves as a catalyst.\nFor a comprehensive review of different aspects of catalysis\nin quantum information theory, we refer interested readers to\nthe following references [13, 14].\nTo illustrate further, let us analyze this from the perspective\nof thermodynamics. In the macroscopic domain of thermody-\nnamics, a system existing in state ρ can undergo a transition\nto state σ if there is a decrease in free energy where the free\nenergy of a state ρ is defined as, F(ρ) = ⟨E(ρ)⟩−KTS(ρ).\nHere ⟨E(ρ)⟩is the average energy, K is the Boltzmann con-\nstant, and S(ρ) is the entropy of the state ρ with T be-\ning the temperature of the surrounding heat bath. Unfortu-\nnately, in the realm of microscopic, quantum, or highly cor-\nrelated systems, a reduction in free energy alone does not\nsuffice as a condition for state transformation. Instead, the\nconcept known as thermo-majorization has been introduced\n[9, 15]. Nevertheless, even thermo-majorization proves insuf-\nficient for characterizing state transformation rules compre-\nhensively. Instances exist where two states ρ and σ do not\nadhere to thermo-majorization, yet the transition from ρ to σ\nbecomes feasible with the presence of an auxiliary system χ,\nknown as catalyst which remains unaltered before and after\nthe state transitions [15].\nTherefore, when assessing the possibility of transforming ρ\ninto σ, consideration must be given to the existence of another\nworking body or other ancillary systems χ such that the com-\nposite system ρ ⊗χ can be transformed into σ ⊗χ. Thus, ma-\njorization should be exclusively applied to the total resources,\nencompassing all potential catalysts and working bodies of\narbitrary dimensions, rather than to the system of interest it-\nself. Criteria that investigate transitions between two states\nin the presence of catalysis are commonly termed as trump-\ning. In [9], it has been demonstrated that merely decreasing\nfree energy is insufficient to fully encapsulate state transfor-\nmation rules under thermal operations. Instead (for states di-\nagonal in the energy eigenbasis), the necessary and sufficient\nconditions for thermodynamic transitions are determined by\na family of second laws, which require verifying the increase\nof the generalized free energy, i.e., Fp(ρ,H) ≥Fp(σ,H) for\np ∈(−∞,∞). A formal definition of generalized free energy\narXiv:2502.20588v1  [quant-ph]  27 Feb 2025\n\n\n2\nFIG. 1. Checking a finite set of sufficient criteria whether there exist\na catalysis χ that can alleviate restrictions on apparently prohibited\ntransitions from state ρ to state σ having eigenvalues x and y respec-\ntively.\nand a comprehensive discussion on these conditions are pre-\nsented in Section IV.\nVerifying the existence of catalytic majorization or trump-\ning relationships requires evaluating an infinite number of\nconditions across the continuous spectrum of p values. De-\nspite having well-defined mathematical expressions for these\ncatalytic transformation conditions, checking an unbounded\nnumber of inequalities is computationally infeasible. A fun-\ndamental question is whether these infinite conditions can be\nreduced to a finite, tractable set of conditions that guarantee\ncatalytic majorization.\nPrior research has approached this problem from multiple\nangles. For probability distributions of pure states or d × d\nmixed states where d ≥4, Gour [16] established that a finite\nnumber of conditions cannot be sufficient to determine trans-\nformation feasibility. Existing characterizations of necessary\nand sufficient conditions, such as those developed by Klimesh\n[17], Turgut [18] and Aubrun and Nechita [19], all require\ninfinite checks and lack computational tractability. These lim-\nitations have directed research efforts toward approximate cat-\nalytic transformations [20, 21], with relatively little progress\non exact catalytic transformations.\nIn this work, we derive a finite set of sufficient conditions\nto determine whether state transformation is possible under a\ngiven free operation (as illustrated in Fig. 1). We first derive\nthis finite set of conditions which are sufficient for trumping\ntwo state vectors xAB and yAB shared between two spatially\nseparated parties under local operation and classical commu-\nnication (LOCC). Further, we also extend our analysis to the\nsecond law of thermodynamics and again explicitly derive a\nfinite set of sufficient conditions for trumping states that are\nblock diagonal in the energy eigenbasis via thermal opera-\ntions. Our analysis also applies to a broader class of gen-\neral states that are not necessarily block-diagonal in the en-\nergy eigenbasis. Finally, we introduce a simulation toolbox to\nfacilitate the practical application of our trumping criteria.\nII.\nMAJORIZATION AND CATALYTIC MAJORIZATION\nWe start by reviewing the conditions for transformation be-\ntween two general state vectors shared between two distant\nparties under LOCC (i.e. within the realm of entanglement\ntheory) and subsequently explore how these conditions are al-\ntered in the presence of catalysis.\nConsider a vector in the Hilbert space yAB ∈HAB(= HA ⊗\nHB) that represents some target state that two spatially sep-\narated parties, Alice and Bob, wish to share by acting on the\navailable state xAB ∈HAB using LOCC [22]. More formally,\nrecall that any such bipartite quantum state in the tensor prod-\nuct space HAB can be written in the Schmidt form [23]:\nxAB =\nn\n∑\ni=1\n√xiuiA ⊗viB\n(1)\nwhere {uiA}i ∈HA and {viB}i ∈HB are two sets of or-\nthonormal bases and |HAB| = |HA||HB| = n.\nThe vector\nx = (x1,...,xn) ∈Pn, with Pn = {(x1,...,xn) : x1 ≥x2 ≥\n...xn ≥0, ∑i x = 1}, is called the vector of Schmidt coeffi-\ncients. Abusing notation, we will sometimes denote the state\nby its vector of Schmidt coefficients.\nHere we restrict our attention to deterministic transforma-\ntions. In this case, it was shown by Nielsen [4] that given\nx,y ∈Pn, x can be transformed into y if and only if for all\ni ∈{1,...,n}\ni\n∑\nj=1\nxj ≤\ni\n∑\nj=1\nyj.\n(2)\nThis relation is known as majorization. Here we say that y\nmajorizes x or equivalently that x is majorized by y and we\ncompactly denote it by x ≺y. Majorization is a partial order,\ni.e. there exist vectors x,y for which neither x ≺y nor y ≺x.\nWe indicate that x is not majorized by y by x ⊀y.\nIn some cases, when x ⊀y, it is nevertheless possible to\nconvert xAB to yAB: surprisingly, there may exist a special vec-\ntor that acts as a catalyst, i.e. there exists a set of triples of\nstates with (x,y,z) such that y does not majorize x, but y ⊗z\nmajorizes x ⊗z. In other words, by using an auxiliary state\nzAB with vector z one enables the deterministic transforma-\ntion, and at the end of the latter zAB is recovered unscathed.\nThis relation is called catalytic majorization or trumping [5]\nand henceforth we shall denote it by x ≺T y.\nWe define by T(y) = {x ∈P<∞: x ≺T y} the set of vec-\ntors that are trumped by y, where P<∞= ∪∞\nn=1Pn. Note that\nif dim(x) ̸= dim(y), the definition of trumping and majoriza-\ntion can be extended to probability vectors where the shorter\nvector is padded with zeros.\n\n\n3\nThe first comprehensive set of conditions characterizing\nthe trumping relation was derived in 2007 independently by\nKlimesh and Turgut [17, 18] (see also [24] for a characteriza-\ntion of a generalized concept of majorization). Remarkably,\nalthough the catalyst may be of arbitrary dimension, these\nconditions are equivalent to all the following strict inequali-\nties being true [24]:\nx ∈T(y) ⇐⇒\n(\nHp(x) > Hp(y),\nfor p ∈R/{0}\nHburg(x) > Hburg(y)\n(3)\nwhere for p ̸= {0,1}:\nHp(x) := sign(p)\n1−p log\nn\n∑\ni=1\n(xi)p ,\n(4)\nfor p = 1:\nH1(x) := −\nn\n∑\ni=1\nxi logxi,\n(5)\nand\nHburg(x) := 1\nn\nn\n∑\ni=1\nlogxi .\n(6)\nNote that both Hp for p < 0 and Hburg evaluate to −∞if some\nof the elements of x are zero.\nThe closure of T(y) in the l1-norm was introduced in [19]\nas a proxy for the study of T(y) (see also [25]). It turns out\nthat by including the limit points of T(y), one can simplify the\nset of conditions for trumping from Eq. (3) at the expense of\nadding ‘non-physical’ catalysts:\nx ∈T(y) ⇐⇒Hp(x) > Hp(y), p ∈(1,∞).\n(7)\nT(y) can be interpreted as the set of vectors that are approxi-\nmately trumped by y. In the following, we rephrase the char-\nacterization of T(y) and T(y) in a more convenient form for\nthe purpose of this paper. Let x ∈Rn\n+ and p ∈R, with slight\nabuse of notation, we define\n∥x∥p :=\n \n1\nn\nn\n∑\ni=1\n(xi)p\n!1/p\n.\n(8)\nNote that ∥·∥p is only a norm (up to a factor n−1/p, the Schat-\nten p-norm) for p ≥1. We call the weight of a vector the\nnumber of non-zero entries. We set ∥x∥0 = (∏n\ni=1 xi)1/n and\nfor p < 0 and x with weight smaller than n, ∥x∥p = 0 such that\n∥·∥p is continuous. With this notation we can replace Eq. (3)\nand Eq. (7) with:\nx ∈T(y) ⇐⇒\n\n\n\n\n\n∥x∥p < ∥y∥p,\np ∈(1,∞)\n∥x∥p > ∥y∥p,\np ∈(−∞,1)\nH1(x) > H1(y),\n(9)\nand\nx ∈T(y) ⇐⇒\nn\n∥x∥p < ∥y∥p,\np ∈(1,∞).\n(10)\nIII.\nA FINITE SUFFICIENT SET OF CONDITIONS FOR\nTRUMPING OF STATE VECTORS\nDespite Eq. (9) (equivalently (3)) and Eq. (10) (equivalently\n(7)) respectively form a complete set of the necessary and suf-\nficient conditions for trumping and approximate trumping, the\nnumber of conditions to check remains infinite. Here, we aim\nto outline our primary mathematical findings that lead to a\nfinite set of conditions, which guarantee the trumping of bi-\npartite state vectors when the free operation is LOCC.\nFor the concrete case of four-dimensional vectors and two-\ndimensional catalysts, necessary and sufficient conditions are\nknown [26, 27]. The general problem of characterizing the\nexistence of a k dimensional catalyst for n dimensional vec-\ntors has been answered with algorithms that have running time\npolynomial in n and k [26, 28]. However, the algorithm only\nprovides an answer for a given value of k.\nSome general\nconditions necessary for trumping were investigated in [29].\nHere, we are interested in a different approach to the problem\nof catalytic majorization. Instead of bounding the dimension\nof the catalyst, we want to find a discrete set of inequalities\nthat implies the sets in Eqs. (3) and (7).\nPartial progress in this direction was made by Klemes [30]\nby considering a family of symmetric polynomials Fk,r : Rn 7→\nR indexed by k,r ∈N:\nFk,r(x) =\n∑\n(k1,...,kn) s.t.\n∑i ki=k,maxki≤r\nn\n∏\ni=1\n(xi)ki\nki! .\n(11)\nIntuitively, this can be thought of as a polynomial generated\nfrom a truncated exponential function. We define it formally\nin Definition 4 in Appendix A. Using this polynomial [30]\nshowed that there is a finite set of inequalities that in turn im-\nply the inequality of p norms for a continuous range of values\nof p. We state it as the following fact:\nFact 1 (Klemes). Let x,y ∈Rn\n+ and fix r ∈N. If\nFk,r(x) ≥Fk,r(y),\nk ∈{r,r +1,...,nr}\nThen\n∥x∥p ≥∥y∥p,\np ∈(0,1)\nand further if ∑n\ni=1 xi = ∑n\ni=1 yi then\n∥x∥p ≤∥y∥p\np ∈(1,r +1).\nNote, while the condition ∑n\ni=1 xi = ∑n\ni=1 yi may seem re-\nstrictive, it is trivially satisfied when considering physical sys-\ntems where xi,yi indicate the probability of finding the requi-\nsite system in state i.\nWe now introduce some notation before stating our main re-\nsult. Given x ∈Rn, we denote by xmin the minimum non-zero\nelement of x: xmin = min{xi,1 ≤i ≤n : xi > 0}. We denote\nby xp the point-wise exponentiation of the vector x. That is:\nxp = (xp\n1,...,xp\nn) where we follow the convention that 0p = 0\nfor p ∈R. Abusing notation, we denote x−1 = 1\nx. Finally, let\n\n\n4\nx ∈R, we denote the greatest integer smaller than or equal to\nx+1 by ¯x = ⌊x+1⌋.\nWe make use of Fact 1 to construct a finite set of sufficient\nconditions for checking whether an element belongs to the set\nT(y) (and also for T(y)) in Theorem 1. However, before pro-\nceeding we state the following corollaries and lemma derived\nfrom Fact 1 that will be pivotal in the proof of our main The-\norem 1. Fact 1 is a slight modification of the Fact 1 replacing\ninequalities with strict inequalities, and some basic properties\nof the function ∥·∥p.\nCorollary 1. Let n > 1, x,y ∈Pn and fix r ∈N. If\nFk,r(x) > Fk,r(y),\nk ∈{r,r +1,...,nr}\nThen\n∥x∥p > ∥y∥p,\np ∈(0,1)\nand\n∥x∥p < ∥y∥p,\np ∈(1,r +1).\nThe point-wise notation introduced in the previous section\nallows us to make a series of identities between different val-\nues of p. In particular, let x,y ∈Pn. We have that for p,m ∈R+\nand p,m ̸= 0:\n∥x∥pm =\n \n1\nn\nn\n∑\ni=1\n(xi)pm\n!1/(pm)\n= (∥xm∥p)1/m,\n(12)\nand if x has weight n\n∥x∥p =\n1\n\u0000 1\nn ∑n\ni=1(xi)p\u0001−1/p\n=\n1\n∥1\nx∥−p\n.\n(13)\nFrom Eq. (12) and Eq. (13) it follows:\n∥x∥pm > ∥y∥pm ⇐⇒∥xm∥p > ∥ym∥p\n(14)\nand if x,y have both weight n\n∥x∥p > ∥y∥p ⇐⇒\n\r\r\r\r\n1\nx\n\r\r\r\r\n−p\n<\n\r\r\r\r\n1\ny\n\r\r\r\r\n−p\n.\n(15)\nMitra and Ok [31] observed that in order to compare in-\nequalities between p-norms in the range (1,∞) it is enough to\ncheck the range (1,r) where r depends only on the ratio of\nx1/y1 and the dimension of the vectors. The following lemma\nis a slight generalization of the statement in [31]:\nLemma 1. Let n > 1, x,y ∈Rn\n+, y1 > x1 > 0 and let\nr =\nlogn\nlogy1 −logx1\nThen, ∥x∥p < ∥y∥p for ∀p > r.\nProof. Consider the following chain of inequalities:\n∥x∥p\np ≤(x1)p\n≤1\nn(y1)p\n≤1\nn\nn\n∑\ni=1\n(yi)p\n= ∥y∥p\np.\n(16)\nThe first inequality holds by our modified definition of ℓp\nnorm in Equation 8 and the third inequality holds as all the\ncomponents of vector y are non-negative. In addition, the first\nand third inequality hold independently of the value of p. We\nrewrite the second inequality as:\n\u0012y1\nx1\n\u0013p\n> n.\n(17)\nThus, the second inequality holds if p > logn/log(y1/x1).\nA similar statement holds for the negative range of p and is\nas follows:\nCorollary 2. Let n > 1, x,y ∈Rn\n+ with xmin > ymin > 0 and\nlet\ns =\nlogn\nlogxmin −logymin\nThen, ∥x∥p > ∥y∥p for p < −s.\nProof. Consider the vectors 1/x and 1/y. We have (1/x)1 =\n1/xmin, (1/y)1 = 1/ymin and, as a consequence, (1/y)1 >\n(1/x)1 > 0. From Lemma 1, we have that for p > s:\n\r\r\r\r\n1\nx\n\r\r\r\r\np\n<\n\r\r\r\r\n1\ny\n\r\r\r\r\np\n.\nFinally, from (13), we have that\n\r\r\r\r\n1\nx\n\r\r\r\r\np\n<\n\r\r\r\r\n1\ny\n\r\r\r\r\np\n⇐⇒∥x∥−p > ∥y∥−p\nUsing the above results, we are ready to state and prove our\nmain result as Theorem 1:\nTheorem 1. Let n > 1, x,y ∈Pn, x have weight n and choose\nr =\nlogn\nlogy1 −logx1\nand ¯r := ⌊r +1⌋.\nIf r > 0 and\nFk,¯r(x) > Fk,¯r(y),\nk ∈{¯r, ¯r +1,...,n¯r},\nthen x ∈T(y).\nIf additionally\nH1(x) > H1(y)\nand either\n\n\n5\n1. the weight of y is smaller than n, or,\n2. the weight of y is n, s > 0 with\ns =\nlogn\nlogxmin −logymin\nand ¯s := ⌊s+1⌋\nand\nFk,1\n\u0012 1\nx¯s\n\u0013\n< Fk,1\n\u0012 1\ny¯s\n\u0013\n,\nk ∈{1,2,...,n} ,\nthen x ∈T(y).\nProof. Consider the first implication, that is that x ∈T(y) or\nequivalently from (10) that ∥x∥p < ∥y∥p for p ∈(1,∞). By\nhypothesis, the following condition holds:\nFk,¯r(x) > Fk,¯r(y)\nk ∈{¯r, ¯r +1,...,n¯r}.\n(18)\nThen, by Corollary 1 we have that ∥x∥p < ∥y∥p in the range\np ∈(1, ¯r). Moreover, since r > 0, by Lemma 1 we conclude\nthat ∥x∥p < ∥y∥p also in the range p ∈(r,∞).\nLet us now investigate the second implication. To verify\nthat x is in T(y), it needs to hold additionally that H1(x) >\nH1(y) and that ∥x∥p > ∥y∥p for p ∈(−∞,1)/{0} (see (9)).\nThe first condition holds by hypothesis, let us verify the sec-\nond one.\nFrom (18) we have that ∥x∥p > ∥y∥p in the range (0,1). It\nremains to check the range (−∞,0). We divide the range into\ntwo partially overlapping ranges: (−∞,−s) and (−¯s,0).\nSince s > 0, we have by Corollary 2 that: ∥x∥p > ∥y∥p for\np < −s.\nTo check the range (−¯s,0), we have by assumption that:\nFk,1\n\u0012 1\nx¯s\n\u0013\n< Fk,1\n\u0012 1\ny¯s\n\u0013\nk ∈{1,2,...,n},\n(19)\nwhich implies from Corollary 1 that\n\r\r\r\r\n1\nx¯s\n\r\r\r\r\nt\n<\n\r\r\r\r\n1\ny¯s\n\r\r\r\r\nt\nt ∈(0,1)\n(20)\nWe conclude by showing the equivalence between (20) and\nthe desired inequality in the range (−¯s,0):\n\r\r\r\r\n1\nx¯s\n\r\r\r\r\nt\n<\n\r\r\r\r\n1\ny¯s\n\r\r\r\r\nt\nt ∈(0,1)\n⇐⇒\n\r\r\r\r\n1\nx\n\r\r\r\r\nt ¯s\n<\n\r\r\r\r\n1\ny\n\r\r\r\r\nt ¯s\nt ∈(0,1)\n⇐⇒\n\r\r\r\r\n1\nx\n\r\r\r\r\np\n<\n\r\r\r\r\n1\ny\n\r\r\r\r\np\np ∈(0, ¯s)\n⇐⇒∥x∥p > ∥y∥p\np ∈(−¯s,0)\n(21)\nThus, Theorem 1 demonstrates a finite set of inequalities\nthat imply the trumping relation for transforming a general\nstate vector x to y when the allowed free operations are LOCC.\nIV.\nA FINITE SUFFICIENT SET OF CONDITIONS FOR\nTRUMPING IN SECOND LAW OF THERMODYNAMICS\nIn the previous section, we have established a finite set of\nsufficient conditions to verify catalytic majorization between\nstate vectors. We now extend our analysis to the domain of\nquantum thermodynamics, in particular, the so-called second\nlaws [9].\nTo begin, we define the generalized Rényi divergence, gen-\neralized free energy, and introduce an embedding map, high-\nlighting its key properties that are pertinent for our analysis in\nthis section.\nDefinition 1. The generalized Rényi divergence of order p\n(for all p ∈R) between any two states ρ and σ, such that\nsupp(ρ) ⊆supp(σ), is defined as:\nDp(ρ||σ) := sign(p)\np−1 logTr\n\u0002\nρ pσ1−p\u0003\nwhere for the limiting cases\np = 1: D1(ρ||σ) := Tr[ρ logρ −ρ logσ] is the quan-\ntum Kullback-Liebler divergence also known as the von\nNeumann relative entropy; and\np = ∞: D∞(ρ||σ) := Dmax(ρ||σ) := inf{λ : ρ ≤2λσ}\nis known as the max-Rényi divergence.\nDefinition 2. Let d > 0, v ∈Nd with vi > 0 and ∑d\ni=1 vi =\nN; the embedding map, denoted by E : Pd →PN, (N ≥d) is\ndefined as:\nE (q) :=\n\n\n\n\n\n\n\nq1\nν1\n,..., q1\nν1\n|\n{z\n}\nν1\n, q2\nν2\n,..., q2\nν2\n|\n{z\n}\nν2\n,..., qd\nνd\n,..., qd\nνd\n|\n{z\n}\nνd\n\n\n\n\n\n\n\n.\n(22)\nThe embedding map E is also a valid classical channel (a\nstochastic matrix) and possesses the following properties:\n1. E maps the probability distribution g := { νi\nN , ν2\nN ,..., νd\nN }\nto the uniform distribution on support size N, that is:\nE (g) =\n\u001a 1\nN , 1\nN ,..., 1\nN\n\u001b\n|\n{z\n}\nN\n:= uN .\n(23)\n2. It preserves equality of the p-Rényi divergence between\nany probability distribution (q) and g which becomes:\nDp(q||g) = Dp(E (q)||E (g)) = Dp(E (q)||uN) .\n(24)\nAnother important quantity that will be extensively used in our\nsubsequent analysis is the generalized free energy, defined as\nfollows:\nDefinition 3. [9] The generalized free energy of order p of a\nsystem with Hamiltonian H of a state ρ, is defined as\nFp(ρ,H) := kT[Dp(ρ||ρg)−logZ] = F(ρg,H)+kTDp(ρ||ρg)\nwhere ρg :=\ne−βH\nTr(e−βH) is known as the thermal state associated\nwith the system Hamiltonian H and β = 1/T is the inverse\ntemperature of the surrounding bath.\n\n\n6\nA.\nFor states diagonal in energy eigenbasis\nHere we consider a thermal system evolving according to\nthe Hamiltonian H. We examine two states, ρ and σ, which\nare simultaneously diagonal in the energy eigenbasis with qρ\nand qσ as their respective vector of eigenvalues arranged in\ndescending order of magnitude. Our goal is to provide a finite\nset of sufficient conditions for transforming ρ to σ using a\ncatalyst. We shall use the nomenclature thermo-majorization\nas an equivalence to the second law of thermodynamics.\nIt was shown in [9, Theorem 18] that the necessary and\nsufficient conditions for catalytic thermo-majorization are ob-\ntained by comparing the generalized free energies of order p\nof ρ and σ for infinite values of p. In particular, if Fp(ρ,H) >\nFp(σ,H) for all p ∈(−∞,∞), catalytic thermo-majorization\nis possible. This is equivalent (from Definition 3) to checking\nDp(ρ||ρg) > Dp(σ||ρg) for all p ∈(−∞,∞).\nA technical hurdle in this endeavor is to address the case\nwhere the vector of eigenvalues of the thermal state ρg−de-\nnoted as g−contains irrational entries. We will first consider\nin Corollary 3 a g that contains only rational entries before\nconsidering a general g in Theorem 2.\nCorollary 3. The following set of finite conditions are suffi-\ncient to transform a state ρ with the vector of eigenvalues de-\nnoted by qρ and is block diagonal in the energy eigenbasis into\nanother block diagonal state σ with the vector of eigenvalues\ndenoted by qσ using catalytic thermal operations, given that\nthe vector of eigenvalues of the thermal state ρg, denoted by\ng, contain all the rational entries:\n1. Fk,¯r(x) < Fk,¯r(y),\nk ∈{¯r, ¯r +1,...,N¯r},\n2. H1(x) < H1(y), and either,\n3. the weight of y is smaller than n, or,\nthe weight of y is n, and Fk,1\n\u0000 1\nx¯s\n\u0001\n> Fk,1\n\u0010\n1\ny¯s\n\u0011\n,\nk ∈\n{1,2,...,n},\nwhere x and y are the probability vectors obtained from\nE (qρ) and E (qσ) and the parameters r and s are chosen to\nbe:\nr :=\nlogN\nlogx1 −logy1\ns :=\nlogN\nlogymin −logxmin\n.\nProof. This corollary follows directly from Theorem 1. For\np ∈(1, ¯r) and p ∈(¯r,∞) (from Corollary 1 and Lemma 1 re-\nspectively) we get (by interchanging the roles of x and y):\n∥x∥p > ∥y∥p and thus Hp(x) < Hp(y).\n(25)\nNow,\nDp(ρ||ρg) a= Dp(qρ||g) b= Dp(E (qρ)||E (g)) = Dp(x||uN)\nc= logN −Hp(x)\nd> logN −Hp(y)\ne= Dp(y||uN) = Dp(E (qσ)||E (g))\nf= Dp(qσ||g)\ng= Dp(σ||ρg).\nHere (a) and (g) hold since qρ,qσ,g are the vector of eigen-\nvalues of ρ,σ,ρg respectively and in (b) and (f), we use the\nproperties of the embedding map 24, in (c) and (e) we use\nthe relation between Dp(.||uN) and Hp(.), and in (d) we use\nEq. 25.\nFurther, conditions (2) and (3) which are the extension to\nother values of p (i.e., p = 1, p ∈(0,1), p ∈(−¯s,0), and\np ∈(−∞,−¯s)) is a direct consequence, leveraging Corol-\nlary 1, Corollary 2, and thus fulfilling the conditions of The-\norem 1 (albeit in a reverse direction to ensure the relative\nRényi entropy aligns with the desired direction for thermo-\nmajorization). Thus, ρ can undergo transformation to σ via\nthermal operation if the conditions outlined in Corollary 3 are\nmet.\nNow, we consider the case where the vector g (vector of\neigenvalues of the thermal state of the underlying system) has\nirrational entries. For this we first approximate g by a vector\ngε that is arranged in descending order of coordinates and is\nclose to g in ℓ1 norm. This is stated as the following fact:\nFact 2. [9, Lemma 15] Let g = {gi}d\ni=1 be a probability distri-\nbution of support size d, in descending order, and containing\nirrational entries. Then for any ε > 0, there exists a probabil-\nity distribution gε such that:\n1. ∥g−gε∥1≤ε ;\n2. Each entry of gε is a rational number, that is there exists\na set of natural numbers {νi}d\ni=1 such that gε = { νi\nN }d\ni=1,\nwith\nd\nΣ\ni=1νi = N; and\n3. There exists a valid classical channel N\nsuch that\nN (g) = gε and for any other distribution x, ∥x −\nN (x)∥1 ≤O(√ε) .\nWe give a simple proof of the statement 1 of the above\nFact 2, directly useful for our purpose in Proposition 1 in\nthe Appendix. Subsequently, given any fixed ε, the approx-\nimation parameter, we define a density matrix ρgε diagonal in\nthe same basis as ρg, with the vector of eigenvalues given by\ngε. This is now a rational approximation of the actual thermal\nstate and will be used to show catalytic majorization. This\napproximation parameter, will influence the number of con-\nditions (comparisons of the Rényi p-entropies) to be checked\nfor catalytic majorization. The formal catalytic majorization\ntheorem for a general thermal state is as follows:\nTheorem 2. Let ε > 0 be given and ρgε be a density matrix\nwith rational entries that commutes with the thermal state ρg\nand satisfies ∥ρg −ρgε∥1 ≤ε. The following set of finite con-\nditions are sufficient to transform a state ρ block diagonal in\nthe energy eigenbasis into another block diagonal state σ us-\ning catalytic thermal operations:\n1. Fk,¯r(x) < Fk,¯r(y)\nAr(ε) ,\nk ∈{¯r +1, ¯r +2,...,N¯r}\n2. H1(x) < H1(y)−2log\n\u0010\n1+\nε\ngmin\n\u0011\n, and either,\n\n\n7\n3. the weight of y is smaller than n, or,\nthe\nweight\nof\ny\nis\nn,\nand\nFk,1\n\u0000 1\nx¯s\n\u0001\n/As(ε) >\nFk,1\n\u0010\n1\ny¯s\n\u0011\n, k ∈{1,2,...,n}.\nHere x and y are the probability vectors obtained from\nE (qρ) and E (qσ), where qρ,qσ are the eigenvectors of ρ,σ\nrespectively. Ar(ε) and As(ε) are some positive real-valued\nfunctions, gmin := min\ni gi, and ∥g−gε∥≤ε, for any arbitrary\nε > 0 with gε being a vector with rational entries, and E is\ndefined in Eq. 22. The functions Ar(ε) and As(ε) are such that\n1\nAr(ε) = max\n(\n2\n\u0014\n−1\nN\n\u001a\u0010\n1+\nε\ngmin\n\u00112¯r\u001b\u0015\n,2−\n2ε\nNgmin\n)\n,\n1\nAs(ε) = 2\n−1\nN\n\u001a\u0010\n1+\nε\ngmin\n\u00112(1+¯s)\n−1\n\u001b\n,\nand the parameters r and s are chosen as:\nr :=\nlogN\nlogx1 −log\n\u001a\ny1\n\u0010\n1+\nε\ngmin\n\u00112\u001b,\ns :=\nlogN\nlogymin −log\n\u001a\nxmin\n\u0010\n1+\nε\ngmin\n\u00112\u001b.\nProof. We prove that the conditions stated in the theorem im-\nply Dp(ρ||ρg) > Dp(σ||ρg) for p ∈R in a piece-wise fash-\nion. First note that for any given ε > 0, the existence of ρgε\nis shown by Fact 2. This approximation calls for an addi-\ntional analysis to relate Dp(ρ||ρg) with Dp(ρ||ρgε) by prov-\ning a continuity argument in Proposition 2. We now indicate\nthe lemmas and main ideas for each regime, by taking into\naccount this approximation, essentially leading to Ar(ε) and\nAs(ε) in the following analysis:\nFor p = 1, the proof is provided in Lemma 2.\nFor the regime 1 < p < ¯r, a detailed proof is presented in\nAppendix-A 3. Here, we provide a brief outline for complete-\nness. For a sufficiently small positive real-valued function\nA1(ε) we have:\nFk,¯r(x) < Fk,¯r(y)\nA1(ε)\nfor k ∈{¯r, ¯r +1,...,N¯r}\na⇒f¯r(x,t) < f¯r(y,t)\nA1(ε)\nb⇒∥x∥p > ∥y∥p\n\u0012\n1+\nε\ngmin\n\u00132\nc⇒Hp(x) < Hp(y)−2p\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\nd⇒Dp(ρ||ρg) > Dp(σ||ρg).\nwhere (a), (b), (c), and (d) follows from a series of Lemmas\n(Lemma 4, 5, 6, and Lemma 7 and 8 respectively) with\n1\nA1(ε) ≤\n2\n\u0014\n−1\nN\n\u001a\u0010\n1+\nε\ngmin\n\u00112¯r\u001b\u0015\n.\nFor the range p ∈(0,1), a similar proof is outlined in\nAppendix-A 4, utilizing a different set of lemmas, specifically\nLemmas 9, 10, 11, and 12 and considering\n1\nA2(ε) ≤2−\n2ε\nNgmin .\nSince condition 1 is a consequence of the range, p ∈\n(1, ¯r) and p ∈(0,1),\n1\nAr(ε) can be chosen to be as small as\nmax\nn\n1\nA1(ε),\n1\nA2(ε)\no\n.\nWe now consider the regime p ∈(−¯s,0). In this range, we\nhave\nFk,1\n\u0012 1\nx¯s\n\u0013\n/As(ε) > Fk,1\n\u0012 1\ny¯s\n\u0013\n,\nfor k ∈{1,2,...,N}\na⇒f1\n\u0012 1\ny¯s ,t\n\u0013\n< f1\n\u0000 1\nx¯s ,t\n\u0001\nAs(ε) ,\nb⇒\n\r\r\r\r\n1\nx¯s\n\r\r\r\r\nξ\n>\n\r\r\r\r\n1\ny¯s\n\r\r\r\r\nξ\n\u0012\n1+\nε\ngmin\n\u00132 1+ξ ¯s\nξ\n, for any ξ ∈(0,1)\nc⇒∥x∥p < ∥y∥p\n\u0012\n1+\nε\ngmin\n\u00132 1−p\np\nd⇒Hp(x) < Hp(y)−2log\n\u0012\n1+\nε\ngmin\n\u0013\ne⇒Dp(ρ||ρg) > Dp(σ||ρg) .\nHere\n(a)\nFollows\nfrom\nLemma\n13\nwith\nAs(ε) ≥\n2\n1\nN\n\u001a\u0010\n1+\nε\ngmin\n\u00112(1+¯s)\n−1\n\u001b\n,\n(b) follows from Lemma 14,\n(c)\nfollows from Lemma 15, (d) follows from Lemma 16, and (e)\nLemma 17 and Lemma 18.\nNote that the direction of inequality (b) is the reverse of that\nappearing in trumping without the thermal operations. This\nis because in order to prove thermo-majorization one needs\nto use the relation between ∥x∥p,Hp(x) and Dp(ρ||ρg), the\ndefinition of the extension map E , and Eq. 24.\nFinally, for the regime p > r and p < −¯s, the proof is pro-\nvided in Lemma 19.\nThis completes the proof.\nB.\nFor states having coherence\nIn the previous subsection, we describe a set of sufficient\nconditions for the catalytic transformation of states that are\ndiagonal in the energy eigenbasis. However, in general the\nstates under consideration may contain coherence, i.e. off-\ndiagonal elements in the energy eigenbasis of the Hamilto-\nnian. We point to [32] for a review on the resource theory of\ncoherence and definitions of transformations.\nBu et. al [33] derived the necessary and sufficient con-\nditions for catalytic transformations under incoherent opera-\ntions with pure catalysts. More succinctly, for any two in-\ncomparable pure states |ψ⟩, |φ⟩∈Hd, the necessary and suf-\nficient condition for the existence of a catalyst |χ⟩such that\n|ψ⟩⊗|χ⟩→|φ⟩⊗|χ⟩under incoherent operation is\nHp(ψ) > Hp(φ) ∀p ∈(−∞,∞)/0\nand, Tr(log[ψ]) > Tr(log[φ])\n(26)\n\n\n8\nwhere Hp is the Renyi entropy defined earlier and ψ (re-\nspectively φ) represent the states after removing all off-\ndiagonal coefficients in the relevant basis [13], i.e.\nψ =\n∑i ⟨i|ψ⟩⟨ψ |i⟩|i⟩⟨i| (resp. φ = ∑i ⟨i|φ⟩⟨φ |i⟩|i⟩⟨i|).\nThe above conditions are equivalent to the conditions de-\nrived in section III and hence we can get the following corol-\nlary.\nCorollary 4. The following set of finite conditions are suffi-\ncient to transform a pure state |ψ⟩into another pure state |φ⟩\nusing a pure catalyst and incoherent operations:\n1. Fk,¯r(x) > Fk,¯r(y),\nk ∈{¯r, ¯r +1,...,n¯r}\n2. Additionally H1(x) > H1(y) and either\n3. (a) the weight of y is smaller than n, or,\n(b) the weight of y is n, with\nFk,1\n\u0012 1\nx¯s\n\u0013\n< Fk,1\n\u0012 1\ny¯s\n\u0013\n,\nk ∈{1,2,...,n}\nwhere x and y are the eigenvalues of ψ and φ respec-\ntively and r and s are real positive number as defined in\nTheorem 1.\nThe proof of the above result can be argued analogously\nfrom Theorem 1 where x and y are the eigenvalues of ψ and\nφ respectively. Determining a finite set of sufficient condi-\ntions for general (mixed) states and mixed catalysis remains\nan open challenge. Nevertheless, for such general scenario,\na finite set of necessary conditions can be derived as outlined\nin Appendix-B. If any of these conditions are not satisfied, it\nindicates that catalysis is not possible, however the converse\nis not true.\nV.\nEXAMPLES\nWe now provide some examples of trumping guaranteed by\nthe sets of sufficient conditions derived in the previous sec-\ntions.\nTrumping bipartite state vectors under LOCC. First, we\npresent examples of two state vectors xAB and yAB, shared be-\ntween two spatially-separated parties, Alice and Bob. These\nstate vectors are not interconvertible using LOCC since x ⊀y\nwhere x and y represent their respective vectors of Schmidt\ncoefficient. However, conversion from xAB to yAB becomes\nfeasible when catalysis is allowed.\nConsider the vectors, x = (0.6100,0.3045,0.0435,0.0420)\nand y = (0.7315,0.1211,0.1374,0.0100).\nHere x ⊀y.\nOne can also easily reconcile this with the necessary and\nsufficient conditions mentioned in [27] which only resolve\nthe question when the catalyst is 2-dimensional. However,\nour findings (presented in Theorem 1), confirms the existence\nof a catalyst indicating that trumping is indeed possible (for\nexplicitly checking the conditions see [34]). In fact, a suitable\ncatalyst for this example can be found in dimension four,\nc = (0.48,0.24,0.16,0.12) implying x⊗c ≺y⊗c.\nTrumping states diagonal in the energy eigenbasis under\nthermal operation. We now present an example from ther-\nmodynamics where two states, initially not interconvertible\nunder thermal operations, the states do not meet thermo-\nmajorization conditions, become interconvertible when catal-\nysis is allowed.\nConsider two states ρ and σ having vector of eigenvalues\nqρ = (0.936918,0.0467542,0.0159775,0.000350242), qσ =\n(0.862942,0.129846,0.00558697,0.00162474) respectively.\nHere qσ ⊀qρ under thermal operations, where the ther-\nmal state g is defined as g = 1\nZ (e−βE0,e−βE1,e−βE2,e−βE3)\nwith Z = e−βE0 + e−βE1 + e−βE2 + e−βE3, β = 1.2 and E0 =\n0,E1 = 1,E2 = 2,E3 = 3. Although qσ and qρ are not in-\nterconvertible under thermal operations, they satisfy the con-\nditions from Theorem 2 when choosing ρε as the maxi-\nmally mixed state.\nIn fact, in the presence of a catalyst\nc = (0.48,0.24,0.16,0.12), qρ thermo-majorizes qσ.\nTrumping general states having coherence.\nFor states\nhaving coherence, consider |ψ⟩=\n√\n0.4|0⟩+\n√\n0.4|1⟩+\n√\n0.1|2⟩+\n√\n0.1|3⟩and |φ⟩=\n√\n0.5|0⟩+\n√\n0.25|1⟩+\n√\n0.25|2⟩\nas presented in [33]. Although the vector of eigenvalues of\n|ψ⟩and |φ⟩do not majorize each other initially, the trans-\nformation becomes feasible in the presence of the catalyst,\n|χ⟩=\n√\n0.6|0⟩+\n√\n0.4|1⟩. This transformation is also assured\nby the finite set of sufficient conditions presented in Corol-\nlary 4.\nThe open source software for this numerical exploration can\nbe found in the public repository [34].\nVI.\nDISCUSSION\nIn this work, we derive a finite set of inequalities that imply\ntrumping. Specifically, we establish a finite set of conditions\nfor trumping of state vectors under LOCC and general state\ntransformation under thermal operations. Our results are also\napplicable to other restricted subsets of thermal operations\nknown as elementary thermal operations and Markovian\nthermal operations, as the hierarchy of all such thermal\nprocesses collapses when catalysis is taken into consideration\n[35]. Moreover, the analysis presented here is general and we\nbelieve that can be non-trivially extended to other concepts,\nsuch as Matrix-majorization [36]. Our derivation builds on a\nset of inequalities relating ℓp norms to a specific polynomial,\nas done in [30]. We note that, the set of inequalities in [37]\nmight be amenable to a similar result. The latter have a spe-\ncial significance in quantum information theory [38], as many\nof the basic entropic quantities have a much more elegant\nrepresentation when defined over symmetric polynomials.\nIt is interesting to compare the sufficient conditions derived\nhere with other known conditions for the existence of cata-\nlyst under certain restrictions on the dimension of the latter.\nOne such condition is given in [27]. There, the authors de-\nrive necessary and sufficient conditions for the 4-dimensional\nvectors to admit a 2-dimensional catalyst. It turns out that\nthe set of conditions derived in our work (which works for\nvectors and catalysts of an arbitrary dimension) is incom-\n\n\n9\nparable to their condition.\nFor instance, the example of a\npair of 4-dimensional vectors presented previously satisfies\nour computable criterion, but fails to satisfy the conditions\nof [27] thus implying that the catalyst needs to be at least 3-\ndimensional. On the other hand, we present the following\ntwo vectors which satisfy the criterion of [27] and thus ad-\nmit a 2-dimensional catalyst, but in the same time do not sat-\nisfy our criterion: x = (0.46519,0.27313,0.20361,0.057807),\ny = (0.46843,0.2693,0.20646,0.05581).\nIt is important to note that the conditions do not shed light\non how to find the catalyst. In particular, we do not relate\nmeeting the conditions with a bound on the catalyst dimen-\nsion. Unfortunately, recent work hints at the computational\nuntractability of this problem [39].\nACKNOWLEDGMENTS\nThe authors thank Nelly Ng for useful discussions with an\nearlier version of this project. A.N. thanks Vjosa Blakaj for\ndiscussion of her work on level sets of entropy.\nS.S. was supported by the Royal Society University Re-\nsearch Fellowship. A.N. acknowledges support from MEXT\nQuantum Leap Flagship Program (MEXT QLEAP) Grant No.\nJPMXS0120319794 and ERC Grant Agreement No. 948139.\nA.N. also acknowledges support by the European Research\nCouncil (ERC Grant Agreement No. 948139) and the Ex-\ncellence Cluster - Matter and Light for Quantum Computing\n(ML4Q).\nThe authors declare no competing interests.\n[1] A. W. Marshall, I. Olkin, and B. C. Arnold, Inequalities: theory\nof majorization and its applications, Vol. 143 (Springer, 1979).\n[2] J. Mairal, Incremental majorization-minimization optimization\nwith application to large-scale machine learning, SIAM Journal\non Optimization 25, 829 (2015).\n[3] Y. Sun, P. Babu, and D. P. Palomar, Majorization-minimization\nalgorithms in signal processing, communications, and ma-\nchine learning, IEEE Transactions on Signal Processing 65, 794\n(2016).\n[4] M. A. Nielsen, Conditions for a class of entanglement transfor-\nmations, Physical Review Letters 83, 436 (1999).\n[5] D. Jonathan and M. B. Plenio, Entanglement-assisted local ma-\nnipulation of pure quantum states, Physical Review Letters 83,\n3566 (1999).\n[6] R. Pereira and S. Plosker, Extending a characterization of ma-\njorization to infinite dimensions, Linear Algebra and its Appli-\ncations 468, 80 (2015).\n[7] D. W. Kribs, R. Pereira, and S. Plosker, Trumping and power\nmajorization, Linear and Multilinear Algebra 61, 1455 (2013).\n[8] R. Pereira and S. Plosker, Dirichlet polynomials, majorization,\nand trumping, Journal of Physics A: Mathematical and Theo-\nretical 46, 225302 (2013).\n[9] F. Brandao, M. Horodecki, N. Ng, J. Oppenheim, and\nS. Wehner, The second laws of quantum thermodynamics,\nProceedings of the National Academy of Sciences 112, 3275\n(2015).\n[10] M. Horodecki and J. Oppenheim, Fundamental limitations for\nquantum and nanoscale thermodynamics, Nature Communica-\ntions 4, 10.1038/ncomms3059 (2013).\n[11] G. Gour, D. Jennings, F. Buscemi, R. Duan, and I. Marvian,\nQuantum majorization and a complete set of entropic condi-\ntions for quantum thermodynamics, Nature Communications 9,\n10.1038/s41467-018-06261-7 (2018).\n[12] T. Fritz, Resource convertibility and ordered commutative\nmonoids, Mathematical Structures in Computer Science 27, 850\n(2017).\n[13] C. Datta, T. V. Kondra, M. Miller, and A. Streltsov, Cataly-\nsis of entanglement and other quantum resources, Reports on\nProgress in Physics 86, 116002 (2023).\n[14] P. Lipka-Bartosik, H. Wilming, and N. H. Y. Ng, Catalysis in\nquantum information theory (2023), arXiv:2306.00798 [quant-\nph].\n[15] M. Lostaglio, An introductory review of the resource theory ap-\nproach to thermodynamics, Reports on Progress in Physics 82,\n114001 (2019).\n[16] G. Gour, Infinite number of conditions for local mixed-state ma-\nnipulations, Phys. Rev. A 72, 022323 (2005).\n[17] M. Klimesh, Inequalities that collectively completely char-\nacterize the catalytic majorization relation, arXiv preprint\narXiv:0709.3680 (2007).\n[18] S. Turgut, Catalytic transformations for bipartite pure states,\nJournal of Physics A: Mathematical and Theoretical 40, 12185\n(2007).\n[19] G. Aubrun and I. Nechita, Catalytic majorization and lp norms,\nCommunications in Mathematical Physics 278, 133 (2008).\n[20] C. Datta, T. V. Kondra, M. Miller, and A. Streltsov, Entangle-\nment catalysis for quantum states and noisy channels, Quantum\n8, 1290 (2024).\n[21] H. Wilming, Entropy and reversible catalysis, Phys. Rev. Lett.\n127, 260402 (2021).\n[22] C. H. Bennett, H. J. Bernstein, S. Popescu, and B. Schumacher,\nConcentrating partial entanglement by local operations, Physi-\ncal Review A 53, 2046 (1996).\n[23] A. Peres, Quantum theory: concepts and methods, Vol. 57\n(Springer Science & Business Media, 2006).\n[24] M. P. Müller and M. Pastena, A generalization of majorization\nthat characterizes shannon entropy, IEEE Transactions on In-\nformation Theory 62, 1711 (2016).\n[25] G. Aubrun and I. Nechita, Stochastic domination for iter-\nated convolutions and catalytic majorization, Annales de l’IHP\nProbabilités et statistiques 45, 611 (2009).\n[26] X. Sun, R. Duan, and M. Ying, The existence of quantum en-\ntanglement catalysts, IEEE transactions on information theory\n51, 75 (2005).\n[27] G. M. Bosyk, H. Freytes, G. Bellomo, and G. Sergioli, The lat-\ntice of trumping majorization for 4d probability vectors and 2d\ncatalysts, Scientific reports 8, 3671 (2018).\n[28] S.\nBandyopadhyay\nand\nV.\nRoychowdhury,\nEfficient\nentanglement-assisted\ntransformation\nfor\nbipartite\npure\nstates, Physical Review A 65, 042306 (2002).\n[29] Y. R. Sanders and G. Gour, Necessary conditions for entangle-\nment catalysts, Physical Review A 79, 054302 (2009).\n[30] I. Klemes, Symmetric polynomials and lp inequalities for cer-\ntain intervals of p, Houston Journal of Mathematics 37, 285\n(2011).\n[31] T.\nMitra\nand\nE.\nOk,\nMajorization\nby\nLp-norms,\nPreprint,\navailable\nat\nhttps://sites.google.com/a/nyu.edu/efeok/papers/Major.pdf\n\n\n10\n(2001).\n[32] A. Streltsov, G. Adesso, and M. B. Plenio, Colloquium: Quan-\ntum coherence as a resource, Rev. Mod. Phys. 89, 041003\n(2017).\n[33] K. Bu, U. Singh, and J. Wu, Catalytic coherence transforma-\ntions, Phys. Rev. A 93, 042326 (2016).\n[34] A. Nema, A. G. Maity, S. Strelchuk, and D. Elkouss,\nTrumping-conditions, https://github.com/AnandaMaity/\nTrumping-conditions/settings/access?guidance_\ntask= (2024).\n[35] J. Son and N. H. Y. Ng, A hierarchy of thermal processes col-\nlapses under catalysis (2023), arXiv:2303.13020 [quant-ph].\n[36] M. U. Farooq, T. Fritz, E. Haapasalo, and M. Tomamichel, Ma-\ntrix majorization in large samples, IEEE Transactions on Infor-\nmation Theory , 1 (2024).\n[37] I. Klemes, More symmetric polynomials related to p-norms,\nHouston Journal of Mathematics 41, 815 (2015).\n[38] R. Jozsa and G. Mitchison, Symmetric polynomials in informa-\ntion theory: Entropy and subentropy, Journal of Mathematical\nPhysics 56, 062201 (2015).\n[39] V. Blakaj and C. Manai, Transcendental properties of entropy-\nconstrained sets: Part ii (2023), arXiv:2302.09645 [math-ph].\n[40] T. M. Cover and J. A. Thomas, Elements of Information The-\nory (Wiley Series in Telecommunications and Signal Process-\ning) (Wiley-Interscience, USA, 2006).\n[41] M. Lostaglio, D. Jennings, and T. Rudolph, Description\nof quantum coherence in thermodynamic processes requires\nconstraints beyond free energy, Nature Communications 6,\n10.1038/ncomms7383 (2015).\n[42] I. Marvian and R. W. Spekkens, Extending noether’s theorem\nby quantifying the asymmetry of quantum states, Nature Com-\nmunications 5, 10.1038/ncomms4821 (2014).\nAppendix A: Proof of Theorem 2: Trumping for thermal processes with thermal states having irrational entries\n1.\nPreliminary results\nWe first introduce the essential ingredients that serve as the foundation for proving the theorem.\nFact 3. [40, Theorem 2.7.1] Consider two sets of positive real numbers {ai}N\ni=1 and {bi}N\ni=1. The following ineqaulity holds:\nN\n∑\ni=1\nai log\n\u0012ai\nbi\n\u0013\n≥\n \nN\n∑\ni=1\nai\n!\nlog\n\n\n\n\nN\n∑\ni=1\nai\nN\n∑\ni=1\nbi\n\n\n\n.\nWe now present the useful definitions and lemmas from [30] that connect the scaled lp norms of vectors to a class of symmetric\npolynomials used to derive our results. To this end, we start with the following definition:\nDefinition 4. Consider an integer r ≥1. Denote the rth degree Taylor polynomial expansion of the exponential function by Pr,\nwhere Pr(ν) =\nr\nΣ\ni=0\nνi\ni! . For any vector x ∈RN and any real number t ∈R define\nfr(x,t) :=\nN\n∏\ni=1\nPr(xit) =\nN\n∏\ni=1\n \nr\n∑\nj=0\n(xit)j\nj!\n!\n.\n(A1)\nFurther, for any integer k ≥1 we define Fk,r(x) as the coefficient of tk in the expansion of fr(x,t). Equivalently, we can express\nfr(x,t) as:\nfr(x,t) :=\nr\n∑\nk=1\nFk,r(x)tk.\n(A2)\nFact 4. [30, Theorem 1] Consider two probability vectors x, y of support size N and take a fixed integer r ≥1. Then we have\nthe following characterization of the scaled lp with respect to the polynomial coefficients Fk,r of the exponential function, for all\nintegers k such that r ≤k ≤Nr.\nIf Fk,r(x) ≤Fk,r(y) then\n∥x∥p ≤∥y∥p\nfor p ∈[0,1],\n∥x∥p ≥∥y∥p\nfor p ∈[1,r +1] .\nWe also need the following relations of the so-called Mellin transforms [30]:\n\n\n11\nFact 5. Define the integral transform of the logarithm of Pr (from Definition 4) as:\nIr(p) :=\nZ ∞\n0 log\n \nr\n∑\ni=0\nνi\ni!\n!\nν−p dν\nν for p ∈(0,1) and\nJr(p) :=\nZ ∞\n0\n \nν −log\n \nr\n∑\ni=0\nνi\ni!\n!!\nν−p dν\nν for p ∈(1,r +1) .\nThen, if we let t = ν/a for a ≥0, the following relations hold:\n1\nIr(p)\nZ ∞\n0 log\n \nr\n∑\ni=0\n(at)i\ni!\n!\nt−p dt\nt\n= ap\nfor p ∈(0,1)\n1\nJr(p)\nZ ∞\n0\n \nat −log\n \nr\n∑\ni=0\n(at)i\ni!\n!!\nt−p dt\nt\n= ap\nfor p ∈(1,r +1).\nWe now prove the statement 1 of Fact 2 to analyze the case when the thermal distribution has irrational entries as the following\nproposition:\nProposition 1. Consider the spectral decomposition of the thermal state ρg in the energy eigenbasis {|ei⟩}d\ni=1 as:\nρg =\nd\nΣ\ni=1gi |ei⟩⟨ei|\nwith some of the eigenvalues gi being irrational. Then there exists a state ρgε with all eigenvalues as rational numbers of form\n{ di\nN }N\ni=1, for N large enough, ρgε is diagonal in the energy eigenbasis and\n∥ρg −ρgε∥1 ≤ε\nfor any given ε > 0.\nProof. The above proposition is simply an extension of the fact that any irrational number can be approximated by a rational\nnumber to any desired accuracy.\nMore formally, let gε denote the vector of eigenvalues of ρgε and N,ε are given. Suppose for some 1 ≤i ≤d, gi is irrational.\nThen by Archimedian property of real numbers, there exists an integer N′ such that N′ > max[maxi [gi], N\nε ]. Now we define\ndi := ⌊giN′⌋for all 1 ≤i ≤d.\nSince g is a probability vector, therefore\nd\nΣ\ni=1di = N′.\nFinally, define the rational approximation of gi as: (gε)i := di\nN′ . Thus, (gε)i satisfy:\n|gi −(gε)i| =\n\f\f\f\fgi −di\nN′\n\f\f\f\f =\n\f\f\f\f\nN′gi −di\nN′\n\f\f\f\f ≤ε\nN′ .\nNote that if for any 1 ≤i ≤d, if gi is rational then gi = (gε)i = di\nN . We thus obtain the resultant density matrix\nρgε :=\nd\n∑\ni=1\ndi\nN′ |ei⟩⟨ei| .\nThis satisfy the property that:\n∥ρg −ρgε∥1 =\nd\n∑\ni=1\n\f\f\f\fgi −di\nN′\n\f\f\f\f ≤N ε\nN′ ≤ε.\nBelow we prove a continuity statement for the p-Rényi divergence.\n\n\n12\nProposition 2. Let p > 0, and any given ε > 0, and two probability distributions x and g. Let gmin := mini gi and gε be another\nprobability distributions such that ∥g−gε∥1 ≤ε, then:\n\f\fDp(x||gε)−Dp(x||g)\n\f\f ≤max\n\u001a\n1,\np\n|p−1|\n\u001b\nlog\n\u0012\n1+\nε\ngmin\n\u0013\n, and\n(A3)\n|D1(x||gε)−D1(x||g)| ≤log\n\u0012\n1+\nε\ngmin\n\u0013\n.\n(A4)\nProof. The above proposition can be proven as follows:\n|Dp(x||gε)−Dp(x||g)| =\n1\n|p−1|\n\f\f\f\f\n\u001a\nlog\n\u0012\nN\nΣ\ni=1xp\ni (gε)1−p\ni\n\u0013\n−log\n\u0012\nN\nΣ\ni=1xp\ni g1−p\ni\n\u0013\u001b\f\f\f\f\n=\n1\n|p−1|\n\u0012\nN\nΣ\ni=1xp\ni (gε)i\n1−p\n\u0013\n\f\f\f\f\f\f\f\f\n\u0012\nN\nΣ\ni=1xp\ni (gε)i\n1−p\n\u0013\nlog\n\n\n\n\nN\nΣ\ni=1xp\ni (gε)i\n1−p\nN\nΣ\ni=1xp\ni gi1−p\n\n\n\n\n\f\f\f\f\f\f\f\f\na\n≤\n1\n|p−1|\n\u0012\nN\nΣ\ni=1xp\ni (gε)i\n1−p\n\u0013\nN\nΣ\ni=1xp\ni (gε)i\n1−p\n\f\f\f\f\flog\n\u0012(gε)i\ngi\n\u00131−p\f\f\f\f\f\n≤\n1\n\u0012\nN\nΣ\ni=1xp\ni (gε)i\n1−p\n\u0013\n\u0012\nN\nΣ\ni=1xp\ni (gε)i\n1−p\n\u0013\u0014\nmax\ni\n\f\f\f\flog\n\u0012(gε)i)\ngi\n\u0013\f\f\f\f\n\u0015\n= max\ni\n\f\f\f\flog\n\u0012(gε)i\ngi\n\u0013\f\f\f\f\nb\n≤log\n\u0012\n1+\nε\ngmin\n\u0013\n,\nwhere (a) follows from the log-sum inequality, fact 3, and (b) follows from the following:\nε ≥∥g−gε∥1 =\nN\nΣ\ni=1gi\n\f\f\f\f\n(gε)i\ngi\n−1\n\f\f\f\f\n≥gmin\nN\nΣ\ni=1\n\f\f\f\f\n(gε)i\ngi\n−1\n\f\f\f\f\n≥gmin max\ni\n\f\f\f\f\n(gε)i\ngi\n−1\n\f\f\f\f\n⇒log\n\u0012(gε)i\ngi\n\u0013\n≤log\n\u0012\n1+\nε\ngmin\n\u0013\n; for all i ∈{1,2...,N}.\n(A5)\nWe now give a continuity statement for the case of p = 1 (i.e., for KL-divergence). The simplicity comes from the definition\nof D1(x||gε) := Σ\ni xi log\nxi\n(gε)i which leads to:\n|D1(x||g)−D1(x||gε)| = Σ\ni xi\n\f\f\f\flog\n\u0012(gε)i\ngi\n\u0013\f\f\f\f\n≤max\ni\n\f\f\f\flog\n\u0012(gε)i\ngi\n\u0013\f\f\f\fΣ\ni xi\n= max\ni\n\f\f\f\flog\n\u0012(gε)i\ngi\n\u0013\f\f\f\f\ni\n≤log\n\u0012\n1+\nε\ngmin\n\u0013\n(A6)\nwhere (i) follows from Eq. A5. This proves Eq. A4.\nIn the following lemmas, we demonstrate how conditions based on symmetric polynomials lead to trumping by explicitly ex-\namining the relation between Dp(ρ||ρg) and Dp(σ||ρg) across the full range of p ∈R. Throughout, we consider x, y as two\nprobability vectors of support size N, that is,\nN\nΣ\ni=1xi =\nN\nΣ\ni=1yi = 1 and without loss of generality, the logarithm is taken with base 2.\n\n\n13\n2.\nCharacterization in terms of relative entropy, for p = 1:\nFor p = 1, following two lemma guarantee the conditions of trumping.\nLemma 2. For any given ε > 0, if H1(x) < H1(y)−2log\n\u0010\n1+\nε\ngmin\n\u0011\n, then\nD1(ρ||ρgε) > D1(σ||ρgε)+2log\n\u0012\n1+\nε\ngmin\n\u0013\n.\nProof. The proof follows easily by using the following relation between entropy and the relative entropy:\nD1(x||gε) = logN −H1(x) .\nUsing the hypothesis of the lemma and above relation completes the proof.\nLemma 3. For any given ε > 0, if D1(ρ||ρgε) > D1(σ||ρgε)+2log\n\u0010\n1+\nε\ngmin\n\u0011\n, then\nD1(ρ||ρg) > D1(σ||ρg).\nProof. The continuity of relative entropy from Eq. A4 together with the hypothesis of the lemma, gives\nD1(ρ||ρg)\na> D1(ρ||ρgε)−log\n\u0012\n1+\nε\ngmin\n\u0013\n> D1(σ||ρgε)+log\n\u0012\n1+\nε\ngmin\n\u0013\nb> D1(σ||ρg)\nwhere (a) and (b) follows from Eq. A4.\n3.\nCharacterization in terms of p Rényi divergence, for p ∈(1, ¯r):\nFor p ∈(1, ¯r), in order to show Fk,¯r(x) < Fk,¯r(y)\nA1(ε) implies trumping (for some suitably chosen A1(ε)), we prove following series of\nLemmas.\nLemma 4. If Fk,¯r(x) < Fk,¯r(y)\nA1(ε) for some real valued positive function A1(ε) which is independent of k (with ε > 0) then\nf¯r(x,t) < f¯r(y,t)\nA1(ε) .\nProof. By definition 4 of f¯r(x,t) and Fk,¯r(x) [30]:\nf¯r(x,t) = Σ\nk Fk,¯r(x)tk\na<\n1\nA1(ε) Σ\nk Fk,¯r(y)tk\n= f¯r(y,t)\nA1(ε) .\nHere (a) follows from the hypothesis of the lemma.\nLemma 5. If f¯r(x,t) <\nf¯r(y,t)\nA1(ε) for any ε > 0 and A1(ε) is as defined in Lemma 4 and in addition satisfies A1(ε) ≥\n2\n\u0014\n1\nN\n\u001a\u0010\n1+\nε\ngmin\n\u00112¯r\u001b\u0015\n, then\n∥x∥p > ∥y∥p\n\u0012\n1+\nε\ngmin\n\u00132\n.\n\n\n14\nProof. Using Fact 5, we have the following:\nN\nΣ\ni=1\n\"\nyit −log\n \n¯r\nΣ\nj=1\n(yit)j\nj!\n!#\n=\nN\nΣ\ni=1yit −log f¯r(y,t)\na<\nN\nΣ\ni=1yit −log f¯r(x,t)−logA1(ε).\nHere (a) follows from the hypothesis of the lemma. Now multiplying both sides of the above Eq. by t−p−1\nJ¯r(p) , rearranging the terms,\nintegrating with respect to t ∈(0,∞) and using Fact 5, we get:\nN∥x∥p\np > N∥y∥p\np + logA1(ε)\nJ¯r(p)\nZ ∞\n0 t−p−1dt\na> N∥y∥p\np + logA1(ε)\nJ¯r(p)\nZ ∞\nk t−p−1dt\n= N∥y∥p\np +N logA1(ε)\n⇒∥x∥p\np > ∥y∥p\np ×\n\u0014\n1+ logA1(ε)\n∥y∥p\np\n\u0015\n⇒∥x∥p\nb> ∥y∥p\n\u0014\n1+\nε\ngmin\n\u00152\n,\nwhere in (a) we set the lower limit of the integral as k = (NpJ¯r(p))−1\np > 0 ensuring that the integral evaluates to NJ¯r(p) and (b)\nholds for the choice of A1(ε) as:\nA1(ε) ≥2\n\u0014\n1\nN\n\u001a\u0010\n1+\nε\ngmin\n\u00112¯r\u001b\u0015\na\n≥2\n∥y∥p\np\n\u001a\u0010\n1+\nε\ngmin\n\u00112¯r)\u001b\nb\n≥2\n∥y∥p\np\n\u001a\u0010\n1+\nε\ngmin\n\u00112p\n−1\n\u001b\n.\nIn the above analysis (a) holds because ∥y∥p\np = Σn\ni=1yp\ni\nN\n≤ΣN\ni=1yi\nN\n= 1\nN , since y is a probability vector and (b) follows as p ∈(1, ¯r).\nThis completes the proof of the lemma.\nLemma 6. If ∥x∥p > ∥y∥p\n\u0010\n1+\nε\ngmin\n\u00112\nfor any given ε > 0, then:\nHp(x) < Hp(y)−2p\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\n.\nProof. From the definition of Renyi entropy (Eq. 3, 4, 5) we have:\nHp(x) := −\n1\np−1 log\n\n\n\nN ×\nN\nΣ\ni=1xp\ni\nN\n\n\n\n\na< −logN\np−1 −\np\np−1 log∥y∥p −2p\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\n= Hp(y)−2p\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\n,\nwhere (a) follows from the hypothesis of the lemma.\nLemma 7. For any given ε > 0, if Hp(x) < Hp(y)−2p\np−1 log\n\u0010\n1+\nε\ngmin\n\u0011\nthen:\nDp(ρ||ρgε) ≥Dp(σ||ρgε)+ 2p\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\n.\n(A7)\n\n\n15\nProof. The proof essentially follows from the relation between the relative entropy of a given distribution with uniform dis-\ntribution and the Shannon entropy of a given state, i.e., Dp(x||uN) = logN −Hp(x) and similarly Dp(y||uN) = logN −Hp(y).\nSince,\nDp(ρ||ρgε) = Dp(x||uN) = logN −Hp(x)\na> logN −Hp(y)+ 2p\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\n= Dp(y||uN)+ 2p\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\n= Dp(σ||ρgε)+ 2p\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\n.\nHere (a) follows from the hypothesis of the lemma.\nLemma 8. For any given ε > 0, if Dp(ρ||ρgε) ≥Dp(σ||ρgε)+ 2p\np−1 log\n\u0010\n1+\nε\ngmin\n\u0011\nthen:\nDp(ρ||ρg) > Dp(σ||ρg).\nProof.\nDp(ρ||ρg)\na> Dp(ρ||ρgε)−\np\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\nb> Dp(σ||ρgε)+ 2p\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\n−\np\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\nc> Dp(σ||ρg)−\np\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\n+ 2p\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\n−\np\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\n= Dp(σ||ρg)\nwhere (a) follows from Proposition 2, (b) follows from the hypothesis of the Lemma and (c) follows from Proposition 2.\nThus, Fk,¯r(x) < Fk,¯r(y)\nA1(ε) along with the choice of A1(ε) = 2\n\u0014\n1\nN\n\u001a\u0010\n1+\nε\ngmin\n\u00112¯r\u001b\u0015\nis sufficient to guarantee trumping.\n4.\nCharacterization in terms of p Rényi divergence, for p ∈(0,1):\nSince the relation between scaled lp norms of two vectors differ in the regime where p ∈(0,1) compared to when p ∈(1, ¯r),\nsome of the lemmas presented above have different bounds and quantifiers. Here we prove the lemmas for the region p ∈(0,1)\nfor clarity and completeness.\nLemma 9. If f¯r(x,t) < f¯r(y,t)\nA2(ε) for any ε > 0 and A2(ε) is as defined in Lemma 4 and in addition satisfies A2(ε) ≥2\n2ε\nNgmin , then\n∥x∥p <\n\n\n\n\n\n∥y∥p\n\u0010\n1+\nε\ngmin\n\u0011−2\n\u0010 1−p\np\n\u0011\nfor p ∈[0, 1\n2]\n∥y∥p\n\u0010\n1+\nε\ngmin\n\u0011−2\nfor p ∈( 1\n2,1]\nProof. Using Fact 4, we have the following:\nN∥x∥p\np =\n1\nI¯r(p)\nZ ∞\n0 t−p−1 log f¯r(x,t)dt\na<\n1\nI¯r(p)\nZ ∞\n0 t−p−1 log f¯r(y,t)dt −logA2(ε)\nZ ∞\n0\nt−p−1\nI¯r(p) dt\nb< N∥y∥p\np −logA2(ε)\nZ ∞\nk\nt−p−1\nI¯r(p) dt\n= N∥y∥p\np {1−Nη(p)logA2(ε)}.\n(A8)\n\n\n16\nwhere (a) follows from the hypothesis of the lemma, while inequality (b) arises from restricting the integration range of the\nsecond term to a modified lower bound k = (η(p)pN2∥y∥p\npI¯r(p))−1/p instead of 0. This ensures that the definite integral in the\nsecond term evaluates to N2∥y∥p\npη(p) with the chosen function η(p) = max{p,(1−p)} depending on the range of p.\nNow, we choose A2(ε) ≥2\n2ε\nNgmin (implying that logA2(ε) > 0), which further leads to:\nη(p)logA2(ε) ≥2η(p)ε\nNgmin\n= 1\nN\n\u0014\n1−\n\u0012\n1−2η(p)ε\ngmin\n\u0013\u0015\ni\n≥1\nN\n\"\n1−\n\u0012\n1+\nε\ngmin\n\u0013−2η(p)#\n,\n(A9)\nwhere (i) holds since (1+x)−n ≥1−nx, for x ∈[0,1].\nCase 1: For p ∈(1/2,1], we have η(p) = p and then substituting Eq. A9 in Eq. A8 gives:\n∥x∥p < ∥y∥p\n\u0012\n1+\nε\ngmin\n\u0013−2\n, for p ∈(1/2,1] .\nCase 2: For p ∈[0,1/2), we have η(p) = 1−p and again :\nlogA2(ε) ≥1\nN\n\"\n1−\n\u0012\n1+\nε\ngmin\n\u0013−2(1−p)#\n.\nSubstituting Eq. A9 in Eq. A8 gives\n∥x∥p < ∥y∥p\n\u0012\n1+\nε\ngmin\n\u0013−2\n\u0010 1−p\np\n\u0011\nfor p ∈[0,1/2).\nThis completes the proof of the lemma.\nLemma 10. If ∥x∥p < ∥y∥p\n\u0010\n1+\nε\ngmin\n\u0011−2γ\nwhere γ := max\nn\u0010\n1−p\np\n\u0011\n,1\no\nfor any given ε > 0, then:\nHp(x) < Hp(y)−2 γ p\n1−p log\n\u0012\n1+\nε\ngmin\n\u0013\n.\nProof. From the definition of Renyi entropy (Eq. 3, 4, 5) we have:\nHp(x) :=\n1\n1−p log\n\n\n\nN ×\nN\nΣ\ni=1xp\ni\nN\n\n\n\n\na<\nlogN\n1−p +\np\n1−p log∥y∥p −2 γ p\n1−p log\n\u0012\n1+\nε\ngmin\n\u0013\n= Hp(y)−2 γ p\n1−p log\n\u0012\n1+\nε\ngmin\n\u0013\nwhere (a) follows from the hypothesis of the lemma. The lemma thus implies:\nHp(x) <\n\n\n\nHp(y)−2log\n\u0010\n1+\nε\ngmin\n\u0011\nfor p ∈[0,1/2)\nHp(y)−2p\n1−p log\n\u0010\n1+\nε\ngmin\n\u0011\nfor p ∈[1/2,1)\nThis completes the proof of the lemma.\n\n\n17\nLemma 11. For any given ε > 0, if Hp(x) < Hp(y)−2 γ p\n1−p log\n\u0010\n1+\nε\ngmin\n\u0011\n, for γ := max\nn\u0010\n1−p\np\n\u0011\n,1\no\nthen:\nDp(ρ||ρgε) ≥Dp(σ||ρgε)+2 γ p\n1−p log\n\u0012\n1+\nε\ngmin\n\u0013\n.\nProof. The proof essentially follows from the relation between the relative entropy of a given state with maximally mixed state\nand the von Neumann entropy of a given state, very similar to that of Lemma 7 (with the factor p−1 being replaced by 1−p in\nthe denominator of the second term on the right hand side of the desired inequality).\nLemma 12. For any given ε > 0, if Dp(ρ||ρgε) ≥Dp(σ||ρgε +2 γ p\n1−p log\n\u0010\n1+\nε\ngmin\n\u0011\nfor γ := max\nn\u0010\n1−p\np\n\u0011\n,1\no\nthen:\nDp(ρ||ρg) > Dp(σ||ρg).\nProof. The essential idea is to use the continuity of Dp(ρ||ρg) in the second argument, which follows from Proposition 2.\nWe do the analysis under the following two cases:\nCase 1: For p ∈[0,1/2) range, we have γ p\n1−p = 1. This leads to:\nDp(ρ||ρg)\ni> Dp(ρ||ρgε)−log\n\u0012\n1+\nε\ngmin\n\u0013\nii> Dp(σ||ρgε)+2log\n\u0012\n1+\nε\ngmin\n\u0013\n−log\n\u0012\n1+\nε\ngmin\n\u0013\niii> Dp(σ||ρg)−log\n\u0012\n1+\nε\ngmin\n\u0013\n+2log\n\u0012\n1+\nε\ngmin\n\u0013\n−log\n\u0012\n1+\nε\ngmin\n\u0013\n= Dp(σ||ρg).\nCase 2: For the range p ∈[1/2,1), we have γ p\n1−p =\np\n1−p. Thus:\nDp(ρ||ρg)\ni> Dp(ρ||ρgε)−\np\n1−p log\n\u0012\n1+\nε\ngmin\n\u0013\nii> Dp(σ||ρgε)+ 2p\n1−p log\n\u0012\n1+\nε\ngmin\n\u0013\n−\np\n1−p log\n\u0012\n1+\nε\ngmin\n\u0013\niii> Dp(σ||ρg)−\np\n1−p log\n\u0012\n1+\nε\ngmin\n\u0013\n+ 2p\n1−p log\n\u0012\n1+\nε\ngmin\n\u0013\n−\np\n1−p log\n\u0012\n1+\nε\ngmin\n\u0013\n= Dp(σ||ρg).\nwhere for both the above cases, (i) and (iii) follows from Proposition 2; (ii) follows from hypothesis of the lemma.\nFrom analysis of both the cases above, we get that Dp(ρ||ρg) > Dp(σ||ρg) which completes the proof of the lemma.\nFor our purpose, it is thus sufficient to choose\n1\nA2(ε) = 2−\n2ε\nNgmin which guarantee trumping.\n5.\nCharacterization in terms of p Rényi divergence, for p ∈(−¯s,0):\nIn the regime p ∈(−¯s,0), we need to show\nFk,1\n\u0000 1\nx¯s\n\u0001\nAs(ε)\n> Fk,1\n\u0012 1\ny¯s\n\u0013\n,\n1 ≤k ≤N ,\nimplies trumping for some real valued positive function As(ε). To demonstrate this, we need the following lemmas.\nLemma 13. If\nFk,1\n\u0010\n1\nx¯s\n\u0011\nAs(ε)\n> Fk,1\n\u0010\n1\ny¯s\n\u0011\n, for some real-valued positive function As(ε) with 1 ≤k ≤N and ε > 0, then\nf1\n\u0012 1\ny¯s ,t\n\u0013\n< f1\n\u0000 1\nx¯s ,t\n\u0001\nAs(ε) .\n\n\n18\nProof. By Definition 4 of f1(x,t) and Fk,1(x) [30]:\nf1\n\u0012 1\ny¯s ,t\n\u0013\n= Σ\nk Fk,1\n\u0012 1\ny¯s\n\u0013\ntk\na<\n1\nAs(ε) Σ\nk Fk,1\n\u0012 1\nx¯s\n\u0013\ntk\n= f1\n\u0000 1\nx¯s ,t\n\u0001\nAs(ε) .\nwhere (a) follows from the hypothesis of the lemma.\nLemma 14. If f1\n\u0010\n1\ny¯s ,t\n\u0011\n<\nf1\n\u0010\n1\nx¯s ,t\n\u0011\nAs(ε) , then for any ε > 0, ξ ∈(0,1) and the choice of As(ε) as\nAs(ε) ≥2\n\n\n\n\u0010\n1+\nε\ngmin\n\u00112(1+¯s)−1\nN\n\n\n\nthe following holds:\n\r\r\r\r\n1\nx¯s\n\r\r\r\r\nξ\n>\n\r\r\r\r\n1\ny¯s\n\r\r\r\r\nξ\n\u0012\n1+\nε\ngmin\n\u00132 1+ξ ¯s\nξ\n.\nProof. From Fact 4, we have the following:\nN\n\r\r\r\r\n1\nx¯s\n\r\r\r\r\nξ\nξ\n=\n1\nIr(ξ)\nZ ∞\n0 t−ξ−1 log fr\n\u0012 1\nx¯s ,t\n\u0013\ndt\na>\n1\nIr(ξ)\nZ ∞\n0 t−ξ−1 log fr\n\u0012 1\ny¯s ,t\n\u0013\ndt +logAs(ε)\nZ ∞\n0\nt−ξ−1\nIr(ξ) dt\nb> N\n\r\r\r\r\n1\ny¯s\n\r\r\r\r\nξ\nξ\n+logAs(ε)\nZ ∞\nk\nt−ξ−1\nIr(ξ) dt\n= N\n\r\r\r\r\n1\ny¯s\n\r\r\r\r\nξ\nξ\n{1+N logAs(ε)}.\n(A10)\nHere (a) follows from the hypothesis of the lemma whereas in (b) we restrict the range of the definite integral to\n\"\nk =\n\u0012\nξN2 \r\r\r 1\ny¯s\n\r\r\r\nξ\nξ Ir(ξ)\n\u0013−1/ξ\n,∞\n#\ninstead of considering the full domain [0,∞], ensuring that it evaluates to N2 \r\r\r 1\ny¯s\n\r\r\r\nξ\nξ. Now, the\nchoice of As(ε) ≥2\n\n\n\n\u0010\n1+\nε\ngmin\n\u00112(1+¯s)−1\nN\n\n\nimplies:\n1+N logAs(ε) ≥\n\u0012\n1+\nε\ngmin\n\u00132(1+¯s) i>\n\u0012\n1+\nε\ngmin\n\u00132(1+ξ ¯s)\n(A11)\nwhere (i) holds since ξ ∈(0,1). Substituting Eq. A11 in Eq. A10 and taking the ξth root both the sides, completes the\nproof.\nWe now state a lemma that serves as a bridge between ∥x∥−p and\n\r\r 1\nx\n\r\r\nk¯s.\nLemma 15. ∥x∥p < ∥y∥p\n\u0010\n1+\nε\ngmin\n\u00112 1−p\np\nfor\np ∈(−¯s,0) ⇐⇒\n\r\r 1\nx¯s\n\r\r\nξ >\n\r\r\r 1\ny¯s\n\r\r\r\nξ\n\u0010\n1+\nε\ngmin\n\u00112 1+ξ ¯s\nξ\nfor\nξ ∈(0,1).\n\n\n19\nProof. The equivalence in the lemma can be shown by the following analysis for any ξ ∈(0,1):\n\r\r\r\r\n1\nx¯s\n\r\r\r\r\nξ\n>\n\r\r\r\r\n1\ny¯s\n\r\r\r\r\nξ\n\u0012\n1+\nε\ngmin\n\u00132 1+ξ ¯s\nξ\n⇐⇒\n\r\r\r\r\n1\nx\n\r\r\r\r\nξ ¯s\n>\n\r\r\r\r\n1\ny\n\r\r\r\r\nξ ¯s\n\u0012\n1+\nε\ngmin\n\u00132 1+ξ ¯s\nξ ¯s\n(A12)\n⇐⇒\n1\n∥x∥−ξ ¯s\n>\n1\n∥y∥−ξ ¯s\n\u0012\n1+\nε\ngmin\n\u00132 1+ξ ¯s\nξ ¯s\n⇐⇒∥x∥p < ∥y∥p\n\u0012\n1+\nε\ngmin\n\u0013−2 1+|p|\n|p|\n, where p := −ξ ¯s and hencep ∈(−¯s,0)\n(A13)\n⇐⇒∥x∥p < ∥y∥p\n\u0012\n1+\nε\ngmin\n\u00132 1−p\np\n,\nfor all p ∈(−¯s,0) .\nLemma 16. If ∥x∥p < ∥y∥p\n\u0010\n1+\nε\ngmin\n\u00112 1−p\np\nfor any given ε > 0, then:\nHp(x) < Hp(y)−2log\n\u0012\n1+\nε\ngmin\n\u0013\n.\nProof. From the definition of Rényi p-entropy (Eq. 4) and the notation p = −|p| (since p is negative) we have:\nHp(x) = −\n1\n1−p log\n\n\n\nN ×\nN\nΣ\ni=1xp\ni\nN\n\n\n\n\n= −logN\n1+|p| +\n|p|\n1+|p| log∥x∥p\na< −logN\n1+|p| +\n|p|\n1+|p| log∥y∥p +\n|p|\n1+|p| × 2(1−p)\np\nlog\n\u0012\n1+\nε\ngmin\n\u0013\n= −logN\n1+|p| +\n|p|\n1+|p| log∥y∥p −\n|p|\n1+|p| × 2(1+|p|)\n|p|\nlog\n\u0012\n1+\nε\ngmin\n\u0013\n= Hp(y)−2log\n\u0012\n1+\nε\ngmin\n\u0013\n,\nwhere (a) follows from the hypothesis of the lemma.\nLemma 17. For any given ε > 0, if Hp(x) < Hp(y)−2log\n\u0010\n1+\nε\ngmin\n\u0011\nthen:\nDp(ρ||ρgε) ≥Dp(σ||ρgε)+2log\n\u0012\n1+\nε\ngmin\n\u0013\n.\n(A14)\nProof. The proof essentially follows from the relation between the relative entropy of a given distribution with uniform distribu-\ntion and the Shannon entropy of a given state, that is,\nDp(ρ||ρgε) = Dp(x||uN) = −logN −Hp(x)\na> −logN −Hp(y)+2log\n\u0012\n1+\nε\ngmin\n\u0013\n= Dp(y||uN)+2log\n\u0012\n1+\nε\ngmin\n\u0013\n= Dp(σ||ρgε)+2plog\n\u0012\n1+\nε\ngmin\n\u0013\n.\nHere (a) follows from the hypothesis of the lemma.\n\n\n20\nLemma 18. For any given ε > 0, if Dp(ρ||ρgε) ≥Dp(σ||ρgε)+2log\n\u0010\n1+\nε\ngmin\n\u0011\nthen:\nDp(ρ||ρg) > Dp(σ||ρg).\nProof. The proof follows from the following analysis:\nDp(ρ||ρg)\na> Dp(ρ||ρgε)−log\n\u0012\n1+\nε\ngmin\n\u0013\nb> Dp(σ||ρgε)+2log\n\u0012\n1+\nε\ngmin\n\u0013\n−log\n\u0012\n1+\nε\ngmin\n\u0013\nc> Dp(σ||ρg)−log\n\u0012\n1+\nε\ngmin\n\u0013\n+2log\n\u0012\n1+\nε\ngmin\n\u0013\n−log\n\u0012\n1+\nε\ngmin\n\u0013\n= Dp(σ||ρg).\nwhere (a) and (c) follow from Eq. A4 of Proposition 2, (b) follows from the hypothesis of the Lemma and (c) follows from\nProposition 2. Above expression implies Dp(ρ||ρg) > Dp(σ||ρg).\n6.\nCharacterization in terms of p Rényi divergence, for p ∈(r,∞) and p ∈(−∞,−¯s]:\nFollowing Lemma explores the ranges p ∈(r,∞) and p ∈(−∞,−¯s] to guarantee the conditions for trumping.\nLemma 19. For a fixed ε > 0, let N > 1, x,y ∈RN\n+, x1 > y1\n\u0010\n1+\nε\ngmin\n\u00112\n> 0 and ymin > xmin\n\u0010\n1+\nε\ngmin\n\u00112\n> 0. Let r and s be\nchosen as:\nr =\nlogN\nlogx1 −logy1\n\u0010\n1+\nε\ngmin\n\u00112\nand\ns =\nlogN\nlogymin −log\n\u001a\nxmin\n\u0010\n1+\nε\ngmin\n\u00112\u001b.\nThen, Dp(ρ||ρg) > Dp(σ||ρg) for ∀p ≥¯r and ∀p < −¯s.\nProof. Using the choice of r and following the steps outlined in Lemma 1 we get:\n∥x∥p ≥∥y∥p\n\u0012\n1+\nε\ngmin\n\u00132\nfor p ≥¯r .\nNow using the following relation between the p-Rényi divergence and the our scaled ℓp norm we get:\nDp(x||uN) = logN +\np\np−1 log∥x∥p\n⇒\nDp(x||uN) > Dp(y||uN)+ 2p\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\n.\n(A15)\nThe following analysis leads us to the proof of the lemma for p > r:\nDp(ρ||ρg) = Dp(x||g)\na\n≥Dp(x||gε)−log\n\u0012\n1+\nε\ngmin\n\u0013\nb> Dp(y||gε)+\np\np−1 log\n\u0012\n1+\nε\ngmin\n\u0013\nc> Dp(y||g) = Dp(σ||ρg) .\nwhere (a) and (c) follows from the continuity of p-Rényi divergence mentioned in Eq. A3 of Proposition 2; (b) follows from\nEq. A15.\nIn order to prove the lemma for p < −¯s, we make the following observations (for p < 0):\n\r\r\r\r\n1\nx\n\r\r\r\r\np\n=\n1\n∥x∥−p\n;\nHp(x) =\n|p|\n1+|p| log∥x∥−|p|\n⇒\nDp(x||uN) = −logN −Hp(x) .\n\n\n21\nFrom Corollary 2 and the choice of s, we get:\n\r\r\r\r\n1\nx\n\r\r\r\r\n−|p|\n>\n\r\r\r\r\n1\ny\n\r\r\r\r\n−|p|\n\u0012\n1+\nε\ngmin\n\u00132\n⇒\n1\n∥x∥−|p|\n>\n1\n∥y∥−|p|\n\u0012\n1+\nε\ngmin\n\u00132\n⇒∥x∥−|p| < ∥y∥−|p|\n\u0012\n1+\nε\ngmin\n\u0013−2\n⇒Hp(x) < Hp(y)−2|p|\n|p|+1\n\u0012\n1+\nε\ngmin\n\u0013\n⇒Dp(x||uN) > Dp(y||uN)+ 2|p|\n|p|+1\n\u0012\n1+\nε\ngmin\n\u0013\nNow doing similar analysis for the case p > r, gives:\nDp(ρ||ρg) > Dp(σ||ρg) for p ∈(−∞,−¯s] .\nThis completes the proof the lemma.\nAppendix B: Discussion on trumping conditions for general states having coherence\nAt first, it may be noted that no necessary and sufficient set of conditions are currently known for catalytic state transfor-\nmations involving states having coherence under the corresponding free operations, rather only necessary conditions have been\nestablished [41]. Here, we outline a method to derive a finite set of necessary conditions for catalytic majorization in quantum\nstates having coherence.\nBefore discussing the catalytic majorization conditions for quantum states having coherence, let us first explore the formal\naspects of the concept known as Symmetry [41, 42]. This concept has significant applications in physics, and recent insights\nindicate that any deviation from Symmetry, termed as asymmetry serves as a resource for information processing tasks [42].\nSymmetry group and symmetry operation: For a symmetry group G, the symmetry transformation of a density matrix ρ\ncorresponding to the group element g can be represented as follows:\ng ∈G =⇒ρ →Ug(ρ) = Ug(ρ)U†\ng\nwhere Ug is unitary.\nAn evolution M is said to be symmetric with respect to G if it commutes with the action of the symmetry group i.e., if\n[M ,G] = 0 for all g ∈G. This implies that the order in which the symmetry transformation and the dynamics occur does not\naffect the final state. In other words, for every density matrix ρ and each element g in the group G, the Equation M [Ug(ρ)] =\nUg[M (ρ)] holds. Similarly, a state is called symmetric if it is invariant under symmetry transformations; otherwise, it is called\nasymmetric.\nIndeed, a resource theory can be formulated where the set of free operations comprises those demonstrating symmetry with\nrespect to the group G. Specifically, this theory pertains to quantum coherence between eigenspaces of the observables generating\nG. If the generator is the Hamiltonian Hs, the corresponding channel M is time-translation symmetric.\nDefinition 5. For any p ≥0, the free coherence of a state ρ with respect to the Hamiltonian H is\nAp(ρ) := Dp(ρ||NH(ρ))\nwhere NH is the operation that removes all coherence between energy eigenspaces and Dp is the Réyni divergence as defined\nearlier.\nSimilar to how free energies determine the extent to which a state deviates from being thermal, free coherence serves as a\nmeasure of how far a state strays from being incoherent in energy. In order to check state transformation between two states\nin presence of a catalyst, the free energy relations are no longer sufficient rather it is only necessary to go beyond free energy\nrelations to capture the role of quantum coherence in thermodynamical state transformation.\nLet us now discuss the conditions for the transformation of states having coherence. For that we borrow and state the theorems\nfrom [15, 41].\n\n\n22\nFact 6. [41, Theorem 1] The set of Thermal operations on a quantum state is a strict subset of the set of symmetric quantum\noperations with respect to the time-translation.\nFact 7. [41, Theorem 2] For all p ≥0, we necessarily have ∆Ap ≤0 for any thermal operation.\nIt is easy to argue that the above fact is true in general for any thermal operation. The Rényi divergence follows the relation\nDp(M (ρ)||M (σ)) ≤Dp(ρ||σ) for all p. Since from Fact 6, [M ,NH] = 0, we derive the condition that the above fact is indeed\ntrue.\nA state ρ in H can be transformed into a state σ (i.e., ρ →σ) through a catalytic thermal operation, if there is another\nquantum state ρc in Hilbert space Hc with Hamiltonian Hc and a thermal operation M on H ⊗Hc i.e.,\nM (ρ ⊗ρc) = σ ⊗ρc.\nFact 8. [41, Theorem 4] Catalytic thermal operations with a block-diagonal catalyst are symmetric operations, i.e., if H is the\nsystem’s Hamiltonian and C is a catalytic thermal operation then\nC (e−iHtρeiHt) = e−iHtC (ρ)eiHt.\nFact 9. [41, Theorem 5] If [ρc,Hc] = 0, for ρ ⊗ρc →σ ⊗ρc, we necessarily have\nAp(σ) ≤Ap(ρ) ∀p ≥0.\nThis implies the necessary conditions for catalytically transforming states having coherence, involve comparing the general-\nized coherence-free energies (of order p) of ρ and σ across an infinite range of p values.\nOne can now get a finite number of necessary conditions for catalytic majorization by replacing ρg with a state ρf =: NH(ρ)\nthat removes all the off diagonal elements of the state into the discussion of Corollary 3 and Theorem 2.\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20588v1.pdf",
    "total_pages": 22,
    "title": "A finite sufficient set of conditions for catalytic majorization",
    "authors": [
      "David Elkouss",
      "Ananda G. Maity",
      "Aditya Nema",
      "Sergii Strelchuk"
    ],
    "abstract": "The majorization relation has found numerous applications in mathematics,\nquantum information and resource theory, and quantum thermodynamics, where it\ndescribes the allowable transitions between two physical states. In many cases,\nwhen state vector $x$ does not majorize state vector $y$, it is nevertheless\npossible to find a catalyst - another vector $z$ such that $x \\otimes z$\nmajorizes $y \\otimes z$. Determining the feasibility of such catalytic\ntransformation typically involves checking an infinite set of inequalities.\nHere, we derive a finite sufficient set of inequalities that imply catalysis.\nExtending this framework to thermodynamics, we also establish a finite set of\nsufficient conditions for catalytic state transformations under thermal\noperations. For novel examples, we provide a software toolbox implementing\nthese conditions.",
    "published_date": "2025-02-27",
    "source": "arxiv"
  }
}