{
  "id": "arxiv_2502.21246v1",
  "text": "Learning-Driven Annealing with Adaptive Hamiltonian Modification for Solving\nLarge-Scale Problems on Quantum Devices\nSebastian Schulz,1, ∗Dennis Willsch,1, 2 and Kristel Michielsen1, 3, 4\n1J¨ulich Supercomputing Centre, Institute for Advanced Simulation,\nForschungszentrum J¨ulich, 52425 J¨ulich, Germany\n2Faculty of Medical Engineering and Technomathematics, University of Applied Sciences Aachen,\n52428 J¨ulich, Germany\n3AIDAS, 52425 J¨ulich, Germany\n4RWTH Aachen University, 52056 Aachen, Germany\n(Dated: March 3, 2025)\nWe present Learning-Driven Annealing (LDA), a framework that links individual quantum an-\nnealing evolutions into a global solution strategy to mitigate hardware constraints such as short\nannealing times and integrated control errors. Unlike other iterative methods, LDA does not tune\nthe annealing procedure (e.g. annealing time or annealing schedule), but instead learns about the\nproblem structure to adaptively modify the problem Hamiltonian. By deforming the instantaneous\nenergy spectrum, LDA suppresses transitions into high-energy states and focuses the evolution into\nlow-energy regions of the Hilbert space. We demonstrate the efficacy of LDA by developing a hybrid\nquantum-classical solver for large-scale spin glasses. The hybrid solver is based on a comprehensive\nstudy of the internal structure of spin glasses, outperforming other quantum and classical algorithms\n(e.g., reverse annealing, cyclic annealing, simulated annealing, Gurobi, Toshiba’s SBM, VeloxQ and\nD-Wave hybrid) on 5580-qubit problem instances in both runtime and lowest energy. LDA is a step\ntowards practical quantum computation that enables today’s quantum devices to compete with\nclassical solvers.\nKeywords: Quantum computing, Quantum annealing, Learning-driven annealing, Feature Hamiltonian, Hy-\nbrid quantum-classical optimization, Spin glass\nI.\nINTRODUCTION\nCombinatorial\noptimization\nproblems\n(COPs)\nare\nubiquitous in computer science, with important applica-\ntions in finance [1], scheduling [2], machine learning [3, 4],\ncomputational biology [5], and operations research [6].\nFor many such problems, finding the optimal solution\nis equivalent to finding the ground state of an associ-\nated Ising spin-glass system [7]. The hardness of COPs\nis related to the presence of opposing spin interactions,\nleading to frustration and a glass phase. The latter is\ncharacterized by the presence of many low-energy local\nminima, that are separated by large energy barriers. This\nmakes solving large-scale COPs often intractable on clas-\nsical computers, quickly exceeding runtimes of 24 hours.\nWith the advent of new generations of quantum an-\nnealers from D-Wave Systems Inc. comprising more than\n5000 qubits, a promising approach is the use of quantum\nannealing (QA) [8–10]. Inspired by the cooling of physi-\ncal systems, QA uses quantum fluctuations caused by a\ntransverse field to navigate the energy landscape of the\nspin system [11]. If the quantum evolution is performed\nadiabatically, the system arrives in the ground state of\nthe spin glass. However, if the evolution is too fast, the\nsystem scatters into higher energy states through a se-\nries of quantum phase transitions (QPTs, used in the\nsense of Refs. [12–15]). Hence, on real devices, finite an-\n∗Corresponding author: Sebastian Schulz; se.schulz@fz-juelich.de\nnealing times and integrated control errors limit the per-\nformance, often making deep low-energy states (includ-\ning the ground state) inaccessible [16, 17]. To address\nthis issue, several authors recently investigated iterative\nprocedures, such as reverse annealing [18–21] and cyclic\nannealing [22–24], in which the annealing is repeatedly\ninitialized from the best known classical state.\nIn do-\ning so, the hope is that QA gradually converges to the\nground state, but in practice, these procedures often fail,\nas they become stuck in high-energy valleys [25, 26].\nWe show that modifications to the problem Hamilto-\nnian itself can greatly improve the performance of itera-\ntive QA on noisy hardware. With Learning-Driven An-\nnealing (LDA), we propose a framework to link individual\nQA runs into a global solution strategy to mitigate hard-\nware constraints such as finite annealing times and inte-\ngrated control errors [27]. LDA works by analyzing the\nstates sampled from QA to adaptively modify the prob-\nlem Hamiltonian to the information learned about the\nenergy landscape. This energetically isolates low-energy\nvalleys in the instantaneous energy spectrum, focussing\nsubsequent annealing runs into a promising region of the\nHilbert space. As a result, the QPU can reach deeper\nregions of the energy spectrum that are otherwise inac-\ncessible, enabling NISQ devices to tackle any COP that\ncan be embedded onto their hardware.\nWe demonstrate the capabilities of LDA by design-\ning a hybrid quantum-classical solver for large-scale spin\nglasses, that is based on alternating local and global\nsearch protocols.\nUsing the D-Wave Advantage 5.4\nQPU [28] in J¨ulich, Germany, we benchmark our hybrid\narXiv:2502.21246v1  [quant-ph]  28 Feb 2025\n\n\n2\nsolver against leading quantum and classical algorithms,\nincluding reverse annealing [18], cyclic annealing [22, 23],\nsimulated annealing using JUPTSA [29], Gurobi [30],\nToshiba’s SBM [31], VeloxQ [32] and D-Wave hybrid [33],\non 5580-qubit NAT-7 [34, 35] spin glasses. The results\nshow that our hybrid solver outperforms all competing\nstrategies in both runtime and lowest energy.\nLDA is\na step towards practical quantum computation that en-\nables today’s quantum annealers to compete with classi-\ncal solvers.\nThe remainder of this paper is organized as follows: In\nSec. II, we introduce the spin-glass formulation and pro-\nvide insights into its underlying structures. Section III\nconcerns adiabatic quantum evolutions and discusses its\nlimitations on modern quantum annealers. In Sec. IV, we\nintroduce the LDA framework, showcasing how learned\ninformation from sampled states can be used to guide the\nannealing evolution by modifying the problem Hamilto-\nnian. In Sec. V, we demonstrate how LDA can be used\nin advanced algorithms by designing a hybrid solver for\nspin glasses based on alternating local and global search\nprotocols. Finally, in Sec. VI, we benchmark our hybrid\nsolver against various classical and quantum solvers, fol-\nlowed by a summary of our findings in Sec. VII.\nII.\nSPIN-GLASS PROBLEMS\nSpin glasses (SG) are magnetic systems of quenched\ndisorder, imposing conflicts between interacting mag-\nnetic moments [36]. In the Edwards-Anderson model of\nSG [37], N Ising spins σz\ni , i ∈{0, . . . , N −1}, are placed\non the sites of a regular graph, with the Hamiltonian\ndefined as\nH =\nX\ni<j\nJijσz\ni σz\nj +\nX\ni\nhiσz\ni .\n(1)\nHere Jij with i < j denotes the coupling strength be-\ntween spins i and j, and hi represents a locally applied\nexternal magnetic field bias on spin i.\nWe consider both triangular lattices with periodic\nboundary conditions (see Fig. 1a) and the Pegasus\ngraph used by the D-Wave Advantage 5.4 quantum an-\nnealer [28]. In the following, we choose |hi| ≪|Jij| to\nensure the generation of complex SG [38]. Notably, for\nhi = 0, H exhibits a global Z2 symmetry.\nThroughout this study, we use Greek letters, e.g.\nα = αN−1 · · · α1α0, to represent a generic eigenstate of\nEq. (1), with αi = ±1 denoting the polarization of the\ni-th spin. We also use the notation α∗= α∗\nN−1 · · · α∗\n1α∗\n0\nto refer to a local (in Hamming distance) minimum of\nEq. (1). The eigenenergy of a state α is given by Eα =\nP\ni<j Jijαiαj + P\ni hiαi and its bit string representation\nis written as a = aN−1 · · · a1a0, with ai = (1 + αi)/2.\nFor a given state α, we define the set of satisfied (i.e.,\nnon-frustrated) couplers and biases as\nJ α = {(i, j) | Jijαiαj < 0},\n(2a)\nHα = {i | hiαi < 0}.\n(2b)\nThese sets consist of those couplings and biases of Eq. (1)\nthat are satisfied in the state α, meaning that the cor-\nresponding terms in the Hamiltonian contribute to a re-\nduction of the total energy of the system.\nIntuitively, the presence of competing spin-spin inter-\nactions in Eq. (1) causes frustration, which prevents the\nground state from establishing a simple long-range (anti-\n)ferromagnetic order.\nInstead, the spins align in ran-\ndom directions, forming a glass phase [39]. This phase\nis characterized by the existence of exponentially many\nlow-energy local minima, where a local minimum refers\nto a state for which flipping a single (or a few) spins al-\nways increases the energy. The energy spectrum of these\nlocal minima typically has small gaps, with macroscopic\nhigh and wide energy barriers separating them [40]. The\nlatter implies that O(N) spins would need to be flipped\nin order to escape a local minimum [36].\nDespite the\ncomplexity of the energy landscape, the formation of lo-\ncal minima stems from a general structure in the inter-\nactions of the spins. Local differences in the spin-spin\ncouplings and biases lead to the formation of spin do-\nmains D1, . . . , DNdom ⊂{0, . . . , N −1}, representing\ngroups of highly correlated spins [36, 41].\nA.\nSpin domains\nWe define a spin domain Dk ⊂{0, . . . , N −1}, with\nk = 1, . . . , Ndom, as a maximally large connected sub-\nspin glass of Eq. (1), such that its energy landscape is er-\ngodic with respect to spin-reversal transformations. This\nmeans that the ground state of the domain is accessible\nfrom any state through a sequence of decreasing energies\nusing solely single spin flips and state inversions (i.e. flip-\nping all spins). In computational terms, ergodic means\nthat the global minimum of the domain can be reached\nvia a greedy search algorithm. Note that a domain can\nconsist of a single spin if the local magnetic field hi dom-\ninates the interaction. An example 24-qubit spin glass\nwith Ndom = 3 domains is shown in Fig. 1a. The re-\nspective energy spectra of the spin domains are given in\npanels (a.1-3).\nEach spin domain Dk identifies a trivial sub-spin glass,\ndefined by the quadratic terms i, j ∈Dk within the do-\nmain,\nX\ni,j∈Dk\nJijσz\ni σz\nj .\n(3)\nThis sub-spin glass has two degenerate ground states\nβ∗(k) and β∗(k), due to the Z2 symmetry of the spin-\nspin couplers, with β∗(k) denoting the inverse state of\nβ∗(k) (i.e., all spins flipped). By combining the ground\n\n\n3\nFIG. 1. A 24-qubit spin-glass with Ndom = 3. (a) Spin-glass graph with the biases hi as nodes and couplers Jij as edges. Dashed\nedges indicate periodic boundary conditions. The colored rectangles represent the spin domains: D1 (green), D2 (purple), and\nD3 (orange). Each domain has two distinct minima: α and α (D1), β and β (D2), γ and γ (D3). Panels (a.1-3) show the\neigenenergies E of the corresponding domains as a function of the Hamming distance dham to the respective ground state\nα, β, γ. (b) Hypercube representation of the Hilbert space, with each axis representing the Hamming distance dham from the\nground state (α, β, γ) of the respective spin domains Dk. Color indicates the lowest eigenenergy at each point. The corners of\nthe hypercube correspond to the 2Ndom = 8 local minima of the spin glass. (c) Energy landscape of the spin glass obtained\nby unfolding the hypercube facets. Each point is projected onto the closest facet (smallest Hamming distance), with the blue\nsurface representing the lowest eigenenergies on these facets. The eight local minima are marked by colored diamonds at the\nfacets’ corners, with the states surrounding it being the energy valleys. Additionally, black dots indicate 2000 samples from\na quantum annealing simulation with annealing time T = 10, with the probability density shown on the lower orange plane.\nPanels (c.1-3) highlight the specific biases hi and couplers Jij satisfied by three of the eight local minima, with the unsatisfied\nterms set to 0 (white). The color scheme matches that of panel (a).\nstates of all domains, the 2Ndom local minima of the full\nspin glass can be constructed. Consequently, these lo-\ncal minima form an Ndom-dimensional hypercube, with\nthe edges denoting state inversions of single spin domains\n(see Fig. 1b).\nThe complexity of the spin-glass energy landscape\nstems from the domain borders, where spin domains cou-\nple to each other (i.e. spin-spin couplings Jij between do-\nmains) and to the local biases hi. These interactions lift\nthe degeneracies of the domains’ ground states, assigning\nenergy shifts to the local minima and forming a hierarchy\non the hypercube [42].\nFor the three-dimensional hypercube shown in Fig. 1b,\nFig. 1c visualizes the energy landscape obtained by un-\nfolding its facets. Note that the hardness of spin glasses\narises from the lack of knowledge about the exact do-\nmains Dk.\nIf the distribution of spin domains were\nknown, the complexity of the problem would be re-\nduced from 2N to 2Ndom with the number of domains\nNdom ≪N.\nB.\nDistance measures\nFor the following description of LDA, a distance mea-\nsure between arbitrary spin configurations α and β is\nrequired. A commonly used metric for this purpose is\nthe Edward-Anderson order parameter [37], measuring\nthe overlap of the states α and β as\nqEA(α, β) = 1\nN\nN−1\nX\ni=0\nαiβi.\n(4)\nBy definition, qEA ∈[−1, 1], with qEA = 1 ⇔α = β and\nqEA = −1 ⇔α = β. Note that qEA is directly related\nto the Hamming distance dham between the bit strings a\nand b via dham = N(1 −qEA)/2.\nWhile qEA is a sufficient tool for the statistical anal-\nysis of phase transitions in disordered systems [43], it\nis indifferent to the distance between the energies Eα\nand Eβ of the states. This means that two states with\nthe same order parameter qEA can have significantly dif-\nferent energies, depending on the amount of frustration\nthat they cause. To compensate for this, we propose a\nquantity qF (α, β) that evaluates the similarity between a\nreference state α and a state β based on the sets of simul-\ntaneously satisfied couplers J α ∩J β and biases Hα ∩Hβ\n\n\n4\nFIG. 2.\nComparison of the quanitiy qF (α∗, β) to (a) the\nEdward-Anderson order parameter qEA(α∗, β) and (b) the en-\nergy difference ∆E = Eβ −Eα∗for states β w.r.t. the global\nminimum α∗of the 24-qubit spin-glass shown in Fig. 1a. The\ncolored diamonds mark the eight local minima (see Fig. 1c).\n(see Eq. (2)), defined as\nqF (α, β) =\nP\n(i,j)∈J α∩J β\nwith (αi,αj)=(βi,βj)\n|Jij| +\nP\ni∈Hα∩Hβ |hi|\nP\n(i,j)∈J α |Jij| + P\ni∈Hα |hi|\n.\n(5)\nBy definition, qF ∈[0, 1], with qF = 1 (0) denoting that\nHβ ⊂Hα \u0000Hβ ∩Hα = ∅\n\u0001\nand J β ⊂J α \u0000J β ∩J α = ∅\n\u0001\n.\nWe remark that in the singular case Hα = J α = ∅, we\ndefine qF = 1. The additional condition αi = βi in the\nfirst summation of Eq. (5) ensures that the spins in the si-\nmultaneously satisfied couplers Jij are also aligned with\none another, (αi, αj) = (βi, βj). This is necessary be-\ncause Jijαiαj = Jijβiβj < 0 would also be satisfied if\n(αi, αj) = (βi, βj). Hence, the condition lifts the spin-\nreversal symmetry of the spin domains, in order to ac-\ncount for the Hamming distance between the states.\nThe definition of qF is based on the observation that\neach local minimum α∗can be uniquely identified (up to\nstate inversion in case of hi = 0) by the sets of satisfied\ncouplers J α∗and biases Hα∗(see Fig. 1c.1-3, where the\nlocal minima satisfy different couplers between the do-\nmains). By ranking each state according to its energy in\nthe sub spin-glass\n\u0000J α∗, Hα∗\u0001\n, the parameter qF inte-\ngrates both the Hamming distance (qEA) and the energy\ndistance (∆E) from α∗into the similarity measure (see\nFig. 2a). This allows qF to distinguish the energy valley\nof α∗(i.e. the neighborhood of states around α∗, where\nsome domains are in an excited state) from the other lo-\ncal minima in Fig. 1c. As a result, only states with both\na small Hamming distance and energy distance are con-\nsidered close to α∗, making qF indifferent to low-energy\nstates of other energy valleys (see peaks at ∆E ≈0 in\nFig. 2b).\nA key property of qF is its asymmetry (i.e. qF (α, β) ̸=\nqF (β, α)), since Eq. (5) considers only terms that are\nsatisfied by the reference state α, but ignores additional\nterms satisfied by β. As a consequence, a state β deeper\nin the energy valley, with J β ⊃J α and Hβ ⊃Hα, typ-\nically has a larger qF value than a higher-energy state,\nwhich violates terms in Hα and J α. This means that qF\nhas an intrinsic bias towards lower-energy states, which\nwill be crucial for the definition of LDA in Sec. IV.\nIII.\nADIABATIC QUANTUM ANNEALING\nAdiabatic quantum annealing, as proposed by Farhi\net al. [44], is a procedure for solving NP-hard combi-\nnatorial optimization problems (COP) through quantum\nfluctuations.\nWith the search space of the COP en-\ncoded in the eigenspectrum of a problem Hamiltonian\nHP (e.g. Eq. (1)), the system is complemented by a driv-\ning Hamiltonian HD that is non-diagonal in the eigen-\nbasis of HP . Since the spin-glass Hamiltonian Eq. (1)\nis diagonal in the computational basis, we consider the\ntransverse field Ising model\nHQA(t) = HP + Γ(t) · HD with HD = −\nN−1\nX\ni=0\nσx\ni ,\n(6)\nwhich is closely related to the design of D-Wave quantum\nannealers (see App. A). Γ(t) is the annealing schedule,\ndefining the relative strength between HP and HD over\ntime 0 ≤t ≤T. Initially, Γ(t = 0) ≫J, such that the\ninstantaneous ground state (GS) is approximately given\nby |+⟩\nN N (where |+⟩= (|0⟩+|1⟩)/\n√\n2), which is initially\nseparated by a large energy gap ∝Γ(0) from the rest of\nthe spectrum. Operating the system at a temperature\nthat is much smaller than the scale set by Γ(0) is sup-\nposed to initialize it in the GS of HD. To reach the GS\nof HP , Γ(t) is decreased adiabatically to zero as t →T,\nallowing the system to follow the instantaneous GS of\nHQA(t) [44, 45]. In order to prevent Landau-Zener tran-\nsitions into excited states during this process, the adia-\nbatic theorem requires T −1 ≪∆2\nmin [46], where ∆min\ndenotes the minimal energy gap between the two lowest\ninstantaneous eigenstates of HQA(t).\nThe minimum annealing time T is the main measure\nfor the computational complexity of adiabatic quantum\nannealing. Significant evidence exists that the presence of\nfirst-order quantum phase transitions (QPTs) during the\nadiabatic evolution causes an exponentially fast closure of\n∆min with the system size N, resulting in exponentially\nlong annealing times [12, 13]. The authors in [41] argue\nthat ∆min scales inversely proportional to the square root\nof the number of competing local minima (and states near\nthem) with energies close to the global minimum and\na large Hamming distances dham. Regarding the spin-\nglass instances under investigation, the number of local\n\n\n5\nFIG. 3. (a) Instantaneous energy spectrum of the transverse\nfield Ising model (see Eq. (6)) for the 24-qubit spin-glass in-\nstance shown in Fig. 1a, using a linear annealing schedule Γ(t).\nThe plot presents a selection of energy levels corresponding to\nthe 8 valleys in the energy landscape (see Fig. 1c). For each\nvalley, the local minimum (solid lines) is shown along with\nthree states at Hamming distance dham = 1 (dashed line)\nand three states at dham = 2 (dash-dotted lines), representing\nthe lowest-energy states along the edges of the hypercube. (b)\nAdiabatic ratios (see Eq. (7)) for the states presented in panel\n(a). The 24-qubit eigenstates and eigenvalues in the vicinity\nof each local minimum were obtained numerically by solving\nthe time-dependent Schr¨odinger equation (see e.g. [47]) for\nreverse-annealing starting in the given states.\nminima scales exponentially, 2Ndom, with the number of\ndomains Ndom ∝N.\nFigure 3a presents the instantaneous energy spectrum\nof the 24-qubit spin-glass instance shown in Fig. 1a, with\nthe adiabatic ratio [48]\ng(t) = |⟨m(t)| ˙HQA(t) |GS(t)⟩|\n|Em(t) −EGS(t)|2\n(7)\ndepicted in Fig. 3b for the states marked in Fig. 1c. Here,\n|m(t)⟩(|GS(t)⟩) denotes the instantaneous m-th excited\n(ground) state, ˙HQA(t) is the t derivative of the instan-\ntaneous Hamiltonian and Em(t) (EGS(t)) corresponds to\nthe eigenenergies of the m-th excited (ground) state.\nIn agreement with [14, 49], the system undergoes a\nsecond-order QPTs at tc/T ≈0.45, by evolving from the\nparamagnetic phase (localized in the σx basis) to an or-\ndered phase (localized in the σz basis). As a result, the\ninstantaneous eigenstates become semi-localized within\nenergy valleys, forming superpositions of computational\nstates within each valley [12]. During the QPT, these\nvalleys are coupled, as indicated by the peaks in g for\nthe 8 global and local minima (see solid lines in Fig. 3b).\nAdditionally, the instantaneous energy spectrum exhibits\ntransitions between states within the same valley. Since\nthese states differ by small Hamming distances, they re-\nmain coupled after the second-order QPTs for t > tc (see\nblue dashed and dashed-dotted curves in Fig. 3b).\nWhile the second-order QPT is generally associated\nwith a polynomial scaling of T, the presence of addi-\ntional anti-crossings at t > tc between semi-localized\nstates in large spin-glass instances induces first-order\nQPTs [12, 49].\nThese transitions are characterized by\nenergy gaps ∆that close exponentially with system size\nN, leading to an exponential scaling of T [13, 14]. Re-\ncently, locally optimized annealing procedures have been\nproposed, which reduce T by decelerating Γ(t) at the\nvicinity of the QPT [50, 51]. However, these strategies\ncan only provide a quadratic speedup [41]. Since the re-\nquired annealing times still exceed the accessible range\non real devices, it is in practice impossible to solve large\nspin glasses using a single annealing run.\nTo overcome this bottleneck, several authors proposed\nthe use of iterative protocols to incorporate classical in-\nformation about the ground state into the annealing pro-\ncess [20, 22, 24]. The reverse annealing protocol, as pro-\nposed by Chancellor [18] and Yamashiro et al. [19], has\nbeen implemented on D-Wave QPUs. It starts by initial-\nizing the system in a computational basis state (e.g. ob-\ntained by a previous anneal or a classical heuristic), with\nΓ = 0. Quantum fluctuations are slowly introduced by\nincreasing Γ to an intermediate value ˜Γ at t = Ts, where\nthe process is paused for a period τ until t = Te. The\nprotocol finishes by annealing back to Γ = 0 and measur-\ning the qubits. By repeating this cycle and initializing\neach reverse anneal by the measurement of the previous,\niterative reverse annealing (IRA) is hoped to move the\nsystem closer to the true ground state and overcome the\nabove-mentioned limitation of an exponential annealing\ntime T.\nIn practice, however, reverse annealing performs a dis-\nsipative local search into the neighborhood of the ini-\ntial state [25].\nThe spread of this search is controlled\nby the inversion point ˜Γ and the QPTs it traverses. If\nno QPT is crossed, the system spreads locally (in Ham-\nming distance) within its energy valley. However, if ˜Γ\nis chosen large enough, such that a QPT is crossed, the\nsystem explores the search space globally by tunneling\ninto other energy valleys [18]. Note that T must be suf-\nficiently short, such that the process is non-adiabatic,\nbecause otherwise the system would simply return to its\ninitial state.\nIn a closed system, there is no direct mechanism in the\nreverse annealing protocol to favor the search of lower-\nenergy states [25]. Instead, the system spreads uniformly\nin energy around the initial state, gravitating (over mul-\n\n\n6\ntiple iterations) towards an equilibrium state, where the\nnumber of states with lower and higher energies balance.\nThis makes it exponentially hard to find the ground state\nfor N ≫1.\nOn real devices, however, the QPU is always in inter-\naction with its surrounding environment. In such open\nsystems, thermal relaxation moderates the transition be-\ntween neighboring states [21, 52].\nAt sufficiently low\ntemperatures, this causes a repopulation of lower-energy\nstates during the pause, which allows reverse annealing\nto improve on the initial state. Passarelli et. al. [26] ar-\ngue that thermal relaxation is the main mechanism driv-\ning the performance of reverse annealing.\nThis means\nthat the success of IRA depends mainly on the effec-\ntive temperature of the QPU. This gives an intuition as\nto why the D-Wave Advantage 5.4 QPU operating at\n≈16.4mK [28] is not able to find the ground state of the\nlarge spin glasses under investigation through IRA (see\nSec. VI).\nIV.\nLEARNING-DRIVEN ANNEALING\nWith Learning-Driven Annealing (LDA) we introduce\na framework for linking individual QA runs into a global\nsolution strategy to mitigate hardware limitations, such\nas finite annealing times and integrated control errors.\nLDA differs from other iterative strategies in that it\ndoes not tune the annealing procedure (e.g. annealing\ntime or annealing schedule), but instead learns about\nthe problem structure (i.e. spin domains) to systemat-\nically modify the problem Hamiltonian. LDA acts on the\ninstantaneous energy spectrum in order to change the\nstrength of QPTs between the energy valleys. This fo-\ncuses the annealing evolution into a low-energy region of\nthe Hilbert space by suppressing QPTs into high-energy\nvalleys.\nLDA achieves this by replacing the problem\nHamiltonian with a so-called feature Hamiltonian in the\nforward anneal. The construction of this Hamiltonian is\nbased on the definition of the quantity qF (see Eq. (5))\nand adapts the strength of biases and couplers in HP\nbased on learned information about the domain struc-\nture to energetically isolate low-energy valleys in the in-\nstantaneous energy spectrum. This allows the annealing\nevolution to successively reach deeper states in the energy\nlandscape.\nThe feature Hamiltonian, denoted as HF (α), is defined\nw.r.t. a classical state α = αN−1 · · · α1α0 for a spin glass\ninstance P = (h, J) as\nHF (α) =\nX\n(i,j)∈J α\nKij +\nX\ni∈Hα\nhiσz\ni\n(8)\nKij = −|Jij|\n2\n\u0002\nαiαjσz\ni σz\nj + αiσz\ni + αjσz\nj\n\u0003\n.\n(9)\nHα and J α denote the sets of satisfied biases and cou-\nplers, respectively (see Eq. (2b) and (2a)). HF (α) trans-\nforms the energy spectrum of P by retaining only terms\nthat are satisfied by α in P. This deforms the energy\nlandscape according to the quantity qF (see Eq. (5)), by\narranging the states based on both their Hamming dis-\ntance and energy distance from α, with α becoming the\nnew ground state (see Thm. B.1).\nIn Eq. (8) we use the transformation Jijσz\ni σz\nj −→Kij\nto lift the Z2 symmetry of the spin-spin couplers Jij by\nintroducing a penalty if either of the two spins i and j\ndoes not match the reference state α, i.e.,\nKij |αi, αj⟩= −3\n2|Jij|,\nKij |αi, αj⟩= 1\n2|Jij|\n(10)\nKij |αi, αj⟩= 1\n2|Jij|,\nKij |αi, αj⟩= 1\n2|Jij|.\n(11)\nNote that the weighting of the biases hi and couplers\nJij remains unchanged compared to the original problem\nHamiltonian by using energy gaps of 2|hi| and 2|Jij|, re-\nspectively. This transformation corresponds to the con-\ndition αi = βi in Eq. (5) and removes the degeneracy\nof the spin domains (i.e., each domain now has only one\nGS). Since the domain’s degeneracy is responsible for the\nexistence of energy valleys (see Fig. 1c), removing the Z2\nsymmetry flattens the energy landscape, while the re-\nstriction of HF (α) to Hα and J α deforms the landscape\nin the direction of the reference state α (see Fig. 4b.1).\nAs a result, the energy landscape becomes monotonic as\na function of Hamming distance from α (see Thm. B.2\nin App. B). Using a forward anneal, LDA explores the\nhypercube locally around α, with measurement proba-\nbilities scaling in the quantity qF .\nThe exploration of the hypercube around α through\nLDA is based on the elements of Hα and J α, referred to\nas features, which energetically define the region of the\nhypercube where the annealing evolution concentrates.\nThese features represent the extent of information pro-\nvided by α regarding the location of a nearby local min-\nimum α∗. If α is a high-energy state, most biases and\ncouplers in P are frustrated, leading to a highly degen-\nerate HF (α) with an almost flat energy landscape. In\nthis case, the evolution spreads over large distances qF ,\nexploring the hypercube globally, as nearly any combi-\nnation of spin flips reduces the system’s energy.\nThis\nsituation changes as α approaches a local minimum α∗.\nAs the overlap between the sets of satisfied terms of α\nand α∗increases, HF (α) incorporates more features that\ncharacterize the local minimum, resulting in an increas-\ningly deformed energy landscape that focuses the evolu-\ntion locally around α in the hypercube. Consequently,\nthe search slows and becomes more fine-grained as LDA\ngains greater certainty about the location of a nearby\nlocal minimum.\nAnalogously to the asymmetry of the quantity qF (see\nEq. 5), LDA inherently favors the sampling of low-energy\nstates in P. This is because, a state β that is located\ndeeper in the energy valley than α (i.e. it is closer to the\nlocal minimum α∗in terms of qF ), typically satisfies all\nthe biases and couplers satisfied by α, along with addi-\ntional terms. Consequently, Hα ⊆Hβ and J α ⊆J β,\n\n\n7\nFIG. 4. Construction of HF M (e, Eq. (15)) for the 24-qubit spin-glass instance shown in Fig. 1, with λ = 0.1. The feature\nHamiltonian HF (b) is derived from four sampled states (a.1-4) using Eq. (12) and the bitmask M, with mi = 1 if the sampled\nstates agree in the i-th bit (this is the case for all non-white nodes shown in panel (b)). Panels (c) and (d) depict subsets of the\noriginal problem Hamiltonian, constructed using Eq. (14), with (c) applying to the terms included in HF , and (d) addressing\nthe remaining biases and couplers. Panels (b-e.1) illustrate the corresponding energy landscapes of the Hamiltonians in (b-e),\nwith the four sampled states shown as black dots in (b.1).\nthus qF (α, β) = 1.\nThis means that β is often either\na degenerate GS or a weakly excited state of HF (α). In\ncontrast, a higher-energy state in P necessarily frustrates\nsome terms satisfied by α, rendering it an excited state\nin HF (α). This intrinsic bias increases the probability\nof sampling lower-energy states, thereby driving the sys-\ntem towards a local minimum on average. This property\ncontrasts with IRA, whose ability to find lower-energy\nstates depends entirely on thermal relaxations in open\nsystems [25, 52].\nIt is important to note that terms frustrated by the\nlocal minimum α∗in P (e.g., within a spin domain) can\ncounteract the sampling of lower-energy states. Consider,\nfor example, a state α that satisfies some features violated\nby a domain’s ground state. As a result, states deeper\nin the energy valley (including the local minimum α∗)\nwill violate these features (i.e. Hα ̸⊂Hα∗and/or J α ̸⊂\nJ α∗). Consequently, lower-energy states become excited\nstates of HF (α) (similar to higher-energy states), causing\nLDA to sample more uniformly across both lower and\nhigher energies. This behavior is akin to overfitting in the\ncontext of machine learning. To address this overfitting\nissue in LDA, we restore the original problem description\nP in a subset of the feature Hamiltonian HF (α), yielding\nHF (α, M) =\nX\n(i,j)∈J α\nwith mi=mj=1\nλ · Kij +\nX\ni∈Hα\nwith mi=1\nλ · hiσz\ni ,\n(12)\nHP (M) =\nX\ni<j\n(\n(1 −λ) · Jijσz\ni σz\nj ,\nif mi, mj = 1\nJijσz\ni σz\nj ,\nelse\n(13)\n+\nX\ni\n(\n(1 −λ) · hiσz\ni ,\nif mi = 1\nhiσz\ni ,\nelse\n(14)\nHF M(α, M) = HF (α, M) + HP (M)\n(15)\nwith the bitmask M = mN−1 . . . m1 m0 controlling\nthe mixing of HP and HF (α) and the mixing strength\nλ ∈[0, 1]. HF M restores the original energy relationship\nbetween the states in a local subspace of the hypercube,\nwhile maintaining the deformed energy landscape out-\nside. If M is chosen appropriately (e.g. only the bits\nwhere a set of sampled states differ), this can be used to\nmitigate the overfitting issue by lowering the energy of\ndesired states relative to α in HF M, hence increasing the\nlikelihood of finding a lower-energy state in P. Note that\nα is not necessarily a GS of HF M anymore.\nFigure 4 presents an example of HF M derived from\nfour sampled states (black dots in Fig. 4b.1), where M\nhas a ’1’ at each bit position where the sampled states\nalign. The corresponding feature Hamiltonian HF is de-\npicted in Fig. 4b, transforming the rough energy land-\nscape of the 24-qubit spin glass (see Fig. 1c) into a mono-\n\n\n8\ntonic landscape (see Fig. 4b.1). Since the sampled states\nmainly disagree on the features of the first domain, the\nenergy landscape remains nearly flat between α and α.\nBy utilizing the original problem Hamiltonian HP in this\ndomain (see Fig. 4d), HF M identifies the locations of the\nlocal minima |α, β, γ⟩and |α, β, γ⟩, thereby concentrat-\ning the annealing evolution into these two valleys (see\nFig. 4e.1).\nV.\nHYBRID OPTIMIZATION\nLDA gives control over the exploration of the Hilbert\nspace in quantum annealing by integrating learned infor-\nmation about the domain structure into the design of the\nproblem Hamiltonian. By modifying the instantaneous\nenergy spectrum, LDA energetically isolates local min-\nima and creates a monotonic energy landscape. Conse-\nquently, QPTs can be selectively suppressed, restricting\nthe quantum evolution to a subspace of the hypercube.\nIn this section, we demonstrate how LDA can be used\nin advanced protocols to solve hard spin-glass instances.\nWe introduce two algorithms, the local search and the\nglobal search protocol, which use an iterative application\nof LDA. Our hybrid optimizer is constructed as an alter-\nnating series of these two algorithms.\nA.\nLocal search protocol\nThe local search protocol is designed to converge from\nan initial state α0 to a nearby local minimum α∗through\nan iterative application of LDA. The protocol consists of\ntwo phases, a distribution and a convergence phase.\nIn the distribution phase, the protocol generates states\nthat spread evenly around the initial state α1 (possi-\nbly with higher energies), by biasing the evolution only\nweakly (i.e. λ ≪1). The goal is to identify those fea-\ntures from α0 that characterize α∗, while ignoring terms\nthat are violated in the spin domain ground states. The\nassumption is that the common features among the sam-\npled states define a subset of Hα∗and J α∗, providing a\nsearch area in the energy landscape where the protocol\nassumes α∗to be located in. In the second phase, the\nprotocol then converges towards α∗, by focussing the an-\nnealing evolution onto the search area. This is achieved\nby deforming the energy landscape outside the area us-\ning HF (i.e. λ ≈1). Over multiple iterations of LDA,\nthe sets of sampled states gradually reveal the elements\nof Hα∗and J α∗, shrinking the search area until the local\nminimum is found.\nEach iteration i of the protocol begins with the con-\nstruction of HF M(αi, Mi) (see Eq. (15)) using the\nlowest-energy state αi and the bitmask Mi derived from\nthe previous iteration.\nFor the first iteration (i = 0,\ndistribution phase), M0 = 1 . . . 11 is used. The hyper-\nparameter λ controls the amplification of extracted fea-\ntures in HF M. It functions as an inverse temperature,\nFIG. 5. Two iterations of the local search protocol applied\nto the 24-qubit spin-glass instance shown in Fig. 1a.\nThe\nprotocol is executed with QT = 0.98 and NT = 5, using (a)\nλ = 0.2 for the first and (b) λ = 1.0 for the second iteration.\nThe top panels depict the energy landscape (E) of HF M in the\nfirst and second iteration, respectively. Black dots represent\n2000 samples from a quantum annealing simulation (T = 10),\nwith the probability density (P) shown on the bottom plane.\nRed dots indicate the subset T . The initial state α0 of the\nfirst iteration (panel a) is marked as a red dot in Fig. 1c. The\ncolor scales are consistent with those in Fig. 1c. Panels (a-b.1)\ndisplay the instantaneous energy spectrum of the transverse\nfield Ising model with HF M for each iteration. The energy\nlevels correspond to those in Fig. 3, where the color of the lines\nindicates the association to the eight valleys in the energy\nlandscape of HP .\nA linear annealing schedule Γ(t) is used\nthroughout as an example. Panels (a-b.2) show the adiabatic\nratios g (see Eq. (7)) for the states shown in panels (a-b.1),\nrespectively.\nreflecting the confidence that the extracted features form\na subset of Hα∗and J α∗. The goal is to maintain α∗\nas a ground state of HF M throughout the iterations.\nTypically, a smaller λ indicates a wider spread of sam-\npled states, as the energy landscape is less deformed (see\n\n\n9\nFig. 5a). We use a geometric schedule\nλ(i) = λs ·\n\u0012λf\nλs\n\u0013\ni\nI−1\n,\n(16)\nthat scales between λs and λf, with I denoting the total\nnumber of Iterations.\nIn total, NS states are generated in each iteration and\nstored in the set S. To construct the bitmask M, the\nstates are sorted in increasing order of their energy in the\noriginal problem Hamiltonian HP . A loop then traverses\nthe states γ ∈S and includes them in a subset T if\n|T | ≤NT −1 < NS and qF (β, γ) ≤QT ∀β ∈T , where\nNT and QT are LDA parameters. The second condition\nensures that the states in T are uniformly distributed\naround α∗and do not cluster together.\nThe bitmask\nM = mN−1 . . . m1 m0 is determined by\nmi =\n(\n1,\nif |P\nβ∈T βi| = NT\n0,\nelse\n,\n(17)\nsuch that bit mi is only set if all states β ∈T have the\nsame bit βi, and αi+1 = S[0]. The protocol continues\niterating until αi = αi+1 or i = I −1, with αi being the\nlocal minimum. The full algorithm is detailed in Alg. 1.\nFigure 5 shows two iterations of the local search pro-\ntocol applied to the 24-qubit spin-glass instance depicted\nin Fig. 1a, using QT = 0.98 and NT = 5. The initial\nstate α1 is marked as a red dot in Fig. 1c. Figures 5a-b.1\ndemonstrate how the local search progressively identifies\nthe red curves as corresponding to the valley of the local\nminimum (α, β, γ), separating it in the instantaneous en-\nergy spectrum and suppressing QPTs into other valleys\n(shown in other colors). Consequently, the evolution is\nincreasingly confined around the local minimum, until it\nis sampled with high probability.\nB.\nGlobal search protocol\nThe global search protocol is designed to transition\nfrom an initial local minimum α∗to a state of a lower-\nenergy valley. The protocol differs from the local search,\nas it does not directly search around α∗, but uses this\nstate as a reference for LDA to gradually filter out higher-\nenergy valleys from the energy landscape. This allows\nthe protocol to overcome large energy barriers, finding\nlower-energy valleys even at large Hamming distances.\nNote that the protocol often identifies excited states of\nthe new valley, requiring a subsequent local search to\nlocate the corresponding local minimum.\nTo reach a new valley in the energy landscape, the\nglobal search transitions between the degenerate ground\nstates of at least one domain, by flipping its O(N/Ndom)\nspins in α∗.\nNotably, the procedure does not require\nknowledge about the domain locations, as the domain\nstructure is inferred from the hierarchy of local min-\nima [42]. This hierarchy arises from differences in domain\nProtocol 1 Local search\nInput: α1\n▷Initial state\nHP\n▷Problem Hamiltonian\nNS\n▷Size of S\nNT\n▷Size of T\nQT\n▷Max. similarity between states in T\nλs, λf\n▷Initial and final mixing strength\nI\n▷Number of iterations\nT\n▷Annealing time\nOutput: α∗\n▷Local minimum near α0\n1: procedure Local search\n2:\nM ←1 . . . 11\n3:\nfor i in range (0, I) do\n4:\nλ ←update λ (i)\n▷Eq. 16\n5:\nHF M ←generate HF M (HP , αi, M, λ)\n▷Eq. 15\n6:\nS ←sample (HF M, NS, T)\n7:\nT ←select samples (S, HP , NT , QT )\n8:\nM ←update M (T )\n▷Eq. 17\n9:\nαi+1 ←T [0]\n10:\nif αi = αi+1 then\n11:\nreturn αi\n12:\nreturn αI\nsizes and inter-domain couplings, leading to different en-\nergy gaps between domain ground states.\nThis means\nthat a set S of energetically similar sampled states (dis-\ntributed across many valleys) is more likely to align in do-\nmains where the two ground states are energetically well-\nseparated, than in domains that only weakly influence the\nstate energies. In such cases, the optimal ground state in\nthese domains can be partially derived from the aligned\nspins in S. Consequently, domains where the spins in S\nand α∗match indicate that α∗resides in the lower-energy\nground state. The bitmask M is then applied to focus\nthe annealing on the remaining domains. Through suc-\ncessive iterations, this strategy gradually substitutes the\nproblem Hamiltonian HP with the feature Hamiltonian\nHF (α∗), aligning the domains with α∗and eliminating\nQPTs into higher energy valleys. Eventually, HP is only\napplied to the subspace of suboptimal domains, such that\na state from a lower-energy valley can be sampled with\nhigh probability.\nThe protocol begins with the unmodified problem\nHamiltonian HF M = HP and M = 0 . . . 0 0. Running\nLDA NS times generates the set of sampled states S,\nfrom which the subset T is constructed analogously to\nthe local search protocol (see Sec. V A). Importantly, α∗\nis appended to T , and the bitmask M for the next iter-\nation is determined using Eq. (17). The protocol contin-\nues until a state with lower energy than α∗is identified\nor i = I −1. Notably, λ ≈1 is used for fast convergence.\nThe complete algorithm is presented in Alg. 2.\nIt is worth noting that the protocol may return to the\n\n\n10\nFIG. 6. Two iterations of the global search protocol applied\nto the 24-qubit spin-glass instance shown in Fig. 1a, using\nQS = 0.98, Qα∗= 0.9, NT = 5, and λ = 1.0.\n(a) and\n(b) depict the energy landscape (E) of HF M during the first\nand second iterations, respectively. Black dots represent 2000\nsamples from a quantum annealing simulation (T = 10), with\nthe probability density (P) projected onto the bottom plane.\nGreen dots indicate the subset T . Green, brown and yellow\ndots indicate T from the first iteration with HF M = HP in\nFig. 1c.\n|α, β, γ⟩is the initial local minimum α∗(red dia-\nmond). The color scales are consistent with those in Fig. 1c.\nPanels (a-b.1) display the instantaneous energy spectrum of\nthe transverse field Ising model with HF M for each iteration.\nThe energy levels correspond to those in Fig. 3, where the\ncolor of the lines indicates the association to the eight valleys\nin the energy landscape of HP . A linear annealing schedule\nΓ(t) is used throughout as an example. Panels (a-b.2) show\nthe adiabatic ratios g (see Eq. (7)) for the states shown in\npanels (a-b.1), respectively.\noriginal valley of α∗. To mitigate this, we impose the\ncondition qF (α∗, β) ≤Qα∗∀β ∈T , where the hyper-\nparameter Qα∗denotes the maximum similarity between\nthe selected states and α∗, effectively ensuring a minimal\nHamming distance between them. This acts as a search\nradius, with smaller Qα∗values generally leading to val-\nleys farther from α∗. This condition can also be applied\nto previously identified local minima to guarantee the\nexploration of an unvisited valley.\nFigure 6 presents two iterations of the global search\nprotocol applied to the 24-qubit spin-glass instance de-\npicted in Fig. 1a, using parameters QT = 0.98, Qα∗=\n0.9, NT = 5 and λ = 1.0. The state (α, β, γ) (red di-\namond) is selected as the initial local minimum α∗. In\nthe first iteration (see Fig. 6a), the protocol identifies α\nas the optimal ground state of the first domain, followed\nby identifying γ as the optimal ground state of the third\ndomain in the second iteration (see Fig. 6b). As a re-\nsult, the protocol progressively isolates the valleys corre-\nsponding to the states (α, β, γ) (red curves) and\n\u0000α, β, γ\n\u0001\n(green curves) in the instantaneous energy spectrum (see\nFig. 6b.1), yielding states from the latter (green dots in\npanel b) with high probability.\nProtocol 2 Global search\nInput: α∗\n▷Initial local minimum\nHP\n▷Problem Hamiltonian\nNS\n▷Size of S\nNT\n▷Size of T\nQT\n▷Max. similarity between states in T\nQα∗\n▷Max. similarity to α∗\nλ\n▷Mixing strength\nI\n▷Number of iterations\nT\n▷Annealing time\nOutput: β\n▷State from a lower-energy valley\n1: procedure Global search\n2:\nM ←0 . . . 00\n3:\nfor i in range (0, I) do\n4:\nHF M ←generate HF M (HP , α∗, M, λ) ▷Eq. 15\n5:\nS ←sample (HF M, NS, T)\n6:\nT ←select samples (S, HP , NT , QT )\n7:\nT ←T + [α∗]\n8:\nM ←update M (T )\n▷Eq. 17\n9:\nβ ←T [0]\n10:\nif Eβ < Eα∗then\n11:\nreturn βi\n12:\nreturn β\nVI.\nBENCHMARKS\nWe assess the performance of the proposed hybrid\nsolver with LDA against other quantum and classical\nmethods on large spin-glass instances.\nWe focus on\nrandom spin glasses that can be natively mapped onto\nany currently available D-Wave Advantage QPU. Specif-\nically, we investigate 10 NAT-7 [34, 35] instances that\nalmost fully utilize the Advantage 5.4 QPU [28], using\n5, 580 qubits and 39, 898 couplers.\nThe instances are\n\n\n11\ngenerated by assigning random coupling strengths J to\neach coupler, where J is uniformly chosen from the set\nJ = {±1/7, ±2/7, . . . , ±1}.\nNo biases h are applied\nto the qubits, maintaining a global Z2 symmetry. Using\nmultiples of 1/7 ensures that the problem and feature\nHamiltonians are well within the precision limits of the\nQPU [27]. Moreover, the use of a non-Sidon [53] set (i.e.,\nthe pairwise sum of two elements from the set can be\nan element of the set again) allows for vanishing fields\nand causes degeneracies between states.\nThe problem\ninstances are designed to feature numerous low-energy\nlocal minima, that have energies within a percent of the\nground state energy but are separated by large energy\nbarriers (dham = O(100)).\nThis enables us to investi-\ngate the capability of quantum and classical solvers to\nnavigate rough energy landscapes.\nFigure 7 presents the benchmarking results of vari-\nous quantum and classical algorithms for the NAT-7 in-\nstances, with the relative energy to the best state detailed\nas a function of runtime for the first problem instance\nin panels (a)–(e).\nResults for the remaining instances\nare summarized in panels (f.1-5) (for reference, compar-\nisons in terms of absolute energies are given in Fig. 10 in\nApp. D). For each problem instance i, a reference state\nΨi (black dots) is determined, which is the lowest-energy\nstate obtained from a forward annealing run on the D-\nWave Advantage 5.4 QPU, using an annealing time of\n2ms and generating 2000 samples. This reference state\nΨi is used to initialize the proposed hybrid solver and\nother quantum strategies, to ensure a fair comparison\nwith regard to the use of the QPU to explore the energy\nlandscape.\nPanel 7a presents results of the proposed hybrid solver\nin combination with the D-Wave Advantage 5.4 QPU.\nThe two stages of the algorithm are distinguished by\nshape, with squares denoting 8 iterations of the local\nsearch protocol and diamonds showing 8 iterations of the\nglobal search protocol.\nInitialized with Ψ1, the solver\ngenerates 2000 samples per iteration using an anneal-\ning time of 2ms with spin-reversal transformation (see\nApp. A). Examples of sampled states for the two proto-\ncols are shown in App. C. The hybrid solver reaches the\nbest energy at −9828.14 (∆E = 0) within 4 cycles after\n≈6 minutes. This runtime is defined as the sum of active\nCPU time and QPU access time as reported by D-Wave,\nexcluding QPU queue waiting time.\nFor comparison, panel 7d presents the lowest energies\n(orange dots) from 30 independent runs on the QPU for\nthe unmodified problem Hamiltonian using the same an-\nnealing parameters as before. The data shows that the\nQPU samples a mean energy of ∆E ≈30.51 (see dot-\nted orange line) with a root-mean-square deviation of\nσ∆E ≈2.18. Already the first iteration of the local search\n(first square in (a)) is significantly below this energy, with\n∆E ≈23.43. This shows that the modification of the\nproblem Hamiltonian according to Eq. (15) can signifi-\ncantly simplify the energy landscape, allowing the QPU\nto reach deeper regions of the energy spectrum that are\notherwise inaccessible.\nThe convergence speed (i.e., number of cycles) of the\nhybrid solver depends on the quality of the sampled\nstates, which is limited on the QPU by integrated con-\ntrol errors and finite annealing times [27, 28]. To explore\nits potential performance on next-generation QPUs, we\nreplace the QPU sampling in ourhybridd solver with sim-\nulated annealing (SA) in panel 7b. For convenience, we\nuse the SA implementation provided in the D-Wave Neal\nSDK [55], generating 200 samples with 500, 000 sweeps\nand 48 threads starting from the initial state Ψ1 (black\ndot). Using SA, the hybrid solver finds the best energy\nwithin a single cycle after ≈30 minutes.\nWhile clas-\nsical sampling with SA is considerably slower than the\nQPU sampling (noting that classical runtime scales in-\nversely with the number of threads), it demonstrates that\nthe ability of the hybrid solver to reach the ground state\ndoes not depend on the quality of the sampling. Instead,\na weak sampling only increases the number of cycles re-\nquired to reach the GS. This makes the hybrid solver and\nLDA well applicable to NISQ devices.\nIn panel 7c, we present results from conventional SA\nusing a parallel SA software called JUPTSA [29] with 48\nthreads. A total of 4 runs was conducted with a geomet-\nric annealing schedule from β = 0.1 to β = 10, and 600K\n(≈10m), 4M (≈1h), 40M (≈10h), and 96M (≈24h)\nspin evaluations. Notably, with an energy of ∆E ≈3.14,\nSA does not reach the best energy within the 24h time\nlimit, emphasizing the difficulty of the problem instance.\nCompared to panels (a) and (b), the proposed hybrid\nsolver finds the final energy of the 24h run in 168.13s\nand 961.45s using QPU and SA sampling, respectively.\nThis speed-up is the result of the proposed local and\nglobal search protocols, and highlights their efficiency in\nnavigating the rough energy landscape and locating low-\nenergy valleys.\nWhile SA requires slow cooling to not\nbecome trapped in a high energy valley, the proposed\nsolver demonstrates that multiple short annealing runs\ncan significantly speed up the search as the evolution can\nbe focussed into promising regions of the Hilbert space.\nThis observation is further supported by the results\nof alternative quantum algorithms shown in panel 7d,\nwhich make use of advanced programming features of\nD-Wave QPUs.\nThe first ansatz we examine is re-\nverse annealing using the IRA scheme [24] as dis-\ncussed in Sec. III (purple dots).\nInitializing the sys-\ntem in the state Ψ1 (black dot), we execute in total\n30 runs on the QPU, with reinitialize state=false and\n[(0, 1), (200, 0.7), (1800, 0.7), (2000, 1)] as the annealing\nschedule (see App. A). Each dot denotes the lowest-\nenergy state of 2000 samples from each iteration. The\ndata shows that reverse annealing improves on the initial\nenergy, but fails to reach the best energy with a mean of\n∆E ≈25.26 (see dotted purple line) with a root-mean-\nsquare deviation of σ∆E ≈1.94. As discussed in Sec. III,\nthis is likely because reverse annealing is constrained by\nthe QPU’s effective temperature.\nThe second strategy we investigate termed cyclic an-\n\n\n12\nFIG. 7. Performance comparison of various quantum and classical solver on 10 random 5580-qubit NAT-7 spin-glass instances.\n(a)–(e) Relative energy to the best solution as a function of algorithm runtime for the first problem instance. Note that only\nthe active QPU and CPU runtimes are reported, thus excluding queue waiting times. Classical code was executed on the\nJUWELS Booster supercomputer [54]. (a) The proposed hybrid solver using the D-Wave Advantage 5.4 QPU for sampling\n(2ms annealing time, spin-reversal transformation, 2000 samples per run). (b) The proposed hybrid solver using SA from\nthe D-Wave Neal SDK [55] for sampling (500, 000 sweeps, 200 samples, 48 threads). In both panels, squares denote the local\nprotocol (8 iterations) and diamonds show the global protocol (8 iterations).\n(c) 4 executions of SA using JUPTSA [29]\n(Intel Xeon Platinum 8168 CPU with 48 threads) and a geometric annealing schedule form β = 0.1 to β = 10 with 600K\n(≈10m), 4M (≈1h), 40M (≈10h), and 96M (≈24h) spin evaluations. (d) Quantum algorithms on the D-Wave Advantage\n5.4 QPU: forward annealing (orange dots, annealing schedule: [(0, 0), (2000, 1)], 2000 samples, spin-reversal transformation,\nmean: orange dotted line); reverse annealing [24] (purple dots, annealing schedule: [(0, 1), (200, 0.7), (1800, 0.7), (2000, 1)],\nreinitialize state=false, 2000 samples, spin-reversal transformation, mean: purple dotted line); cyclic annealing [22, 23] (pink\ndots, h-gain schedule: [(0, 0), (1, 0.03), (4, 0.03), (2000, 0)], annealing schedule: [(0, 1), (1, 1), (4, 0.7), (2000, 1)], 2000 samples,\nspin-reversal transformation).\n(e) Proprietary/classical solvers: Gurobi [30] (yellow dots), D-Wave hybrid [33] (teal dots,\nclassified as a classical solver here as the QPU access time was ≲1% of the total runtime) using 1m, 10m and 1h time limits,\nToshiba’s SBM algorithm [31] implemented in Ref. [32] (brown dots; 4 Nvidia H100 GPUs) and VeloxQ [32] (light blue dots; 4\nNvidia H100 GPUs; instance specific tuning of parameters). (f.1-5) Cumulative results of all 10 NAT-7 instances and solvers.\nNote, that for each problem instance i the proposed hybrid solver (both QPU and SA sampling), reverse- and cyclic-annealing,\nand Gurobi use the same initial state Ψi (black dot), which is the lowest-energy state obtained from a single forward annealing\nrun on the D-Wave Advantage 5.4 QPU (2ms annealing time, spin-reversal transformation, 2000 samples). See App. A for a\ndetailed description of the QPU settings.\nnealing (pink dots) was proposed by Wang et al. [22, 23]\nand combines reverse annealing with the h gain schedule\nfeature (which controls the function b(t) in Eq. (A2), see\nApp. A) to cycle around the tricritical point of the many-\nbody localization transition [15]. This is achieved using\na reference Hamiltonian that encodes the initial state of\neach cycle through local biases. The strength of this refer-\nence Hamiltonian is controlled via the h gain schedule\n[(0, 0), (1, 0.05), (40, 0.05), (2000, 0)]. The reverse anneal-\ning schedule is [(0, 1), (1, 1), (40, 0.4), (2000, 1)]. Although\ncyclic annealing achieves lower energies than reverse an-\nnealing alone (best energy at ∆E ≈20.90), we observe\nthat each cycle results in only minor changes to the bit\nstring, with O(10) Hamming distance between initial and\n\n\n13\nfinal state (for comparison, the proposed global search\nprotocol achieves O(500) bit flips). As a result, cyclic\nannealing often becomes trapped in local minima. This\nbehavior likely arises from the design of the reference\nHamiltonian, which biases states based on their Ham-\nming distance to the initial state, restricting the search\nto nearby states. Given that energy barriers can span\nO(100) bits, cyclic annealing is unlikely to transition\nbetween energy valleys, instead requiring exponentially\nmany restarts to locate the GS.\nAs a result, all tested purely QPU-based strategies fail\nto find the best energy on the D-Wave Advantage 5.4\nQPU. While future generations of QPUs might be able to\nnatively sample the best energy, our SA results (panels b,\nc) indicate that a hybrid protocol, modifying the problem\nHamiltonian according to Eq. (15), might still be the\nbest choice for practical quantum computation, as it can\nsignificantly speed up the search (panel a).\nAs\nour\nfinal\nbenchmark,\nwe\nconsider\npropri-\netary/classical solvers in panel 7e.\nThese include\nGurobi [30] (yellow dots), D-Wave hybrid [33] (teal dots),\nand two quantum-inspired-algorithms (QIA): Toshiba’s\nsimulated bifurcation machine (SBM) [31] implemented\nin Ref. [32] (brown dots), and VeloxQ [32] (light blue\ndots). Note that QIA are often regarded as a classical\nbaseline for quantum algorithms [56].\nFor Gurobi, we\nconducted two executions: one without an initial state\nand one initialized with the state Ψ1 (black dot). Both\nexecutions had a 24h time limit. Only the results of the\nsecond run are shown, as the first run failed to achieve\nan energy lower than ∆E ≈474.57.\nUsing the initial\nstate, Gurobi improves within the first minute, reach-\ning an energy of ∆E ≈24.2857. However, subsequent\nprogress was minimal, with the only improvements oc-\ncurring to the lower-bound energy of the ground state,\nsuch that the best energy was not reached within the 24h\nruntime. Regarding D-Wave hybrid, we evaluated run-\ntimes of 1min, 10min, and 1h, with the latter reaching\nan energy of ∆E ≈17.71. Throughout these runs, QPU\naccess time was ≲1% of the total runtime, suggesting\nthe solver operated predominantly as a classical solver.\nThe poor QPU utilization is likely due to the difficulty of\nfinding a suitable embedding for the problem. Toshiba’s\nSBM and VeloxQ achieve energies of ∆E ≈26.72 and\n∆E ≈9.14, respectively.\nNote that both QIA solvers\nwere executed on substantially more powerful classical\nhardware (four Nvidia H100 GPUs) compared to the\nother classical solvers (Intel Xeon Platinum 8168 CPU).\nWe remark that the lowest energies were found by SA\nand the proposed hybrid solver, while all investigated\nproprietary classical solvers would likely require longer\nruntimes to reach similar energies.\nIn panel (f), we present the cumulative results for the\n10 problem instances. Across all instances, we observe\nconsistent qualitative behavior for the evaluated algo-\nrithms. Notably, the proposed hybrid solver (both the\nQPU and SA implementation) finds the lowest energy\nacross all investigated problem instances, surpassing the\nother algorithms in both lowest energy and total run-\ntime. Only for the fifth and ninth spin-glass instance,\nSA is able to match the energy of the proposed hybrid\nsolver in the 24h run.\nVII.\nCONCLUSION\nIn this work, we have introduced Learning-Driven An-\nnealing (LDA), a framework designed to link individ-\nual quantum annealing (QA) runs into a global solution\nstrategy to mitigate hardware constraints such as finite\nannealing times and integrated control errors. LDA dif-\nfers from other iterative strategies in that it does not\nchange the annealing procedure (i.e, annealing schedule\nor annealing time). Instead, it learns about the problem\nstructure (i.e. the spin domains) to adaptively modify the\nproblem Hamiltonian HP . LDA replaces HP with a so-\ncalled feature Hamiltonian HF to gradually simplify the\nenergy landscape. HF is defined w.r.t. a reference state\nα, retaining only the biases and couplers from HP that\nare satisfied by α. These retained terms, called features,\nencode the location of a nearby local minimum α∗in the\nenergy spectrum.\nWe have demonstrated that HF deforms the energy\nlandscape based on both the Hamming distance and en-\nergy distance to α. This creates a monotonic landscape,\nsuch that the annealing evolution is steered towards α,\nand QPTs into other energy valleys are suppressed, due\nto increased instantaneous energy gaps. As a result, LDA\naccesses states deep in the energy valley, which are oth-\nerwise inaccessible, and gradually approaches the local\nminimum α∗over multiple iterations. We have extended\nthe LDA framework to accommodate multiple reference\nstates, enabling the transition between arbitrary energy\nvalleys and a structured search of the energy landscape.\nThis is achieved by selectively reintroducing the problem\nHamiltonian to restore low-energy valleys in the energy\nlandscape.\nTo demonstrate the efficacy of LDA, we have devel-\noped a hybrid quantum-classical solver for large-scale\nspin-glass problems. The solver alternates between a lo-\ncal and global search protocol, both using an iterative\napplication of LDA.\nThe local search protocol converges from an initial\nstate α0 to a nearby local minimum α∗. It begins with\na distribution phase that scatters the system around the\ninitial state to identify characteristic features of the en-\nergy valley, followed by a convergence phase that grad-\nually narrows the search area to isolate α∗. Numerical\nsimulations on a 24-qubit spin-glass confirmed that this\napproach isolates the energy valley of α∗in the instan-\ntaneous energy spectrum, ensuring that the search is re-\nstricted to transitions within the valley.\nThe global search protocol transitions from a local min-\nimum α∗to a state in a lower-energy valley by leveraging\nthe hierarchy of local minima. Using α∗as a reference,\nthe protocol identifies spin domains in suboptimal config-\n\n\n14\nurations and gradually replaces the problem Hamiltonian\nHP with the feature Hamiltonian HF . Through numeri-\ncal simulation, we verified that this process isolates lower-\nenergy valleys in the instantaneous energy spectrum, al-\nlowing the system to cross high and wide energy barriers\nand reach a lower-energy valley even at large Hamming\ndistances.\nWe have benchmarked the proposed hybrid solver\nagainst leading quantum and classical methods, including\nreverse annealing [18], cyclic annealing [22, 23], simulated\nannealing [29], Gurobi [30], Toshiba’s SBM [31], D-Wave\nhybrid [33] and VeloxQ [32], on 5580-qubit NAT-7 [34, 35]\nspin-glass instances. The results show that the proposed\nhybrid solver, sampling from the D-Wave Advantage 5.4\nQPU, outperforms all competing algorithms in both run-\ntime and lowest energy. Remarkably, none of the other\nmethods matched the best energies found by the pro-\nposed hybrid solver within a 24h time limit (except for\nSA in the fifth and ninth problem instance), highlighting\nthe efficacy of the proposed protocols in exploring rough\nenergy landscapes and locating low-energy valleys even\non large-scale problem instances. We have shown that\nthis ability does not depend strongly on the quality of\nsampled states by replacing the QPU with a SA sampler.\nIn both cases, the proposed hybrid solver converges to\nthe best energy, with the sampling quality only affecting\nthe number of iterations and the runtimes. This result\nsuggests that LDA is able to lift hardware restrictions\nby distributing a long evolution over multiple short runs.\nThis could enable NISQ devices to solve any COP that\ncan be embedded onto the hardware. While a separate\nstudy is necessary to systematically analyze its applica-\nbility to other types of COPs and quantum algorithms,\nLDA is a step towards practical quantum computation\nthat enables today’s quantum annealers to compete with\nclassical solvers in both runtime and energy.\nACKNOWLEDGMENTS\nThe authors thank Hans De Raedt, Madita Willsch,\nVrinda Mehta, Fengping Jin, Jaka Vodeb, and Paul\nWarburton for comments and discussions.\nThe au-\nthors thank Jakub Paw lowski and Bart lomiej Gardas\nfor sharing performance results of Toshiba’s SBM and\nVeloxQ on the investigated problem instances.\nThe\nauthors gratefully acknowledge the Gauss Centre for\nSupercomputing e.V. (www.gauss-centre.eu) for fund-\ning this project by providing computing time on the\nGCS Supercomputer JUWELS [54] at J¨ulich Supercom-\nputing Centre (JSC). The authors gratefully acknowl-\nedge the J¨ulich Supercomputing Centre (https://www.fz-\njuelich.de/ias/jsc) for funding this project by provid-\ning computing time on the D-Wave Advantage™Sys-\ntem JUPSI through the J¨ulich UNified Infrastructure for\nQuantum computing (JUNIQ). D.W. acknowledges sup-\nport from the project JUNIQ that has received funding\nfrom the German Federal Ministry of Education and Re-\nsearch (BMBF) and the Ministry of Culture and Science\nof the State of North Rhine-Westphalia.\n[1] M. Marzec, Portfolio Optimization:\nApplications in\nQuantum\nComputing,\nHandbook\nof\nHigh-Frequency\nTrading and Modeling in Finance , 73 (2016).\n[2] D. Willsch, M. Willsch, C. D. G. Calaza, F. Jin, H. De\nRaedt, M. Svensson, and K. Michielsen, Benchmarking\nAdvantage and D-Wave 2000Q quantum annealers with\nexact cover problems, Quantum Information Processing\n21, 10.1007/s11128-022-03476-y (2022).\n[3] M. H. Amin, E. Andriyash, J. Rolfe, B. Kulchytskyy, and\nR. Melko, Quantum Boltzmann Machine, Phys. Rev. X\n8, 021050 (2018).\n[4] M.\nBenedetti,\nJ.\nRealpe-G´omez,\nR.\nBiswas,\nand\nA. Perdomo-Ortiz, Estimation of effective temperatures\nin quantum annealers for sampling applications: A case\nstudy with possible applications in deep learning, Phys.\nRev. A 94, 022308 (2016).\n[5] A. Perdomo-Ortiz, N. Dickson, M. Drew-Brook, G. Rose,\nand A. Aspuru-Guzik, Finding low-energy conformations\nof lattice protein models by quantum annealing, Scientific\nReports 10.1038/srep00571 (2012).\n[6] R. J. Boucherie, A. Braaksma, and H. Tijms, Operations\nResearch (World Scientific, 2021).\n[7] A. Lucas, Ising formulations of many NP problems, Fron-\ntiers in Physics 2, 10.3389/fphy.2014.00005 (2014).\n[8] S. Yarkoni, E. Raponi, T. B¨ack, and S. Schmitt, Quan-\ntum annealing for industry applications: introduction and\nreview, Reports on progress in physics. Physical Society\n(Great Britain) 85, 10.1088/1361-6633/ac8c54 (2022).\n[9] A. D. King, A. Nocera, M. M. Rams, J. Dziarmaga,\nR. Wiersema, W. Bernoudy, J. Raymond, N. Kaushal,\nN. Heinsdorf, R. Harris, K. Boothby, F. Altomare,\nA. J. Berkley,\nM. Boschnak,\nK. Chern,\nH. Chris-\ntiani, S. Cibere, J. Connor, M. H. Dehn, R. Desh-\npande, S. Ejtemaee, P. Farr´e, K. Hamer, E. Hoskin-\nson, S. Huang, M. W. Johnson, S. Kortas, E. Ladizin-\nsky, T. Lai, T. Lanting, R. Li, A. J. R. MacDonald,\nG. Marsden, C. C. McGeoch, R. Molavi, R. Neufeld,\nM.\nNorouzpour,\nT.\nOh,\nJ.\nPasvolsky,\nP.\nPoitras,\nG. Poulin-Lamarre, T. Prescott, M. Reis, C. Rich,\nM. Samani, B. Sheldan, A. Smirnov, E. Sterpka, B. Trul-\nlas Clavera, N. Tsai, M. Volkmann, A. Whiticar, J. D.\nWhittaker, W. Wilkinson, J. Yao, T. J. Yi, A. W. Sand-\nvik, G. Alvarez, R. G. Melko, J. Carrasquilla, M. Franz,\nand M. H. Amin, Computational supremacy in quan-\ntum simulation, arXiv e-prints , arXiv:2403.00910 (2024),\narXiv:2403.00910 [quant-ph].\n[10] E. Pelofske, Comparing three generations of D-Wave\nquantum annealers for minor embedded combinatorial op-\ntimization problems, Quantum Sci. Technol. 10, 025025\n(2025).\n[11] A. Rajak, S. Suzuki, A. Dutta, and B. K. Chakrabarti,\nQuantum annealing: an overview, Philosophical transac-\n\n\n15\ntions. Series A, Mathematical, physical, and engineering\nsciences 381, 20210417 (2023).\n[12] M. H. S. Amin and V. Choi, First-order quantum phase\ntransition in adiabatic quantum computation, Physical\nReview A 80, 10.1103/PhysRevA.80.062326 (2009).\n[13] G. Schaller and R. Sch¨utzhold, The role of symmetries\nin adiabatic quantum algorithms, Quantum Information\n& Computation 10 (2010).\n[14] R. Sch¨utzhold and G. Schaller, Adiabatic quantum algo-\nrithms as quantum phase transitions: First versus second\norder, Phys. Rev. A 74, 060304 (2006).\n[15] H. Nishimori and G. Ortiz, Elements of phase transitions\nand critical phenomena, first published in paperback ed.\n(Oxford University Press, Oxford, 2015).\n[16] B. Altshuler, H. Krovi, and J. Roland, Anderson localiza-\ntion makes adiabatic quantum optimization fail, Proceed-\nings of the National Academy of Sciences of the United\nStates of America 107, 12446 (2010).\n[17] A. Villanueva, P. Najafi, and H. J. Kappen, Why adi-\nabatic quantum annealing is unlikely to yield speed-up,\nJournal of Physics A: Mathematical and Theoretical 56,\n465304 (2023).\n[18] N. Chancellor, Modernizing quantum annealing using lo-\ncal searches, New Journal of Physics 19, 023024 (2017).\n[19] Y. Yamashiro, M. Ohkuwa, H. Nishimori, and D. A.\nLidar, Dynamics of reverse annealing for the fully\nconnected p -spin model,\nPhysical\nReview\nA\n100,\n10.1103/PhysRevA.100.052321 (2019).\n[20] A.\nPerdomo-Ortiz,\nS.\nE.\nVenegas-Andraca,\nand\nA. Aspuru-Guzik, A study of heuristic guesses for\nadiabatic quantum computation, Quantum Information\nProcessing 10, 33 (2011).\n[21] V. Mehta, H. D. Raedt, K. Michielsen, and F. Jin, Per-\nformance of quantum annealing for 2-SAT problems with\nmultiple satisfying assignments, (2025).\n[22] H. Wang, H.-C. Yeh, and A. Kamenev, Many-body local-\nization enables iterative quantum optimization, Nature\nCommunications 13, 5503 (2022).\n[23] H. Zhang, K. Boothby, and A. Kamenev, Cyclic quantum\nannealing: searching for deep low-energy states in 5000-\nqubit spin glass, Scientific Reports 14, 30784 (2024).\n[24] E. Pelofske, G. Hahn, and H. Djidjev, Initial State En-\ncoding via Reverse Quantum Annealing and H-Gain Fea-\ntures, IEEE Transactions on Quantum Engineering 4, 1\n(2023).\n[25] N. Chancellor and V. Kendon, Experimental test of\nsearch range in quantum annealing, Physical Review A\n104, 10.1103/PhysRevA.104.012604 (2021).\n[26] G. Passarelli, K.-W. Yip, D. A. Lidar, H. Nishimori,\nand P. Lucignano, Reverse quantum annealing of the\np -spin model with relaxation, Physical Review A 101,\n10.1103/PhysRevA.101.022331 (2020).\n[27] D-Wave Systems Inc., Error Sources for Problem Repre-\nsentation, (2025).\n[28] QPU-Specific Physical Properties: Advantagesystem5.4,\nTech. Rep. (D-Wave Systems Inc., 2025) D-Wave User\nManual 09-1264A-G.\n[29] F. J. Hans De Raedt, Vrinda Mehta, JUPTSA: J¨ulich\nParallel Tempering Simulated Annealer, in house soft-\nware, (2024).\n[30] Gurobi Optimization, LLC, Gurobi Optimizer Reference\nManual, (2024).\n[31] Toshiba Digital Solutions Corporation, SQBM+: (Com-\nmercial service) Quantum-inspired Optimization Solution\nbased on SBM technology, (2025).\n[32] J. Paw lowski, J. Tuziemski, P. Tarasiuk, A. Przybysz,\nR. Adamski, K. Hendzel,  L. Pawela, and B. Gardas,\nVeloxQ: A Fast and Efficient QUBO Solver, (2025).\n[33] D-Wave Systems Inc., D-Wave Hybrid Solver Service: An\nOverview, (2025).\n[34] H. G. Katzgraber, F. Hamze, and R. S. Andrist, Glassy\nChimeras Could Be Blind to Quantum Speedup:\nDe-\nsigning Better Benchmarks for Quantum Annealing Ma-\nchines, Physical Review X 4, 021008 (2014).\n[35] C. C. McGeoch and P. Farr´e, Milestones on the Quantum\nUtility Highway: Quantum Annealing Case Study, ACM\nTransactions on Quantum Computing 5, 1 (2024).\n[36] K. Binder and A. P. Young, Spin glasses: Experimental\nfacts, theoretical concepts, and open questions, Rev. Mod.\nPhys. 58, 801 (1986).\n[37] S. F. Edwards and P. W. Anderson, Theory of spin\nglasses, Journal of Physics F: Metal Physics 5, 965\n(1975).\n[38] H. G. Katzgraber, F. Hamze, Z. Zhu, A. J. Ochoa, and\nH. Munoz-Bauza, Seeking Quantum Speedup Through\nSpin Glasses: The Good, the Bad, and the Ugly, Physical\nReview X 5, 10.1103/PhysRevX.5.031026 (2015).\n[39] D. L. Stein and C. M. Newman, Spin Glasses: Old and\nNew Complexity, Complex Systems v. 20 (2011).\n[40] S. Mukherjee and B. K. Chakrabarti, On the Question of\nErgodicity in Quantum Spin Glass Phase and Its Role in\nQuantum Annealing, Journal of the Physical Society of\nJapan 88, 061004 (2019).\n[41] M. H. S. Amin, Effect of local minima on adiabatic quan-\ntum optimization, Physical Review Letters 100, 130503\n(2008).\n[42] G. Hed, A. K. Hartmann, D. Stauffer, and E. Domany,\nSpin domains generate hierarchical ground state structure\nin J = +/-1 spin glasses, Physical Review Letters 86,\n3148 (2001).\n[43] A. D. King, J. Raymond, T. Lanting, R. Harris, A. Zucca,\nF. Altomare, A. J. Berkley, K. Boothby, S. Ejtemaee,\nC. Enderud, E. Hoskinson, S. Huang, E. Ladizinsky,\nA. J. R. MacDonald, G. Marsden, R. Molavi, T. Oh,\nG. Poulin-Lamarre, M. Reis, C. Rich, Y. Sato, N. Tsai,\nM. Volkmann, J. D. Whittaker, J. Yao, A. W. Sandvik,\nand M. H. Amin, Quantum critical dynamics in a 5,000-\nqubit programmable spin glass, Nature 617, 61 (2023).\n[44] E. Farhi, J. Goldstone, S. Gutmann, and M. Sipser,\nQuantum Computation by Adiabatic Evolution,\n(2000),\narXiv:quant-ph/0001106 [quant-ph].\n[45] T. Albash and D. A. Lidar, Adiabatic quantum computa-\ntion, Reviews of Modern Physics 90, 10.1103/RevMod-\nPhys.90.015002 (2018).\n[46] M. H. S. Amin, Consistency of the adiabatic theorem,\nPhysical Review Letters 102, 220401 (2009).\n[47] D. Willsch, M. Willsch, F. Jin, K. Michielsen, and\nH. De Raedt, GPU-accelerated simulations of quan-\ntum annealing and the quantum approximate optimiza-\ntion algorithm, Computer Physics Communications 278,\n108411 (2022).\n[48] Y. Mori, S. Kawabata, and Y. Matsuzaki, How to exper-\nimentally evaluate the adiabatic condition for quantum\nannealing, Scientific Reports 14, 8177 (2024).\n[49] T. Albash and D. A. Lidar, Adiabatic quantum computa-\ntion, Rev. Mod. Phys. 90, 015002 (2018).\n[50] J. Roland and N. J. Cerf, Quantum search by local adi-\nabatic evolution, Physical Review A 65, 10.1103/Phys-\n\n\n16\nRevA.65.042308 (2002).\n[51] Y. Susa, Y. Yamashiro, M. Yamamoto, I. Hen, D. A.\nLidar, and H. Nishimori, Quantum annealing of the p -\nspin model under inhomogeneous transverse field driving,\nPhysical Review A 98, 10.1103/PhysRevA.98.042326\n(2018).\n[52] V. Mehta, H. D. Raedt, K. Michielsen, and F. Jin, Unrav-\neling Reverse Annealing: A Study of D-Wave Quantum\nAnnealers, (2025).\n[53] S. Sidon, Ein Satz ber trigonometrische Polynome und\nseine Anwendung in der Theorie der Fourier-Reihen,\nMathematische Annalen 106, 536 (1932).\n[54] J¨ulich Supercomputing Centre, JUWELS Cluster and\nBooster: Exascale Pathfinder with Modular Supercomput-\ning Architecture at Juelich Supercomputing Centre, J. of\nLarge-Scale Res. Facil. 7, A183 (2021).\n[55] D-Wave Systems Inc., D-Wave Neal, (2025).\n[56] Q.-G. Zeng, X.-P. Cui, B. Liu, Y. Wang, P. Mosharev,\nand M.-H. Yung, Performance of quantum annealing in-\nspired algorithms for combinatorial optimization prob-\nlems, Commun. Phys. 7, 1 (2024).\n\n\n17\nAppendix A: QPU settings\nThe time-dependent Hamiltonian implemented on the\nD-Wave Advantage 5.4 QPU is defined as\nHQA(t) = −A (s(t))\n2\n\"X\ni\nσi\nx\n#\n(A1)\n+ B (s(t))\n2\n\nb(t) ·\nX\ni\nhiσi\nz +\nX\ni<j\nJijσi\nzσj\nz\n\n,\n(A2)\nwhere hi and Jij represent the linear and quadratic terms\nof the problem Hamiltonian HP , respectively. The func-\ntion s(t) ∈[0, 1] parameterizes the annealing schedule for\nwhich A and B are the strengths of the driving and prob-\nlem Hamiltonians, respectively (the particular functions\nA(s) and B(s) for the QPU used are shown in [28]). The\nfunction b(t) is called h gain schedule.\nFor forward annealing, we use s(t) = t/T and b(t) = 1,\nwhere T is the total annealing time. Additionally, we ap-\nply a spin-reversal transformation to HP for every batch\nof 400 samples from the QPU. This transformation in-\nvolves generating a random binary string r ∈{±1}N\nand modifying the problem terms via hi −→hiri and\nJij −→Jijrirj. Sampled states α are transformed back\nusing αi −→αiri. We use the spin-reversal transforma-\ntion to mitigate memory effects on the QPU when rapidly\nsubmitting similar problems.\nReverse annealing is realized by changing the annealing\nschedule via s(t) to begin at s(0) = 1 where B(s) ≫\nA(s). The schedule is specified as a series of tuples [t/T, s]\n(see Sec. VI), with linear interpolation between points.\nInspired by [25], we use a schedule with a symmetric\npause, by first annealing to an intermediate value 0 <\ns′ < 1, holding s′, and then returning to s = 1.\nFor\nthe large spin glasses under investigation, we found s′ =\n0.7 to be optimal.\nFor all reverse annealing runs, we\nset reinitialize state=false, initializing each run from the\npreviously sampled state.\nCyclic annealing uses both reverse annealing and\nthe QPU’s h gain feature, which introduces a time-\ndependent gain b(t) for the linear terms hi in HP . Similar\nto s(t), b(t) is defined as series of tuples [t/T, b], with lin-\near interpolation between points.\nSince the large spin\nglasses under investigation have no linear biases (i.e.,\nhi = 0), we use these terms to encode the initial state\nα of each cycle, setting hi = −αi. The schedules for s(t)\nand b(t) are inspired by [23].\nAppendix B: Properties of HF\nTheorem B.1. Given the feature Hamiltonian HF (α)\n(see Eq. (8)) to a reference state α, then α is a ground\nstate of HF (α).\nProof. Let HF (α) be the feature Hamiltonian to a refer-\nence state α = αN−1 . . . α1α0 and let β = βN−1 . . . β1β0\nbe an arbitrary state, with αi, βi ∈{−1, 1}. Then\nEβ = ⟨β| HF (α) |β⟩\n(B1)\n=\nX\n(i,j)∈J α\n−|Jij|\n2\n· [αiαjβiβj + αiβi + αjβj]\n(B2)\n+\nX\ni∈Hα\nhiβi.\n(B3)\nFor each term in the first sum, we have\nαiαjβiβj + αiβi + αjβj\n=\n\n\n\n\n\n\n\n\n\n3\nif (βi, βj) = (αi, αj)\n−1\nif (βi, βj) = (αi, αj)\n−1\nif (βi, βj) = (αi, αj)\n−1\nif (βi, βj) = (αi, αj)\n,\n(B4)\nso Eq. (B2) is minimal if (βi, βj) = (αi, αj) for all (i, j) ∈\nJ α. Similarly, for the second sum in Eq. (B3), we have\nhiβi < 0 ⇔βi = αi,\n(B5)\nby the definition of Hα (see Eq. (2b)) Thus, the energy\nEβ is minimal if β = α. Therefore, α is a ground state\nof HF (α).\nTheorem B.2. Given the feature Hamiltonian HF (α)\n(see Eq. (8)) to a reference state α, then the energy Eβ of\nan arbitrary state β ̸= α (see Eq. (B1)) is monotonic as\na function of Hamming distance dham(α, β) from α. This\nmeans that there exists a path from β to α via dham(α, β)\nsuccessive single bit flips, each of which either maintains\nor decreases the energy.\nProof. Let HF (α) be the feature Hamiltonian to a refer-\nence state α = αN−1 . . . α1α0, and let β = βN−1 . . . β1β0\nbe an arbitrary state such that α ̸= β, with αi, βi ∈\n{−1, 1}. To prove the statement, we construct a path\nP = (α = γ(0), γ(1), . . . , γ(dham(α,β)−1) = β) with mono-\ntonically increasing energies.\nLet γ(0) = γ(0)\nN−1 . . . γ(0)\n1 γ(0)\n0\n= α. Then by Lem. B.1,\nγ(0) is a ground state of HF (α), with all terms in Eγ(0)\ngiving only negative contributions.\nTo construct the\npath P, we define the step from γ(n) to γ(n+1) for\nn = 0, . . . , dham(α, β) −2.\nThe energy of γ(n) is, ac-\n\n\n18\ncording to Eq. (B4),\nEγ(n) =\nX\n(i,j)∈J α\n(γ(n)\ni\n,γ(n)\nj\n)=(αi,αj)\n−3|Jij|\n2\n(B6)\n+\nX\n(i,j)∈J α\n(γ(n)\ni\n,γ(n)\nj\n)=(αi,αj)\n|Jij|\n2\n(B7)\n+\nX\n(i,j)∈J α\n(γ(n)\ni\n,γ(n)\nj\n)=(αi,αj)\n|Jij|\n2\n(B8)\n+\nX\n(i,j)∈J α\n(γ(n)\ni\n,γ(n)\nj\n)=(αi,αj)\n|Jij|\n2\n(B9)\n+\nX\ni∈Hα\nhiγ(n)\ni\n.\n(B10)\nLet i ∈{0, . . . , N −1} be the first bit for which γ(n)\ni\n̸= βi\nand set γ(n+1) to be the state with the single bit i flipped,\ni.e., γ(n+1) = γ(n)\nN−1 . . . γ(n)\ni+1βiγ(n)\ni−1 . . . γ(n)\n0\n. If bit i occurs\nin the set J α (see Eq. (2a)), this single bit flip will ei-\nther increase the energy of the coupling contribution by\nmoving terms from Eq. (B6) to Eq. (B7) or Eq. (B8)—\nthereby increasing the energy by multiples of 2|Jij|—or it\nwill maintain the energy by moving terms from Eq. (B7)\nor Eq. (B8) to Eq. (B9). Similarly, if bit i occurs in the\nset Hα (see Eq. (2b)), the bit flip will increase the energy\nof the bias contribution in Eq. (B10) by 2|hi|. Thus each\nstep from γ(n) to γ(n+1) for n = 0, . . . , dham(α, β) −2\nwill either increase or maintain the energy. After N iter-\nations, γ(dham(α,β)−1) = β by the definition of the Ham-\nming distance.\nTherefore, P is a path of states with\nmonotonically increasing energies.\nAppendix C: Illustration of the local and global\nsearch protocol\nFigures 8 and 9 show representative illustrations of the\nlocal and global search protocols applied to the first 5580-\nqubit NAT-7 spin-glass instance (see Fig. 7), respectively.\nThey depict the set of sampled states S, the set of se-\nlected states T and the feature Hamiltonian HF M across\nfour iterations of the protocols.\nAppendix D: Benchmarking results of NAT-7\ninstances\nFigure 10 compares the benchmarking results of the\ninvestigated quantum and classical solvers in Sec. VI\nwithin the 10 NAT-7 spin-glass instances.\nThe figure\nis based on the same data shown in Fig. 7 but high-\nlights the absolute energies found by each solver. Note\nthat the problem instances are designed to feature numer-\nous low-energy local minima, that have energies within\na percent of the ground state energy but are separated\nby large energy barriers (dham = O(100)). This allows\nus to study the solvers’ ability to navigate rough en-\nergy landscapes.\nConsequently, the energy differences\nbetween solvers are typically small relative to the over-\nall energy scale of the problems, but their corresponding\nstates exhibit a large Hamming distance dham from one\nanother. The proposed hybrid solver (both QPU and SA\nsampling), reverse- and cyclic-annealing, and Gurobi use\nthe same initial state Ψi (black dot), which is the lowest-\nenergy state obtained from a single forward annealing\nrun on the D-Wave Advantage 5.4 QPU (2ms annealing\ntime, spin-reversal transformation, 2000 samples).\n\n\n19\nFIG. 8. Four iterations of the local search protocol ap-\nplied to the first NAT-7 spin-glass instance, shown in\nFig. 7. (a) Set S of 6000 sampled states for each iter-\nation, presented as a function of their Hamming distance\nfrom the protocol’s final state (purple circle) and their en-\nergy difference ∆E relative to the best-known state. The\nenergy axis is consistent with Fig. 7a. The black circle\ndenotes the reference state for the protocol, while blue,\nred, green, and purple dots represent sampled states from\nthe first, second, third, and fourth iterations, respectively.\nColored circles depict the elements of the subset S⊂used\nfor the calculation of the bitmask M (see Eq. (17)) of each\niteration. (b) Embedding of the feature Hamiltonian on\nthe D-Wave Advantage 5.4 QPU [28], with qubits repre-\nsented as nodes. Purple nodes indicate qubits for which a\ncoupler and/or bias was modified in the feature Hamilto-\nnian in the fourth iteration relative to the original prob-\nlem Hamiltonian. Black nodes represent qubits for which\nthe original problem Hamiltonian was used.\nFIG. 9. Four iterations of the global search protocol ap-\nplied to the first NAT-7 spin-glass instance, shown in\nFig. 7. (a) Set S of 6000 sampled states for each iter-\nation, presented as a function of their Hamming distance\nfrom the protocol’s final state (purple circle) and their en-\nergy difference ∆E relative to the best-known state. The\nenergy axis is consistent with Fig. 7a. The black circle\ndenotes the reference state for the protocol, while blue,\nred, green, and purple dots represent sampled states from\nthe first, second, third, and fourth iterations, respectively.\nColored circles depict the elements of the subset S⊂used\nfor the calculation of the bitmask M (see Eq. (17)) of each\niteration. (b) Embedding of the feature Hamiltonian on\nthe D-Wave Advantage 5.4 QPU [28], with qubits repre-\nsented as nodes. Colored nodes indicate qubits for which\na coupler and/or bias was modified in the feature Hamil-\ntonian relative to the original problem Hamiltonian, with\nthe color encoding the iteration in which the modifica-\ntion occurred.\nBlack nodes represent qubits for which\nthe original problem Hamiltonian was used. Since con-\nnected qubits are typically spatially close on the QPU,\nthe spin-glass domain structure is reflected in the cluster-\ning of colored nodes.\n\n\n20\nFIG. 10. Performance comparison of various quantum and classical solver on 10 random 5580-qubit NAT-7 spin-glass instances.\nThe data corresponds to Fig. 7, but depicts the absolute energies found by each solver.\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21246v1.pdf",
    "total_pages": 20,
    "title": "Learning-Driven Annealing with Adaptive Hamiltonian Modification for Solving Large-Scale Problems on Quantum Devices",
    "authors": [
      "Sebastian Schulz",
      "Dennis Willsch",
      "Kristel Michielsen"
    ],
    "abstract": "We present Learning-Driven Annealing (LDA), a framework that links individual\nquantum annealing evolutions into a global solution strategy to mitigate\nhardware constraints such as short annealing times and integrated control\nerrors. Unlike other iterative methods, LDA does not tune the annealing\nprocedure (e.g. annealing time or annealing schedule), but instead learns about\nthe problem structure to adaptively modify the problem Hamiltonian. By\ndeforming the instantaneous energy spectrum, LDA suppresses transitions into\nhigh-energy states and focuses the evolution into low-energy regions of the\nHilbert space. We demonstrate the efficacy of LDA by developing a hybrid\nquantum-classical solver for large-scale spin glasses. The hybrid solver is\nbased on a comprehensive study of the internal structure of spin glasses,\noutperforming other quantum and classical algorithms (e.g., reverse annealing,\ncyclic annealing, simulated annealing, Gurobi, Toshiba's SBM, VeloxQ and D-Wave\nhybrid) on 5580-qubit problem instances in both runtime and lowest energy. LDA\nis a step towards practical quantum computation that enables today's quantum\ndevices to compete with classical solvers.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}