{
  "id": "arxiv_2502.21316v1",
  "text": "Doping dependence of 2-spinon excitations in the doped 1D cuprate Ba2CuO3+δ\nJiarui Li,1, ∗Daniel Jost,1, ∗Ta Tang,1, 2 Ruohan Wang,1 Yong Zhong,1 Zhuoyu Chen,3 Mirian\nGarcia-Fernandez,4 Jonathan Pelliciari,5 Valentina Bisogni,5 Brian Moritz,1 Kejin Zhou,4\nYao Wang,6, 7 Thomas P. Devereaux,1, 8, 9 Wei-Sheng Lee,1, † and Zhi-Xun Shen1, 9, 10, 11, ‡\n1Stanford Institute for Materials and Energy Sciences,\nSLAC National Accelerator Laboratory, Menlo Park, CA 94025, USA\n2Department of Applied Physics, Stanford University, Stanford, CA 94305, USA\n3Department of Physics, Southern University of Science and Technology, Shenzhen 518055, China\n4Diamond Light Source, Harwell Campus, Didcot, Oxfordshire OX11 0DE, United Kingdom\n5National Synchrotron Light Source II, Brookhaven National Laboratory, Upton, NY, 11973, USA\n6Department of Chemistry, Emory University, Atlanta, GA 30322, USA\n7Department of Physics and Astronomy, Clemson University, Clemson, SC 29634, USA\n8Department of Materials Science and Engineering, Stanford University, Stanford, CA 94305, USA\n9Geballe Laboratory for Advanced Materials, Stanford University, Stanford, CA 94305, USA\n10Department of Physics, Stanford University, Stanford, 94305, CA, USA\n11Department of Applied Physics, Stanford University, Stanford, 94305, CA, USA\n(Dated: March 3, 2025)\nRecent photoemission experiments on the quasi-one-dimensional Ba-based cuprates suggest that\ndoped holes experience an attractive potential not captured using the simple Hubbard model. This\nobservation has garnered significant attention due to its potential relevance to Cooper pair formation\nin high-Tc cuprate superconductors. To scrutinize this assertion, we examined signatures of such\nan attractive potential in doped 1D cuprates Ba2CuO3+δ by measuring the dispersion of the 2-\nspinon excitations using Cu L3-edge resonant inelastic X-ray scattering (RIXS). Upon doping, the\n2-spinon excitations appear to weaken, with a shift of the minimal position corresponding to the\nnesting vector of the Fermi points, qF . Notably, we find that the energy scale of the 2-spinons near\nthe Brillouin zone boundary is substantially softened compared to that predicted by the Hubbard\nmodel in one-dimension. Such a discrepancy implies missing ingredients, which lends support for\nthe presence of an additional attractive potential between holes.\nCorner-sharing quasi-one-dimensional (1D) cuprates\nconsist of chains of CuO2 plaquettes which are connected\nvia corner sharing oxygen atoms (Fig. 1(a)). They can\nbe modeled as a 1D spin chain with a strong antiferro-\nmagnetic (AFM) super-exchange interaction. Therefore,\nthese compounds contain the essence of electronic cor-\nrelations exhibited in the quasi-two dimensional cuprate\nsuperconductors, but with a simpler geometry. Experi-\nments have revealed a wealth of many-body phenomena,\nincluding magnetic order, spin-charge separation, and\nfractionalization, along with associated collective charge,\nspin, and orbital excitations [1–6]. Such phenomena have\nprovided valuable insight into the effects of strong elec-\ntronic correlations and the mystery of high-Tc supercon-\nductivity.\nRecent\nangle-resolved\nphotoemission\nspectroscopy\n(ARPES) experiments on doped 1D cuprates, specifically\nBa2CuO3+δ, revealed a doping dependence to the holon\nand spinon bands, not captured by the simple Hubbard\nmodel [6]. An additional strong, extended, and most im-\nportantly attractive interaction was required to model the\ndata effectively. Subsequent theories suggest that incor-\nporating such a potential into the Mott-Hubbard model\n∗These two authors contributed equally.\n† Corresponding author: leews@stanford.edu\n‡ Corresponding author: zxshen@stanford.edu\ncould enhance superconducting pairing [7–10].\nThere-\nfore, the results of these experiments and the proposed\nattractive couplings could have profound implications for\nunderstanding the pairing mechanism in cuprate super-\nconductors.\nGiven the importance of this hypothesis, additional ex-\nperiments are necessary for validation. Theories predict\nthat such an interaction should also leave fingerprints\nin the bosonic excitation channels, particularly, the dy-\nnamic spin structure factor S(q, ω) [11–13].\nThe dop-\ning evolution of S(q, ω) in the simple Hubbard model is\nsketched in Fig.\n1(b).\nWhen the system is undoped,\nS(q, ω) exhibits a typical two-spinon continuum, a char-\nacteristic feature of 1D quantum spin chains due to elec-\ntron fractionalization. The peak position of S(q, ω) fol-\nlows the lower edge of the continuum, which emanates\nfrom the zone center, reaching a maximum at q = 0.25,\nthen terminating at the Brillouin zone boundary (q =\n0.5), where the excitation becomes gapless. Upon hole\ndoping, the momentum where the 2-spinon excitations\nbecome gapless shifts to qF , corresponding to the nest-\ning wavevector of the Fermi points in the spinon bands.\nAt the zone boundary q = 0.5, the excitations become\ngapped with an energy of ωπ. In the presence of an at-\ntractive potential Vint, ωπ will soften and the spectral\nweight should spread out in energy and momentum. The\nsoften of ωπ can serve as an estimate for the strength of\nVint.\narXiv:2502.21316v1  [cond-mat.str-el]  28 Feb 2025\n\n\n2\n(a)\n(b)\nundoped\nEnergy\nq (2π/a)\nEnergy\nqF\nωπ\nq (2π/a)\nhole-doped\nVint\n(c)\nIntensity (a.u.)\nPhoton Energy (eV)\n930\n935\nTEY\n1\n2\n3\n4\n5\nA\nC\nB\nundoped\nhole-doped\n0.5\n0.5\na\nFIG. 1. (a) Schematic of a corner-sharing quasi-1D cuprate as an antiferromagnetic spin chain with the lattice constant a. (b)\nIllustration of 2-spinon excitations for the undoped and doped 1D spin chain, respectively. ωπ denotes the 2-spinon energy\nat q = 0.5, which is predicted to soften in the presence of an attractive potential Vint. (c) XAS obtained by measuring total\nelectron yield (TEY) across the Cu L3-edge of the five samples prepared for this study. A, B and C denote the spectral features\naround 931.9 eV, 933.4 eV, and 934.5 eV, respectively.\nIn this letter, we measure the doping dependence of 2-\nspinon excitations in Ba2CuO3+δ thin films using Cu L3-\nedge resonant inelastic x-ray scattering (RIXS). In other\nundoped one-dimensional cuprates, Cu L-edge RIXS cap-\ntures 2-spinon excitations, with a peak position that\ntracks the lower boundary of the 2-spinon continuum\n[4, 14, 15], laying the foundations for the doping depen-\ndence study reported here. The higher light-matter scat-\ntering cross-section and element specificity make RIXS\nan ideal tool for probing Ba2CuO3+δ films. Upon doping,\nwe find that the 2-spinon excitations broaden, accompa-\nnied by a systematic shift of the gapless momentum qF .\nWe also find that the energy scale of the 2-spinons near\nthe zone boundary, ωπ, is substantially lower than pre-\ndicted by the one-dimensional Hubbard model. Such a\ndiscrepancy implies missing ingredients in the Hubbard\nmodel and supports the presence of an additional attrac-\ntive potential between holes.\nBa2CuO3+δ thin films were synthesized through ozone-\nreactive molecular beam epitaxy (MBE). Ba and Cu\nsources were co-evaporated onto 001 oriented SrTiO3\nsubstrates with TiO2 termination. Doping was controlled\nvia the temperature at which the ozone supply was shut\noff. More hole doping is expected for the sample grown\nwith a lower ozone shut-off temperature. The thickness of\nsamples 1-3 is 50 nm, with ozone shut-off temperatures\nof 350°C, 270°C, and 180°C followed by 10 minutes of\nUHV annealing. We found it very challenging to achieve\nhigher doping concentrations in 50 nm thick films, requir-\ning thinner films for homogeneous doping across samples\n(samples 4 and 5 with a thickness of 10 nm). Sample\n4 had an ozone shut-off temperature of 440°C, followed\nby 10 minutes of UHV annealing. The sample with the\nhighest doping concentration (sample 5) was prepared by\nannealing in ozone at growth temperature (570°C) for 5\nminutes and cooling down in ozone until the sample tem-\nperature reached 100°C. More details on sample synthesis\ncan be found in the supplementary material [16].\nCu L3-edge XAS and RIXS experiments were per-\nformed at the 2-ID SIX of NSLS-II for samples 1-3 and at\nI21 of Diamond Light Source for samples 4 and 5. XAS\ndata were obtained by measuring total electron yield at\na grazing incident angle of 20°. The x-ray polarization\nwas parallel to the scattering plane (i.e., π-geometry).\nRIXS data were taken with the spectrometer angle 2θ\nset at ∼150° also using a π-polarization geometry, which\nis known to be more sensitive to magnetic excitations. As\nmagnetic excitations in 1D systems only disperse along\nthe chain direction, all momentum-dependent data have\nbeen denoted as a function of the projected in-chain\nmomentum transfer q along the chain direction using\nthe reciprocal lattice unit 2π/a (a =3.90 ˚A). A detailed\nschematic of the experimental geometry is show in the\nsupplementary Fig. S1 [16]. The energy resolution of the\nRIXS data was 32 meV for samples 1-3 and 42 meV for\nsamples 4 and 5. All XAS and RIXS measurements were\nconducted at approximately 30 K. The intensity of all\nRIXS spectra is normalized to the integrated intensity of\nthe dd excitations. The maxima of 2-spinon excitations\nwere extracted by fitting to a Gaussian function (see sup-\nplementary material [16]).\nWe first verify that holes were introduced into the com-\npounds by our synthesis method. Figure 1(d) presents\nthe X-ray absorption spectra (XAS) across the Cu L3-\nedge. In sample 1, which is the least hole-doped, the XAS\nis essentially identical to those measured in the single-\ncrystal undoped 1D cuprate, Sr2CuO3 [4]. Specifically,\nthe XAS consists of a main peak, A, at 931.9 eV, and\na weak hump, C, extending up to 934.5 eV. Locally, the\nground state of the undoped compound is primarily of\n3d9 and 3d10L character (L denotes the ligand character\nof the ground state from the oxygen 2p orbital contribu-\ntions). The main peak A corresponds to transitions into\nthe 3d10 final states, and the weak high-energy hump\n\n\n3\n(a)\n(b)\n0.05\n0.7\n0.04\n1.0\n0.06\n0.8\n0.08\n0.9\n0.08\n0.6\nq (2π/a)\nq (2 /a)\nq (2π/a)\nq (2π/a)\nq (2π/a)\nπ\nFIG. 2. (a) RIXS intensity map as a function of energy loss and momentum projected along the chain direction for Samples\n1-5. The markers indicate the peak position of the 2-spinon spectra. The error bars are the 90% confidence intervals of the\nfitted peak position. Black dashed lines indicate the fit for each sample’s theoretical lower bounds of the 2-spinon dispersion.\n(b) Stack plots of RIXS energy loss spectra at representative momenta for each sample. Vertical lines mark the peak positions\nof the 2-spinon excitations.\nC has been attributed to the transition to Cu 3d3z2−r2\norbitals, which become partially unoccupied due to hy-\nbridization with the Cu 4s states [17–19].\nFor samples 2 to 5, where more hole doping is expected,\na new peak (denoted B) located at 933.4 eV emerges with\nincreasing spectral weight with nominally increasing hole\nconcentration, reminiscent of the hole-induced high en-\nergy shoulder next to the main XAS peak observed in 2D\ncuprates. Here, the feature is more pronounced, likely\ndue to poor screening in one dimension [20–22].\nThe\nground state of the hole-doped Cu sites should possess a\ndominant 3d9L character (doped holes on oxygen); there-\nfore, peak B can be attributed to the transition locally\nto the 3d10L final state. Thus, the growth of spectral\nweight in peak B demonstrates a systematic increase of\nhole concentration in our series of Ba2CuO3 samples [17–\n19, 23].\nBy tuning the photon energy to the main peak of the\nXAS, RIXS can map out the energy-momentum disper-\nsion of the 2-spinon excitations.\nFigure 2(a) summa-\nrizes the RIXS intensity map as a function of projected\nmomentum along the chain direction. RIXS spectra at\nrepresentative momenta are displayed in the lower panel\n(Fig. 2 (b)). In the least doped sample 1, we observe a\nbranch of excitations whose peak positions reach a max-\nimum at q = 0.25 with an energy of approximately 450\nmeV. This merges into the elastic peak near the zone\nboundary (q = 0.5), indicating that the excitations be-\ncome gapless. This dispersion is expected for the lower\nedge of the 2-spinon continuum in the undoped 1D an-\ntiferromagnetic spin chain (see also Fig. 1(b)), with an\nenergy scale as in single crystal Sr2CuO3 [4]. In addi-\ntion, like single crystal Sr2CuO3[4], the dd excitations ex-\nhibit a substantial energy-momentum dispersion, which\nhas been attributed to the “spin-orbital” separation (see\nsupplementary Fig. S2 [16]).\nUpon hole doping, as shown in Fig. 2, although the\noverall features of the 2-spinon dispersion remain simi-\nlar, the excitations become broader in energy-momentum\nspace, and the maximal 2-spinon energy decreases at the\nlower edge of the contiuum near q = 0.25. Importantly,\nthe momentum qF where the 2-spinon excitation becomes\n\n\n4\nq (2π/a)\nq (2π/a)\n(a)\n(b)\nExp\nCal\nExp\nCal\nmax\nmin\nFIG. 3. Calculated 2-spinon excitations in a 30 % hole doped\n1D spin chain using (a) Hubbard model and (b) extended-\nHubbard model with an effective nearest-neighbor attractive\ninteraction V = −1t. The calculated peak positions (black\nmarkers) and the 2-spinon peak positions in sample 5 (open\nmarkers, shown also in Fig. 2(a)) are superimposed for com-\nparison. The discrepancy between experiment and calculated\n2-spinon excitation energy at the zone boundary is indicated\nby vertical arrows, as a guide to the eye.The calculation were\nreproduced from Ref. [12].\ngapless shifts from q = 0.5 to smaller values with increas-\ning hole doping. In the most heavily hole-doped sample 5,\nas shown in Fig. 2(b), the 2-spinon continuum becomes\ngapless at a momentum between q = 0.3 and 0.35, where\nthe peak merges with elastic peak and becomes invisible.\nBeyond this momentum, the peak becomes observable\nagain and increases in energy as it approaches the zone\nboundary at q = 0.5. Taken together, we have observed\nan expected systematic shift of qF with increasing hole\ndoping.\nqF should correspond to the nesting wave-vector of the\nFermi points in the spinon band with the corresponding\ndoping x, which can be expressed as qF = (1 −x)/2 in\nreciprocal lattice units (2π/a). The doping level of each\nsample can be estimated more accurately by determining\nthe qF position in the 2-spinon dispersion. We fit the\ndispersion ωs(q) to\nωs(q) = ωo · sin(2π\nq\n(1 −x)),\n(1)\nwhere ωo denotes the maximal energy of the 2-spinon\ncontinuum near q = 0.25. For sample 5, the fitting pro-\ncedure was not applied due to insufficient data, where\ninstead qF has been determined by the peak positions of\nthe momentum distribution curves of the 2-spinon inten-\nsity at constant energies [16]. The extracted ωo and the\ndoping concentration x are summarized in Table I\nTABLE I. Fitted parameters for 2-spinon excitations\nSample\n1\n2\n3\n4\n5\nωo (meV) 446 ± 4\n447 ± 4\n453 ± 5\n417 ± 13 360 ± 19\nx (%)\n1.3 ± 0.6 4.2 ± 0.6 3.9 ± 0.8 8.1 ± 1.6\n33 ± 4\nWith these estimated doping concentrations, our data\ncan be compared to the 1D Hubbard-like model simula-\ntions with similar hole concentrations. Figure 3(a) shows\nthe calculated 2-spinon excitations with a hole doping of\nx = 30% using a simple Hubbard model (HM), com-\npared to the peak positions extracted from sample 5\n(white markers). The energy scale of the calculation was\ndetermined by normalizing the 2-spinon peak energy at\nq = 0.25 in undoped (x = 0%) to that in our least doped\nsample 1, setting an overall energy scale of the hopping\nintegral in the Hubbard model t = 0.7 eV, similar to scal-\ning in Ref. [6]. More details about the calculation are de-\nscribed elsewhere [12, 16]. While the calculated 2-spinon\nexcitations capture the essence of the measured disper-\nsion for q < qF , the Hubbard model significantly overesti-\nmates the energy scale near the zone boundary compared\nto the experimental data (see Fig. 3(a) and supplemen-\ntary material). This discrepancy indicates that the Hub-\nbard model alone cannot fully account for the doping\ndependence of the 2-spinon excitations in Ba2CuO3+δ.\nTheory has shown that by adding an attractive poten-\ntial in the doped 1D Hubbard model, the characteristic\nenergy scale ωπ decreases, and the spectral weight broad-\nens in energy and momentum [11–13]. Figure 3(b) shows\nthe calculated 2-spinon excitations with an effective at-\ntractive interaction V = −1.0t, showing a better agree-\nment with the data than that predicted in the simple\nHubbard model. While a slightly larger value of V might\nbetter fit the experimental data, such fine-tuning may not\nbe as meaningful due to the uncertainty in the data and\nthe doping concentration of sample. Nevertheless, this is\na substantial attractive interaction and is consistent with\nthe value previously determined by ARPES [6].\nIt might be interesting to compare with recent work on\nanother quasi-1D antiferromagnetic (AFM) spin chain,\nYbAlO3. The spinon band filling was effectively tuned\nby a magnetic field, and the evolution of the 2-spinon\ncontinuum was measured by inelastic neutron scatter-\ning [24].\nNotably, at a magnetic field of 0.8 T, where\nqF ∼0.3 (2π/a), the ωπ is approximately two to three\ntimes higher than ωo. This is similar to that in the sim-\nple Hubbard model with a comparable qF due to hole\ndoping (see, for example, Fig. 3(a)). This agreement is\nin stark contrast with our experimental observations on\nBa2CuO3+δ, highlighting the presence of an attractive\npotential in quasi-1D cuprates. We suspect that the ori-\ngin of the unique coupling may stem from charge transfer\nbetween the Cu 3d orbitals and O ligand, which appears\nto be absent in the YbAlO3.\nNote that charge trans-\nfer allows oxygen phonons to more strongly couple with\nthe electrons, which could give rise to such an attractive\npotential [25].\nIn conclusion, our results provide further support for\nthe existence of a long-range attractive potential in quasi-\n1D cuprates that is absent in the simple Hubbard model.\nWhile it has been suggested that this potential may\narise from electron-phonon coupling [12, 25–27], veri-\nfying this intriguing hypothesis is beyond the scope of\n\n\n5\nthis manuscript. A complimentary study using RIXS at\nthe O K-edge with greater sensitivity to electron-oxygen\nphonon coupling may shed additional light on this sub-\nject [28, 29].\nFurther investigations into the origin of\nthis potential and how it manifests in higher dimensions\ncould be important for understanding and controlling the\nproperties of high-Tc cuprates.\nI.\nACKNOWLEDGEMENTS\nThis work was supported by the U.S. Department of\nEnergy, Office of Basic Energy Sciences, Division of Ma-\nterials Sciences and Engineering, under Contract No.\nDE-AC02-76SF00515. J.L. acknowledges the support of\nthe Department of Energy, Laboratory Directed Research\nand Development program at SLAC National Accelerator\nLaboratory, under contract DE-AC02-76SF00515. D.J.\ngratefully acknowledges funding by the Alexander-von-\nHumboldt foundation. Part of data were taken at the I21\nRIXS beamline of Diamond Light Source (UK) using the\nRIXS spectrometer designed, built, and owned by Dia-\nmond Light Source. We thank Diamond Light Source for\nproviding beamtime under proposal ID MM32900. This\nresearch used beamline 2-ID of NSLS-II, a US DOE Of-\nfice of Science User Facility operated for the DOE Of-\nfice of Science by Brookhaven National Laboratory un-\nder contract no.\nDE-SC0012704.\nY.W. acknowledges\nsupport from the Air Force Office of Scientific Research\nYoung Investigator Program under grant FA9550-23-1-\n0153. The computational results utilized the resources of\nthe National Energy Research Scientific Computing Cen-\nter (NERSC), a Department of Energy Office of Science\nUser Facility using NERSC award BES-ERCAP0023181.\nSome of the computing for this project was performed on\nthe Sherlock cluster. We would like to thank Stanford\nUniversity and the Stanford Research Computing Center\nfor providing computational resources and support that\ncontributed to these research results.\n[1] C. Kim, A. Y. Matsuura, Z.-X. Shen, N. Motoyama,\nH. Eisaki, S. Uchida, T. Tohyama, and S. Maekawa, Ob-\nservation of Spin-Charge Separation in One-Dimensional\nSrCuO2, Phys. Rev. Lett. 77, 4054 (1996).\n[2] H. Fujisawa, T. Yokoya, T. Takahashi, S. Miyasaka,\nM. Kibune, and H. Takagi, Angle-resolved photoemission\nstudy of Sr2CuO3, Phys. Rev. B 59, 7358 (1999).\n[3] B. J. Kim, H. Koh, E. Rotenberg, S. J. Oh, H. Eisaki,\nN. Motoyama, S. Uchida, T. Tohyama, S. Maekawa, Z. X.\nShen, and C. Kim, Distinct spinon and holon dispersions\nin photoemission spectral functions from one-dimensional\nSrCuO2, Nature Physics 2, 397 (2006).\n[4] J. Schlappa, K. Wohlfeld, K. J. Zhou, M. Mourigal,\nM. W. Haverkort, V. N. Strocov, L. Hozoi, C. Mon-\nney, S. Nishimoto, S. Singh, A. Revcolevschi, J.-S. Caux,\nL. Patthey, H. M. Rønnow, J. van den Brink, and\nT. Schmitt, Spin–orbital separation in the quasi-one-\ndimensional Mott insulator Sr2CuO3, Nature 485, 82\n(2012).\n[5] J. Schlappa, U. Kumar, K. J. Zhou, S. Singh, M. Mouri-\ngal, V. N. Strocov, A. Revcolevschi, L. Patthey, H. M.\nRønnow, S. Johnston, and T. Schmitt, Probing multi-\nspinon excitations outside of the two-spinon continuum\nin the antiferromagnetic spin chain cuprate Sr2CuO3, Na-\nture Communications 2018 9:1 9, 1 (2018).\n[6] Z. Chen, Y. Wang, S. N. Rebec, T. Jia, M. Hashimoto,\nD. Lu, B. Moritz, R. G. Moore, T. P. Devereaux, and Z.-\nX. Shen, Anomalously strong near-neighbor attraction in\ndoped 1d cuprate chains, Science 373, 1235 (2021).\n[7] D.-W. Qu, B.-B. Chen, H.-C. Jiang, Y. Wang, and W. Li,\nSpin-triplet pairing induced by near-neighbor attraction\nin the extended hubbard model for cuprate chain, Com-\nmunications Physics 5, 257 (2022).\n[8] L. Zhang, T. Guo, Y. Mou, Q. Chen, and T. Ma, En-\nhancement of d-wave pairing in the striped phase with\nnearest neighbor attraction, Phys. Rev. B 105, 155154\n(2022).\n[9] M. Jiang, Enhancing d-wave superconductivity with\nnearest-neighbor attraction in the extended hubbard\nmodel, Phys. Rev. B 105, 024510 (2022).\n[10] Z. Zhou, W. Ye, H.-G. Luo, J. Zhao, and J. Chang, Ro-\nbust superconducting correlation against intersite inter-\nactions in the extended two-leg hubbard ladder, Phys.\nRev. B 108, 195136 (2023).\n[11] Z. Shen, J. Liu, H.-X. Wang, and Y. Wang, Signatures\nof the attractive interaction in spin spectra of 1d cuprate\nchains (2024), arXiv:2405.11472.\n[12] T. Tang, D. Jost, B. Moritz, and T. P. Devereaux, The\ninfluence of extended interactions on spin dynamics in\none-dimensional cuprates (2024), arXiv:2405.11445.\n[13] T. Tohyama,\nH. Maeda,\nK. Tsutsui,\nS. Sota, and\nS. Yunoki, Spin and charge dynamics of doped one-\ndimensional mott insulators (2024), arXiv:2404.11412\n[cond-mat.str-el].\n[14] V. Bisogni, S. Kourtis, C. Monney, K. Zhou, R. Kraus,\nC. Sekar, V. Strocov, B. B¨uchner, J. van den Brink,\nL. Braicovich, T. Schmitt, M. Daghofer, and J. Geck,\nFemtosecond dynamics of momentum-dependent mag-\nnetic excitations from resonant inelastic x-ray scattering\nin cacu2o3, Phys. Rev. Lett. 112, 147401 (2014).\n[15] F. Forte, M. Cuoco, C. Noce, and J. van den Brink,\nDoping dependence of magnetic excitations of one-\ndimensional cuprates as probed by resonant inelastic x-\nray scattering, Phys. Rev. B 83, 245133 (2011).\n[16] See supplemental material for additional details.\n[17] J. Fink, N. N¨ucker, E. Pellegrin, H. Romberg, M. Alexan-\nder, and M. Knupfer, Electron energy-loss and x-ray ab-\nsorption spectroscopy of cuprate superconductors and re-\nlated compounds, Journal of Electron Spectroscopy and\nRelated Phenomena 66, 395 (1994).\n[18] R. Neudert,\nS.-L. Drechsler,\nJ. M´alek,\nH. Rosner,\nM. Kielwein,\nZ. Hu,\nM. Knupfer,\nM. S. Golden,\nJ. Fink, N. N¨ucker, M. Merz, S. Schuppler, N. Mo-\ntoyama, H. Eisaki, S. Uchida, M. Domke, and G. Kaindl,\n\n\n6\nFour-band extended Hubbard Hamiltonian for the one-\ndimensional cuprate Sr2CuO3 : Distribution of oxygen\nholes and its relation to strong intersite Coulomb inter-\naction, Phys. Rev. B 62, 10752 (2000).\n[19] M. Salluzzo, G. Ghiringhelli, N. B. Brookes, G. M.\nDe Luca, F. Fracassi, and R. Vaglio, Superconducting-\ninsulator transition driven by out-of-plane carrier local-\nization in Nd1.2Ba1.8Cu3O7+x ultrathin films, Phys. Rev.\nB 75, 054519 (2007).\n[20] C. T. Chen, L. H. Tjeng, J. Kwo, H. L. Kao, P. Rudolf,\nF. Sette, and R. M. Fleming, Out-of-plane orbital charac-\nters of intrinsic and doped holes in La2−xSrxCuO4, Phys.\nRev. Lett. 68, 2543 (1992).\n[21] M. A. van Veenendaal and G. A. Sawatzky, Intersite in-\nteractions in cu l-edge xps, xas, and xes of doped and\nundoped cu compounds, Phys. Rev. B 49, 3473 (1994).\n[22] G. Ghiringhelli, N. B. Brookes, C. Dallera, A. Tagliaferri,\nand L. Braicovich, Sensitivity to hole doping of cu L3 res-\nonant spectroscopies: Inelastic x-ray scattering and pho-\ntoemission of La2−xSrxCuO4, Phys. Rev. B 76, 085116\n(2007).\n[23] H. Wang, W. Liang, Q. Liu, H. Huang, M. Yang, Z. Luo,\nY. Yang, S. Hu, C. Jin, and C. Gao, Polarization-\ndependent soft X-ray absorption of over-doped supercon-\nducting Sr2CuO3+δ single crystal, Journal of Electron\nSpectroscopy and Related Phenomena 196, 61 (2014).\n[24] S. E. Nikitin, S. Nishimoto, Y. Fan, J. Wu, L. S. Wu, A. S.\nSukhanov, M. Brando, N. S. Pavlovskii, J. Xu, L. Va-\nsylechko, R. Yu, and A. Podlesnyak, Multiple fermion\nscattering in the weakly coupled spin-chain compound\nYbAlO3, Nature Communications 12, 10.1038/s41467-\n021-23585-z (2021).\n[25] Y. Wang, Z. Chen, T. Shi, B. Moritz, Z.-X. Shen, and\nT. P. Devereaux, Phonon-mediated long-range attractive\ninteraction in one-dimensional cuprates, Phys. Rev. Lett.\n127, 197003 (2021).\n[26] T.\nTang,\nB.\nMoritz,\nC.\nPeng,\nZ.\nX.\nShen,\nand\nT. P. Devereaux, Traces of electron-phonon coupling in\none-dimensional cuprates, Nature Communications 14,\n10.1038/s41467-023-38408-6 (2023).\n[27] H.-X. Wang, Y.-M. Wu, Y.-F. Jiang, and H. Yao, Spec-\ntral properties of a one-dimensional extended hubbard\nmodel from bosonization and time-dependent variational\nprinciple:\nApplications to one-dimensional cuprates,\nPhys. Rev. B 109, 045102 (2024).\n[28] T. P. Devereaux, A. M. Shvaika, K. Wu, K. Wohlfeld,\nC. J. Jia, Y. Wang, B. Moritz, L. Chaix, W.-S. Lee, Z.-X.\nShen, G. Ghiringhelli, and L. Braicovich, Directly charac-\nterizing the relative strength and momentum dependence\nof electron-phonon coupling using resonant inelastic x-\nray scattering, Phys. Rev. X 6, 041019 (2016).\n[29] D. Jost, H.-Y. Huang, M. Rossi, A. Singh, D.-J. Huang,\nY. Lee, H. Zheng, J. F. Mitchell, B. Moritz, Z.-X. Shen,\nT. P. Devereaux, and W.-S. Lee, Low temperature dy-\nnamic polaron liquid in a manganite exhibiting colossal\nmagnetoresistance, Phys. Rev. Lett. 132, 186502 (2024).\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21316v1.pdf",
    "total_pages": 6,
    "title": "Doping dependence of 2-spinon excitations in the doped 1D cuprate Ba$_2$CuO$_{3+δ}$",
    "authors": [
      "Jiarui Li",
      "Daniel Jost",
      "Ta Tang",
      "Ruohan Wang",
      "Yong Zhong",
      "Zhuoyu Chen",
      "Mirian Garcia-Fernandez",
      "Jonathan Pelliciari",
      "Valentina Bisogni",
      "Brian Moritz",
      "Kejin Zhou",
      "Yao Wang",
      "Thomas P. Devereaux",
      "Wei-Sheng Lee",
      "Zhi-Xun Shen"
    ],
    "abstract": "Recent photoemission experiments on the quasi-one-dimensional Ba-based\ncuprates suggest that doped holes experience an attractive potential not\ncaptured using the simple Hubbard model. This observation has garnered\nsignificant attention due to its potential relevance to Cooper pair formation\nin high-$T_c$ cuprate superconductors. To scrutinize this assertion, we\nexamined signatures of such an attractive potential in doped 1D cuprates\nBa$_2$CuO$_{3+\\delta}$ by measuring the dispersion of the 2-spinon excitations\nusing Cu $L_3$-edge resonant inelastic X-ray scattering (RIXS). Upon doping,\nthe 2-spinon excitations appear to weaken, with a shift of the minimal position\ncorresponding to the nesting vector of the Fermi points, $q_F$. Notably, we\nfind that the energy scale of the 2-spinons near the Brillouin zone boundary is\nsubstantially softened compared to that predicted by the Hubbard model in\none-dimension. Such a discrepancy implies missing ingredients, which lends\nsupport for the presence of an additional attractive potential between holes.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}