{
  "id": "arxiv_2502.20310v1",
  "text": "IFT-UAM/CSIC-25-18, NORDITA 2025-014\nDual Non-Lorentzian Backgrounds for Matrix Theories\nChris D. A. Blair,a Johannes Lahnsteiner,b Niels A. Obers,b,c and Ziqi Yanb\naInstituto de F´ısica Te´orica UAM/CSIC, Universidad Aut´onoma de Madrid, Cantoblanco, Madrid\n28049, Spain\nbNordita, KTH Royal Institute of Technology and Stockholm University, Hannes Alfv´ens v¨ag 12,\nSE-106 91 Stockholm, Sweden\ncCenter of Gravity, The Niels Bohr Institute, Copenhagen University, Blegdamsvej 17, DK-2100\nCopenhagen Ø, Denmark\nE-mail: c.blair@csic.es, j.m.lahnsteiner@outlook.com, obers@nbi.ku.dk,\nziqi.yan@su.se\nAbstract: We study properties of non-Lorentzian geometries arising from BPS decoupling\nlimits of string theory that are central to matrix theory and the AdS/CFT correspondence.\nWe focus on duality transformations between ten-dimensional non-Lorentzian geometries cou-\npled to matrix theory on D-branes. We demonstrate that T- and S-duality transformations\nexhibit novel asymmetric properties: depending not only on the choice of transformation\nbut also on the value of the background fields, the codimension of the foliation structure of\nthe dual non-Lorentzian background may be different or the same. This duality asymme-\ntry underlies features observed in the study of non-commutativity and Morita equivalence\nin matrix and gauge theory. Finally, we show how the holographic correspondence involving\nnon-commutative Yang-Mills fits into our framework, from which we further obtain novel\nholographic examples with non-Lorentzian bulk geometries.\narXiv:2502.20310v1  [hep-th]  27 Feb 2025\n\n\nContents\n1. Introduction\n2\n2. Non-Lorentzian Backgrounds for Matrix Theories\n5\n3. Duality Asymmetry\n8\n3.1. T-Duality Asymmetry\n8\n3.1.1.\nMatrix 0-Brane Theory on a Transverse 2-Torus\n9\n3.1.2.\nMatrix 2-Brane Theory on a Longitudinal 2-Torus\n10\n3.1.3.\nT-duality in Ramond-Ramond Sector\n11\n3.1.4.\nGeneral Toroidal Compactifications\n13\n3.2. S-Duality Asymmetry\n16\n3.2.1.\nSL(2, Z) S-Duality in Type IIB Superstring Theory\n16\n3.2.2.\nSL(2, Z) S-Duals of Matrix p-Brane Theories\n18\n3.3. SL(2, Z) T-Duality Asymmetry\n21\n3.3.1.\nSL(2, Z) from O(2, 2; Z) Duality\n22\n3.3.2.\nMatrix p-Brane Theory on a 2-Torus\n23\n3.4. IKKT Matrix Theory and Tensionless String\n26\n4. Intermezzo: Duality Asymmetry from Matrix Theory\n27\n5. B-Field, Non-Commutativity, and Holography\n29\n5.1. Holographic Duals for Non-Commutative Yang-Mills\n30\n5.2. Asymptotic Duality Asymmetry\n34\n5.2.1.\nAsymptotic T-duality\n34\n5.2.2.\nAsymptotic S-Duality: Bulk Geometry from T ¯T\n36\n5.3. Non-Lorentzian Holographic Duals\n38\n5.3.1.\nExample: A Bulk 3-Brane Decoupling Limit\n38\n5.3.2.\nGeneral Brane Geometries\n41\n6. Conclusions\n41\nA. T-duality of Lorentzian Background Fields\n43\nB. T-duality of Matrix p-Brane Theory\n46\nB.1. Buscher Duality of Matrix p-Brane Theory\n46\nB.2. General Opd, d; Zq Transformations\n50\nReferences\n52\n– 1 –\n\n\n1. Introduction\nIn this paper, we uncover novel features of string theory dualities, which appear after taking\nBPS decoupling limits that are central to matrix theory and holography. These limits zoom in\non background BPS objects, and lead to the appearance of non-Lorentzian geometry describ-\ning the resulting background. One can often think of these limits as defining self-contained\ncorners of string theory (and M-theory).\nIn previous work [1, 2] we have set out a roadmap to explore and unify the space of\nsuch limits. Building on this perspective, we showed in [3] that holography in string theory\nis remarkably just another example of an asymptotic BPS decoupling limit associated with\nan asymptotic ten-dimensional non-Lorentzian geometry, coupled to the branes on which the\ndual field theory lives.\nWe emphasise that this statement applies to standard AdS/CFT\nwith a relativistic bulk.\nThe perspective of [3] not only highlights the common origin of\nholographic [4, 5], matrix theoretic [6–9] and ‘non-relativistic’ limits [10–12] in string and\nM-theory, but also allows one to classify new non-Lorentzian versions of AdS/CFT. 1 See\nalso [12, 17, 18] for insights from the dual non-relativistic string side, and [19–21] for further\nrecent developments.\nString duality plays an essential role in generating and unifying the different decoupling\nlimits in this program. Upon compactification, seemingly distinct non-Lorentzian geometries\nmay turn out to be equivalent due to a duality relation inherited from string theory prior to\nthe associated BPS decoupling limit(s). We have used this fact extensively in [1–3] to build\nthe duality web of these decoupling limits and their resulting corners of string and M-theory. 2\nIn this paper, we will take a further step and spell out a number of interesting intricacies\nof string duality applied to non-Lorentzian geometry for matrix theory. We will see that the\nnature of the dual non-Lorentzian geometry, which is characterised by the codimension of its\nfoliation structure, is not determined solely by the choice of duality transformation but also\nby the value of the original background fields. We will explain how this behaviour is inherited\nby non-commutative gauge theory on D-branes, extending the understanding of T-duality as\nMorita equivalence [23, 24]. Combining this connection with the framework of [3], we will\nfurther uncover the underlying non-Lorentzian prescriptions governing holographic duals of\nnon-commutative Yang-Mills. The reader may be surprised that a geometrically very different\nbut arguably more complete viewpoint can still be uncovered in this well-studied field.\n‚ Relation to matrix theory. Our main focus will be the corners of type II superstring theory\nresulting from applying a single BPS decoupling limit where one zooms in on a background\nDp-brane. In [1–3], we introduced the nomenclature Matrix p-brane Theory (MpT) to refer to\nthese corners of string theory. The low-energy excitations in MpT are the Dp-branes (instead\nof the fundamental strings), whose dynamics is described by matrix (gauge) theory.\n1Including those proposed in [13, 14], while see [15, 16] for another proposal with a different treatment of\nthe coordinates.\n2A complementary perspective is to use the BPS mass spectrum to classify the U-dual orbits of these\ndecoupling limits [22].\n– 2 –\n\n\nIn the classic case of M0T, the low-energy excitations are captured by the bound state\nof N D0-branes and we are led to the Banks-Fischler-Shenker-Susskind (BFSS) matrix the-\nory [6, 25]. At large N, BFSS matrix theory is conjectured to describe eleven-dimensional\nM-theory [6] (and at finite N to describe the null compactification of M-theory [7–9]). The\nD0-branes in M0T are non-relativistic particles interacting with each other via an instan-\ntaneous gravitational force that is Newton-like. The covariantisation of such a Newton-like\nforce leads to a curved Newton-Cartan geometry, where the ten-dimensional target space is\nfoliated into an absolute time direction and nine-dimensional spatial hypersurfaces. These\n‘longitudinal’ worldline and ‘transverse’ directions are mixed via a Galilean boost transfor-\nmation. Such a target space geometry (that we loosely refer to as an M0T geometry) lacks\nany ten-dimensional metric description, and is therefore non-Lorentzian.\nCompactifying the BFSS matrix theory over a p-torus and T-dualising along all the cycles\non the torus, we are led to super Yang-Mills theory (SYM) on a p-torus, describing the dynam-\nics of wrapped Dp-branes in MpT. These wrapped Dp-branes interact with each other via in-\nstantaneous Newton-like forces. In the decompactification limit where MpT typically becomes\nten-dimensional, the target space is non-Lorentzian, equipped with a (p+1)-dimensional lon-\ngitudinal and (9´p)-dimensional transverse sector, related via a D-brane generalisation of\nthe Galilean boost transformation. Here, the longitudinal sector is aligned with the worldvol-\nume of a background Dp-brane on which the BPS decoupling limit zooms in. For example,\nin the case where p “ 3 , we are led to N “ 4 SYM on D3-branes, which is coupled to\nten-dimensional non-Lorentzian M3T geometry.\n‚ Duality asymmetry. In our earlier papers [1–3], we have shown that T-dualising MpT in\na longitudinal (transverse) isometry direction leads to M(p´1)T (M(p+1)T), accompanied\nby a set of duality transformation rules relating the original and dual MpT background\nfields. These T-duality rules appear to formalise the intuition that the ten-dimensional non-\nLorentzian geometries seen by different matrix theories are related to each other in the same\nway as D-branes on tori (see also [10, 26]).\nHowever, this expectation changes when one dualises on multiple isometry directions si-\nmultaneously, in the presence of arbitrary background gauge fields. In particular, T-dualising\nMpT with d transverse isometries leads to a non-Lorentzian geometry whose nature depends\non the rank r of the B-field in the isometry directions: MpT is mapped to M(p+d´r)T under\nT-duality along all the transverse isometry directions. Here, 0 ď r ď d . Conversely, T-\ndualising M(p+d)T along d longitudinal isometries, with or without a B-field, we are always\nled to MpT with vanishing B-field in the dual transverse isometry directions. We refer to this\nmismatched behaviour as duality asymmetry.\nThis asymmetric behaviour is not restricted to T-duality, but a generic phenomenon\nassociated with duality between corners arising from different decoupling limits of string\ntheory. An S-duality example has been previously studied in [27–29], which considered the\nasymmetric SL(2, Z) transformations involving M1T and non-relativistic string theory, where\nthe latter arises from a BPS decoupling limit zooming in on a background fundamental\n– 3 –\n\n\nstring [10, 11]. In this case, whether a given SL(2, Z) transformation maps between M1T\nand non-relativistic string theory, or is a self-duality map, depends on both the value of\nthe Ramond-Ramond (RR) zero-form (i.e. the axion) and the transformation parameters.\nAlgebraically, the full transformations are captured by an intriguing polynomial realisation\nof SL(2, Z). In this paper, we extend the previous analysis [27–29] of SL(2, Z) duals of non-\nrelativistic string theory by presenting the full SL(2, Z) transformation of M1T. Moreover,\nwe will show that an identical structure arises when restricting to SL(2, Z) subgroups of\ntwo-dimensional T-duality between MpT on a transverse 2-torus and M(p+2)T on a dual\nlongitudinal 2-torus, with the B-field component on the torus playing the role of the RR\nzero-form in S-duality.\nThe same behaviour also extends to the MpTs with p ă 0 , which are associated with the\nIshibashi-Kawai-Kitazawa-Tsuchiya (IKKT) matrix theory [30] and target space geometries\nthat are either Lorentzian (p “ ´1) or Carroll-like (p ă ´1) [1, 2]. A version of the T-duality\nasymmetry that maps Mp´1qT to itself has been studied in the context of tensionless string\ntheory with a B-field [31].\n‚ Non-commutative gauge theory and holography. The T-duality asymmetry between MpT\ngeometries hinges on the presence of the B-field. Connes, Douglas and Schwarz famously\nshowed how toroidal compactification of matrix theory leads to non-commutative geometry,\nwhere the non-commutativity is characterised by a constant B-field on the torus [23]. T-\ndualising matrix theory on such a ‘non-commutative torus’ leads to non-commutative gauge\ntheories [24, 32]. In this setting, T-duality transformations between string theory backgrounds\nare viewed as Morita equivalence between algebras labeled by different non-commutativity\nparameters [23, 24, 33–35]. For rational values of non-commutativity parameter, T-duality\ncan be used to map to a commutative theory. We will explain how the duality asymmetry of\nthe underlying ten-dimensional non-Lorentzian geometries accounts for these features. 3\nInspired by the above observations, in the last part of this paper, we will examine ex-\nplicit examples of backgrounds which are related holographically to non-commutative Yang-\nMills [46–48]. In particular, we will revisit the solution analysed by Maldacena and Russo\nin [47] which corresponds to D1-branes delocalised in D3-branes, with a non-vanishing B-field\nat infinity. We will show that the decoupling limit leading to non-commutative Yang-Mills\ncan be realised as an asymptotic M1T limit. This provides another example of how holog-\nraphy is governed by our overarching perspective of BPS decoupling limits and asymptotic\nnon-Lorentzian geometry [3]. By taking a further BPS decoupling limit, we will generate\n3Historically, the non-relativistic limits introduced in [10–12] were developed as ‘closed string’ versions of\n‘open string’ decoupling limits leading to non-commutative theories [26, 36–40] living on branes. The former\ncan be seen as inducing the latter when the appropriate brane configurations are explicitly included. The\ndecoupling limit used by Seiberg and Witten [24] when studying non-commutative Yang-Mills similarly can\nbe seen to arise in this context [11, 37].\nIt is therefore natural that there is a non-Lorentzian geometric\nunderpinning of the appearance of non-commutativity. Furthermore, it is interesting to note in this context\nthat S-duality asymmetry between M1T and non-relativistic string theory underlies the relationships between\nnon-commutative open strings and non-commutative Yang-Mills on D3-branes discussed in [41–45].\n– 4 –\n\n\nnew non-Lorentzian bulk geometries that underlie a dual field theory that should arise from\na non-relativistic limit of non-commutative Yang-Mills.\nThe paper is organised as follows. In Section 2, we collect the essential ingredients of\nthe non-Lorentzian geometries that underlie matrix theories. In Section 3, we study both\nthe T- and S-duality asymmetry. In Section 4, we discuss how this can be interpreted in\nterms of matrix theory and non-commutative geometry.\nIn Section 5, we apply the new\ninsights from our study of non-Lorentzian geometry and duality asymmetry to the holographic\ncorrespondence associated with non-commutative gauge theories. We conclude the paper in\nSection 6. We have also included two appendices: Appendix A reviews the usual T-duality\ntransformations, and Appendix B provides further technical details of T-duality asymmetry.\n2. Non-Lorentzian Backgrounds for Matrix Theories\nWe begin by summarising, following [1–3], the defining prescriptions for the BPS decoupling\nlimit of type II superstring theory that leads to Matrix p-brane Theory (MpT). For simplicity,\nwe first consider flat spacetime with coordinates xM , M “ 0 , ¨ ¨ ¨ , 9. Then, we reparametrise\nthe NSNS sector such that the metric GMN, B-field BMN, and dilaton Φ become\nds2 ” GMN dxM dxN “ ω dxA dxB ηAB ` 1\nω dxA1dxA1,\n(2.1a)\nBMN “ bMN ,\neΦ “ ω\np´3\n2 eφ ,\n(2.1b)\nwhere A “ 0 , ¨ ¨ ¨ , p and A1 “ p ` 1 , ¨ ¨ ¨ , 9 . Here, ω is a dimensionless parameter that\nwe will send to infinity to define the BPS decoupling limit. Moreover, bMN and φ will be\nthe new B-field and dilaton in the resulting MpT. In the ω Ñ 8 limit, the ten-dimensional\nmetric GMN becomes singular, which implies that the resulting geometry is non-Lorentzian.\nIt is important that the divergences in the metric must be cancelled exactly for any physical\nobservables, which is achieved by reparametrising the RR (p+1)-form potential as\nCpp`1q “ ω2 e´φ dx0 ^ ¨ ¨ ¨ ^ dxp ` cpp`1q ,\n(2.1c)\nwhere cpp`1q will be the RR (p+1)-form in the resulting MpT after the ω Ñ 8 limit. For now\nwe assume that no other RR potentials are present. Physically, this ω Ñ 8 limit zooms in on\na background Dp-brane in type II superstring theory, in a way that the brane charge is fine\ntuned according to (2.1c) such that it cancels the infinite brane mass (see below). As a result,\nwe are led to the self-contained MpT corner, where the light excitations are Dp-branes. This\nalso implies that MpT is non-perturbative from the perspective of the fundamental string.\nFor p “ 0, the above prescription can be directly related to the infinite boost limit of\nM-theory compactified on a spatial circle, with ω corresponding to the large Lorentz factor\nassociated with the boost. From the M-theory perspective, the infinite boost leads to the\ndiscrete light cone quantisation (DLCQ), i.e. M-theory compactified over a lightlike circle.\n– 5 –\n\n\nThe reduction on this circle leads to M0T in type IIA. The idea of DLCQ forms the founda-\ntion for the BFSS matrix theory, with the D0-branes being identified with the Kaluza-Klein\nexcitations in the lightlike compactification. The MpT limits with p ‰ 0 can be reached from\nthis DLCQ perspective by applying T-duality, as explained in [1–3].\nThe above ω Ñ 8 limit manifests itself as a BPS decoupling limit when applied to the\nDp-branes. For simplicity, we only review the single brane case here, while the more general\ncase of multiple coinciding branes has been discussed in [3] and leads to matrix (gauge) theory.\nConsider the bosonic sector of the Dp-brane action,\nSDp “ ´Tp\nż\ndp`1σ e´Φ\nc\n´ det\n”\nBαXM BβXN `\nGMN ` BMN\n˘\n` Fαβ\nı\n` Tp\nż\nCpp`1q,\n(2.2)\nwhere σα, α “ 0 , ¨ ¨ ¨ , p are the worldvolume coordinates and XMpσq describe how the Dp-\nbrane is embedded within the ten-dimensional target space. Moreover, Fαβ “ BαAβ ´ BβAα\nis field strength associated with the Up1q gauge potential Aα on the brane and\nCpp`1q ”\n1\npp ` 1q! CM0¨¨¨Mp dXM0^¨ ¨ ¨^dXMp\n(2.3)\nis the pullback of the target space RR (p+1)-form to the worldvolume of the Dp-brane.\nPlugging the MpT prescription (2.1) into the Dp-brane action (2.2) and sending ω to infinity,\nwe find the following Dp-brane action in MpT: 4\nSMpT\nDp\n“ Tp\nż\ndp`1σ e´ϕ ?\n´τ\n´\n1\n2 τ αβ BαXA1BβXA1 ` 1\n4 τ αβ τ γδ Fαγ Fβδ\n¯\n` Tp\nż\ncpp`1q , (2.4)\nwhere ταβ ” BαXA BβXB ηAB , τ “ detpταβq , τ αβ is the inverse of ταβ , and\nFαβ ” BαXM BβXN BMN ` Fαβ .\n(2.5)\nThe crucial point here is that the infinite ω divergences from the brane mass and charge\ncontributions in (2.2) precisely cancel each other, leaving us with the finite action (2.4). It\nis in this sense that the ω Ñ 8 limit is a BPS decoupling limit. In the case of coinciding\nDp-branes, the action (2.4) generalises to that of (super) Yang-Mills theory which is identified\nas the associated matrix theory. We then observe that the target space isometry group is\nnon-Lorentzian: it admits longitudinal SO(1, p) and transverse SO(9 ´ p) transformations, as\nwell as p-brane Galilean boosts,\nδGxA “ 0 ,\nδGxA1 “ ΛA1\nA xA,\n(2.6a)\nδGcpp`1q “ 1\np! e´φ ΛA1A dxA1 ^ dxA1 ¨ ¨ ¨ ^ dxAp ϵAA1¨¨¨Ap .\n(2.6b)\n4The same Dp-brane actions in MpT can also be derived from dualising the Dp-branes in non-relativistic\nstring theory [49], where the brane worldvolume actions can be derived from first principles using the non-\nrelativistic string worldsheet theory [50].\n– 6 –\n\n\nHere the role of the absolute ‘time’ direction in the standard Galilean transformation is\nreplaced by the longitudinal directions xA aligned with the background Dp-brane.\nThe above discussion illustrated the essential features of MpT assuming a flat spacetime.\nNow we discuss the generalisation to curved non-Lorentzian geometries. This can be inferred\nby ‘covariantising’ dxA and dxA1 in MpT as\ndxA Ñ τ A ” τM\nA dxM ,\ndxA1 Ñ EA1 ” EM\nA1dxM ,\n(2.7)\nwhere τM\nA and EM\nA1 are, respectively, the longitudinal and transverse vielbein fields that\nencode the MpT geometry. The p-brane Galilean boost now acts as:\nδGτ A “ 0 ,\nδGEA1 “ ΛA1\nA τ A,\n(2.8a)\nδGcpp`1q “ 1\np! e´φ ΛA1A EA1 ^ τ A1 ^ ¨ ¨ ¨ ^ τ Ap ϵAA1¨¨¨Ap .\n(2.8b)\nThis is a p-brane generalisation of the Newton-Cartan geometry that covariantises the New-\ntonian force between particles. Combining (2.7) with the flat space MpT prescription (2.1),\nwe are led to the curved spacetime MpT prescription,\nGMN “ ω τM\nA τN\nB ηAB ` 1\nω EM\nA1EN\nA1,\nCpp`1q “ ω2 e´φ τ 0 ^ ¨ ¨ ¨ ^ τ p ` cpp`1q,\n(2.9a)\nBMN “ bMN ,\neΦ “ ω\np´3\n2 eφ ,\nCpqq “ cpqq,\nq ‰ p .\n(2.9b)\nHere, we have introduced the finite part cpqq of the other RR forms, which lead to the asso-\nciated RR potentials in MpT after the ω Ñ 8 limit. Moreover, applying the covariantisa-\ntion (2.7) to the MpT Dp-brane action leads to the following curved spacetime generalisation:\nSMpT\nDp\n“Tp\nż\ndp`1σ e´ϕ ?\n´τ\n´\n1\n2 τ αβ BαXM BβXN EMN ` 1\n4 τ αβ τ γδ Fαγ Fβδ\n¯\n` Tp\nż ÿ\nq\ncpqq ^ eFp2qˇˇˇ\np`1 ,\nταβ ” BαXM BβXN τM\nA τN\nB ηAB .\n(2.10)\nIt is understood that only the pp ` 1q-forms are kept in the Chern-Simons term.\nIn general, if there is no further constraint on the longitudinal vielbein τM\nA, the foliation\nin the target space is not preserved and could result in pathologies when it comes to causal-\nity. In fact, the BPS decoupling limit of the superalgebra does require a more constraining\nsymmetry algebra. This MpT algebra contains the generators of the na¨ıve Galilei-like al-\ngebra from amalgamating the longitudinal SO(1, p) and transverse SO(9-p) via the p-brane\nGalilean boost generator GAA1 . In addition, there is an extension ZA that renders nonzero\nthe commutator between GAA1 and the transverse momentum generator PA1, with\n“\nGAA1, PB1‰\n“ δA1B1 ZA .\n(2.11)\n– 7 –\n\n\nThis ZA is a natural generalisation [51, 52] of the central extension from the Galilei to\nBargmann algebra in the particle case, where it would be associated with the particle num-\nber conservation.\nInstead, ZA is now associated with the winding of the wrapped brane\nconfiguration. The ZA symmetry acts nontrivially on the RR form cpp`1q as follows:\nδZcpp`1q “ pp ` 1q e´φ DΣA ^ τ A1 ^ ¨ ¨ ¨ ^ τ Ap ϵAA1¨¨¨Ap ,\n(2.12)\nwhere ΣA is the Lie group parameter associated with the ZA generator and Dα ” BαXM DM ,\nwith DM the derivative covariantised with respect to the frame index A . Up to a boundary\nterm, the Dp-brane action (2.10) transforms under the ZA symmetry as\nδZSMpT\nDp\n“ ´\nTp\npp ´ 1q!\nż\ndp`1σ e´φ ΣA0 ϵα0¨¨¨αp Dα0τα1\nA1 τα2\nA2 ¨ ¨ ¨ ταp\nAp ϵA0¨¨¨Ap .\n(2.13)\nTherefore, the ZA invariance requires that we impose a constraint on the torsion. For instance,\nwe could require the torsional constraint DrMτNs\nA “ 0 , which would be sufficient to preserve\nthe (p+1)-dimensional foliation structure in the target space. This is analogous (and dual)\nto the ZA symmetry in non-relativistic string theory as discussed in e.g. [53–55], where such\na torsional constraint is needed for quantum consistency of the worldsheet theory [56, 57].\nNote that working from the supergravity perspective, incorporating supersymmetry appears\nto require an involved set of constraints (both bosonic and fermionic) [58, 59], which remain\nto be worked out in the case of MpT. Resolving the important question of determining which\nconstraints are needed for an allowed background is beyond the scope of this paper.\n3. Duality Asymmetry\nWe now illustrate the phenomenon of T- and S-duality asymmetry in the web of Matrix p-\nbrane Theories (MpTs). We will first discuss T-duality between different MpTs, and show\nhow the presence of a background B-field in a given MpT background determines which\nMqT, possibly including q “ p, one lands in after T-duality. This is the focus of Section 3.1,\nwhere we first explain how this happens using a simple revealing example, and then provide\ndetails for more general backgrounds (with additional technical details to be found in the\nappendices). Then in Section 3.2 we turn to SLp2, Zq S-duality asymmetry between M1T and\nnon-relativistic string theory, before highlighting how similar structures appear when one\nconsiders the SLp2, Zq subgroup of two-dimensional T-duality between MpT and M(p+2)T,\nin Section 3.3. We briefly discuss the extension to Mp´1qT that is associated with the IKKT\nmatrix theory and furthermore Carrollian versions of MpT (with p ă ´1) in Section 3.4.\n3.1. T-Duality Asymmetry\nIn this subsection, we illustrate how T-duality asymmetry appears in MpT. We start our\ndiscussion of T-duality asymmetry in MpT with the simplest possible example, namely the\nM0T limit in flat spacetime, compactified on a transverse 2-torus with a B-field component\non the internal torus. Take the toroidal directions to be x1 and x2 , which come with the\n– 8 –\n\n\nscaling factor ω´1 in (2.1). Under the standard Buscher rule, na¨ıvely, the scaling factor ω´1\nin front of x1 and x2 is inverted to be ω after T-dualising along these two internal directions.\nOne may hence expect that the T-dual frame is described by M2T with x1 and x2 now being\nlongitudinal. However, this will not be the case if the internal B-field is nonzero. Note that\nthe very same example we use was pinpointed in [32] and used to argue for the appearance\nof non-commutative gauge theories on D-branes. This relationship should be borne in mind\nand will become prominent in Sections 4 and 5.\nWe first discuss, in Section 3.1.1, the T-duality of the NSNS sector of our M0T example,\nbefore looking at the would-be inverse transformation of M2T on a longitudinal torus in\nSection 3.1.2. In Section 3.1.3 we include the RR sector and discuss some subtleties. Then in\nSection 3.1.4 we discuss generalisations to higher-dimensional tori and curved backgrounds.\n3.1.1. Matrix 0-Brane Theory on a Transverse 2-Torus\nFirst, we focus on the NSNS sector in type IIA superstring theory.\nImposing the M0T\nprescription, we write (2.1) with p “ 0 as\nds2 “ ´ω dt2 ` 1\nω\n´\ndx2\n1 ` dx2\n2 ` dxm dxm¯\n,\nBp2q “ B dx1^ dx2 ,\neΦ “ ω´ 3\n2 gs ,\n(3.1)\nwhere m “ 3 , ¨ ¨ ¨ , 9 . We always take ω ą 0 and for simplicity assume that B ą 0 if non-zero.\nIn the ω Ñ 8 limit, we are led to the M0T geometry encoded by the vielbein fields τ 0 and\nEA1, with A1 “ 1 , ¨ ¨ ¨ , 9 and\nM0T geometry\nτ 0 “ dt ,\nEA1 “ dxA1 ,\nbp2q “ B dx1 ^ dx2 ,\neφ “ gs .\n(3.2)\nT-dualising x1 and x2 by applying the standard Buscher transformations leads to the following\ndual geometric data:\ndrs2 “ ´ω dt2 `\nω\n1 ` ω2 B2\n´\ndrx 2\n1 ` drx 2\n2\n¯\n` 1\nω dxm dxm ,\n(3.3a)\nrBp2q “ ´\nω2 B\n1 ` ω2 B2 drx1^ drx2 ,\ne\nrΦ “\nω´ 1\n2 gs\n?\n1 ` ω2 B2 ,\n(3.3b)\nwhere rx1 and rx2 are the T-dual coordinates. In the case where B “ 0 , we obtain the M2T\nprescription as expected, with\ndrs2 “ ω\n´\n´dt2 ` drx 2\n1 ` drx 2\n2\n¯\n` 1\nω dxm dxm ,\n(3.4a)\nrBp2q “ 0 ,\ne\nrΦ “ ω´ 1\n2 gs ,\n(3.4b)\nIn the ω Ñ 8 limit, we are led to the following M2T geometry in the T-dual frame:\nM2T geometry\nT-dual with B “ 0\nrτ A “\n`\ndt , drx 1, drx 2˘\n,\nrEm “ dxm ,\nrbp2q “ 0 ,\ne rφ “ gs .\n(3.5)\n– 9 –\n\n\nThis is what one would intuitively expect given the fact that D0-branes are T-dual to D2-\nbranes. However, if B ‰ 0 , the nature of the ω Ñ 8 limit of the dual prescription (3.3) is\nchanged fundamentally, and the resulting theory is now M0T instead of M2T. At finite ω ,\nwe rewrite the prescription (3.3) as\ndrs2 “ ´ω rτ 0 rτ 0 ` ω rEA1 rEA1,\nrBp2q “ rbp2q ,\ne\nrΦ “ ω´ 3\n2 e\nrϕ ,\n(3.6)\nwith\nrτ 0 “ dt ,\nrEA1 “\nˆ\ndrx 1\n?\nB2 ` ω´2 ,\ndrx 2\n?\nB2 ` ω´2 , dxm\n˙\n,\n(3.7a)\ne rφ “\ngs\n?\nB2 ` ω´2 ,\nrbp2q “ ´\nB´1\n1 ` ω´2 B´2 drx 1^ drx 2 .\n(3.7b)\nIn the ω Ñ 8 limit, we are led to the following M0T geometry in the T-dual frame:\nM0T geometry\nT-dual with B ‰ 0\nrτ 0 “ dt ,\nrEA1 “\n`\ndrx 1{B, drx 2{B, dxm˘\n,\nrbp2q “ ´drx 1^drx 2{B,\ne rφ “ gs{B .\n(3.8)\nWe thus observed that the specific MpT, for p “ 0 or p “ 2, that the T-dual frame describes\ncrucially depends on the value of the internal B-field component B . While here we have\nstarted with M0T, it is clear that the details of the calculation are unchanged if we instead\nstarted with flat MpT geometry with a transverse B-field.\n3.1.2. Matrix 2-Brane Theory on a Longitudinal 2-Torus\nConversely, we now T-dualise M2T in its longitudinal x1 and x2 directions compactified over\na 2-torus. The M2T limiting prescription is given by\nds2 “ ω\n´\n´dt2 ` dx2\n1 ` dx2\n2\n¯\n` 1\nω dxm dxm ,\n(3.9a)\nBp2q “ B dx1^ dx2 ,\neΦ “ ω´ 1\n2 gs .\n(3.9b)\nT-dualising x1 and x2 leads to the following dual prescription:\ndrs2 “ ´ω dt2 ` 1\nω\nˆ drx 2\n1 ` drx 2\n2\n1 ` ω´2 B2 ` dxm dxm\n˙\n,\n(3.10a)\nrBp2q “ ´\nB\nω2 ` B2 drx 1^ drx 2 ,\ne\nrΦ “\nω´ 3\n2 gs\n?\n1 ` ω´2 B2 .\n(3.10b)\nIn the limit ω Ñ 8 , regardless of the value of B, we are always led to the following M0T\ngeometry in the T-dual frame:\nM0T geometry\nin T-dual frame\nrτ 0 “ dt ,\nrEA1 “\n`\ndrx 1, drx 2, dxm˘\n,\nrbp2q “ 0 ,\ne rφ “ gs .\n(3.11)\nIn particular, this is M0T with vanishing B-field, which we saw above is T-dual to M2T with\nvanishing B-field. While M2T with a B-field is T-dual to M0T without a B-field, M0T with\na B-field is T-dual to M0T. We therefore have a pair of theories, M0T and M2T, which are\nrelated by a T-duality asymmetry, as illustrated by Figure 1.\n– 10 –\n\n\nM0T\nM2T\nT-dual on trans. 2-torus\nB “ 0\nT-dual on long. 2-torus\nB ‰ 0\nFigure 1. T-duality asymmetry between M0T on a transverse 2-torus and M2T on a longitudinal\n2-torus. Under T-duality, the latter is always mapped to M0T in zero internal B-field. Here, B is the\ncomponent of the internal B-field on the 2-torus.\n3.1.3. T-duality in Ramond-Ramond Sector\nFor consistency, it must be the case that the above statements also apply when the RR sector\nis included. Let us verify this. We return to our example (3.1), which following the general\nMpT prescription (2.1) must be supplemented with the following RR one-form potential:\nCp1q “ ω2\ngs\ndt .\n(3.12)\nFor simplicity, we take the finite part of Cp1q and all the other RR potentials to be zero.\nAfter T-dualising on the transverse 2-torus (see Appendix A for the T-duality rules for the\nRR fields in our conventions), we are led to the dual prescriptions,\nrCp1q “ ´ω2 B\ngs\ndt ,\nrCp3q “\nω2\n1 ` ω2 B2 g´1\ns\ndt ^ drx 1 ^ drx 2 ,\n(3.13)\nwhile all the other RR potentials remain zero. When B “ 0 , the only nonzero RR potential\nis rCp3q “ ω2 g´1\ns\ndt ^ drx 1^ drx 2 . Together with the NSNS prescription (3.1), we are led to\nthe complete M2T limiting prescription as in (2.1). On the other hand, when B ‰ 0 and the\ndual theory is M0T again, we use (3.7) to rewrite the dual prescription (3.13) as\nrCp1q “ ´ω2 e´ rφ rτ 0 ` rc p1q ,\nrCp3q “ rcp3q ,\n(3.14)\nwhere, in addition to the data already given in (3.13), we also have\nrc p1q “ ω2\nˆa\nB2 ` ω´2 ´ B\n˙\ng´1\ns\ndt ,\nrc p3q “ g´1\ns\ndt^ drx 1^ drx 2\nB2 ` ω´2\n.\n(3.15)\nIn the ω Ñ 8 limit, we find the following finite rc p1q and rc p3q:\nM0T geometry\ndual RR fields\nrc p1q “ 1\n2 B´1 g´1\ns\ndt ,\nrc p3q “ B´2 g´1\ns\ndt ^ drx 1 ^ drx 2 ,\n(3.16)\ngiving the associated Buscher rules for the dual RR potentials in M0T. This transformation\nhas induced a shift of the potentials with coefficients which are polynomial in B´1. This is a\n– 11 –\n\n\nhint of a more general phenomena, which we will return to later. Meanwhile, the T-duality\ntransformations of the RR potentials on a longitudinal 2-torus in M2T follows analogously,\nand are consistent with what we have seen in the NSNS sector.\nNote that the prescription (3.14) is almost identical to the M0T limit defined via (2.1),\nexcept that the sign in front of the ω2 divergence in rCp1q in (3.14) is the opposite. This\nis because the choice of a positive B ą 0 selects a different branch of the Lorentz group,\nwhile decoupling the rest. This is made manifest by looking at the probe D0-brane action in\ntype IIA superstring theory, which takes the following form under the prescriptions (3.6) and\n(3.14):\nrSD0 “ ´ T0\nż\ndτ ω\n3\n2 e´rϕa\nω BτX0 BτX0 ´ ω´1 BτXA1BτXA1\n` T0\nż ´\n´ω2 e´ rφ rτ 0 ` rc p1q¯\n.\n(3.17)\nThe divergent term is\n´ω2 T0\nż\ndτ\n´ˇˇBτX0ˇˇ ` BτX0¯\n,\n(3.18)\nwhich only vanishes when BτX0 ă 0 . In contrast, the derivation of the D0-brane action in\nM0T (see (2.4) with p “ 0) requires that BτX0 ą 0 . Therefore, the T-dual of M0T exhibits\na branched structure: it maps between the branches of BτX0 ă 0 and BτX0 ą 0 . Note\nthat a similar branched structure has previously been seen to appear in the SL(2, Z) duals of\nnon-relativistic string theory [27–29], which we will explore further shortly. Such a branched\nstructure arises because the BPS decoupling limit could decouple either the branes or anti-\nbranes, and these choices are related to each other via duality transformations. This is akin\nto the usual non-relativistic limit in the particle case, where one decouples particles with\nnegative energies and is therefore led to the conservation of particle number.\nAnother subtlety that can arise concerns the possibility of having a B-field which is not\nindependent of ω, but vanishes as B “ ω´1 b with constant b , which in the ω Ñ 0 limit is\nequivalent to the M0T geometry (3.2) with zero B-field. Therefore, the T-dual theory must\nstill be M2T in the non-Lorentzian background (3.5). However, at finite ω , the dual geometry\n(3.3) now becomes\ndrs 2 “ ω\nˆ\n´dt2 ` drx 2\n1 ` drx 2\n2\n1 ` b2\n˙\n` 1\nω dxm dxm ,\n(3.19a)\nrBp2q “ ´ω\nb\n1 ` b2 drx1^ drx2 ,\ne\nrΦ “ ω´ 1\n2\ngs\n?\n1 ` b2 ,\n(3.19b)\nwhere the B-field contains a linear divergence in ω and does not match the M2T prescription.\nSomehow this seemingly more complicated prescription (3.19) must lead to the same M2T\ngeometry (3.5) after taking the ω Ñ 8 limit. In the RR sector, (3.13) becomes\nrCp1q “ ´ω b\ngs\ndt ,\nrCp3q “ ω2 dt^ drx 1^ drx 2\ngs\n`\n1 ` b2˘\n.\n(3.20)\n– 12 –\n\n\nCombined with (3.19), we find that the T-dual of the original M0T prescription (3.1) on a\ntransverse 2-torus can be identified with the M2T limiting procedure, except that rBp2q and\nrCp1q now contain extra linear divergences in ω . However, the physical content of the resulting\ntheory after sending ω to infinity has to be identical to the that of M2T on the background\ngeometry (3.5). We test this by using the dual probe D2-brane in type IIA superstring theory,\nwhose Chern-Simons term now takes the form\nż ´\nrCp3q ` rCp1q ^ Fp2q¯\n“ 1\ngs\nż ˆω2 dt^ dx1^ dx2\n1 ` b2\n´ ω dt ^ F\n˙\n` O\n`\nω0˘\n.\n(3.21)\nIntriguingly, the ω-divergences in (3.21) precisely cancel the ones from the square-root kinetic\nterm in the D2-brane action (2.2) (with p “ 2). In the ω Ñ 8 limit, we are led to the same\nM2T D2-brane action (2.10) (with p “ 2), in the background fields given in (3.5). In this\nsense, the dual geometry in the ω Ñ 8 limit with the choice B “ b{ω is equivalent to the\nM2T geometry (3.5), even though the dual limiting prescription looks rather different.\n3.1.4. General Toroidal Compactifications\nNext we discuss T-duality transformations of MpTs on more general toroidal compactifica-\ntions, first with a higher-dimensional internal torus and then on curved backgrounds. We\ncontinue to emphasise the conceptual aspects here – Appendix B can be consulted for more\ncomplete technical formulae.\n‚ Higher-dimensional toroidal compactification. We will only consider a d-dimensional inter-\nnal torus either fully in the longitudinal or transverse sector in MpT. The generalisation to\nthe case where the internal torus includes both longitudinal and transverse directions merely\nintroduces additional technical complexity. 5 Here we focus simply on the T-duality transfor-\nmation of the dilaton, which is sufficient for us to discern which MpT appears as the dual\ntheory. The standard Buscher transformation [60, 61] of the dilaton is:\ne\nrΦ “\n”\ndet\n`\nGij\n˘\ndet\n`\nGkℓ´ Bkm Gmn Bnℓ\n˘ı´ 1\n4 eΦ ,\n(3.22)\nwhere Gij and Bij are the components of the metric and B-field in the toroidal directions,\nand Gij is the inverse of Gij .\nWe further assume that the internal B-field Bij has rank\nr , which is a non-negative even integer. Then we bring Bij into block-diagonal form using\na special orthogonal transformation. Take the splitting i “ pa, mq with a “ 1, . . . , r and\nm “ r ` 1, . . . , d , in the block-diagonal form we have Bmn “ Bma “ 0 and\nBab “\n¨\n˚\n˚\n˚\n˚\n˚\n˚\n˚\n˝\n0\nλ1\n´λ1\n0\n...\n0\nλr{2\n´λr{2\n0\n˛\n‹‹‹‹‹‹‹‚\n.\n(3.23)\n5We will see a hint of the structure later in Section 3.3 in the Op2, 2; Zq case.\n– 13 –\n\n\nFirst, we consider MpT on a d-dimensional spatial torus in the (p+1)-dimensional longitudinal\nsector, with d ď p . We read off from the MpT prescription (2.1) that\nGij “ ω δij ,\neΦ “ ω\np´3\n2 eφ .\n(3.24)\nFrom (3.22) we find that, at large ω ,\ne\nrΦ “ ω\nrp´3\n2 eφ ` higher-order terms in ω´1 ,\nrp “ p ´ d .\n(3.25)\nThis is the prescription for M(p´d)T. Therefore, as expected, T-dualising on a d-dimensional\nlongitudinal torus in MpT leads us to M(p ´ d)T.\nNext, we consider MpT on a d-dimensional torus in the (9 ´ p)-dimensional transverse\nsector, with d ď 9 ´ p . The same calculation on the longitudinal torus applies, except that\nthe reparametrisation of gij in (3.24) is now replaced with Gij “ ω´1 δij . At large ω , the\ndual dilaton rΦ also satisfies (3.25) but now with\nrφ “ φ ´ ln\nˇˇλ1 ¨ ¨ ¨ λr{2\nˇˇ ,\nrp “ p ` d ´ r .\n(3.26)\nHere, rφ is the dual Mrp T dilaton after the ω Ñ 8 limit is taken. Therefore, T-dualising on a\nd-dimensional transverse torus in MpT leads us to M(p+d´r)T, which explicitly depends on\nthe rank of the internal B-field.\n‚ Curved backgrounds.\nThe above conclusion continues to hold when one considers more\ngeneral curved MpT backgrounds, assuming that the isometry directions are purely transverse\nor purely longitudinal in a particular sense. The NSNS background fields in MpT are given\nby the longitudinal metric τMN “ τM\nA τN\nB ηAB with A “ 0 , ¨ ¨ ¨ , p , the transverse metric\nEMN “ EM\nA1 EN\nA1 with A1 “ p ` 1 , ¨ ¨ ¨ , 9 , the dilaton ϕ , and the Kalb-Ramond potential\nbp2q . We split the curved index as M “ pµ, iq, with i “ 1, . . . , d denoting isometry directions.\nConsider T-duality between backgrounds with longitudinal isometries such that EiA1 “ 0 and\nbackgrounds with transverse isometries such that τiA “ 0. This means we require that the\ntransverse (longitudinal) vielbein have no legs in longitudinal (transverse) isometry directions.\nWorking in the NSNS sector alone, one show that longitudinal Buscher T-duality of MpT leads\nalways to Mpp´dqT, while transverse T-duality of MpT again leads to Mpp`d´rq depending\non the rank of the B-field in the isometry directions. See Appendix B.1 for the details.\nHere, we illustrate the expressions that arise by discussing briefly the cases d “ 2, 3.\nWe start with the T-duality of MpT compactified over a 2-torus in the transverse sector.\nAs we have learned, there are two different T-dual cases to consider, depending on whether\nthe internal B-field bp2q “ 1\n2 B ϵij dxi^ dxj vanishes:\n(1) From MpT to Mpp`2qT when B “ 0 . We denote the dual fields with an extra tilde. The\nBuscher rules associated with T-dualising the internal 2-torus are given by\nrτij “ Eij ,\nrτµν “ τµν ´ bµi Eijbνj ,\nrbij “ 0 ,\nrbµi “ Eij Eµj ,\n(3.27a)\n– 14 –\n\n\nrτµi “ Eij bµ j ,\nrEµν “ Eµν ´ Eµi Eij Ejν ,\nrbµν “ bµν ´ 2 Eij Eirµ bνsj ,\n(3.27b)\nand e rφ “ eφ{\n?\ndet E . Here, Eij is the inverse of Eij . When it comes to the RR potentials\ncpqq , it is convenient to denote them in a collective way using the polyform,\nÿ\nq\ncpqq^ eBp2q “ C0 ` Ci dxi ` 1\n2 C12 ϵij dxi ^ dxj .\n(3.28)\nThe dual polyform fields are\nrC0 “ ´C12 ,\nrC12 “ C0 ,\nrCi “ ´ϵi\nj Cj .\n(3.29)\n(2) Self-duality of MpT when B ‰ 0 . The Buscher rules are\nrτµν “ τµν ,\nrEµi “ det E\nB2\nEij ´\nbµj ` bjk EkℓEℓµ\n¯\n,\nrEij “ det E\nB2\nEij ,\n(3.30a)\nrbij “ ´\nϵij\nB ,\nrbµν “ bµν `\nbµi ϵij bjν\nB\n,\nrbµi “ ϵi\nj\nB bµj ,\n(3.30b)\nrEµν “ Eµν ´ Eµi Eij Ejν ´ det E\nB2\n´\nbµi ´ Eµk Ekℓbℓi\n¯\nEij ´\nbjν ´ bjm Emn Enν\n¯\n, (3.30c)\ntogether with e rφ “ eφ{B and\nrC0 “ ´C12` 1\n2 ℓpp`1q^ebp2q\n0 ^\n„\nϵijAi^Aj` 1\n2 ϵij bp2q\ni ^bp2q\nj\n` B\n´\n1 ` Ai^bp2q\ni\n¯2ȷ\n,\nrCi “ ´ϵij Cj ´ ℓpp`1q^\n„\n1\n2 ϵij bp2q\nj\n`\n1 ´ ϵkℓAk^Aℓ˘\n´ B Ai\nȷ\n,\n(3.31)\nrC12 “ C0 ` 1\n2 ℓpp`1q^ebp2q\n0 ^\n´\n1 ´ B ϵij Ai^Aj¯\n,\nℓpp`1q ” det E\nB2 eφ τ 0^ ¨ ¨ ¨^ τ p ,\nwhere Ai denotes the one-form with components Aµi ” Eij Ejµ . We have also used\nbp2q “ bp2q\n0\n` bp2q\ni\ndxi ` 1\n2 B ϵij dxi^dxj .\n(3.32)\nNext, we consider MpT compactified on a 3-torus in the transverse sector.\nIn this case,\ndetpbijq “ 0 and bij is at most of rank two. We focus on the rank-two case and so write\nbij “ ϵijk bk for bk ‰ 0. We have argued that T-dualising over such a 3-torus maps MpT to\nMpp ` 1qT by examining the transformation of the dilaton in (3.26). Before the MpT limit\nis performed, the Buscher transformation of the internal metric Gij and Kalb-Ramond field\nBij is given by rG ` rB “\n`\nG ` B\n˘´1 , which implies that the dual metric on the 3-torus is\nrGij “ ω bi bj\n}b} ` ω´1 det E\n}b}2\nˆ\nEij ´ bi bj\n}b}2\n˙\n` O\n`\nω´3˘\n,\n}b}2 ” bi Eij bj .\n(3.33)\n– 15 –\n\n\nSince detpEij ´ bi bj}b}2q “ 0 , there exists rEi2, 3 such that\nrGij “ ω rτi\n1 rτi\n1 ` 1\nω\n´\nrEi\n2 rEi\n2 ` rEi\n3 rEi\n3¯\n` O\n`\nω´3˘\n,\n(3.34)\nwith rτi\n1 “ bi{}b} . Therefore, after the ω Ñ 8 limit is applied, the T-dual theory has a\nlongitudinal sector with one more dimension compared to MpT. This indeed implies that the\nT-dual theory is M(p+1)T.\nThe above observations on T-duality transformations can be generalised in multiple ways.\nIn Appendix B.1, we present the details for d-dimensional Buscher duality on both longitudi-\nnal and transverse tori in curved MpT backgrounds, restricting to the NSNS sector. In Ap-\npendix B.2, we outline how the situation changes when one considers more general Opd, d; Zq\ntransformations, in which case the dual MpT depends on the rank of a matrix involving both\nthe parameters of the transformation and the B-field. In the case d “ 2, we provide below in\nSection 3.3 complete details regarding the SLp2, Zq subgroup of non-trivial T-dualities on a\n2-torus, where we treat general SLp2, Zq transformations and the RR sector (building on the\nanalogous case of SLp2, Zq S-duality, which we first discuss in Section 3.2).\nNote that the behaviour we have identified as T-duality asymmetry is consistent with\nthe consecutive application of the single T-duality relationships of [1–3] when one takes into\naccount the assumptions τi\nA “ 0 and Ei\nA1 “ 0 we impose on the background geometry in\norder to consider our isometries as wholly longitudinal/transverse. We discuss this further\nat the end of Appendix B.1. It would also be possible to consider situations where we relax\nthese conditions (and likewise to consider mixed longitudinal/transverse transformations).\nHere one will find generically that the resulting dual theory will depend on the rank of some\nmore convoluted combination of background fields.\n3.2. S-Duality Asymmetry\nNow, we divert our attention to S-duality. A similar duality asymmetry has also been observed\nfor the S-duality transformations acting on non-relativistic string theory [27–29]. Here, we\nwill extend the previous discussion to include how the SL(2, Z) group acts on M1T, which\nwill lead us to the complete duality asymmetry illustrated in Figure 2.\n3.2.1. SL(2, Z) S-Duality in Type IIB Superstring Theory\nWe start by briefly reviewing the SL(2, Z) duality of type IIB superstring theory. From the\nM-theory perspective, this global symmetry group arises from the isometry group of a shrunk\n2-torus, over which M-theory is compactified to give rise to the IIB theory in ten dimensions.\nDenote the toroidal modulus as\nτ ” τ1 ` i τ2 “ Cp0q ` i e´Φ ,\n(3.35)\nwhere Cp0q is the RR zero-form and Φ the dilaton in the IIB theory. Then, the inverse toroidal\nmetric takes the form,\nMij “ 1\nτ2\n˜\n|τ|2 τ1\nτ1\n1\n¸\n,\n(3.36)\n– 16 –\n\n\nnon-rel.\nstring\nM1T\nγ cp0q` δ “ 0\nγ ‰ 0\nγ cp0q` δ ‰ 0\nγ “ 0\nFigure 2.\nSL(2, Z) S-duality asymmetry between M1T and non-relativistic string theory, in\nterms of SL(2, Z) group parameters γ, δ and the RR zero-form cp0q. Dashed lines indicate a discrete\nrealisation and continuous lines a polynomial realisation of the transformation.\nwith ‘i’ the index on the internal torus. The SL(2, Z) transformation matrix\nΛij “\n˜\nα\nβ\nγ\nδ\n¸\n,\nα δ ´ β γ “ 1 ,\nα , β , γ , δ P Z ,\n(3.37)\nacts on the axion-dilaton coupling τ (and thus the toroidal metric M) as\nrτ “ α τ ` β\nγ τ ` δ ,\nĂ\nM “ Λ M Λ⊺.\n(3.38)\nMoreover, we have\nrCp2q\ni\n“\n`\nΛ´1˘\ni\nj Cp2q\nj\n,\nCp2q\ni\n”\n˜\nBp2q\nCp2q\n¸\n,\n(3.39)\ni.e. Cp2q\ni\ntransforms as an SL(2, Z) doublet. Finally,\ne´Φ{2 GMN ,\nCp4q ` 1\n2 Bp2q ^ Cp2q ,\n(3.40)\nare singlets invariant under SL(2, Z), with GMN the string-frame metric.\nIt is useful to repackage the above SL(2, Z) transformations in terms of vielbein fields on\nthe internal torus, with\nMij “ V i V j ` Ei Ej ,\nV i “ e´ Φ\n2\n´\n1 0\n¯\n,\nEi “ e\nΦ\n2\n´\nCp0q 1\n¯\n.\n(3.41)\nThen, under the SL(2, Z) transformation, the quantity pV i Cp2q\ni\n, Ei Cp2q\ni\nq⊺only picks up (a\ndiscrete set of) the SO(2) rotation on the internal torus, with\n˜rV i\nrEi\n¸\nrCp2q\ni\n“ s\n˜\ncos θ ´ sin θ\nsin θ\ncos θ\n¸ ˜\nV i\nEi\n¸\nCp2q\ni\n,\n(3.42a)\ns “ sgn\n`\nγ Cp0q ` δ\n˘\n,\ntan θ “\nγ e´Φ\nγ Cp0q ` δ .\n(3.42b)\n– 17 –\n\n\nWe take the principal value of the arctan when θ is evaluated. Note that the angle θ depends\non both the group parameters and background fields. It will turn out to be convenient to\nrecast the transformation of the doublet Cp2q\ni\nin terms of this SOp2q rotation. Note that we\nhave explicitly:\nV i Cp2q\ni\n“ e´ Φ\n2 Bp2q ,\nEi Cp2q\ni\n“ e\nΦ\n2\n´\nCp2q ` Cp0qBp2q¯\n.\n(3.43)\nWhen we apply a BPS decoupling limit, both the background fields and the parameter tan θ\nadmit an expansion in ω. This fact underlies the transformations rules we will present below.\n3.2.2. SL(2, Z) S-Duals of Matrix p-Brane Theories\nNow, we consider how the SL(2, Z) S-duality acts on the MpT limits of type IIB with\np “ 1 , 3 .\nM1T and M3T can be viewed as arising from different toroidal compactifica-\ntions of non-relativistic M-theory, which is U-dual to M-theory in the DLCQ [1, 29]. Non-\nrelativistic M-theory arises from a BPS decoupling limit zooming in on a background M2-\nbrane [10, 11, 26, 39, 40]. As a result, the eleven-dimensional target space geometry devel-\nops a codimension-three foliation structure, with the transverse sector related to the three-\ndimensional longitudinal sector via a membrane Galilean boost [29, 49, 62].\nCompactifying non-relativistic M-theory on a transverse 2-torus leads to M3T in ten\ndimensions, which then admits a standard SL(2, Z) symmetry that maps M3T to itself, in-\nherited from the internal toroidal topology. This can be confirmed by plugging the M3T\nlimiting prescription, with Cp0q “ cp0q and Φ “ φ from (2.1), into (3.35), under which the\ntorus modulus becomes τ Ñ cp0q ` i e´φ .\nThe standard SL(2, Z) transformations of the\nbackground fields thus remain unchanged.\nIn contrast, M1T arises from compactifying non-relativistic M-theory on an ‘anisotropic’\ntorus, with one cycle in the longitudinal sector and the other in the transverse sector [29].\nHere, the transverse cycle is taken to be the M-theory circle, and compactifying on this circle\nleads to M2T. Then, T-dualising the longitudinal cycle maps M2T to M1T, and shrinking the\noriginal longitudinal cycle to zero decompactifies the T-dual circle in M1T, leading to M1T\nin ten dimensions. Due to the anisotropy of the internal torus, the SL(2, Z) transformations\nexhibit duality asymmetry.\nWe first show how SL(2, Z) acts on M1T. Recall the M1T limiting prescription (2.9),\nM1T\nprescription\nGMN “ ω τMN ` 1\nω EMN ,\nBp2q “ bp2q,\neΦ “ ω´1 eφ,\nCp2q “ ω2 e´φ dt ^ dx1 ` cp2q,\n(3.44)\nwith τMN “ τM\nA τM\nB ηAB, A “ 0 , 1 and EMN “ EM\nA1EM\nA1, A1 “ 2 , ¨ ¨ ¨ , 9 . Moreover,\nCpqq “ cpqq for q ‰ 2 . Under the above reparametrisation (3.35) gives τ Ñ cp0q ` i ω e´φ .\nIt then follows that the ω Ñ 8 limit invalidates the metric description (3.36) (of the 11-\ndimensional torus), 6 but the vielbein formalism introduced in (3.41) still applies. Define the\n6In the ω Ñ 8 limit, the torus becomes a singular ring-like object that is infinitely thin and with an\ninfinitely large radius. This singular torus is topologically equivalent to a pinched torus, which is ‘almost’\nRiemannian except at the nodal point [2].\n– 18 –\n\n\ninverse vielbein fields\nvi “ e´ φ\n2\n˜\n1\n0\n¸\n,\nei “ e\nφ\n2\n˜\ncp0q\n1\n¸\n,\n(3.45)\nit then follows that\nV i “ ω\n1\n2 vi ,\nEi “ ω´ 1\n2 ei ,\ntan θ “ ω κ ,\nκ ”\nγ e´φ\nγ cp0q ` δ .\n(3.46)\nThe opposite scalings of the vielbeins could be viewed as introducing a Euclidean Carroll\nor Galilean structure on the two-dimensional M-theory torus. Intuitively κ could then be\nthought of as a Euclidean ‘boost’ on the anisotropic torus on which non-relativistic M-theory\nis compactified [29]. However, we will not pursue this point of view further.\nAs we now discuss, the nature of the SL(2, Z) transformations applied to M1T then differ\ndepending on γ is zero or not.\n‚ From M1T to non-relativistic string theory (γ ‰ 0). In this case, the ω Ñ 8 limit of the\ntransformation (3.42) gives\n˜\nrv i\nre i\n¸\nrCp2q\ni\n“ sgnpγq\n˜\n0 ´1\n1\n0\n¸ ˜\nvi\nei\n¸\nCp2q\ni\n,\n(3.47)\nsuch that the two cycles of the internal anisotropic torus are switched. The S-dual frame then\ndescribes non-relativistic string theory, defined by the following limiting prescription:\nnon-rel. string\nprescription\nrGMN “ ω2 rτMN ` rEMN ,\nrBp2q “ ´ω2 rτ 0^ rτ 1 ` rbp2q,\nerΦ “ ω e rφ,\nrCpqq “ ω2 rτ 0^ rτ 1^ rc pq´2q ` rc pqq,\n(3.48)\nwith τMN “ τM\nA τN\nB ηAB, A “ 0 , 1 and EMN “ EM\nA1EN\nA1, A1 “ 2 , ¨ ¨ ¨ , 9 .\nNote that\ne´ rΦ\n2 rGMN “ e´ Φ\n2 GMN determines how the S-dual quantity rτM\nA and rEM\nA1 are related to τM\nA\nand EM\nA1. Depending on whether γ is positive or negative, we are mapped to sectors associ-\nated with different branches of the Lorentz group before the ω Ñ 8 limit is performed [27],\nwith distinct signs in front of the ω2-divergence in the B-field and RR potential ansatz in\n(3.48). The choice that we made in (3.48) corresponds to γ ą 0 . When γ ă 0 , the ω-\ndivergences in rBp2q and rCpqq in the non-relativistic string prescription (3.48) gain an extra\nminus sign. More explicitly, in the ω Ñ 8 limit,\n`\nrτMN , rEMN\n˘\n“ |γ| e´φ `\nτ MN , EMN\n˘\n, and\nthe dual dilaton and RR zero-form (axion) are given by e rφ “ γ2 e´φ and rc p0q “ α{γ .\nThe dual B-field and RR two-form potential do not form an SL(2, Z) doublet now. This\nasymmetry is introduced as only the RR two-form potential in the original IIB theory contains\na divergence. The SL(2, Z) transformation takes the simplest form when we take our variables\nto be the finite parts of the expansion of the vielbein-contractions of the doublet, defined in\n(3.43). These can be defined directly in M1T as:\nBp2q ” vi cp2q\ni\n“ e´ φ\n2 bp2q ,\nCp2q ” ei cp2q\ni\n“ e\nφ\n2\n´\ncp2q ` cp0q bp2q¯\n,\ncp2q\ni\n”\n˜\nbp2q\ncp2q\n¸\n.\n(3.49)\n– 19 –\n\n\nSimilarly, we define in the S-dual non-relativistic string theory the quantities\nrB p2q ” e\nrφ\n2 rbp2q ,\nrC p2q ” e\nrφ\n2\n´\nrc p2q ` rc p0qrbp2q¯\n.\n(3.50)\nWe further define the Einstein-frame two-form ℓp2q ” e´ φ\n2 τ 0^τ 1. In terms of these quantities,\nwe then find the following polynomial realisation of SL(2, Z):\nM1T Ñ non-rel. string\nκ ‰ 0\n¨\n˚\n˚\n˝\nrℓp2q\nsgnpγq rCp2q\nsgnpγq rBp2q\n˛\n‹‹‚“\n¨\n˚\n˚\n˝\n1\n0\n0\n1\nκ\n1\n0\n1\n2 κ2\n1\nκ\n1\n˛\n‹‹‚\n¨\n˚\n˚\n˝\nℓp2q\nBp2q\n´Cp2q\n˛\n‹‹‚,\n(3.51a)\nwhere a branching factor sgnpγq arises as explained before. Finally, we define the four-form\nCp4q ” cp4q ` 1\n2 bp2q^ cp2q , which we note in passing arises from projecting the M-theory six-\nform using the vielbein fields on the internal metric. This four-form is no longer a singlet but\nreceives the polynomial transformation\nrCp4q “ Cp4q ´ 1\n2 κ´1 Cp2q^ ℓp2q ` 1\n4 κ´2 Bp2q^ ℓp2q.\n(3.51b)\nThe transformation (3.51) makes use of the universal form for any higher-dimensional poly-\nnomial realisations of the SL(2, Z) group, which is rooted in invariant theory [28].\nThe\nabove polynomial realisation also persists when field strengths are considered, and the re-\nlated SL(2, Z) invariants that appear in supergravity can be conveniently classified using\ninvariant theory in abstract algebra, using the same framework developed in [28]. 7\n‚ Self-duality of M1T (γ “ 0). In this case, κ “ 0 , and we find that the dual prescription\nis again of the M1T type (3.44). The divergent term in Cp2q gain a sign sgnpδq due to the\nbranching phenomenon, i.e. SL(2, Z) relates D-strings and anti-D-strings to each other, while\nboth the original and dual frames are M1T. In the ω Ñ 8 limit, we find\nM1T\nœ\nκ “ 0\nrτMN “ |δ| τMN ,\ne rφ “ δ2 eφ ,\nrBp2q “ sgnpδq Bp2q ,\nrEMN “ |δ| EMN ,\nrc p0q “ δ´1 `\nα cp0q ` β\n˘\n,\nrCp2q “ sgnpδq Cp2q ,\n(3.52)\nwhile Cp4q is invariant. In this case, the polynomial realisation trivialises to a discrete trans-\nformation. 8\nNext, we consider the action of SL(2, Z) S-duality on non-relativistic string theory, which has\nbeen studied in detail in [27–29]. In this case, the transformations differ according to whether\nγ cp0q` δ is zero or non-zero.\n7Invariant theory concerns the classification of the basis of invariants for systems of binary or multi-variable\nforms. This was an active field in the 19th century, which reached its peak when Hilbert published his seminal\npaper on an elegant proof of the finiteness theorem, alongside with the Nullstellensatz and the syzygy theorem,\nwhich form the foundation of the commutative algebraic interpretation of algebraic geometry [63].\n8Note that for integer-valued transformation parameters, when γ “ 0 we necessarily have α “ δ “ ˘1.\nHowever, we do not use this to simplify the transformations here in order that they can also be read as being\nvalid as classical SLp2, Rq transformations in a supergravity description of the M1T geometry.\n– 20 –\n\n\n‚ Self-duality of non-relativistic string theory (γ cp0q ` δ ‰ 0).\nIn this case, the SL(2, Z)\ntransformation maps non-relativistic string theory to itself, with\nrτ MN “\nˇˇγ cp0q` δ\nˇˇ τ MN ,\ne rφ “\n`\nγ cp0q` δ\n˘2 eφ ,\n(3.53a)\nrEMN “\nˇˇγ cp0q ` δ\nˇˇ EMN ,\nrc p0q “ α cp0q ` β\nγ cp0q ` δ ,\n(3.53b)\nand the below polynomial transformation of the gauge potentials, with s “ sgn\n`\nγ cp0q` δ\n˘\n:\nnon-rel. string\nœ\n1\nκ ‰ 0\n¨\n˚\n˚\n˝\nrℓp2q\n´s rCp2q\ns rBp2q\n˛\n‹‹‚“\n¨\n˚\n˚\n˝\n1\n0\n0\n´κ\n1\n0\nκ2\n2\n´κ 1\n˛\n‹‹‚\n¨\n˚\n˚\n˝\nℓp2q\n´Cp2q\nBp2q\n˛\n‹‹‚,\n(3.54a)\nrCp4q “ rCp4q ´ 1\n2 κ Bp2q^ ℓp2q ` 1\n4 κ2 Cp2q^ ℓp2q,\n(3.54b)\nwhich are analogous to (3.51).\nHowever, importantly, κ is now replaced with κ´1 in the\ntransformation matrix.\n‚ From non-relativistic string theory to M1T (γ cp0q ` δ “ 0). In this case, cp0q “ ´δ{γ is\nrational. The SL(2, Z) transformation maps non-relativistic string theory to M1T, with\nnon-rel. string theory Ñ M1T\nγ cp0q` δ “ 0\nrτMN “ |γ|\ngs\nτMN ,\ne rφ “ γ2 e´φ ,\nrBp2q “ ´ sgnpγq Cp2q ,\n(3.55a)\nrEMN “ |γ|\ngs\nEMN ,\nrc p0q “ α\nγ ,\nrCp2q “ sgnpγq Bp2q ,\n(3.55b)\nwhile Cp4q remains invariant.\nWhen consecutive transformations are considered, one has to make sure to start with\nthe correct branch. For example, after we apply the rule (3.51) mapping from M1T to non-\nrelativistic string theory with κ “ κ1 , the rule (3.54) mapping non-relativistic string theory\nto itself with κ “ κ2 is only applicable if the branching factor in (3.51) is positive. The\ncomposed transformations are self-consistently the ones in (3.51) with κ “ κ´1\n1\n` κ2 .\n3.3. SL(2, Z) T-Duality Asymmetry\nWe now show that an analogous polynomial realisation of SL(2, Z) also arises from the T-\nduality asymmetry between MpT and M(p+2)T as shown in Figure 3.\n– 21 –\n\n\nMpT\nM(p+2)T\nγ B` δ “ 0\nγ ‰ 0\nγ B` δ ‰ 0\nγ “ 0\nFigure 3. SL(2, Z) T-duality asymmetry between MpT on a transverse 2-torus and M(p+2)T on\na longitudinal 2-torus, in terms of the SL(2, Z) group parameters and the internal B-field B . This\nfigure is analogous to the SL(2, Z) S-duality asymmetry in Figure 2.\n3.3.1. SL(2, Z) from O(2, 2; Z) Duality\nWe start with type II string theory, before any decoupling limit is taken. T-duality on a d-\ndimensional internal torus (with coordinates xiq consists of Opd, d; Zq transformations, which\nact tensorially as linear transformations on the following combination (‘generalised metric’)\nof the internal metric Gij and Kalb-Ramond field Bij :\nH “\n˜\nGij ´ Bik GkℓBℓj\nBik Gkj\n´Gik Bkj\nGij\n¸\n.\n(3.56)\nWhen d “ 2 , and after a proper change of basis (see Appendix A), we decompose the\ngeneralised metric as\nH Ñ\nGij\n?\nG\nb 1\nτ2\n˜ˇˇτ\nˇˇ2 τ1\nτ1\n1\n¸\n,\nG ” det\n`\nGij\n˘\n,\nτ ” τ1 ` i τ2 “ B ` i G\n1\n2 ,\n(3.57)\nwhere Bij “ B ϵij . Here, the second factor in H can be thought of as the modulus of a\nmetric on a ‘hidden’ torus, with τ the modulus akin to (3.35) and the following identifications\nbetween SL(2, Z) S- and T-duality:\nS-duality\nT-duality\nC(0)\nB\neΦ\nG´ 1\n2\n(3.58)\nThe full T-duality group is O(2, 2; Z). We are interested in the part of O(2, 2; Z) that is\nbeyond the Z2 transformation associated with the Buscher duality on a single circle, and\ntherefore consider the SO(2, 2; Z) subgroup that factorises as\nSOp2, 2; Zq “\n´\nSLp2, Zq ˆ SLp2, Zq\n¯\n{Z2 .\n(3.59)\nOne of these SL(2, Z) factors generates geometric volume-preserving transformations of the\ntwo isometry directions on the internal torus. The other SL(2, Z) subgroup acts on the hidden\n– 22 –\n\n\ntorus with modulus τ as prescribed in (3.57). The Buscher transformation acting on a single\ncircle exchanges the two SL(2, Z)’s and thus extends SO(2, 2; Z) to the full T-duality group\nO(2, 2; Z). This exchange reveals that the ‘hidden’ torus with modulus τ becomes the physical\ntorus of the theory T-dual under a single Buscher transformation. Note this torus will again\nbe anisotropic with respect to scalings in ω.\n3.3.2. Matrix p-Brane Theory on a 2-Torus\nWe now study how the SL(2, Z) T-duality associated with the modulus τ in (3.57) acts on\nMpT. We have learned in Section 3.1 that MpT on a transverse 2-torus is T-dualised to\nitself if B ‰ 0 but to M(p+2)T on a longitudinal 2-torus if B “ 0 , while Mpp ` 2qT always\nT-dualises to MpT with vanishing B-field on the torus. The SL(2, Z) generalisation of this\nBuscher T-duality asymmetry will introduce a more involved structure as in Section 3.2.2. To\nspell out the similarities, first we consider MpT compactified on a transverse 2-torus. From\nthe BPS decoupling limit (2.9), we read off that\nGij “ Eij\nω\nùñ\nG´ 1\n2 “ ω g´ 1\n2 ,\ng “ det\n`\nEij\n˘\n.\n(3.60)\nThis is analogous to the dilaton prescription eΦ “ ω eφ in (3.48) for non-relativistic string\ntheory. Conversely, if we consider M(p+2)T on a longitudinal torus, then (3.60) is replaced\nwith\nGij “ ω τij\nùñ\nG´ 1\n2 “ g´ 1\n2\nω\n,\ng “ det\n`\nτij\n˘\n.\n(3.61)\nThis is analogous to the dilaton prescription eΦ “ ω´1 eφ in M1T (see (3.44)). We then form\nthe following dictionary mapping between the SL(2, Z) S- and T-duality asymmetry:\nS-duality asymmetry\nT-duality asymmetry\nnon-rel. string/M1T\nMpT/M(p+2)T\nc(0)\nB\neφ\ng´1{2\nτMN\nEMN\ne´φ\n(3.62)\nand, in contrast to the expression in (3.46), the asymmetry factor κ now becomes\nκ “\nγ ?g\nγ B ` δ .\n(3.63)\nThe same SL(2, Z) S-duality structure in Section 3.2.2 then translates directly to T-duality\nasymmetry, as depicted in Figure 3.\nTo write down the explicit transformation rules for the gauge potentials requires some\nadditional work. The original T-duality SLp2, Zq doublets are the one-forms arising from the\nmetric and B-field as well as RR polyforms with zero or two toroidal indices (see Appendix A),\nwhereas in the S-duality case we only needed to consider the two-form doublet. The trans-\nformations of the doublet can again be conveniently expressed by considering combinations\n– 23 –\n\n\nalong the lines of (3.49), where we contract with vielbeins for the SLp2q{SOp2q coset to obtain\na doublet transforming under the SOp2q rotation of the form (3.42). Meanwhile, the T-duality\nsinglets include a two-form arising from the B-field and an RR polyform with one toroidal\nindex, whereas in the S-duality case we had just the invariant four-form. Starting from first\nprinciples, one needs to combine the SLp2, Zq T-duality transformations of these multiplets\n(following from Appendix A) with the appropriate decomposition of the MpT background\nfields with longitudinal or transverse isometries (following from Appendix B.1 specialised to\nd “ 2). After expanding in ω and after some algebra, we can read off the dual background.\nIt can then be shown that the resulting SL(2, Z) transformations also take an elegant\npolynomial form using the powerful approach of invariant theory, as we have briefly com-\nmented on earlier below (3.51). According to [28], an N-dimensional polynomial realisation\nof SL(2, Z) can be written as a lower triangular matrix UNpxq acting on an N-dimensional\nvector field V, such that the SL(2, Z) transformation takes the form,\nV Ñ UNpxq V ,\nUNpxq “\n¨\n˚\n˚\n˚\n˚\n˚\n˚\n˚\n˚\n˚\n˝\n1\n0\n0\n¨ ¨ ¨\n0\n´x\n1\n0\n¨ ¨ ¨\n0\nx2\n2\n´x\n1\n¨ ¨ ¨\n0\n...\n...\n...\n...\n...\np´xqN´1\npN´1q!\np´xqN´2\npN´2q!\np´xqN´3\npN´3q!\n¨ ¨ ¨\n1\n˛\n‹‹‹‹‹‹‹‹‹‚\n.\n(3.64)\nBelow, we spell out the final results of this procedure, which makes use of polynomial realisa-\ntions with N “ 2 and N “ 4. For ease of presentation, we omit all the branching factors by\ncommitting ourselves to a particular pair of branches connected by the SL(2, Z) transforma-\ntion. The transformations involving other branches are identical except for various changes\nof signs. It is convenient to deal with the SL(2, Z) transformations of the MpT (or M(p+2)T)\nRR potentials cpqq in a collective way by introducing the polyform\nCpoly “\nÿ\nq\ncpqq^ eBp2q .\n(3.65)\nDecomposing with respect to the splitting of the spacetime index M “ pµ , iq, with xi the\ncoordinates on the internal 2-torus, we write as in (3.28),\nCpoly “ C0 ` Ci dxi ` 1\n2 C12 ϵij dxi ^ dxj .\n(3.66)\nWe further define\nAi ” g\n1\n2 Ai ,\nBi ” g´ 1\n2 ϵij bj ,\nL ” τ 0^ ¨ ¨ ¨ ^ τ p ,\npO1 O2q ” 1\n2 ϵij Oi\n1^Oj\n2 .\nOn the MpT side, where the internal torus is transverse, we define the following quantity\n– 24 –\n\n\ncarrying a four-dimensional polynomial realisation:\nCMpT ”\n¨\n˚\n˚\n˚\n˚\n˚\n˝\n3\n`\nBB\n˘\n^L\n“\n´1\n4\n`\nAB\n˘2 ` 3\n`\nAB\n˘\n´ 1\n‰\n^L\ng\n1\n2 C0\n´g´ 1\n2 `\nC12 ´ C0 B\n˘\n`\n`\nAA\n˘\n^L\n˛\n‹‹‹‹‹‚\n.\n(3.67)\nOn the M(p+2)T side, where the internal torus is longitudinal, we instead define\nCM(p+2)T ”\n¨\n˚\n˚\n˚\n˚\n˚\n˝\n3\n`\nAA\n˘\n^L\n“\n´1\n4\n`\nAB\n˘2 ´ 3\n`\nAB\n˘\n´ 1\n‰\n^L\ng´ 1\n2 `\nC12 ´ C0 B\n˘\ng\n1\n2 C0 `\n`\nBB\n˘\n^L\n˛\n‹‹‹‹‹‚\n.\n(3.68)\nWe find the following T-duality asymmetry between MpT and M(p+2)T:\nM(p+2)T Ñ MpT\nγ ą 0\n˜ rB\nrA\n¸\n“ U2\n`\n´ 1\nκ\n˘\n˜\nA\n´B\n¸\nrCM(p+2)T “ U4\n`\n´ 1\nκ\n˘\nCMpT\nrCi “ Ci ` ϵij L^\n”\n1\nκ Bj^epABq ´\n1\n2 κ2 Aj^e´pABqı\nM(p+2)T\nœ\nγ “ 0 pδ ą 0q\nrA “ A\nrB “ B\nrCpoly “ Cpoly\nMpT\nœ\nγ B ` δ ą 0\n˜ rB\nrA\n¸\n“ U2\n`\nκ\n˘\n˜\nB\nA\n¸\nrCMpT “ U4\n`\nκ\n˘\nCMpT\nrCi “ Ci ` ϵij L^\n”\nκ Aj^e´pABq ´ κ2\n2 Bj^epABqı\nMpT Ñ M(p+2)T\nγ B ` δ “ 0 pγ ą 0q\nrA “ ´B\nrC0 “ C12\nrB “ A\nrC12 “ ´C0\nrCi “ Ci\nIn the first and third cases we indeed arrive at the desired polynomial realisations of SL(2, Z).\nIt is also possible to combine the Ci with other fields to form a vector that transforms as in\n(3.64), but this would introduce further redundancies. Note that in order to match with the\nRR Buscher transformations of (3.29) one needs to take into account not only the choice of\nbranch, but the fact that the SLp2, Zq transformation used here differs from the conventional\nBuscher transformation by an additional coordinate transformation (see Appendix A).\n– 25 –\n\n\nFinally, we briefly comment on the case where MpT is compactified over an anisotropic\ntorus (or, equivalently, pinched tori), with one cycle in the longitudinal sector and the other\nin the transverse sector. We now revisit the BPS decoupling limit leading to MpT, where the\ntoroidal metric Gij in (3.57) before the limit is applied becomes\nGij “ ω τi τj ` 1\nω Ei Ej ,\nτi “\nd\nΓ\nρ2\n˜\n1\n´ρ1\n¸\n,\nEi “\na\nΓρ2\n˜\n0\n1\n¸\n,\n(3.69)\nwith the torus modulus rτ “ ρ1 `iρ2{ω and Γ the area of the torus. It then follows that G\n1\n2 “\nΓ , and the modulus τ in (3.57) associated with the hidden torus is independent of ω , i.e. τ “\nB ` i Γ . Therefore, in the ω Ñ 8 limit, in contrast to the T-duality asymmetry discussed\nabove, the SL(2, Z) transformation associated with the hidden torus with the modulus τ is\nregular; in contrast, the other SL(2, Z) group associated with the real torus with the modulus\nρ is develops a T-duality ‘asymmetry’. However, there is no real asymmetry in this case,\nbecause MpT is mapped to itself, compactified on different anisotropic tori. Note that this\nT-duality on an anisotropic torus acts on the other SL(2, Z) subgroup to the T-duality which\nmaps between MpT and Mpp ` 2qT discussed above, and they are exchangeable with each\nother via a Buscher transformation acting on a single circle.\n3.4. IKKT Matrix Theory and Tensionless String\nAnother generalisation is to the case of MpT with p ă 0 .\nIt has been shown in [1, 2]\nthat MpT with p ă ´1 arises from a BPS decoupling limit that zooms in on a background\nEuclidean (spacelike) brane in type II˚ superstring theory [64]. In particular, Mp´1qT arises\nfrom a BPS decoupling limit that zooms in on a background D-instanton, and the dynamics\ntherein is described by the Ishibashi-Kawai-Kitazawa-Tsuchiya (IKKT) matrix theory [30].\nThe Mp´1qT limit can be inferred by performing a timelike T-duality transformation of the\nM0T limit, and the associated BPS limit is defined by the following reparametrisation of the\nbackground fields in type IIB superstring theory:\nds2 “ 1\nω ηµν dxµ dxν ,\neΦ “ i ω´2 eφ ,\nCp0q “ ω2 e´φ .\n(3.70a)\nThe extra i in eΦ implies that we analytically continue to type IIB˚ superstring theory. In\nM(-1)T, the whole target space is ‘transverse’ as the sector longitudinal to a background\ninstanton is pointlike in both space and time.\nIt is shown in [1, 2] that the fundamental string in Mp´1qT is described by tensionless\nstring theory [65, 66]. This can be made manifest by applying the limiting prescription (3.70)\nto the Nambu-Goto action of the fundamental string, which gives rise to\nSF1 “ ´ω´1 T\n2\nż\nd2σ\nc\n´ det\n´\nBαXµ BβXµ\n¯\n.\n(3.71)\nIt is manifest that for ω Ñ 8 the tension ω´1 T goes to zero. Such a tensionless limit of the\nstring worldsheet theory gives rise to a finite worldsheet action in the Polyakov formulation,\n– 26 –\n\n\nwhere the worldsheet topology develops nodal points. This is reminiscent of the amplitude\ncalculations [67, 68] in ambitwistor string theory [69], which is described by a chiral worldsheet\naction that formally arises from a singular gauge choice in tensionless string theory [70, 71].\nT-dualising Mp´1qT over a spatial toroidal compactification proceeds analogously as for\nMpT with p ě 0 . If the B-field on the d-dimensional internal torus is of rank d , then Mp´1qT\nis T-dualised to itself [31]. 9 However, if the rank r of the internal B-field smaller than d ,\nwith r ă d , then the T-dual theory is in general Mrp T with rp “ ´1 ´ pd ´ rq ă ´1 , whose\ntarget space now becomes Carroll-like [1, 2]. In such a generalised Carrollian spacetime, a\nspacelike (instead of Minkowskian) sector of the target space is absolute, and the remaining\nMinkowskian sector is mapped to this absolute spatial sector via Carroll-like boosts.\nThe Carroll-like dynamics of MpT with p ă ´1 is expected to be captured by a new matrix\ntheory from T-dualising IKKT matrix theory on a toroidal compactification. Moreover, it is\nknown that MpT is related to M(´p ´ 1)T via a timelike T-duality transformation, which\nshould be viewed as an analytic continuation instead of a genuine T-dual equivalence [2]. We\ndefer the intricacies of T-duality in these novel corners of string theory for future study. 10\n4. Intermezzo: Duality Asymmetry from Matrix Theory\nNow let us come full circle and discuss the relationship between the duality asymmetry of\nnon-Lorentzian backgrounds and known features of matrix theory.\nWe began in Section 3.1 with the simple example of M0T with a transverse 2-torus\ncarrying a non-trivial B-field. The usual M0T limit, without a B-field, gives BFSS matrix\ntheory, and can also be phrased in terms of the DLCQ of M-theory. Adding the B-field on\na 2-torus is equivalent to turning on the M-theory three-form with a component C12´ in the\nnull direction of the DLCQ. This configuration was famously argued in [23] to correspond to\nmatrix theory on a non-commutative torus.\n‚ T-duality as Morita equivalence.\nLet us briefly review how the above described non-\ncommutativity is realised. Following [23], we consider the IKKT matrix theory on a 2-torus.\nThis is related to the BFSS matrix theory on a 2-torus by compactifying a further direction,\nwhich, as noted above, would correspond to a timelike direction in M0T. This implies that\nthe IKKT matrix theory lives in Mp´1qT. The 0-dimensional IKKT matrix theory is\nS „ tr\n´“\nXµ , Xν\n‰ “\nXµ , Xν\n‰\n` fermions\n¯\n,\n(4.1)\nwhere Xµ , µ “ 0 , ¨ ¨ ¨ , 9 are N ˆ N matrices. Note that µ is now an Euclidean index i.e. we\ninclude a Wick rotation when relating Mp´1qT and M0T. We compactify X0 and X1 on a\n2-torus, whose periodicity implies that there exists invertible matrices U0 and U1 , such that\nX0 ` R0 “ U0 X0 U´1\n0 ,\nXi “ U0 Xi U´1\n0\n,\n(4.2a)\n9We would like to thank Ritankar Chatterjee for discussions on this topic.\n10E.g. see [72] for recent work on the Carrollian superstring in MpT with p ă 0, which also extends the\nstudy of T-duality in one direction in [2].\n– 27 –\n\n\nX1 ` R1 “ U1 X1 U´1\n1 ,\nXi “ U1 Xi U´1\n1\n,\n(4.2b)\nwith i “ 2 , ¨ ¨ ¨ , 9 . It follows that U0 U1 “ λ U1 U0 , where λ “ e2πi θ is a complex constant.\nIf λ “ 1, then the 2-torus is an ordinary commutative torus, while if λ ‰ 1 then we have a\nnon-commutative torus. Viewing the real variable θ, instead of the complex variable λ, as a\nparameter of the non-commutative torus, it turns out that there is an equivalence between\ndifferent such tori under an SLp2, Zq action:\nrθ “ α θ ` β\nγ θ ` δ ,\n(4.3)\nwhere αδ ´ βγ “ 1. When the map (4.3) between θ and rθ is invertible, the two algebras\ndefined by U0 U1 “ e2πi θ U1 U0 and U0 U1 “ e2πi rθ U1 U0 are equivalent to each other up to a\nphase factor, which is an example of Morita equivalence [33]. In [23] it was argued that the\ntransformation (4.3) is induced by SLp2, Zq T-duality given the identification θ „ B, where B\nis the non-zero component of the B-field on the original geometry to which the Mp´1qT (or\nM0T) limit is taken. Indeed, for γ B ` δ ‰ 0, (4.3) is the fractional linear transformation of\nthe B-field on a transverse 2-torus in MpT that follows from the results in Section 3, where\nthe explicit form comes from applying the dictionary (3.62) to (3.53). According to Fig. 3,\nthese transformations map MpT to itself, but in different background fields.\nWhen B, or θ, is rational, there are two special cases to consider. Firstly, suppose we\nchoose the transformation parameters such that α θ ` β “ 0. In this case, the associated\ntransformation (4.3) maps θ ‰ 0 to rθ “ 0, leading to an equivalent description in terms of\nmatrix theory on a commutative torus. This is a well-known statement, and still a transfor-\nmation from MpT to itself. Secondly, suppose we choose the transformation parameters such\nthat γ θ ` δ “ 0. The transformation (4.3) is singular. However, according to Section 3.3,\nwhat we are really doing is mapping from MpT to a dual Mpp ` 2qT limit, on a longitu-\ndinal 2-torus and with a B-field rB “ α{γ . 11 This takes us to usual matrix theory (SYM)\non Dpp ` 2q-branes, without non-commutativity but with a constant magnetic field on the\nbrane. As we will see explicitly below, the Mpp ` 2qT limit with longitudinal B-field leads to\nvanishing non-commutativity.\nNote that more generally, we could consider M0T on a d-dimensional torus with a B-\nfield on the torus. This leads to matrix theory on a non-commutative d-torus, with non-\ncommutativity parameters θij transforming now under SOpd, d; Zq, inherited from the T-\nduality of string theory [23, 24, 33–35].\n‚ T-duality and Seiberg-Witten map. Now, suppose the B-field on the d-dimensional torus is\nof rank r. We have seen that T-dualising on the torus directions will lead to a dual Mpd´rqT\nlimit. The D0-branes on which the matrix theory live in the M0T limit transform into Dd-\nbranes in the Mpd ´ rqT limit. The gauge theory on these Dd-branes is Non-Commutative\nYang-Mills (NCYM). This T-dual picture was described by Seiberg and Witten [24]. It is\n11This is obtained by applying the dictionary (3.62) to the transformation of cp0q in (3.55b).\n– 28 –\n\n\nilluminating to dive briefly into some details. The Seiberg-Witten map defines an effective\nopen string metric Gij and a (T-dual) non-commutativity parameter θij via\n´\nG´1 ` θ\n¯ij\n“\n”\npG ` Bq´1ıij\n.\n(4.4)\nLet us focus once more on the case of T-duality acting on a two-dimensional torus, taking\nd “ 2 and r “ 0 or r “ 2. In the two-dimensional case, the SLp2, Zq modulus τ “ B ` i\n?\nG\nof (3.57) becomes in open string variables\nτ “ ´θ ` i\n?\nG\nG ` θ2\n,\n(4.5)\nwhere G ” det Gij and θij “ θ ϵij.\nNext, we consider the fate of these open string variables under the two T-dual decoupling\nlimits studied in Section 3.3, associated with MpT on a transverse 2-torus and Mpp`2qT on a\nlongitudinal 2-torus. Here we can allow for general values of p. In both cases, the open string\n(inverse) volume modulus scales the same way,\n?\nG “ ω´1?\nG , where in the MpT case we have\n?\nG “\na\ndet Eij{B2 and in the Mpp ` 2qT case we have\n?\nG “ 1{\na\ndet τij . We then find that\nθ “ ´1{B in MpT, indicating (for B ‰ 0) a non-commutative theory from the open string\nperspective, while always θ “ 0 in Mpp ` 2qT (regardless of the B-field on the longitudinal\ntorus). In both cases, we have the following induced SLp2, Zq T-duality transformations:\nb\nrG “\n?\nG\npα ´ β θq2 ,\nrθ “ ´ γ ´ δ θ\nα ´ β θ .\n(4.6)\nWe can then consider the effect of these transformations for the different cases displayed in\nFigure 3. For instance, if we start with MpT with non-vanishing θ “ ´1{B, then transforma-\ntions with γ B `δ ‰ 0, or equivalently γ ´δ θ ‰ 0, take us to MpT with non-vanishing rθ . If θ\nis non-zero and rational, we can find a transformation such that γ ´ δ θ “ 0 , which maps us\nto an open string picture with rθ “ 0. This corresponds to a transformation with γ B ` δ “ 0 ,\nwhich in fact maps MpT to Mpp ` 2qT. 12\nOne can similarly check the transformations of Mpp`2qT with θ “ 0 , which give Mpp`2qT\nwith rθ “ 0 for γ “ 0 and MpT with rθ ‰ 0 for γ ‰ 0 .\nInterpreted in terms of gauge theories on D(p+2)-branes, this tells us that (in this setup\nwith a single B-field component) an MpT limit realises the Seiberg-Witten limit [24] leading\nto non-commutative Yang-Mills, while an Mpp ` 2qT limit leads to standard Yang-Mills. In\nthe next section, we will see an explicit realisation of this in a holographic setting.\n5. B-Field, Non-Commutativity, and Holography\nWe have seen above that there is an interesting interplay between the presence of a B-\nfield, string duality of non-Lorentzian corners of string theory, and non-commutative matrix\n12We can also comment on the singular transformations with α´β θ “ 0. From the closed string geometrical\nperspective, these are just the transformations that set rB “ 0 in MpT. From the open string perspective, the\nSeiberg-Witten map is itself singular in the decoupling limit for this value.\n– 29 –\n\n\n(gauge) theories. In this Section, we turn our attention to analysing some explicit examples\nof geometries with B-fields which have an important role in holographic duality involving\nnon-commutative gauge theories.\nIn [3], we showed how applying MpT decoupling limits to curved D-brane geometries\nallowed one to derive the usual AdS/CFT correspondence as well as novel non-Lorentzian\ngeneralisations. Asymptotically, applying the MpT limit in the form of (2.9) generates a\nflat non-Lorentzian background, and induces the limit leading to super-Yang-Mills (SYM) on\nDp-branes. In the bulk curved geometry, the same limit produces the near-horizon geometry.\nFurther MqT limits can be applied leading to limits of SYM dual to non-Lorentzian bulk\ngeometries. In this Section, we show how this same logic carries over to D-brane solutions\nwith non-trivial B-fields dual to non-commutative versions of SYM.\nIn particular, we will study (generalisations of) the Hashimoto-Itzhaki-Maldacena-Russo\nbackground [46, 47] holographically dual to four-dimensional non-commutative Yang-Mills\ntheory (NCYM), which involves a constant B-field at infinity. We will discuss how duality\nasymmetry manifests, and further exhibit novel non-Lorentzian geometries that are conjec-\nturally holographically dual to further BPS decoupling limits of NCYM.\n5.1. Holographic Duals for Non-Commutative Yang-Mills\n‚ Dp-D(p+2)-brane geometry in B-field. The relevant geometries arise from solutions de-\nscribing a Dp-brane dissolved in a D(p+2)-brane.\nTaking a specific near-horizon limit of\nthese solutions leads to the holographic duals of NCYM [46–48]. The p “ 1 case corresponds\nto the geometry analysed by Maldacena and Russo in [47] dual to four-dimensional NCYM.\nIn order to generate the initial Dp-D(p+2) solutions, we follow [73] (see also [74]) and start\nwith the D(p+1)-brane solution for p ă 5, given by:\nds2 “\n1\n?\nH\n´\n´dX2\n0 ` ¨ ¨ ¨ ` dX2\np ` dX2\np`1\n¯\n`\n?\nH\n´\ndX2\np`2 ` dX2\np`3 ` ¨ ¨ ¨ ` dX2\n9\n¯\n, (5.1a)\nCpp`1q “\n`\nGs H\n˘´1dX0^¨ ¨ ¨^dXp ,\neΦ “ Gs H\n2´p\n4 .\n(5.1b)\nWe smear this geometry in Xp`2 such that the harmonic function H “ HpRq is independent\nof Xp`2, with R2 ” X2\np`3 ` ¨ ¨ ¨ ` X2\n9 . Rotating in the Xp`1–Xp`2 plane by a constant angle\nΘ and then T-dualising along one of the rotated directions, we generate the following solution\nwith Dp-branes delocalised in a D(p+2)-brane worldvolume:\nds2 “\n1\n?\nH\n«´\n´dX2\n0 ` ¨ ¨ ¨ ` dX2\np\n¯\n`\ndX2\np`1 ` dX2\np`2\ncos2 Θ ` H´1 sin2 Θ\nff\n`\n?\nH\n´\ndX2\np`3 ` ¨ ¨ ¨ ` dX2\n9\n¯\n,\nBp2q “ tan Θ dXp`1^dXp`2\nH cos2 Θ ` sin2 Θ\n,\neΦ “\nGs H\n1´p\n4\na\ncos2 Θ ` H´1 sin2 Θ\n,\n(5.2a)\nCpp`1q “ sin Θ\nGs H dX0^¨ ¨ ¨^dXp ,\nCpp`3q “ G´1\ns\ncos Θ dX0^¨ ¨ ¨^dXp`2\nH cos2 Θ ` sin2 Θ\n,\n(5.2b)\n– 30 –\n\n\nwhere to minimise notation we have relabelled the new coordinates after rotating and T-\ndualising again as Xp`1 and Xp`2. Moreover,\nH “ 1 `\nˆ L\nR\n˙5´p\n,\nL5´p “ p4πq\n3´p\n2\nΓp5´p\n2 q\n5 ´ p\nN Gs ℓ5´p\ns\ncos Θ\n,\n(5.3)\nwith N the number of D(p+2)-branes, ℓs the string length, and Gs the string coupling at the\nasymptotic infinity where R Ñ 8 . Note that, as in [47], we have shifted the Kalb-Ramond\ntwo-form by a constant tan Θ dXp`1^dXp`2 to get the solution (5.2).\nAt the asymptotic infinity where R Ñ 8 , we find H Ñ 1 and the solution (5.2) gives\nds2 “ ´dX2\n0 ` dX2\n1 ` ¨ ¨ ¨ ` dX2\n9 ,\nCpp`1q “ sin Θ\nGs\ndX0^¨ ¨ ¨^dXp ,\neΦ “ Gs ,\n(5.4a)\nBp2q “ tan Θ dXp`1^dXp`2 ,\nCpp`3q “ cos Θ\nGs\ndX0^¨ ¨ ¨^dXp`2 .\n(5.4b)\nThis shows that there is indeed a constant B-field whose value is given by tan Θ , originating\nfrom the shift we have performed.\n‚ Asymptotic BPS decoupling limit. We now follow the logic of our earlier paper [3], and\nseek asymptotic BPS decoupling limits, following the prescription (2.1), such that the ten-\ndimensional geometry asymptotes to the flat non-Lorentzian MqT geometry.\nThis means\ngrouping the coordinates into longitudinal and transverse sets, XA and XA1, and rescaling\nthem as XA “ ω1{2 xA and XA1 “ ω´1{2 xA1 . Simultaneously we are required to rescale the\nstring coupling Gs “ ωpq´3q{2gs . The asymptotic BPS decoupling limit is implemented by\nsending ω to infinity. This procedure will in turn induce a limit of the full bulk solution. We\nare interested in the cases where this limit is well-defined leading to either a near-horizon\nlimit (which remains a Lorentzian geometry) or a new non-Lorentzian MqT geometry.\nIn the present case, a natural choice would be to apply an asymptotic Mpp ` 2qT limit\naligned with the Dpp ` 2q-brane configuration of the solution (5.2), i.e. choosing XA “\npX0, . . . , Xp`2q to be the longitudinal sector. This simply generates the standard near-horizon\nlimit of this brane geometry, with a vanishing B-field in the associated ω Ñ 8 limit. This is\nas expected from [47] and the discussion in Section 4.\nInstead, we consider the asymptotic MpT limit aligned with the Dp-brane configuration\nof the solution (5.2), i.e. choosing XA “ pX0, . . . , Xpq to be the longitudinal sector. In this\ncase, we have to ensure that the B-field is finite. In particular, we require that, after taking\nthe ω Ñ 8 limit, the resulting MpT geometry at asymptotic infinity is described by\n`\nτ 0 , ¨ ¨ ¨ , τ p˘\n“\n`\ndt , dx1, ¨ ¨ ¨ , dxp˘\n,\n`\nEp`1 , ¨ ¨ ¨ , E9˘\n“\n`\ndxp`1, ¨ ¨ ¨ , dx9˘\n,\nbp2q “ B dxp`1^dxp`2 ,\n(5.5)\ntogether with a constant string coupling gs and some RR potentials, whose values we do\nnot specify a priori. Comparing with the flat-spacetime MpT prescription (2.1), we find the\nfollowing prescription:\n`\nX0, ¨ ¨ ¨ , Xp˘\n“ ?ω\n`\nt , x1, ¨ ¨ ¨ , xp˘\n,\nGs “ gs ω\np´3\n2 ,\n(5.6a)\n– 31 –\n\n\n`\nXp`1, ¨ ¨ ¨ , X9˘\n“\n1\n?ω\n`\nxp`1, ¨ ¨ ¨ , x9˘\n,\nΘ “ arctan\n`\nω B\n˘\n.\n(5.6b)\nWithout loss of generality, we assume that B ą 0 . We emphasise that our convention, as\nin [3], is that α1 is kept fixed. One may translate conventions, using for instance that ds2{α1 is\nfixed, to confirm that the decoupling limit we use matches the α1 Ñ 0 limit taken in [46–48].\nThen, in the ω Ñ 8 limit of the asymptotic geometry (5.4), we are led to the MpT\ngeometry (5.5), with the RR potentials\ncpp`1q “ ´\n1\n2 gs B2 dx0^¨ ¨ ¨^dxp ,\ncpp`3q “\n1\ngs B dx0^¨ ¨ ¨^dxp`2 .\n(5.7)\nThe complete asymptotic MpT geometry is then described by (5.5) and (5.7).\n‚ Generating the bulk near-horizon limit. Next, we apply the asymptotic BPS decoupling\nlimit prescribed by (5.6) to the bulk supergravity solution (5.2). It can be checked that the\nω Ñ 8 limit generates the near-horizon limit in the bulk, leading to the following geometry:\nds2 “ Ω\n´\n´dt2 ` ¨ ¨ ¨ ` dx2\np\n¯\n` 1\nΩ\n«\ndx2\np`1` dx2\np`2\n1 ` pΩBq´2\n` dx2\np`3 ` ¨ ¨ ¨ ` dx2\n9\nff\n,\n(5.8a)\nBp2q “\nB\n1 ` pΩBq´2 dxp`1^dxp`2 ,\neΦ “\nΩ\np´3\n2 gs\na\n1 ` pΩBq´2 ,\n(5.8b)\nCpp`1q “ Ω2\ngs\ndt^dx1^ ¨ ¨ ¨^dxp ,\nCpp`3q “\n`\ngs B\n˘´1\n1 ` pΩBq´2 dt^dx1^¨ ¨ ¨^dxp`2 ,\n(5.8c)\nwhere\nΩ“\n´r\nℓ\n¯5´p\n2 ,\nr2 “ x2\np`3 ` ¨ ¨ ¨ ` x2\n9 ,\nℓ5´p “ p4πq\n3´p\n2\nΓ\n` 5´p\n2\n˘\n5 ´ p N Gs ℓ5´p\ns\nB .\n(5.9)\nIn the special case of p “ 1 , we recover the Maldacena-Russo geometry [47], whose NSNS\nsector was obtained in [46]. When p ‰ 1, we recover the backgrounds studied in [48]. These\nare the holographic duals of NCYM on the Dpp ` 2q-brane.\nIn the ΩÑ 8 limit of the holographic geometry (5.8), i.e. when pr{ℓq Ñ 8, we recover\nthe asymptotic MpT geometry (5.5) up to a shift of the RR potential cpp`1q. This shift can\nbe understood by noting that the limit of the asymptotic RR potentials of (5.4) is sensitive to\nsubleading Opω´2q terms in sin Θ . As in the simpler near-horizon geometries discussed in [3],\nit should be possible to view the full bulk Lorentzian near-horizon geometry as a deformation\nof the asymptotic flat non-Lorentzian geometry, with the geometric deformation determined\nby the replacement ω Ñ Ω. To ensure this is the case, we are led to the following modification\nof the asymptotic limiting prescription (5.6):\n`\nX0, ¨ ¨ ¨ , Xp˘\n“ ?ω\n`\nt , x1, ¨ ¨ ¨ , xp˘\n,\nGs “\ngs ω\np´3\n2\n?\n1 ` ω´2 B´2 ,\nΘ “ arctan\n`\nω B\n˘\n,\n– 32 –\n\n\n`\nXp`3, ¨ ¨ ¨ , X9˘\n“\n1\n?ω\n`\nxp`3, ¨ ¨ ¨ , x9˘\n,\n`\nXp`1, Xp`2˘\n“\n`\nxp`1, xp`2˘\n?\nω ` ω´1 B´2 .\n(5.10)\nNow, in the ω Ñ 8 limit, the asymptotic MpT geometry is described by\n`\nτ 0 , ¨ ¨ ¨ , τ p˘\n“\n`\ndt , dx1, ¨ ¨ ¨ , dxp˘\n,\nbp2q “ B dxp`1^dxp`2 ,\n(5.11a)\n`\nEp`1 , ¨ ¨ ¨ , E9˘\n“\n`\ndxp`1, ¨ ¨ ¨ , dx9˘\n,\ncpp`3q “\n1\ngs B dx0^¨ ¨ ¨^dxp`2 .\n(5.11b)\nThis is almost identical to (5.5) and (5.7) except that now cpp`1q “ 0 in the asymptotic\nMpT geometry. After the above replacement, the ω-deformed prescription of the asymptotic\nMpT geometry (which is flat before the deformation) precisely gives rise to the bulk curved\ngeometry (5.8) upon replacing ω with Ω. We will show later in Section 5.2.2 that, after\nan S-duality transformation, the deformation parametrised by the background-dependent\nquantity Ωreceives an interpretation as the T ¯T-deformation of non-relativistic string theory,\nconforming to the expectation from [3].\n‚ Non-commutative Yang-Mills theory. The field theory dual is described by the gauge theory\non a stack of D(p+2)-branes that extend in pt, x1, ¨ ¨ ¨ , xp`2q at the asymptotic infinity. These\nbranes are orthogonal to pxp`3, ¨ ¨ ¨ , x9q that enter in the definition of r in (5.9). Due to the\npresence of the B-field in the pxp`1, xp`2q-plane, the gauge theory on such D(p+2)-branes is\nNCYM. The non-commutativity between xp`1 and xp`2 is made manifest after applying the\nSeiberg-Witten map [24], discussed briefly in Section 4, to pass to the effective description\nin terms of the open string. Before sending ω to infinity, the limiting prescription leading\nto the asymptotic geometry is given in (5.10). The reparametrised background fields in the\nasymptotic infinity are essentially given by (5.8) except that Ωis replaced with ω , so that in\nparticular the asymptotic NSNS sector is:\nds2 “ ω\n´\n´dt2 ` ¨ ¨ ¨ ` dx2\np\n¯\n` 1\nω\n«\ndx2\np`1` dx2\np`2\n1 ` pω Bq´2\n` dx2\np`3 ` ¨ ¨ ¨ ` dx2\n9\nff\n,\n(5.12a)\nBp2q “\nB\n1 ` pω Bq´2 dxp`1^dxp`2 ,\neΦ “\ngs ω\np´3\n2\na\n1 ` pω Bq´2 .\n(5.12b)\nThe Seiberg-Witten map says that, in the effective propagator of open strings, the non-\ncommutativity between the worldvolume coordinates is determined by\n“\nxα, xβ‰\n9\nˆ\n1\nG ` B B\n1\nG ´ B\n˙αβ\n,\nα “ 0 , ¨ ¨ ¨ , p ` 2\nωÑ8\nùùùùñ\n“\nxp`1, xp`2‰\n9 1\nB .\n(5.13)\nTherefore, the worldvolume coordinates xp`1 and xp`2 do not commute with each other on\nthe brane. Moreover, the open string coupling from the Seiberg-Witten map is given by\ng2\no “ eΦ\nc\ndetpG ` Bq\ndet G\n“ ω\np´1\n2 gs B ,\n(5.14)\n– 33 –\n\n\nwhich implies that the effective NCYM coupling is proportional to\n?\nB . When p “ 1 as in [47]\nwe automatically have a finite NCYM coupling (before taking the large N limit). For general\np, (5.14) can be viewed as defining the ω expansion of the open string coupling in this MpT\nlimit prescribed by (5.12). To see that this is sensible, we check explicitly that the D-brane\naction is finite and extract the effective NCYM coupling, which is also given by gYM „\na\ngs B.\nNamely, we apply the limiting prescription directly to a single probe D(p+2)-brane extending\nin pt, x1, ¨ ¨ ¨ , xp`2q at the asymptotic infinity, where there is a U(1) gauge field strength Fαβ\nresiding on the brane. As a particularly simple example, we consider the case where p “ 0 . A\nshort calculation shows that the ω Ñ 8 limit of the D2-brane action leads to a finite action,\nSD2 „\n1\n2 B2 gs\nż\nd3σ B2 `\nF 2\n01 ` F 2\n02\n˘\n´ F 2\n12\nB ` F12\n.\n(5.15)\nRecall that we have assumed B ą 0 , which can be thought of as a vacuum expectation value\nof the field strength F12 . After rescaling F12 Ñ BF12, we expand the action for small F12 as\nSD2 „ ´\n1\n4 g2\nYM\nż\nd3σ\n8\nÿ\nn“0\n`\n´F12\n˘n Fαβ F αβ ,\n(5.16)\nwhere the effective gauge coupling is indeed gYM „\na\ngs B . The p ą 1 cases work similarly.\nIn the non-abelian case and in terms of the open string data, NCYM involves the field\nstrength Fµν “ BµAν ´ BνAµ ´ i pAµ ‹ Aν ´ Aν ‹ Aµq , where ‘‹’ denotes the Moyal product\nand involves the non-commutative parameter θ as introduced in Section 4 [24].\n5.2. Asymptotic Duality Asymmetry\nHaving described the holographic duals for NCYM in Section 5.1, with the new emphasis on its\nnon-Lorentzian geometric aspect, we now apply the insights of duality asymmetry developed\nin Section 3 to study how duality transformations act on these backgrounds. In this scenario,\nit is always the asymptotic geometry that becomes non-Lorentzian, while the bulk geometry\nremains Lorentzian, which constitutes an example of the DLCQ0/DLCQ1 correspondence as\nproposed in [3]. Therefore, it is the ‘asymptotic’ duality asymmetry that we will focus on in\nthis case. Later in Section 5.3, we will study examples with a non-Lorentzian bulk geometry,\nalso in the presence of a B-field.\n5.2.1. Asymptotic T-duality\n‚ Self-duality of asymptotic MpT. Now, we take a closer look at the near-horizon geome-\ntry (5.8), which asymptotes to the non-Lorentzian MpT geometry (5.11) with a constant\nB-field in the xp`1 and xp`2 directions. Our general results tell us that T-dualising these\ndirections will lead to a dual MpT description asymptotically, as long as the B-field is not\nzero. Intriguingly, T-dualising xp`1 and xp`2 generates a particularly simple bulk geometry,\nds2 “ Ω\n´\n´dt2 ` dx2\n1 ` ¨ ¨ ¨ ` dx2\np\n¯\n` 1\nΩ\n˜\ndx2\np`1 ` dx2\np`2\nB2\n` dx2\np`3 ` ¨ ¨ ¨ ` dx2\n9\n¸\n,\n(5.17a)\n– 34 –\n\n\nBp2q “ ´B´1 dxp`1^dxp`2,\nCpp`1q “ ´Ω2 B\ngs\ndt^dx1^¨ ¨ ¨^dxp,\neΦ “ Ω\np´3\n2\ngs\nB , (5.17b)\nwith the same data as given in (5.9). In particular, recall that Ω“ pr{ℓq\n5´p\n2 . Note that\nCpp`3q “ 0 in this dual frame. In the asymptotic limit where Ωtends to infinity, we are led\nto the non-Lorentzian MpT geometry described by\nτ 0 , ¨¨¨ , p “\n`\ndt , dx1 , ¨ ¨ ¨ , dxp˘\n,\neφ “ gs\nB ,\n(5.18a)\nEp`1 , ¨¨¨ , 9 “\nˆdxp`1\nB\n, dxp`2\nB\n, dxp`3, ¨ ¨ ¨ , dx9\n˙\n,\nBp2q “ ´B´1 dxp`1^dxp`2 .\n(5.18b)\nAs expected, this asymptotic MpT geometry (5.18) arises from T-dualising the xp`1 and xp`2\ndirections in the other asymptotic MpT geometry that we found earlier in (5.11), which can\nbe checked by using the T-duality rules derived in Section 3.1. This is an example where an\nMpT geometry compactified on a transverse 2-torus is T-dualised to another MpT geometry,\nwhen the internal B-field on the 2-torus is nonzero. In this T-dual frame, the corresponding\nfield theory is NCYM with the non-commutativity rxp`1, xp`2s „ B .\n‚ From asymptotic MpT to asymptotic M(p+2)T. We have also learned in Section 3.3 that\nthere exist T-duality transformations that map MpT to Mpp`2qT in the asymptotic infinity.\nThese are the SLp2, Zq transformations such that γ B ` δ “ 0 , which can only happen when\nB is rational. Taking this to be so, we now apply the T-duality transformation to the MpT\ngeometry (5.11) that arises from an asymptotic limit of the near-horizon geometry (5.8). We\nfocus on the positive γ branch here. This dual geometry is\n`\nτ 0, ¨ ¨ ¨ , τ p`2˘\n“\nˆ\ndt, ¨ ¨ ¨ , dxp, dxp`1\nγ\n, dxp`2\nγ\n˙\n,\n`\nEp`1, ¨ ¨ ¨ , E9˘\n“\n`\ndxp`1, ¨ ¨ ¨ , dx9˘\n,\neφ “ gs\nγ ,\nbp2q “ α\nγ dxp`1^dxp`2 ,\nc pp`1q “ ´ γ\ngs δ dt^dx1^¨ ¨ ¨^dxp .\n(5.19)\nHence this is a geometry generated by an asymptotic M(p+2)T limit. The field theory residing\nin the (p+3)-dimensional longitudinal sector is ordinary commutative Yang-Mills: although\nthere is still a constant B-field in (5.19), it is longitudinal and, according to the discussion of\nthe Seiberg-Witten map in Section 4, this does not correspond to any non-commutativity.\nWe can connect the above T-dualities to the discussion in [47]. There it was noted that\nasymptotically the physical size of the xp`1 and xp`2 direction in the geometry (5.8) (for\np “ 1) shrinks in string units. If these are compact this leads to a singularity associated with\nwinding modes becoming light. As noted there, T-dualising does not remove this singularity\n– because the dual background (5.17) again shrinks in these directions asymptotically. The\nexception is when the asymptotic B-field is rational, in which case the singularity can be\nremoved by dualising to the geometry (5.19) in M(p+2)T. This has the side effect of going to\na description with no non-commutativity on the field theory side. All these translate elegantly\ninto our MpT/M(p+2)T framework and dovetails with the discussion in Section 4.\n– 35 –\n\n\nMoreover, for rational B-field, the singular behaviour before T-dualising now receives an\ninterpretation that the (p+3)-dimensional field theory resides on a non-Lorentzian geometry\ndescribed by\n`\nτ 0 , ¨ ¨ ¨ , τ p˘\n“\n`\ndt , dx1, ¨ ¨ ¨ , dxp˘\n,\n`\nEp`1 , Ep`2˘\n“\n`\ndxp`1 , dxp`2˘\n,\n(5.20)\nwhich is a (p+3)-dimensional non-Lorentzian submanifold of the ten-dimensional asymptotic\nMpT geometry (5.11). The new physical side of the xp`1 and xp`2 direction is kept finite. It\nis only when compared with the bulk relativistic geometry, where a metric is in use, that this\nsubmanifold of MpT appears to be singular. As expected from the T-dual relation, the original\nMpT frame is equally valid as the dual M(p+2)T frame, and the relativistic description of\nthe asymptotic field theory in M(p+2)T is not necessarily privileged.\n5.2.2. Asymptotic S-Duality: Bulk Geometry from T ¯T\nWe now focus on the p “ 1 case and consider the S-dual of the background (5.8). Instead of\nS-dualising the geometry (5.8) with p “ 1 as in [47], we focus on the S-dual of the simpler\nbulk geometry (5.17) with p “ 1 , which gives\nds2 “ B\ngs\n\"\nΩ2´\n´dt2 ` dx2\n1\n¯\n`\n”\nB´2 `\ndx2\n2 ` dx2\n3\n˘\n` dx2\n4 ` ¨ ¨ ¨ ` dx2\n9\nı*\n,\neΦ “ ΩB\ngs\n,\nBp2q “ ´Ω2 B\ngs\ndt^dx1 ,\nCp2q “ dx2^dx3\nB\n,\nCp4q “ Ω2\ngs\ndt^dx1^dx2^dx3 .\n(5.21)\nAsymptotically, the spacelike non-commutativity in NCYM is mapped to non-commutativity\nbetween space and time in the S-dual non-commutative open string theory (NCOS) [37]. In\norder for the associated NCOS to be well defined, the field strength F01 has to acquire a\nvacuum expectation value b , which can be equivalently thought of as adding an OpΩ0q term\nto Bp2q of (5.21). This shift follows from considering S-duality on the D3 worldvolume [37],\nwhere one works as usual with the gauge invariant sum of the gauge field strength and the\nB-field. Now, the Seiberg-Witten map implies that rt , x1s 9 b´1 in the S-dual NCOS, with\nthe effective coupling „ gs\n?\nb .\nNote that S-duality is the Z2 part of SL(2, Z) parametrised by α “ δ “ 0 and β “ ´γ “ 1 .\nAccording to Section 3.2.2, this falls in the γ ‰ 0 case and M1T is mapped to non-relativistic\nstring theory. The dual asymptotic non-Lorentzian geometry is encoded by\nτ 0 , 1 “\nd\nB\ngs\n`\ndt , dx1˘\n,\nE2 , 3 “\n`\ndx2 , dx3˘\n?gs B\n,\neφ “ B\ngs\n,\n(5.22a)\nE4 , ¨¨¨ , 9 “\nd\nB\ngs\n`\ndx2 , dx9˘\n,\nCp2q “ dx2^ dx3\nB\n.\n(5.22b)\nThis non-Lorentzian geometry (5.22) arises from the ΩÑ 8 limit of the bulk geometry (5.21),\nwhich fits the general non-relativistic string limiting prescription [49, 53, 75],\nds2 “ ω2`\n´τ 0 τ 0` τ 1 τ 1˘\n` E2E2 ` ¨ ¨ ¨ ` E9E9 ,\nBp2q “ ´ω2 τ 0^τ 1 ` bp2q ,\n(5.23a)\n– 36 –\n\n\neΦ “ ω eφ ,\nCpqq “ ω2 τ 0^τ 1^cpq´2q ` cpqq ,\n(5.23b)\nafter replacing ω with Ω.13 Here, the ω2 divergence in Cpqq is induced by the criticality of\nthe B-field [49]. See e.g. [53, 54, 75–80] for studies of general non-Lorentzian target space\ngeometry in non-relativistic string theory.\nConsider a probe string in this S-dual holographic setup. Asymptotically where ΩÑ 8 ,\nwe are led to the Gomis-Ooguri action [10] describing the non-relativistic string,\nS “ ´\n1\n4πα1\nż\nd2σ\n”\nBαX2 BαX2 `¨ ¨ ¨`BαX9 BαX9 `P ¯B\n`\nX0 `X1˘\n` ¯P B\n`\nX0 ´X1˘ı\n, (5.24)\nwhere XMpσq are the embedding coordinates mapping the worldsheet with coordinates σα,\nα “ 0 , 1 to the ten-dimensional target space. Moreover, P and ¯P are one-form worldsheet\nfields playing the role of Lagrange multipliers; they are the momenta conjugate to X0 ` X1\nand X0 ´ X1, respectively. We also defined the worldsheet light-cone derivatives B “ B0 ` B1\nand ¯B “ B0 ´ B1 . Now, for this worldsheet action there exists a marginal deformation\n1\n4πα1\nż\nd2σ UpXq P ¯P ,\n(5.25)\nwhere UpXq is a background field. Integrating out the non-dynamical fields P and ¯P in the\ndeformed action leads us back to the full type IIB superstring theory. Undoing the conformal\ngauge in (5.24) followed by integrating out the worldsheet zweibein field gives rise to the\nNambu-Goto formulation of the non-relativistic string [54], in which case the current-current\ndeformation (5.25) maps to the T ¯T-deformation. This identification with a T ¯T-deformation\nwas made in [81] and elaborated on in [3].\nThe deformation (5.25) is sometimes known as the torsional deformation [56], as it is\ngenerically generated from quantum corrections unless a sufficiently strong symmetry principle\nis invoked that constrains the torsion of the longitudinal vielbein fields τ 0,1 [56, 82–84]. In\nthe context of backgrounds sourced by strings and branes, it has been argued recently in [17,\n18, 21] that it is necessary to allow such deformations.\nNow let us return to the study of the background (5.21). Starting with non-relativistic\nstring theory in the asymptotic non-Lorentzian geometry (5.22), with action (5.24), choos-\ning UpXq “ Ω´2 deforms the asymptotic flat non-Lorentzian geometry to be the bulk fun-\ndamental string geometry (5.21). In this manner, and as discussed more generally in [3],\nthe T ¯T-deformation generates the Lorentzian near-horizon geometry from the asymptotic\nnon-Lorentzian geometry, which is a recurring phenomenon that we have seen through this\nsection.\nHere we have used dualities to obtain the background (5.21) which asymptotes\nto a non-relativistic string theory background, in which case the deformation can really be\nviewed as the original T ¯T-deformation. More generally, one can view the deformation which\n13Note that while the RR potentials of (5.21) are non-zero, and have the correct form for this limit, they\ngive rise to vanishing fluxes: as follows from the fact that the RR five-form field strength in our conventions\nis F p5q “ dCp4q ` Hp3q ^ Cp2q, where Hp3q “ dBp2q.\n– 37 –\n\n\ngenerates the near-horizon limit from other non-Lorentzian geometries as particular (higher-\ndimensional) generalisations of T ¯T, as explained in [3]. Such a generalised T ¯T deformation\nessentially undoes the associated BPS decoupling limit.\nNote that the second quantisation of non-relativistic string theory leads to matrix string\ntheory [85, 86], which is described by a two-dimensional N “ 8 SYM. See [3, 20] for more\nrecent studies. In particular, [20] contains further studies of the holographic correspondence\nbetween the large N limit of matrix string theory and gravitational string solitons in non-\nrelativistic string theory.\n5.3. Non-Lorentzian Holographic Duals\nSo far, we have only been concerned with known holographic duals to non-commutative Yang-\nMills, for which we have highlighted the appearance of asymptotic non-Lorentzian geometry.\nIn the language of [3], these duals are of the DLCQ0/DLCQ1 type, i.e. they pair a relativistic\nbulk geometry in the DLCQ0 orbit dual to a field theory in the DLCQ1 orbit. In this sub-\nsection, we show evidence for new holographic duals with a non-Lorentzian curved geometry\nin the bulk, which are of the DLCQ1/DLCQ2 type.\n5.3.1. Example: A Bulk 3-Brane Decoupling Limit\nFor concreteness, we start with the p “ 1 case associated with the D1-D3 brane configuration.\nWe consider general bulk MpT limits of the D1-D3 background (5.2), such that we obtain\nnot a near-horizon limit but a genuine non-Lorentzian curved geometry.\nIn [3], we discussed possible bulk MpT limits of individual Dq-brane geometries. We can\ncharacterise these limits in terms of the n MpT longitudinal directions that are transverse to\nthe Dq-brane, and the m MpT transverse directions that are longitudinal to the Dq-brane.\nRequiring that the RR pq ` 1q-form appearing in the brane geometry was finite led to the\ncondition m ` n “ 4. In particular, we showed that one could take a bulk M1T limit of the\nD3-brane with pm , nq “ p3 , 1q , a bulk M3T limit of the D1-brane with pm , nq “ p1 , 3q and\na bulk M3T-limit of the D3-brane with pm , nq “ p2 , 2q .\nThis suggests that the D1-D3 solution obtained from setting p “ 1 in (5.2) may admit a\nfurther M3T limit in the bulk. In this limit, we want the B-field to be finite. Assuming that\nΘ is fixed, this requires one of the directions pX2, X3q to be longitudinal and the other to be\ntransverse. This fixes the allowed limit to have the following form:\n0\n1\n2\n3\n4\n5\n6\n7\n8\n9\nD1-brane\nˆ\nˆ\n–\n–\n–\n–\n–\n–\n–\n–\nD3-brane\nˆ\nˆ\nˆ\nˆ\n–\n–\n–\n–\n–\n–\nbulk M3T limit\nˆ\n–\nˆ\n–\nˆ\nˆ\n–\n–\n–\n–\nThis M3T limit then corresponds to letting\n`\nX0, X2, X4, X5˘\n“ ω\n1\n2 `\nt, x2, x4, x5˘\n,\n`\nX1, X3, X6, ¨ ¨ ¨ , X9˘\n“ ω´ 1\n2 `\nx1, x3, x6, ¨ ¨ ¨ , x9˘\n,\nGs “ gs .\n(5.26)\n– 38 –\n\n\nIn order to obtain a well-defined M3T geometry that admits a further near-horizon limit,\nthe harmonic function H in (5.2) must be finite under the bulk M3T limit. There are two\ndifferent possibilities:\n(1) Smearing. We smear in the X4, 5 directions, which are taken to be compactified over\ncircles of radii R4, 5 , respectively. After this smearing, H becomes\nH “ 1 `\nL4\n4π R4 R5\n`\nX2\n6 ` ¨ ¨ ¨ ` X2\n9\n˘ .\n(5.27)\nSubstituting R4, 5 “ ?ω r4, 5 and X6, ¨¨¨ , 9 “ x6, ¨¨¨ , 9{?ω , it follows that H in (5.27) is\nmanifestly finite in ω , with\nsmearing:\nH “ 1 `\nℓ2\nx2\n6 ` ¨ ¨ ¨ ` x2\n9\n,\nℓ2 “\nℓ4\ns N gs\nr4 r5 cos Θ .\n(5.28)\nThis gives a background localised in the M3T transverse directions px6, ¨ ¨ ¨ , x9q .\n(2) Large N rescaling.\nAlternatively, similarly to examples considered in [3, 13, 16], we\nintroduce an additional formal rescaling of the parameter N as N Ñ ω2 N, such that\nlarge N:\nH “ 1 `\nℓ4\nx2\n4 ` x2\n5\n,\nℓ4 “ 4πℓ4\ns N gs\ncos Θ\n.\n(5.29)\nThis gives a background localised in the M3T transverse directions px4, x5q . One caveat\nto note here is that this mechanism of generating supergravity solutions by introducing\nan additional rescaling of N is not part of our intrinsic definition of an MpT limit. The\nphysical significance of this additional scaling, and in particular its BPS nature, is not\nentirely clear.\nIn either case, we find that the bulk geometry (5.2) becomes,\nds2 “ ω\n´\n´τ 0 τ 0 ` τ 2 τ 2 ` τ 4 τ 4 ` τ 5 τ 5¯\n` 1\nω\n´\nE1 E1 ` E3 E3 ` E6 E6 ` ¨ ¨ ¨ ` E9 E9¯\n,\nBp2q “ bp2q ,\nCp2q “ cp2q ,\nCp4q “ ω2\neφ τ 0^τ 2^τ 4^τ 5 ` cp4q ,\neΦ “ eφ ,\n(5.30)\nwhich is the M3T limiting prescription with the M3T geometric data\n`\nτ 0, E1˘\n“ pdt, dx1q\nH\n1\n4\n,\n`\nτ 2, E3˘\n“\nH\n1\n4 pdx2, dx3q\na\nsin2 Θ ` H´1 cos2 Θ\n,\n(5.31a)\n`\nτ 4, τ 5, E6, ¨ ¨ ¨ , E9˘\n“ H\n1\n4 `\ndx4, ¨ ¨ ¨ , dx9˘\n,\n(5.31b)\ntogether with\nbp2q “\ntan Θ dx2^dx3\nsin2 Θ ` H cos2 Θ ,\ncp2q “ sin Θ\ngs H dt^dx1 ,\n(5.31c)\n– 39 –\n\n\neφ “\ngs\na\ncos2 Θ ` H´1 sin2 Θ\n,\ncp4q “\ng´1\ns\ncos Θ\nsin2 Θ ` H cos2 Θ dt^dx1^dx2^dx3 .\n(5.31d)\nHere, H is either given by (5.28) or (5.29), depending on whether we follow the smearing or\nlarge N rescaling procedure. Note that we have shifted Cp4q from the original geometry (5.2)\nby an ω2 term in (5.30) that takes the form\nω2\neφ τ 0^τ 2^τ 4^τ 5 “ g´1\ns\ndt^dx2^dx4^dx5 ,\n(5.32)\nwhich is closed, meaning that this required critical term can be added to the original back-\nground without modifying the fact that it is a solution to IIB supergravity. In the ω Ñ 8\nlimit, we are led to the curved non-Lorentzian M3T geometry encoded by (5.31).\nThe geometry (5.31) allows for a further asymptotic M1T limit of the form (5.12) to be\ntaken. This leads to a ‘near-horizon’ geometry of the M3T type, which should be dual to\na non-relativistic limit of NCYM (induced by the M3T limit in ten dimensions). Using the\nterminology we introduced in [3], this is an example of a DLCQ1/DLCQ2 correspondence.\nTo describe this further asymptotic M1T limit that corresponds to a near-horizon limit\nof the bulk M3T geometry, we use the same parametrisation as (5.12) but in terms of a new\nparameter rω that replaces ω , such that, asymptotically,\n`\nt, x1˘\n“\n?\nrω\n`\nt , x1˘\n,\n`\nx2, x3˘\n“\n`\nx2, x3˘\n?\nrω ` rω´1 B´2 ,\n(5.33a)\n`\nx4, ¨ ¨ ¨ , x9˘\n“\n1\n?\nrω\n`\nx4, ¨ ¨ ¨ , x9˘\n,\ngs “\ngs\n?\nrω2 ` B´2 ,\nΘ “ arctan\n`\nrω B\n˘\n.\n(5.33b)\nIt then follows that H „\n`\nrω{rΩ\n˘2, with\nrΩ“\n$\n&\n%\nrℓ´1 a\nx2\n6 ` ¨ ¨ ¨ ` x2\n9 ,\nrℓ2 “ 4π ℓ4\ns N gs B\n`\nr4 r5\n˘´1\n(smearing)\nrℓ´2 `\nx2\n4 ` x2\n5\n˘\n,\nrℓ4 “ 4π ℓ4\ns N gs B\n(large N rescaling)\n(5.34)\nFinally, the rω Ñ 8 limit of (5.31) gives the following bulk M3T geometry:\n`\nτ 0, E1˘\n“ rΩ\n1\n2 `\ndt , dx1˘\n,\n`\nτ 4, τ 5, E6, ¨ ¨ ¨ , E9˘\n“ rΩ´ 1\n2 `\ndx4, ¨ ¨ ¨ , dx9˘\n,\n(5.35a)\n`\nτ 2, E3˘\n“\npdx2, dx3q\na\nrΩ` rΩ´1B´2 ,\ncp2q “\nrΩ\ngs\ndt^dx1 ,\neφ “\ngs\na\nrΩ2 ` B´2 ,\n(5.35b)\nbp2q “ B dx2^dx3\n1 ` prΩBq´2 ,\ncp4q “\ng´1\ns\nrΩ` rΩ´1B´2 dt^dx1^dx2^dx3 .\n(5.35c)\nThe dual field theory conjecturally arises from an M3T limit of four-dimensional NCYM.\nCompactifying the x2 and x3 directions leads to an anisotropic torus, and the SL(2, Z) T-\nduality associated with this torus exhibits the asymmetric structure that we have commented\non at the end of Section 3.3.2.\n– 40 –\n\n\n5.3.2. General Brane Geometries\nThe above construction for the D1-D3 configuration can be generalised to the Dp-D(p+2)\ncase, which has to take the following form (under the assumption that Θ is fixed):\n7 of dim.\np ´ m ` 1 (incl. t)\nm\n1\n1\nn\n7 ´ p ´ n\nDp-brane\nˆ\nˆ\n–\n–\n–\n–\nD(p+2)-brane\nˆ\nˆ\nˆ\nˆ\n–\n–\nbulk MqT limit\nˆ\n–\nˆ\n–\nˆ\n–\nwhere we consider a bulk MqT limit with q “ p ` n ´ m ` 1 . Another constraint is that\nm`n “ 3 , such that the ω2-divergence in the RR potential Cpq`1q required by the MqT limit\nis closed, which generalises (5.32). Note that n ď 3 and p ` n ě 3 . Moreover, the harmonic\nfunction\nH “ 1 `\nω\nq´3\n2 L5´p\n`\nω xu xu ` ω´1 xi xi˘5´p\n2\n,\nL5´p “ gs N\ncos Θ\np2πLsq5´p\np5 ´ pq ω6´p .\n(5.36)\nhas to be finite such that a near-horizon limit can be taken. There are three possibilities:\nH “\n$\n’\n’\n’\n’\n&\n’\n’\n’\n’\n%\n1 ` ℓ5´p `\nxi xi˘p´5\n2 ,\nn “ 0 ,\n1 ` ℓ5´p´n `\nxi xi˘p`n´5\n2\n,\nn ą 0 ,\nsmearing in xu ,\n1 ` ℓ5´p `\nxu xu˘p´5\n2 ,\nn ą 0 ,\nN Ñ ω\n8´p´q\n2\nN .\n(5.37)\nIn the case where p “ 1 and n “ 2 , we recover the D1-D3 configuration considered earlier in\nthis subsection. More generally, we obtain a series of other non-Lorentzian geometries that\nare dual to various field theories that arise from further BPS decoupling limits of NCYM in\nvarious dimensions.\n6. Conclusions\nIn this paper, we have initiated the systematic study of the phenomenon of duality asymmetry\nbetween non-Lorentzian geometries coupled to matrix theories. Working within the setting\nof Matrix p-brane Theory, we saw how in the simplest cases the presence or absence of a\nB-field dictated the nature of the T-dual theory. For more general SLp2, Zq duality transfor-\nmations, we saw that both S- and T-duality asymmetry share similar structures and involve\nintricate algebraic features linked to invariant theory, building on [28]. We also revisited the\nholographic duals of non-commutative Yang-Mills, showing how to interpret these geometries\nin the holographic framework we introduced in [3], and demonstrating that by iterating the\ndecoupling limit we can obtain new non-Lorentzian holographic duals. We hope that this\nwork helps establish a modern geometric foundation for the study of matrix theories and\nnon-commutativity.\nThe paper [28] proposed a program of ‘non-Lorentzian bootstrap’, in which bosonic non-\nLorentzian symmetries are bootstrapped to constrain Lorentzian supergravity by undoing the\n– 41 –\n\n\nBPS decoupling limit. In this program, novel duality asymmetries may help us determine\nhigher-order terms in Lorentzian supergravity efficiently.\nThe new non-Lorentzian bulk geometries of Section 5.3 should be dual to non-relativistic\nlimits of non-commutative Yang-Mills. These limits can be engineered, in principle, using the\nknowledge of the underlying bulk limit and its overlap with the brane on which the field theory\nlives. In previous (commutative) examples [13, 14, 19] it has been found that the limit of the\nfield theory localises the dynamics onto a moduli space of a field theory BPS configuration.\nA natural conjecture would be that the field theories dual to our non-Lorentzian geometries\nshould relate to non-commutative instantons [24, 87].\nIt would be interesting to apply the techniques developed in this paper to matrix theo-\nries on more general compactifications. One could speculate about the possible appearance of\n(mirror) duality asymmetry for general Calabi-Yau compactifications of non-Lorentzian ge-\nometries. It would also be interesting to explore generalisations to corners related to heterotic\nstring theory [57, 88, 89].\nWe finish with some remarks about U-duality asymmetry in M-theory. The U-duality\ngroup of M-theory on a 3-torus is SLp3, ZqˆSLp2, Zq. In non-relativistic M-theory this should\nprovide a unified framework for the discussions in Sections 3.2 and 3.3 on SL(2, Z) S- and\nT-duality asymmetries. Note for instance that the T-duality asymmetry between M0T and\nM2T can be lifted to eleven dimensions, where it is interpreted as a U-duality between M-\ntheory in the DLCQ and non-relativistic M-theory, with the T-duality SLp2, Zq being the\nnon-geometric SLp2, Zq factor of the U-duality group, and the B-field on the torus lifting to\nthe M-theory 3-form on a 3-torus.\nSimilarly, one can consider the U-duality between non-relativistic M-theory on a trans-\nverse 3-torus and its magnetic dual on a longitudinal 3-torus. This magnetic dual is based on\nan M5-brane decoupling limit (see e.g. [1]), for which an associated supergravity was recently\nconstructed in [90]. U-duality between these limits uplifts the T-duality asymmetry between\nM2T and M4T: non-relativistic M-theory is either self U-dual or dualises to its magnetic dual\ndepending on the value of the three-form on the transverse torus.\nAcknowledgments\nWe would like to thank Ritankar Chatterjee, Jorge Russo and Matthew Yu for useful discus-\nsions. The work of C.B. is supported through the grants CEX2020-001007-S and PID2021-\n123017NB-I00, funded by MCIN/AEI/10.13039/501100011033 and by ERDF A way of mak-\ning Europe. The work of N.O. is supported in part by VR project Grant 2021-04013 and\nVillum Foundation Experiment Project No. 00050317.\nThe work of Z.Y. is supported in\npart by Olle Engkvists Stiftelse Project Grant 234-0342, VR Project Grant 2021-04013, and\nthe European Union’s Horizon 2020 research and innovation programme under the Marie\nSk lodowska-Curie Grant Agreement No. 31003710. Nordita is supported in part by Nord-\nForsk.\nThe Center of Gravity is a Center of Excellence funded by the Danish National\nResearch Foundation under grant No. 184.\n– 42 –\n\n\nA. T-duality of Lorentzian Background Fields\n‚ Opd, dq T-duality.\nHere we summarise our conventions for T-duality of the NSNS and\nRR background fields. Write the ten-dimensional coordinates as xM “ pxµ, xiq, where the xi,\ni “ 1, . . . , d, are adapted coordinates for d isometry directions. Decompose the 10-dimensional\nstring frame metric as\nGMN “\n˜\ngµν ` Gij Aµ\ni Aν\nj\nGjℓAµ\nℓ\nGik Aν\nk\nGij\n¸\n,\n(A.1)\nand let Bµν, Bµi and Bij denote the components of the B-field. Then in the NSNS sector,\nthe T-duality multiplets with non-trivial transformation are\nH “\n˜\nGij ´ Bik GkℓBℓj\nBik Gkj\n´Gik Bkj\nGij\n¸\n,\nAµ “\n˜\nAµ\ni\nBµi ´ Aµ\nj Bji\n¸\n,\n(A.2)\nwhile gµν , Bµν ` Arµi Bνsi , and e´2Φb\ndet\n`\nGij\n˘\nare Opd, dq singlets. For Λ a generic Opd, dq\ntransformation we write,\nΛ “\n˜\nα β\nγ\nδ\n¸\n,\nΛ η ΛT “ η ,\nη “\n˜\n0 1\n1 0\n¸\n,\n(A.3)\nwhere the d ˆ d matrices α, β, γ, δ obey\nα δT ` β γT “ 1 ,\nα βT ` β αT “ γ δT ` δ γT “ 0 .\n(A.4)\nThe field combinations of (A.2) transform as H Ñ Λ H Λ⊺and A Ñ Λ´⊺A .\nA Buscher\nT-duality transformation on all d directions simultaneously corresponds to α “ δ “ 0 and\nγ “ β “ 1 , which has the effect of swapping upper and lower d-dimensional indices in H and\nAµ . For the field components appearing in (A.2), this results in\nrG ` rB “\n`\nG ` B\n˘´1 ,\nrAµi “ Bµi ´ AµjBji ,\nrBµi ´ rAµ\nj rBji “ Aµi ,\n(A.5)\nFrom these expressions we determine the transformed fields explicitly. Define\nG ij ”\n”`\nG ´ B G´1 Bq´1ıij\n.\n(A.6)\nNote that ‘G’ and ‘B’ in the above expressions (A.5) and (A.6) have their indices being i on\nthe internal d-torus. It then follows that the full T-dual metric and dilaton are\nrGµν “ Gµν ´ Gij Aµi Aνj `\n`\nBµi ´ Aµk Bki\n˘\nG ij `\nBνj ´ AνlBlj\n˘\n,\nrGij “ G ij ,\nrGµi “ G ij `\nBµj ´ Aµk Bkj\n˘\n,\nrΦ “ Φ ´ 1\n4 ln\n”\ndet\n`\nGij\n˘\ndetpGijq\nı\n,\n(A.7a)\n– 43 –\n\n\nand the T-dual B-field is\nrBij “ ´Gik Bkl G lj ,\nrBµi “ Aµi ` Gik Bkl G lj`\nBµj ` Bjm Aµm˘\n,\n(A.7b)\nrBµν “ Bµν ` 2 Arµ\niBνsi ` Aµi Bij Aνj ´\n`\nBµi ` Bik Aµk˘\nGil Blm G mj `\nBνj ` Bjl Aνl˘\n,\nWhen d “ 1 , the above transformations recover the usual Buscher rules [60, 61]. E.g. letting\ny denote the isometry direction, we have rGyy “ G´1\nyy .\nThe transformation of the RR sector is most naturally expressed in terms of the polyform\nCPoly “ eBp2q^\nÿ\nq\nCpqq ,\n(A.8)\nwhich appears naturally in the Wess-Zumino part of the D-brane worldvolume action (our\nconventions are as in [49]). Splitting the coordinates as above, this decomposes as:\nCPoly “\ndÿ\nk“0\n1\nk! Ci1...ik dxi1^ ¨ ¨ ¨ ^dxik ,\n(A.9)\nwhere each Ci1...ik is a polyform in 10 ´ d dimensions. These polyforms transform together\nas spinors of the double cover of Opd, dq : in particular the polyforms pC , Ci1i2 , . . . q and\npCi , Ci1i2i3 , . . . q correspond to chiral spinors. When d “ 1, again letting y denote the isometry\ndirection, one can write simply CPoly “ C ` Cy^dy , and the Buscher transformation for RR\nfields takes the form:\nrC “ Cy ,\nrCy “ C ,\n(A.10)\nwhich in terms of the original RR polyforms C “ ř\nq Cpqq implies the expressions\nrC “ Cy ` C ^ By ` Cy ^ By ^ Gy\nGyy\n,\nrCy “ C ´ Cy ^ Gy\nGyy\n,\n(A.11)\nwhere we use the shorthand notation By ” Bµy dxµ and Gy ” Gµy dxµ .\nThe Buscher\ntransformation on d directions follows most simply by repeated application of (A.10).\n‚ Op2, 2q T-duality and SLp2q. Here we give further details of the special case with d “ 2 .\nGiven V “ pV i, rViq and W “ pWi , Ă\nW iq transforming in the vector and covector representa-\ntions of Op2, 2q, consider the following change of basis: rV i “ ϵij rVj , Ă\nWi “ ϵij Ă\nW j, such that\nthe natural pairing V ¨ W is preserved. Here, ϵ12 “ ϵ12 “ 1 , so ϵik ϵjk “ δi\nj . After making\nthis change of basis, the non-trivial Op2, 2q multiplets of (A.2) can be expressed as\nH “\nGij\na\n|G|\nb M ,\nM ”\n1\na\n|G|\n˜\n|G| ` B2 B\nB\n1\n¸\n,\nAµi “\n˜\nAµi\nBµi ´ B Aµi\n¸\n,\n(A.12)\nwhere we let Bij “ B ϵij and Bµi ” ϵijBµj . Similarly, a transformation Λ P Op2, 2q in this\nbasis has the general form following from (A.3),\nΛ “\n˜\nαij\nβik ϵjk\nϵik γkj\nϵik δkl ϵjl\n¸\n.\n(A.13)\n– 44 –\n\n\nConsider the subclass of transformations where αij “ α δj\ni , δij “ δ δi\nj, βij “ β ϵij and\nγij “ ´γ ϵij. Then we obtain a factorisation,\nΛ “ δij b Λ ,\nΛ ”\n˜\nα β\nγ\nδ\n¸\n,\nα δ ´ β γ “ 1 ,\n(A.14)\nwhich is an SLp2q subgroup of Op2, 2q that acts solely on the second matrix M in the tensor\nproduct in (A.12), or equivalently in the usual manner on the complex scalar τ ” B `i|G|1{2 .\nWe can explicitly write the transformation of the NSNS fields of (A.12) as M Ñ Ă\nM “ Λ M Λ⊺\nand Aµi Ñ r\nAµi “ Λ´⊺Aµi.\nAnother SLp2q subgroup follows from transformations with β “ γ “ 0 , and with α “ δ´⊺\nrestricted to have unit determinant. This other SLp2q subgroup acts on the two-dimensional\nindices on the internal torus as volume preserving transformations. This reveals that\nSOp2, 2q “\n´\nSLp2q ˆ SLp2q\n¯\n{ Z2 ,\n(A.15)\nThe Z2 quotient reflects the fact that the transformation Λ “ p´δijq b p´I2q acts trivially on\nSOp2, 2q vectors. Hence, SLp2q ˆ SLp2q is the double cover of SOp2, 2q . The full T-duality\ngroup Op2, 2q also includes a Z2 transformation which exchanges the SLp2q factors. This\nrealises the Buscher transformation on a circle. Note that the usual Buscher transformation\non both directions corresponds to the SLp2q inversion with α “ δ “ 0, along with a reordering\nof the coordinates, such that x1 Ñ ˘x2 and x2 Ñ ¯x1 . The latter is a geometric SLp2q\ntransformation. When describing the T-duality on both directions in SLp2q language we will\nomit this coordinate reordering, however.\nThe RR fields transform as spinors under T-duality. We can construct the spinor repre-\nsentation of Op2, 2q in a standard way by introducing creation and annihilation operators\nψM “ pψi , ψiq ,\ntψi , ψju “ δj\ni ,\ntψi , ψju “ 0 ,\ntψi, ψju “ 0 ,\n(A.16)\nrealising the Clifford algebra, with the gamma matrices of Op2, 2q being Γ “\n?\n2pψi, ψiq.\nIntroducing a state |0y such that ψi|0y “ 0, then an Op2, 2q spinor can be expressed as\n|Cy “ C0 |0y ` C12 ψ1 ψ2 |0y ` Ci ψi |0y .\n(A.17)\nA Pinp2, 2q transformation S : |Cy Ñ S |Cy defines an Op2, 2q transformation Λ which can be\nderived from the invariance of the gamma matrices as usual:\nS pΛ ΓqS´1 “ Γ ,\n(A.18)\nwhere here S acts on the spinorial indices of Γ and Λ acts on the covector index. The Weyl\nspinors of definite chirality are Ci, which transforms solely under the geometric SLp2q and\nC ” pC12 , C0q⊺, transforming solely under the other SLp2q. Taking C to transform under\nΛ P SLp2q as C Ñ Λ C, the formula (A.18) can be verified to produce an associated Op2, 2q\n– 45 –\n\n\ntransformation of the form (A.14). Note this means that C transforms covariantly while Aµi\ntransforms contravariantly under SLp2q.\nSpecialising the RR polyform (A.9) to the d “ 2 case, we obtain a set of polyforms in\nthe eight undualised directions, which can be identified directly with Ci and pC12, C0q, i.e.\nCPoly “ C0 ` Ci ^ dxi ` C12dx1 ^ dx2 .\n(A.19)\nIn practice, it is convenient to repackage the transformations of the SLp2q doublets using the\nvielbein V such that M “ V V⊺. Making the analogous vielbein choice to that appearing in\n(3.41), this means we consider the combinations\nV⊺Aµi “\n˜\n|G|\n1\n4 Aµi\n|G|´ 1\n4 Bµi\n¸\n,\nV´1 C “\n˜\n|G|´ 1\n4 `\nC12 ´ B C0\n˘\n|G|\n1\n4 C0\n¸\n,\n(A.20)\nwhich transform in the same manner under the compensating local SOp2q transformation\nneeded to preserve the vielbein parametrisation,\nrVT r\nAµi “ h⊺V⊺Aµi ,\nrV´1 rC “ h´1 V´1 C ,\nh ”\n˜\ncos θ\nsin θ\n´ sin θ cos θ\n¸\nP SOp2q ,\n(A.21)\nwith the angle θ satisfying tan θ “ γ |G|\n1\n2 {pγB ` δq .\nB. T-duality of Matrix p-Brane Theory\nB.1. Buscher Duality of Matrix p-Brane Theory\nIn this appendix, we discuss further details of the T-duality transformation rules for the NSNS\nbackground fields of Matrix p-Brane Theory (MpT). As before, we write the 10-dimensional\ncoordinates as xM “ pxµ , xiq, where i “ 1, . . . , d denote the isometry directions.\n‚ Gauge fixing for transverse isometries. First, we focus on a d-dimensional toroidal com-\npactification within the transverse sector, and thus split the transverse index as A1 “ pa1 , Iq ,\nwhere I is the d-dimensional toroidal index. We assume that the isometry is wholly transverse\nin the sense that the longitudinal vielbein contains no legs in the isometry directions. With\nthis assumption, we use the local longitudinal SOp1 , pq and transverse SOp9 ´ pq symmetries\nto gauge fix the boost invariant vielbein fields as 14\nτ AM “\n´\nτ Aµ 0\n¯\n,\nEMA1 “\n˜\nEµ\na1\n0\n´Aν\ni Eν\na1 Ei\nI\n¸\n.\n(B.1)\n14A brief justification: if τ 1A\nM is some other choice of longitudinal vielbein also such that τ 1A\ni “ 0, then\nΛA\nB “ τ 1A\nM τ M\nB is by construction an SOp1, pq rotation such that τ 1A\nM “ ΛA\nB τ B\nM. Similarly for EM\nA1. A\ncareful counting of independent components, taking into account the surviving boost freedom (with parameters\nlI\nA), shows that the (B.1) and (B.2) contain the correct number of independent components, i.e. equal to that\nof a relativistic vielbein.\n– 46 –\n\n\nHere, Aµi is the Kaluza-Klein vector. We assume EiI to be invertible, and τ Aµ Eµa1 “ 0 .\nThe general form of the boost covariant transverse vielbein is then fixed to be\nEAM “\n˜\nEa1\nµ\n0\nlIA τ Aµ ` Aµj EIj EIi\n¸\n,\n(B.2)\nwhere EIi is the inverse of Ei\nI, and Ea1\nµ Eµ\nb1 “ δa1\nb1 . The arbitrary functions lIA can be\nremoved by a boost transformation (or by a field redefinition of Aµi) and we drop them\nhenceforth. To carry out T-duality, we embed this configuration into a relativistic metric\nGMN , which is decomposed as in (A.1) with\ngµν “ ω τµν ` ω´1 pEµν ´ Eij AµiAνjq ,\nGij “ ω´1 Eij .\n(B.3)\nHere, τµν ” τ Aµτ Bν ηAB , Eµν ´ EijAµiAνj “ Ea1\nµ Ea1\nν, and Eij “ EIiEIj is invertible.\n‚ Gauge fixing for longitudinal isometries.\nNext, we focus on a d-dimensional toroidal\ncompactification within the longitudinal sector, and thus split the longitudinal index as\nA “ pa , Iq , where I is the d-dimensional toroidal index. We assume that the isometry is\nwholly longitudinal in the sense that the transverse vielbein contains no legs in the isometry\ndirections. In analogy to (B.1), we gauge fix the boost invariant vielbeins as follows:\nτ AM “\n˜\nτ aµ\n0\nAµj τ Ij τ Ii\n¸\n,\nEMA1 “\n˜\nEµA1\n´Aνi EνA1\n¸\n,\n(B.4)\nwhere τ µA EµA1 “ 0 and we take τ Ii to be invertible. To discuss T-duality of the metric,\nwe then need to know the form of the boost covariant longitudinal vielbein EA1\nM . Using\ninvertibility of τ Ii and the boost symmetry, we can put this in the form\nEA1\nM “\n´\nEA1\nµ 0\n¯\n.\n(B.5)\nWe then embed this gauge fixing in a relativistic metric of the same form as (A.1), with\ngµν “ ω\n´\nτµν ´ Aµ\ni τij Aν\nj¯\n` ω´1 Eµν ,\nGij “ ω τij .\n(B.6)\nwhere we have τµν ´ τijAµiAνj “ τ aµ τ bν ηab, Eµν “ EA1\nµ EA1\nν, and τij “ τi\nI τj\nI is invertible.\nAssuming the MpT background fields take the form given above, we derive the following\nT-duality rules.\n‚ Longitudinal T-duality. Using the metric prescription of (B.6), we find that the transfor-\nmation rules (A.7) gives rise to the T-dual metric\nrGµν “ ω\n´\nτµν ´ τijAµiAνj¯\n` ω´1 ”\nEµν `\n`\nbµi ´ Aµk bki\n˘\nE ij `\nbνj ´ Aνl blj\n˘ı\n,\nGµi “ ω´1 E ij `\nbµj ´ Aµk bkj\n˘\n,\nGij “ ω´1 rE ij ,\n(B.7a)\n– 47 –\n\n\nthe T-dual B-field,\nrBµν “ bµν ` 2 Arµ\ni bνsi ` bij Aµi Aνj ´ ω´2 τ ik bkl E lj `\nbµi ` bim Aµm˘ `\nbνj ` bjn Aνn˘\n,\nrBµi “ Aµi ` ω´2 τ ik bkl E lj `\nbµj ` bjm Aµm˘\n,\nrBij “ ´ω´2 Eik bkl E lj ,\n(B.7b)\nand the T-dual dilaton,\nrΦ “ φ ` 1\n2\n`\np ´ d ´ 3\n˘\nln ω ´ 1\n4 ln\n”\ndet\n`\nτij\n˘\ndet\n`\nEij\n˘ı\n,\n(B.7c)\nwhere\nEij “\n`\nτ ´ ω´2 b τ ´1 b\n˘\nij ,\n(B.8)\nand E ij is the inverse of Eij. Note that, in (B.8), when τ , E , and b appear without indices\nthey implicitly carry the toroidal index i and τ ´1 refers to the inverse of τij . For ω Ñ 8 ,\nEij Ñ τij , and we recover the defining prescription for an Mpp ´ dqT limit, gauge fixed as in\n(B.1) and (B.2) with\nrGµν “ ω rτµν ` ω´1 rEµν ,\nrBµν “ rbµν ,\nrΦ “ rφ ` 1\n2\n`\np ´ d ´ 3\n˘\nln ω ,\n(B.9a)\nwhere the components of the new Mpp ´ dqT background fields are:\nrEµν “ Eµν `\n`\nbµi ´ Aµk bki\n˘\nτ ij `\nbνj ´ Aνl blj\n˘\n,\nrφ “ φ ´ 1\n2 ln det\n`\nτij\n˘\n,\n(B.10a)\nrEµi “ τ ij `\nbµj ´ Aµk bkj\n˘\n,\nrEij “ τ ij ,\n(B.10b)\nrτµν “ τµν ´ τij Aµ\ni Aν\nj ,\nrτµi “ rτij “ rbij “ 0 ,\n(B.10c)\nrbµν “ bµν ` 2 Arµ\ni bνsi ` bij Aµi Aνj ,\nrbµi “ Aµ\ni .\n(B.10d)\nwhere τ ij denotes the inverse of τij , Aµi ” τ ij τµj , and we note that rτµν “ τ aµ τ bν ηab . More\nspecifically, this is M(p ´ dqT with zero B-field on the transverse isometry directions.\n‚ Transverse T-duality. In this case, the presence of the transverse B-field induces a much\nricher set of dual limits. Using the metric prescription of (B.3), we find that the transforma-\ntion rules (A.7) gives rise to the T-dual metric\nrGµν “ ω\n”\nτµν ` E ij `\nbµi ´ Aµk bki\n˘ `\nbνj ´ Aνl blj\n˘ı\n` ω´1 pEµν ´ EijAµiAνjq ,\nrGµi “ ω E ij `\nbµj ´ Aµk bkj\n˘\n,\nrGij “ ω E ij ,\n(B.11a)\nthe T-dual B-field,\nrBµν “ bµν ` 2 Arµ\ni bνsi ` bij Aµi Aνj ´ ω2 Eik bkl E lj `\nbµi ` bim Aµm˘ `\nbνj ` bjn Aµn˘\n,\nrBµi “ Aµi ` ω2 Eik bkl E lj `\nbµj ` bjm Aµm˘\n,\nrBij “ ´ω2 Eik bkl E ℓj ,\n(B.11b)\n– 48 –\n\n\nand the T-dual dilaton,\nrΦ “ φ ` 1\n2\n`\np ` d ´ 3\n˘\nln ω ´ 1\n4 ln\n”\ndetpEijq detpEijq\nı\n,\n(B.11c)\nwhere now we have\nEij “\n`\nE ´ ω2 b E´1 b\n˘\nij .\n(B.12)\nAgain, in (B.12), both E and b carry the toroidal index i and pE´1qij “ Eij is the inverse of\nE . Now, the ω Ñ 8 limit is not immediate, as Eij diverges.\nFirstly, we can consider a general d-torus but with Bij “ bij “ 0 on the torus. Then we\nfind E ij “ Eij and\nrGµν “ ω rτµν ` ω´1 rEµν ,\nrBµν “ rbµν ,\nrΦ “ rφ ` 1\n2\n`\nrp ´ 3\n˘\nln ω ,\n(B.13a)\nwhere rp “ p ` d and where we can express the components of the rτµν, rEµν and rbµν directly\nin terms of those of τµν, Eµν and bµν as follows:\nrτµν “ τµν ` Eij bµi bνj ,\nrτµi “ Eij bµj ,\nrτij “ Eij ,\n(B.14a)\nrEµν “ Eµν ´ Eij Aµi Aνj ,\nrEµi “ 0 ,\nrEij “ 0 ,\n(B.14b)\nrbµν “ bµν ` 2 Arµ\ni bνsi ,\nrbµi “ Aµ\ni ,\nrbij “ 0 ,\n(B.14c)\nrφ “ φ ´ 1\n2 ln det\n`\nEij\n˘\n,\n(B.14d)\nwhere Eij denotes the inverse of Eij and Aµi “ EijEµj.\nIn the ω Ñ 8 limit, this T-duality transformation maps MpT to M(p+d)T with the\nrelated Buscher rules given by (B.14). The dual internal B-field rbij on the torus is consistently\nzero. If we make the restriction rbij in the inverse transformations (B.10), then the multiple\ndirection Buscher rules (B.10) and (B.14) express the T-duality between MpT and Mpp`dqT\nwith the restriction that bij “ rbij “ 0. This also includes the case d “ 1, for which the\nB-field is trivially zero, and we recover the Buscher transformation rules between MpT and\nMpp ˘ 1qT given previously in [2, 3] and used to generate the duality web of [1].\nNow, we suppose that the B-field has non-zero components in the internal transverse\ndirections, such that not all components of bij vanish in MpT. Suppose that the internal B-\nfield bij has rank r. Then we can bring it into block-diagonal form using a special orthogonal\ntransformation, such that splitting i “ pa, mq with a “ 1, . . . , r and m “ r ` 1, . . . , d we\nhave bmn “ bma “ 0 and bab is given by (3.23), so that det bab “ λ2\n1 . . . λ2\nr{2 ‰ 0. We can\nfigure out most easily what the T-dual theory is in the ω Ñ 8 limit by examining the dilaton\ntransformation (B.11c). We need to compute\ndet Eij “ det\n˜\nEab ´ ω2 bac\n`\nE´1˘cd bdb Ean\nEma\nEmn\n¸\n“ ωr”\ndet\n`\nEmn\n˘2`\ndet Eij\n˘´1`\ndet bab\n˘2 ` O\n`\nω´2˘ı\n.\n(B.15)\n– 49 –\n\n\nConsequently we find\nrΦ “ rφ ` 1\n2\n`\np ` d ´ r ´ 3\n˘\nln ω ,\nrφ “ φ ´ 1\n2 ln det\n`\nEmn\n˘\n´ ln\nˇˇλ1 ¨ ¨ ¨ λr{2\nˇˇ .\n(B.16)\nFurthermore, the new internal B-field can be shown to be finite, taking the form\nrbij “\n˜\npbabq´1\npbacq´1 βcn\npbbcq´1 βcm pbcdq´1 βcm βdn\n¸\n,\nβam ” ´\n`\nEab˘´1Ebm .\n(B.17)\nIt follows that the full B-field in (B.11a) is likewise finite. We conclude that when the rank of\nthe internal B-field is r , MpT is mapped to M(p`d´r)T under the T-duality transformation\nalong all the directions on the d-torus.\nIt may seem that this result is in tension with the fact that we have shown both above\nand in [3] that a single Buscher duality is sufficient to map MpT to Mpp ` 1qT, with the\nB-field components playing no role in the validity of this statement. Applying d consecutive\nT-duality on different isometry transformations it would then seem to imply that one should\nbe able to map MpT to Mpp ` dqT directly. The resolution of this puzzle is to note that\nour transverse T-duality rules above are derived with the assumption that τ A has no legs\non the isometry directions, and that T-duality with respect to a subset of these isometries\ndoes not lead to a background obeying this restriction. Indeed, suppose one has two isometry\ndirections, denoted y and z, and one T-dualises first on the y direction alone, assuming the\ncondition τ Ay “ 0. From (B.14) specialised to the d “ 1 case we read off the dual component\nrτzy “ Bzy{Eyy .\nHence if there is initially a B-field component Bzy then the condition\nrτ Az “ 0 does not hold, and we cannot continue to apply the d “ 1 Buscher rules following\nfrom (B.14). This can be further illustrated explicitly in the example of M0T on a transverse\n2-torus studied in Section 3.1.1. T-dualising on the direction x1 of the background (3.1) leads\nto the intermediate geometry\nds2 “ ω\n”\n´dt2 `\n`\ndrx1 ´ B dx2\n˘2ı\n` 1\nω\n´\ndx2\n2 ` dxm dxm¯\n,\n(B.18a)\nwith Bp2q “ 0 and eΦ “ ω´1 gs describing an M1T limit. In the present case, wanting to\nT-dualise on the direction x2 of (B.18), it is clear that τ Ax2 ‰ 0 unless B “ 0. So therefore\nthe naive Buscher T-duality rules which would relate M1T to M2T do not apply. We leave\nfurther extension of the T-duality transformations of MpT, allowing for arbitrary background\nfield configurations respecting the isometry, to future work.\nB.2. General Opd, d; Zq Transformations\nHere we outline how to extend the analysis to general Opd, d; Zq transformations of the form\n(A.3). We focus just on the dual dilaton and the dual metric in the isometry directions as\nthese are sufficient to determine the nature of the dual theory. These are given by:\nrG “\n”\nγ\n`\nG ` B\n˘\n` δ\nı´⊺\nG\n”\nγ\n`\nG ` B\n˘\n` δ\nı´1\n,\ne\nrΦ “ eΦ det\n”\nγ\n`\nG ` B\n˘\n` δ\nı´ 1\n2 .\n(B.19)\n– 50 –\n\n\nRecall that the Buscher transformation has γ “ 1 and δ “ 0. We then consider the results\nof longitudinal and transverse T-duality transformations of MpT.\n‚ Longitudinal Opd, d; Zq transformation. Given G “ ω τ and eΦ “ ω\n1\n2 pp´3q eφ, the transfor-\nmation rules (B.19) give\nrG “ ω´1”\nγ ` ω´1`\nγB ` δ\n˘\nτ ´1ı´⊺\nτ ´1 ”\nγ ` ω´1 `\nγ B ` δ\n˘\nτ ´1ı´1\n,\n(B.20)\ne\nrΦ “ ω\np´3´d\n2\neφ `\ndet τ\n˘´ 1\n2 det\n”\nγ ` ω´1 `\nγB ` δ\n˘\nτ ´1ı´ 1\n2 .\n(B.21)\nThe nature of the dual decoupling limit then depends on the rank of γ:\n(1) γ “ 0 : from MpT to MpT. For γ “ 0, we obtain\nrG “ ω δ´⊺τ δ´1 ,\ne\nrΦ “ ω\np´3\n2\neφ `\ndet δ\n˘´ 1\n2 ,\n(B.22)\nand the transformation therefore takes us to a dual MpT prescription.\n(2) det γ ‰ 0 : from MpT to Mpp´dqT. If γ is invertible, then in the limit ω Ñ 8, we get\nrG “ ω´1 γ´⊺τ ´1 γ´1 ,\ne\nrΦ “ ω\np´3´d\n2\neφ pdet τq´ 1\n2 pdet γq´ 1\n2 .\n(B.23)\nwhich gives a transformation to a dual Mpp ´ dqT prescription.\n(3) rankpγq “ r , 0 ă r ă d : from MpT to Mpp ´ rqT. This can be argued from the\ndilaton transformation rule. Let χ “ pγ B ` δq τ ´1. We need to evaluate the following\ndeterminant:\ndet\n´\nγ ` χ\nω\n¯\n“ ωr´d ”\nQ ` O\n`\nω´1˘ı\n,\n(B.24)\nwhere\nQ ” ϵi1...id ϵj1...jd γi1j1 ¨ ¨ ¨ γirjrχir`1jr`1 ¨ ¨ ¨ χidjd\nr! pd ´ rq!\n.\n(B.25)\nSubadditivity of the matrix rank implies rank\n`\nγ ` ω´1 χ\n˘\nď rankpγq ` rank\n`\nω´1 χ\n˘\n. We\nassume that γ ` ω´1χ is invertible so that the metric T-duality transformation does not\nbreak down. Hence rankpω´1 χq ě d ´ r, and so the expression in (B.25) is the leading\ndivergence, and\ne\nrΦ “ ω\np´3´r\n2\neφ pdet τq´1{2 Q´1{2 ,\n(B.26)\nsignals that we are in Mpp ´ rqT.\n‚ Transverse Opd, d; Zq transformation. Given G “ ω´1E, eΦ “ eφω\n1\n2 pp´3q, the transforma-\ntion rules (B.19) give:\nrG “ ω\n”\nγ E ` ω\n`\nγ B ` δ\n˘ı´⊺\nE\n”\nγ E ` ω1 `\nγ B ` δ\n˘ı´1\n,\n(B.27a)\ne\nrΦ “ ω\np´3`d\n2\neφ det\n”\nγ E ` ω\n`\nγ B ` δ\n˘ı´ 1\n2 .\n(B.27b)\nThe nature of the dual decoupling limit now depends on the rank of γB ` δ:\n– 51 –\n\n\n(1) γB `δ “ 0 : from MpT to Mpp`dqT. If δ “ ´γ B then the condition α δ⊺`β γ⊺“ 1\nimplies that pα B ` βq γ⊺“ 1. Therefore γ is invertible in this case, and we get:\nrG “ ω γ´⊺E´1 γ´1 ,\ne\nrΦ “ ω\np´3`d\n2\neφ `\ndet E\n˘´ 1\n2 `\ndet γ\n˘´ 1\n2 .\n(B.28)\nThis is a transformation to a dual Mpp ` dqT prescription.\n(2) detpγB ` δq ‰ 0 : from MpT to MpT. In this case, we find\nrG “ ω´1 `\nγB ` δ\n˘´⊺E\n`\nγB ` δ\n˘´1 ,\ne\nrΦ “ ω\np´3\n2\neφ det\n`\nγB ` δ\n˘´ 1\n2 ,\n(B.29)\nwhich implies that the dual frame is still MpT.\n(3) rankpγB ` δq “ r , 0 ă r ă d : from MpT to Mpp ` d ´ rqT. We can again see\nthis behaviour simply by extracting the leading power of ω arising from the determinant\nappearing in the dilaton transformation rule. Letting κ ” γB ` δ, we have\ndet\n`\nγE ` ω κ\n˘\n“ ωr ”\nR ` O\n`\nω´1˘ı\n,\n(B.30)\nwhere\nR “ ϵi1...id ϵj1...jd κi1j1 . . . κirjrpγEqir`1jr`1 . . . pγEqid´rjd´r\nr!pd ´ rq!\n.\n(B.31)\nThis then implies\ne\nrΦ “ ω\npp`d´rq´3\n2\neφ R´ 1\n2 ,\n(B.32)\nsignalling that we are in Mpp ` d ´ rqT.\nReferences\n[1] C. D. A. Blair, J. Lahnsteiner, N. A. J. Obers, and Z. Yan, Unification of Decoupling Limits in\nString and M Theory, Phys. Rev. Lett. 132 (2024), no. 16 161603, [arXiv:2311.10564].\n[2] J. Gomis and Z. Yan, Worldsheet formalism for decoupling limits in string theory, JHEP 07\n(2024) 102, [arXiv:2311.10565].\n[3] C. D. A. Blair, J. Lahnsteiner, N. A. Obers, and Z. Yan, Matrix theory reloaded: a BPS road to\nholography, JHEP 02 (2025) 024, [arXiv:2410.03591].\n[4] J. M. Maldacena, The Large N limit of superconformal field theories and supergravity, Adv.\nTheor. Math. Phys. 2 (1998) 231–252, [hep-th/9711200].\n[5] N. Itzhaki, J. M. Maldacena, J. Sonnenschein, and S. Yankielowicz, Supergravity and the large N\nlimit of theories with sixteen supercharges, Phys. Rev. D 58 (1998) 046004, [hep-th/9802042].\n[6] T. Banks, W. Fischler, S. H. Shenker, and L. Susskind, M theory as a matrix model: A\nConjecture, Phys. Rev. D 55 (1997) 5112–5128, [hep-th/9610043].\n[7] L. Susskind, Another conjecture about M(atrix) theory, hep-th/9704080.\n– 52 –\n\n\n[8] N. Seiberg, Why is the matrix model correct?, Phys. Rev. Lett. 79 (1997) 3577–3580,\n[hep-th/9710009].\n[9] A. Sen, D0-branes on T**n and matrix theory, Adv. Theor. Math. Phys. 2 (1998) 51–59,\n[hep-th/9709220].\n[10] J. Gomis and H. Ooguri, Nonrelativistic closed string theory, J. Math. Phys. 42 (2001)\n3127–3151, [hep-th/0009181].\n[11] U. H. Danielsson, A. Guijosa, and M. Kruczenski, IIA/B, wound and wrapped, JHEP 10 (2000)\n020, [hep-th/0009182].\n[12] U. H. Danielsson, A. Guijosa, and M. Kruczenski, Newtonian gravitons and d-brane collective\ncoordinates in wound string theory, JHEP 03 (2001) 041, [hep-th/0012183].\n[13] N. Lambert and J. Smith, Non-relativistic M2-branes and the AdS/CFT correspondence, JHEP\n06 (2024) 009, [arXiv:2401.14955].\n[14] N. Lambert and J. Smith, Non-relativistic intersecting branes, Newton-Cartan geometry and\nAdS/CFT, JHEP 07 (2024) 224, [arXiv:2405.06552].\n[15] J. Gomis, J. Gomis, and K. Kamimura, Non-relativistic superstrings: A New soluble sector of\nAdS(5) x S**5, JHEP 12 (2005) 024, [hep-th/0507036].\n[16] A. Fontanella and J. M. Nieto Garc´ıa, Nonrelativistic Holography from AdS5/CFT4, Phys. Rev.\nLett. 133 (2024), no. 15 151601, [arXiv:2409.02267].\n[17] D. ´Avila, A. Guijosa, and R. Olmedo, Asymptotically nonrelativistic string backgrounds, Int. J.\nMod. Phys. A 39 (2024), no. 15n16 2450047, [arXiv:2312.13243].\n[18] A. Guijosa and I. C. Rosas-L´opez, Geometry from D-branes in nonrelativistic string theory, Int.\nJ. Mod. Phys. A 39 (2024), no. 17n18 2450031, [arXiv:2312.03332].\n[19] N. Lambert and J. Smith, Reciprocal non-relativistic decoupling limits of String Theory and\nM-Theory, JHEP 12 (2024) 094, [arXiv:2410.17074].\n[20] T. Harmark, J. Lahnsteiner, and N. A. Obers, Gravitational solitons and non-relativistic string\ntheory, arXiv:2501.10178.\n[21] A. Guijosa, On the Underlying Nonrelativistic Nature of Relativistic Holography,\narXiv:2502.03031.\n[22] R. Dijkgraaf, J. de Boer, T. Harmark, and N. A. Obers, “U-duality and Theories without\nGravity.” unpublished.\n[23] A. Connes, M. R. Douglas, and A. S. Schwarz, Noncommutative geometry and matrix theory:\nCompactification on tori, JHEP 02 (1998) 003, [hep-th/9711162].\n[24] N. Seiberg and E. Witten, String theory and noncommutative geometry, JHEP 09 (1999) 032,\n[hep-th/9908142].\n[25] B. de Wit, J. Hoppe, and H. Nicolai, On the Quantum Mechanics of Supermembranes, Nucl.\nPhys. B 305 (1988) 545.\n[26] R. Gopakumar, S. Minwalla, N. Seiberg, and A. Strominger, (OM) theory in diverse\ndimensions, JHEP 08 (2000) 008, [hep-th/0006062].\n– 53 –\n\n\n[27] E. A. Bergshoeff, K. T. Grosvenor, J. Lahnsteiner, Z. Yan, and U. Zorba, Branched SL(2,Z)\nduality, JHEP 10 (2022) 131, [arXiv:2208.13815].\n[28] E. A. Bergshoeff, K. T. Grosvenor, J. Lahnsteiner, Z. Yan, and U. Zorba, Non-Lorentzian IIB\nsupergravity from a polynomial realization of SL(2, R), JHEP 12 (2023) 022,\n[arXiv:2306.04741].\n[29] S. Ebert and Z. Yan, Anisotropic compactification of nonrelativistic M-theory, JHEP 11 (2023)\n135, [arXiv:2309.04912].\n[30] N. Ishibashi, H. Kawai, Y. Kitazawa, and A. Tsuchiya, A Large N reduced model as superstring,\nNucl. Phys. B 498 (1997) 467–491, [hep-th/9612115].\n[31] A. Banerjee, R. Chatterjee, and P. Pandit, Tensionless strings in a Kalb-Ramond background,\nJHEP 06 (2024) 067, [arXiv:2404.01385].\n[32] M. R. Douglas and C. M. Hull, D-branes and the noncommutative torus, JHEP 02 (1998) 008,\n[hep-th/9711165].\n[33] A. S. Schwarz, Morita equivalence and duality, Nucl. Phys. B 534 (1998) 720–738,\n[hep-th/9805034].\n[34] D. Brace, B. Morariu, and B. Zumino, Dualities of the matrix model from T duality of the Type\nII string, Nucl. Phys. B 545 (1999) 192–216, [hep-th/9810099].\n[35] B. Pioline and A. S. Schwarz, Morita equivalence and T duality (or B versus theta), JHEP 08\n(1999) 021, [hep-th/9908019].\n[36] N. Seiberg, L. Susskind, and N. Toumbas, Strings in background electric field, space / time\nnoncommutativity and a new noncritical string theory, JHEP 06 (2000) 021, [hep-th/0005040].\n[37] R. Gopakumar, J. M. Maldacena, S. Minwalla, and A. Strominger, S duality and\nnoncommutative gauge theory, JHEP 06 (2000) 036, [hep-th/0005048].\n[38] I. R. Klebanov and J. M. Maldacena, (1+1)-dimensional NCOS and its U(N) gauge theory\ndual, Adv. Theor. Math. Phys. 4 (2000) 283–302, [hep-th/0006085].\n[39] E. Bergshoeff, D. S. Berman, J. P. van der Schaar, and P. Sundell, Critical fields on the\nM5-brane and noncommutative open strings, Phys. Lett. B 492 (2000) 193–200,\n[hep-th/0006112].\n[40] T. Harmark, Open branes in space-time noncommutative little string theory, Nucl. Phys. B 593\n(2001) 76–98, [hep-th/0007147].\n[41] J. X. Lu, S. Roy, and H. Singh, ((F, D1), D3) bound state, S duality and noncommutative open\nstring / Yang-Mills theory, JHEP 09 (2000) 020, [hep-th/0006193].\n[42] J. G. Russo and M. M. Sheikh-Jabbari, On noncommutative open string theories, JHEP 07\n(2000) 052, [hep-th/0006202].\n[43] R.-G. Cai and N. Ohta, (F1, D1, D3) bound state, its scaling limits and SL(2,Z) duality, Prog.\nTheor. Phys. 104 (2000) 1073–1087, [hep-th/0007106].\n[44] J. X. Lu, S. Roy, and H. Singh, SL(2, Z) duality and four-dimensional noncommutative\ntheories, Nucl. Phys. B 595 (2001) 298–318, [hep-th/0007168].\n– 54 –\n\n\n[45] U. Gran and M. Nielsen, Noncommutative open (p,q) string theories, JHEP 11 (2001) 022,\n[hep-th/0104168].\n[46] A. Hashimoto and N. Itzhaki, Noncommutative Yang-Mills and the AdS / CFT correspondence,\nPhys. Lett. B 465 (1999) 142–147, [hep-th/9907166].\n[47] J. M. Maldacena and J. G. Russo, Large N limit of noncommutative gauge theories, JHEP 09\n(1999) 025, [hep-th/9908134].\n[48] M. Alishahiha, Y. Oz, and M. M. Sheikh-Jabbari, Supergravity and large N noncommutative\nfield theories, JHEP 11 (1999) 007, [hep-th/9909215].\n[49] S. Ebert, H.-Y. Sun, and Z. Yan, Dual D-brane actions in nonrelativistic string theory, JHEP\n04 (2022) 161, [arXiv:2112.09316].\n[50] J. Gomis, Z. Yan, and M. Yu, Nonrelativistic Open String and Yang-Mills Theory, JHEP 03\n(2021) 269, [arXiv:2007.01886].\n[51] J. Brugues, T. Curtright, J. Gomis, and L. Mezincescu, Non-relativistic strings and branes as\nnon-linear realizations of Galilei groups, Phys. Lett. B 594 (2004) 227–233, [hep-th/0404175].\n[52] J. Brugues, J. Gomis, and K. Kamimura, Newton-Hooke algebras, non-relativistic branes and\ngeneralized pp-wave metrics, Phys. Rev. D 73 (2006) 085011, [hep-th/0603023].\n[53] R. Andringa, E. Bergshoeff, J. Gomis, and M. de Roo, ’Stringy’ Newton-Cartan Gravity, Class.\nQuant. Grav. 29 (2012) 235020, [arXiv:1206.5176].\n[54] E. Bergshoeff, J. Gomis, and Z. Yan, Nonrelativistic String Theory and T-Duality, JHEP 11\n(2018) 133, [arXiv:1806.06071].\n[55] E. A. Bergshoeff, K. T. Grosvenor, C. Simsek, and Z. Yan, An Action for Extended String\nNewton-Cartan Gravity, JHEP 01 (2019) 178, [arXiv:1810.09387].\n[56] Z. Yan, Torsional deformation of nonrelativistic string theory, JHEP 09 (2021) 035,\n[arXiv:2106.10021].\n[57] E. A. Bergshoeff, K. T. Grosvenor, L. Romano, and Z. Yan, Heterotic String Sigma Models:\nDiscrete Light Cone Quantization and Its T ¯T-Deformation, to appear (2024).\n[58] E. A. Bergshoeff, J. Lahnsteiner, L. Romano, J. Rosseel, and C. Simsek, Non-relativistic\nten-dimensional minimal supergravity, JHEP 12 (2021) 123, [arXiv:2107.14636].\n[59] E. A. Bergshoeff, C. D. A. Blair, J. Lahnsteiner, and J. Rosseel, The surprising structure of\nnon-relativistic 11-dimensional supergravity, JHEP 12 (2024) 010, [arXiv:2407.21648].\n[60] T. H. Buscher, Path Integral Derivation of Quantum Duality in Nonlinear Sigma Models, Phys.\nLett. B 201 (1988) 466–472.\n[61] T. H. Buscher, A Symmetry of the String Background Field Equations, Phys. Lett. B 194\n(1987) 59–62.\n[62] C. D. A. Blair, D. Gallegos, and N. Zinnato, A non-relativistic limit of M-theory and\n11-dimensional membrane Newton-Cartan geometry, JHEP 10 (2021) 015, [arXiv:2104.07579].\n[63] D. Hilbert, Ueber die theorie der algebraischen formen, Mathematische annalen 36 (1890), no. 4\n473–534.\n– 55 –\n\n\n[64] C. M. Hull, Timelike T duality, de Sitter space, large N gauge theories and topological field\ntheory, JHEP 07 (1998) 021, [hep-th/9806146].\n[65] U. Lindstrom, B. Sundborg, and G. Theodoridis, The Zero tension limit of the superstring,\nPhys. Lett. B 253 (1991) 319–323.\n[66] J. Isberg, U. Lindstrom, B. Sundborg, and G. Theodoridis, Classical and quantized tensionless\nstrings, Nucl. Phys. B 411 (1994) 122–156, [hep-th/9307108].\n[67] Y. Geyer, L. Mason, R. Monteiro, and P. Tourkine, Loop Integrands for Scattering Amplitudes\nfrom the Riemann Sphere, Phys. Rev. Lett. 115 (2015), no. 12 121603, [arXiv:1507.00321].\n[68] Y. Geyer and R. Monteiro, Two-Loop Scattering Amplitudes from Ambitwistor Strings: from\nGenus Two to the Nodal Riemann Sphere, JHEP 11 (2018) 008, [arXiv:1805.05344].\n[69] L. Mason and D. Skinner, Ambitwistor strings and the scattering equations, JHEP 07 (2014)\n048, [arXiv:1311.2564].\n[70] W. Siegel, Amplitudes for left-handed strings, e-Print (12, 2015) [arXiv:1512.02569].\n[71] E. Casali and P. Tourkine, On the null origin of the ambitwistor string, JHEP 11 (2016) 036,\n[arXiv:1606.05636].\n[72] B. Chen and Z. Hu, Carrollian superstring in the flipped vacuum, arXiv:2501.11011.\n[73] J. C. Breckenridge, G. Michaud, and R. C. Myers, More D-brane bound states, Phys. Rev. D 55\n(1997) 6438–6446, [hep-th/9611174].\n[74] J. G. Russo and A. A. Tseytlin, Waves, boosted branes and BPS states in m theory, Nucl. Phys.\nB 490 (1997) 121–144, [hep-th/9611047].\n[75] E. A. Bergshoeff, J. Gomis, J. Rosseel, C. S¸im¸sek, and Z. Yan, String Theory and String\nNewton-Cartan Geometry, J. Phys. A 53 (2020), no. 1 014001, [arXiv:1907.10668].\n[76] T. Harmark, J. Hartong, and N. A. Obers, Nonrelativistic strings and limits of the AdS/CFT\ncorrespondence, Phys. Rev. D 96 (2017), no. 8 086019, [arXiv:1705.03535].\n[77] J. Klusoˇn, Remark About Non-Relativistic String in Newton-Cartan Background and Null\nReduction, JHEP 05 (2018) 041, [arXiv:1803.07336].\n[78] T. Harmark, J. Hartong, L. Menculini, N. A. Obers, and Z. Yan, Strings with Non-Relativistic\nConformal Symmetry and Limits of the AdS/CFT Correspondence, JHEP 11 (2018) 190,\n[arXiv:1810.05560].\n[79] T. Harmark, J. Hartong, L. Menculini, N. A. Obers, and G. Oling, Relating non-relativistic\nstring theories, JHEP 11 (2019) 071, [arXiv:1907.01663].\n[80] L. Bidussi, T. Harmark, J. Hartong, N. A. Obers, and G. Oling, Torsional string\nNewton-Cartan geometry for non-relativistic strings, JHEP 02 (2022) 116, [arXiv:2107.00642].\n[81] C. D. A. Blair, Non-relativistic duality and T ¯T deformations, JHEP 07 (2020) 069,\n[arXiv:2002.12413].\n[82] J. Gomis, J. Oh, and Z. Yan, Nonrelativistic String Theory in Background Fields, JHEP 10\n(2019) 101, [arXiv:1905.07315].\n[83] A. D. Gallegos, U. G¨ursoy, and N. Zinnato, Torsional Newton Cartan gravity from\nnon-relativistic strings, JHEP 09 (2020) 172, [arXiv:1906.01607].\n– 56 –\n\n\n[84] Z. Yan and M. Yu, Background Field Method for Nonlinear Sigma Models in Nonrelativistic\nString Theory, JHEP 03 (2020) 181, [arXiv:1912.03181].\n[85] L. Motl, Proposals on nonperturbative superstring interactions, hep-th/9701025.\n[86] R. Dijkgraaf, E. P. Verlinde, and H. L. Verlinde, Matrix string theory, Nucl. Phys. B 500 (1997)\n43–61, [hep-th/9703030].\n[87] N. Nekrasov and A. S. Schwarz, Instantons on noncommutative R**4 and (2,0) superconformal\nsix-dimensional theory, Commun. Math. Phys. 198 (1998) 689–703, [hep-th/9802068].\n[88] E. A. Bergshoeff and L. Romano, Non-relativistic heterotic string theory, JHEP 01 (2024) 146,\n[arXiv:2310.19716].\n[89] E. Lescano and D. Osten, Non-relativistic limits of bosonic and heterotic Double Field Theory,\nJHEP 07 (2024) 286, [arXiv:2405.10362].\n[90] E. Bergshoeff, N. Lambert, and J. Smith, The M5-Brane Limit of Eleven-Dimensional\nSupergravity, arXiv:2502.07969.\n– 57 –\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20310v1.pdf",
    "total_pages": 58,
    "title": "Dual Non-Lorentzian Backgrounds for Matrix Theories",
    "authors": [
      "Chris D. A. Blair",
      "Johannes Lahnsteiner",
      "Niels A. Obers",
      "Ziqi Yan"
    ],
    "abstract": "We study properties of non-Lorentzian geometries arising from BPS decoupling\nlimits of string theory that are central to matrix theory and the AdS/CFT\ncorrespondence. We focus on duality transformations between ten-dimensional\nnon-Lorentzian geometries coupled to matrix theory on D-branes. We demonstrate\nthat T- and S-duality transformations exhibit novel asymmetric properties:\ndepending not only on the choice of transformation but also on the value of the\nbackground fields, the codimension of the foliation structure of the dual\nnon-Lorentzian background may be different or the same. This duality asymmetry\nunderlies features observed in the study of non-commutativity and Morita\nequivalence in matrix and gauge theory. Finally, we show how the holographic\ncorrespondence involving non-commutative Yang-Mills fits into our framework,\nfrom which we further obtain novel holographic examples with non-Lorentzian\nbulk geometries.",
    "published_date": "2025-02-27",
    "source": "arxiv"
  }
}