{
  "id": "arxiv_2502.21222v1",
  "text": "Exercises on the Kepler ellipses through a\nfixed point in space, after Otto Laporte\nGert Heckman\nRadboud University Nijmegen\nDedicated to Tom Koornwinder on the occasion\nof his 80th birthday\nAbstract\nThis article has a twofold purpose. On the one hand I would like\nto draw attention to some nice exercises on the Kepler laws, due to\nOtto Laporte from 1970. Our discussion here has a more geometric\nflavour than the original analytic approach of Laporte.\nOn the other hand it serves as an addendum to a paper of mine\nfrom 1998 on the quantum integrability of the Kovalevsky top. Later\nI learned that this integrability result had been obtained already long\nbefore by Laporte in 1933.\n1\nIntroduction\nIn the first decade of this century Maris van Haandel and I taught for several\nyears a master class for high school students on the Kepler laws of planetary\nmotion. The proof that the orbits of the planets are ellipses is usually given by\nclever calculus tricks, which might leave the innocent student with a feeling\nof black magic, although opinions can differ. For example, Herbert Goldstein\ndescribes this proof as the “simplest way to integrate the equation for the\norbit”, see Section 3.7 of his excellent text book on classical mechanics [2].\nIn the preparation of our master class we found a proof, that was more\ngeometric in nature, and based on the focus-focus characterization of ellipses\n[4]. After the standard initial discussion in Section 2 of the conservation laws\nof angular momentum and total energy, and their consequences for the Kepler\n1\narXiv:2502.21222v1  [math.SG]  28 Feb 2025\n\n\nproblem, our proof will be recalled in the Section 3. An elegant alternative\ngeometric proof based on the focus-directrix characterization of ellipses was\ngiven by Alexander Givental [1]. Several other proofs, like the original one of\nIsaac Newton from 1687 and the one by Richard Feynman from 1964, were\ndiscussed in modern mathematical language in [4].\nRecently I became aware of a paper by Otto Laporte on some geometric\nproperties of the Kepler ellipses through a fixed point in space [11]. His results\nwere obtained while teaching classical mechanics during numerous years in\norder to provide interesting exercises for students learning the mathematics\nof the Kepler laws. His analytic results will be conveniently derived in a\ngeometric way in Section 4.\nThe final Section 5 serves as an addendum to an old paper of mine on\nthe quantization of the Kovalevsky top [5].\nI would like to thank Rainer Kaenders and the anonymous referee for\nuseful comments.\n2\nThe familiar conservation laws\nLet r be the radius vector of a point in R3 and let the scalar r denotes its\nlength. If r moves in time t then ˙r denotes its velocity and ¨r its acceleration.\nAs usual the dot always stands for the derivative with respect to time. The\nKepler problem studies the solutions of Newton’s equation of motion\nµ¨r = F\nfor an inverse square force field F = −kr/r3 defined on R3 minus the origin.\nThe vector r describes the relative motion of a particle with mass m around\nanother particle with mass M. The parameter µ = mM/(m + M) is called\nthe reduced mass and k = GmM the coupling constant, with G Newton’s\nuniversal gravitational constant.\nThe second law of Kepler that the motion is planar and that the radius\nvector traces out equal areas in inequal times is easy to prove. Moreover it\nholds for a general central force field F, that is a force field of the form\nF(r) = f(r)r/r\nwith f a scalar function on R3 minus the origin. Writing p = µ˙r for the\nmomentum vector it follows from the Leibniz product rule that the angular\n2\n\n\nmomentum vector L = r × p is conserved, which in case L ̸= 0 implies that\nthe motion takes place in the plane perpendicular to L. Since the area of\nthe surface traced out by the radius vector r in a time interval t0 < t < t1 is\nequal to\n1\n2\nZ t1\nt0\n|r × ˙r| dt = L(t1 −t0)/(2µ)\nwe conclude that the radius vector r in a central force field sweeps out equal\nareas in equal times.\nIf the central force field F is in addition spherically symmetric, that is\nF(r) = f(r)r/r\nwith f a scalar function on R+, then the potential function V is defined by\nV (r) = −\nZ\nf(r)dr\nand satisfies d{V (r)}/dt = −f(r)(r · ˙r)/r by the chain rule. In turn this\nimplies that the total energy\nH = p2/(2µ) + V (r)\nis conserved for solutions of Newton’s equation of motion. For the Newtonian\nforce field f(r) = −k/r2 the potential function becomes V (r) = −k/r.\n3\nA geometric focus-focus proof\nIn this section an ellipse will be the geometric locus of points in a plane for\nwhich the sum of the distances to two given points is constant. The two\ngiven points are called the foci, and the sum of the distances is denoted 2a\nand called the major axis. The distance between the given foci is denoted 2c,\nand 2b > 0, defined by a2 = b2 + c2, is called the minor axis. The quotient\n0 ≤e = c/a ≤1 is called the eccentricity of the ellipse. If e = 0 then the\nellipse becomes a circle, while if e = 1 then the ellipse degenerates to a line\nsegment.\nLet us continue the discussion at the end of the previous section, and\nlet us assume throughout this section that both L ̸= 0 (excluding collinear\nmotion) and H < 0 are fixed. Consider the following figure of the plane\n3\n\n\nperpendicular to L. The circle C with center 0 and radius −k/H > 0 is the\nboundary of a disc where motion with fixed energy H < 0 can take place.\nIndeed, we have\nH = p2/(2µ) −k/r ≥−k/r\nand so r ≤−k/H with equality if and only if p = 0. The solutions t 7→r\nof the Kepler problem starting from rest at points of C fall straight onto the\norigin 0. For this reason C is called the fall circle [16].\nLet s = −kr/(rH) be the projection of r from the center 0 on this circle\nC. The line L through r with direction vector p is the tangent line to the\norbit E at position r with momentum p. Let t be the orthogonal reflection of\nthe point s in the tangent line L. As time varies, the position vector r moves\nalong the orbit E and also p = µ˙r and L move along with it, and likewise\nthe point s moves along the fall circle C. It is a good question to investigate\nhow the point t moves.\nb\nb\nb\nb\nb\nb\n0\nt\np\nr\ns\nn\nC\nE\nL\nN\nTheorem 3.1. The point t is equal to K/(µH) with\nK = p × L −kµr/r\nthe so called Lenz vector. The Lenz vector K and therefore also the vector t\nare conserved quantities for the Kepler problem.\n4\n\n\nProof. The line N spanned by n = p×L is perpendicular to L. The point t is\nobtained from s = −kr/(rH) by subtracting twice the orthogonal projection\nof s −r on the line N, and therefore\nt = s −2((s −r) · n)n/n2.\nUsing u · (v × w) = (u × v) · w for all vectors u, v, w in R3 we get\n2(r −s) · n = 2(H + k/r)r · (p × L)/H = p2L2/(µH)\nand since n2 = p2L2 we conclude that\nt = −kr/(rH) + n/(µH) = K/(µH)\nwith K = p × L −kµr/r the Lenz vector. The second claim that ˙K = 0 is\nderived by a straightforward computation using the Leibniz product rule for\ndifferentiation, and is left to the reader as an exercise.\nCorollary 3.2. The orbit E is an ellipse with foci 0 and t, and major axis\nequal to 2a = −k/H.\nProof. Since orthogonal reflections preserve lengths we have\n|t −r| + |r −0| = |s −r| + |r −0| = |s −0| = −k/H.\nHence E is an ellipse with foci 0 and t, and with major axis 2a = −k/H.\nThis geometric proof of the law of ellipses is taken from [4]. The conserved\nvector t = K/µH is a priori well motivated both in geometric and physical\nterms. In most text books on classical mechanics, like the one by Herbert\nGoldstein [2], or in the original article by Wilhelm Lenz [12] the vector K is\njust written down out of the blue and its motivation comes only a posteriori\nfrom the conservation law ˙K = 0 and as a vector pointing in the direction\nopposite to the focus t of the elliptical orbit E.\nThe vector K has been (re)discovered many times before, going back\nto Hermann and Laplace and others [4]. In the literature it is commonly\ncalled the Runge–Lenz vector, or also just the Lenz vector. Pauli introduced\na quantized version of the Lenz vector to give an elegant derivation of the\nBalmer formulae for the hydrogen spectrum [14], [15]. Pauli did this work in\nthe fall of 1925 at Hamburg, where he was assistent with Lenz.\n5\n\n\nBy definition we find e = 2c/(2a) = −K/(µH) : −k/H = K/(kµ) for the\neccentricity of E. The square length of the Lenz vector is equal to\nK · K = (p × L) · (p × L) −2(p × L) · (kµr/r) + k2µ2 = 2µHL2 + k2µ2\nby straightforward inspection. If 2c is the distance between the two foci of\nthe elliptical orbit E then\n4c2 = t · t = (2µHL2 + k2µ2)/(µ2H2)\nand together with 4a2 = 4b2 + 4c2 = k2/H2 we arrive at 4b2 = −2L2/(µH).\nThe area of the region bounded inside E is πab, and therefore\nπab = LT/2µ\nwith T the period of the orbit. Hence we obtain\na3\nT 2 =\naL2\n4π2b2µ2 = −2ab2µH\n4π2b2µ2\n=\nk\n4π2µ = G(m + M)\n4π2\nusing k = GmM and µ = mM/(m + M). Since the mass m of any planet\nis negligible compared to the mass M of the sun we conclude that the ratio\na3/T 2 is the same for all planets, which is how Kepler formulated his harmonic\nlaw. This ends our discussion of the three Kepler laws: the ellipse law, the\narea law and the harmonic law.\n4\nAll Kepler ellipses through a fixed point\nLet us continue with the notation of the previous section, that is let us fix\nan energy H = p2/2µ −k/q < 0 and let C be the falling circle with center\nat the origin 0 and radius −k/H. Otto Laporte asked himself the question\nwhat can be said about the one parameter family F of all Kepler ellipses E\nhaving that same fixed energy H < 0 and passing through a fixed point r\nin space [11]. Our geometric approach for the Kepler problem answers these\nquestions rather easily.\nFor example, what is the locus T of the foci t as these Kepler ellipses\nthrough the fixed point r vary? The geometry gives a quick answer, because\n|t −r| = |s −r| = s −r = −k/H −r = 2a −r\n6\n\n\nand so t traverses a circle with center r and radius 2a−r. The ellipse in this\none parameter family with smallest eccentricity e = 1 + 2Hr/k is the one\nwith r at its perihelion and r −s at its aphelion, while the one with largest\neccentricity e = 1 is the fall from standstill at s reaching 0 in finite time\nT/2 with infinite velocity. Indeed, all Kepler ellipses with the same energy\nH have the same major axes 2a = −k/H, and hence also the same period\nT by the harmonic law. In particular all motions starting at r at the same\ntime return at r simultaneously.\nb\nb\nb\nb\nb\nb\n0\nt\nr\ns\nt\nt\nC\nE\nE\nE\nE\nT\nB\nAnother question that Laporte posed is to describe the locus B of points\nthat bounds the region swept out by all Kepler ellipses through the fixed\npoint r. If q is a point on such an ellipse E with focus t then\nq + |q −r| ≤q + |q −t| + |t −r| + r −r = −k/H −k/H −r = 4a −r\nby the triangle inequality, and equality holds if t lies on the line segment\nfrom q to r. Hence the region swept out by these Kepler ellipses through r\nwith energy H < 0 is bounded by an ellipse with foci 0 and r and major axis\n4a −r.\n7\n\n\nHis last question deals with the directrices of E with respect to the origin,\nas E varies in the family F of Kepler ellipses through the fixed point r. The\ndirectrix D of such an E with respect to the origin is given by d + K⊥with\nd = L2K/K2 and K⊥the orthogonal complement of K. Indeed the distance\nfrom r to this directrix D is equal to\n(d −r) · K/K = (L2 −r · K)/K = kµr/K = r/e\nwith e = K/(kµ) the eccentricity of E, as should. The degenerate ellipse E\nthrough r with maximal eccentricity e = 1 has directrix equal to r⊥while\nthe ellipse E through r with minimal eccentricity e = 1 + 2Hr/k = (a −r)/a\nhas directrix equal to\n(1 + a/(a −r))r + r⊥\nat least if r ̸= a.\nLet us assume for the rest of this section that 0 < r < a , which in\nturn implies that the complement of the region swept out by this family\nof directrices is bounded. Let E denote the curve bounding that bounded\ncomplement. A natural Ansatz would be that E is an ellipse with foci r and\nu = ar/(a −r) and with long axis equal to (2a −r)r/(a −r).\nb\nb\nb\nb\nb\nb\nb\nb\nb\n0\nt\nr\ns\nw\nv\nu\nd\nC\nC\nE\nE\nL\nD\n8\n\n\nTheorem 4.1. The orthogonal reflection of the vector u = ar/(a −r) in the\ndirectrix D = d + K⊥of the Kepler ellipse E through r is equal to\nv = ar/(a −r) −rt/(a −r),\nwhich in turn implies that v −r = r(r −t)/(a −r). In particular we get\n|v−r| = (2a−r)r/(a−r) and so v moves along a circle C with center r and\nradius (2a−r)r/(a−r) as E moves in the family F of Kepler ellipses through\nr. Hence this family of directrices of E is the family of tangents to an ellipse\nE with foci r and u = ar/(a −r), with long axis equal to (2a −r)r/(a −r)\nand with eccentricity [r2/(a −r)] : [(2a −r)r/(a −r)] = r/(2a −r).\nProof. The orthogonal reflection v of u = ar/(a−r) with mirror the directrix\nD = d + K⊥is given by the formula\nv = u −2((u −d) · K)K/K2,\nand the desired rewriting goes as follows. Since\nu · K = ar · K/(a −r) = a(L2 −kµr)/(a −r), d · K = L2\nwe get\n2((u −d) · K) K = 2r(L2 −akµ) K/(a −r) = rK2 t/(a −r) .\nHere we have used\n2a = −k/H, K = µHt, K2 = 2µHL2 + k2µ2 .\nThis proves that v = ar/(a −r) −rt/(a −r) and hence we conclude that\n|v −r| = r(2a −r)/(a −r). The rest of the theorem follows just like the\nargument of the previous section.\nRemark 4.2. The ellipse E has eccentricity r/(2a −r) and so its directrix\nD with respect to the focus r is equal to −(2a−r)r/r+r⊥. This suggests that\nin case r = a the dual curve E becomes a parabola, and in case a < r < 2a\nthe dual curve E becomes a hyperbola. We leave it to the interested reader\nto show that the above geometric argument can be adapted to include these\ncases as well.\n9\n\n\n5\nFinal remarks\nIn the fall of 1995 I spent a month at the Mittag Leffler Institute in Stock-\nholm. In the impressive library I was brousing through the correspondences\nof G¨osta Mittag Leffler with Sophie Kowalevski about her discovery of the\nfamous integrable top, and later went down to the basement of the Institute\nto get myself a reprint of her Acta paper from 1889 [9]. Motivated by my\nprevious work with Eric Opdam on hypergeometric functions associated with\nroot systems (which was partly motivated by understanding how the inte-\ngrals of motion for the classical Calogero–Moser system could be lifted to its\nquantization) I checked by trial and error that her classical integral of motion\ncould be lifted to a conserved quantity for the corresponding quantum top,\nand wrote a short paper with the algebraic details of the proof [5].\nIn 2005 I got a friendly letter of the Russian physicist Igor Komarov, ex-\nplaining that both the quantum integrability of the Kowalevski top had been\ndone long before in 1933 by Otto Laporte [10], and also that my approach by\ndoing the calculations in the universal enveloping algebra of the Euclidean\nmotion group of R3 had been anticipated by him in 1981 [7] with several\nrelated results in the following years [8]. I should have written back then a\nshort addendum to my paper explaining my ignorance of this earlier work\nby Laporte and Komarov, but postponed this idea with the plan of getting\nback to the quantum Kowalevski top and see if some better understanding\nof the corresponding spectral problem could be obtained.\nIt did not work out that way as I failed in this attempt, and later I\nforgot about it, until I read a few years ago the autobiography “Der Teil\nund das Ganze” of Werner Heisenberg. In Chapter 3 Heisenberg tells about\nhis contacts with Wolfgang Pauli and Otto Laporte, which revitalized my\ninterest in the person of Laporte. All three were graduate students of Arnold\nSommerfeld in M¨unchen with graduation years 1921 (P), 1923 (H) and 1924\n(L). Subsequently Laporte went as a postdoc to the National Bureau of\nStandards in Maryland. In 1926 he joined the physics faculty at Ann Arbor\nin Michigan as colleague of Sam Goudsmit and George Uhlenbeck, and stayed\nthere for the rest of his life. The paper on the Kepler ellipses through a fixed\npoint in space of 1970 was one of his last, written after many years of teaching\nclassical mechanics. By shining some extra light now on this Kepler paper\nof Laporte I hope to have made up for the omission in my old work of 1998.\n10\n\n\nReferences\n[1] Alexander Givental, Kepler’s Laws and Conic Sections, Arnold Math.\nJournal 2 (2016), 139-148.\n[2] Herbert Goldstein, Classical Mechanics, Addison-Wesley, Second Edi-\ntion, 1980.\n[3] David L. Goodstein and Judith R. Goodstein, Feynman’s Lost Lecture:\nThe Motion of Planets Around the Sun, Norton and Company, New\nYork, 1996.\n[4] Maris van Haandel and Gert Heckman, Teaching the Kepler Laws for\nFreshmen, The Mathematical Intelligencer 31:2 (2009), 40-44.\n[5] Gert Heckman, Quantum Integrability of the Kovalevsky Top, Indaga-\ntiones Mathematicae 9:3 (1998), 359-365.\n[6] Werner Heisenberg, Der Teil und das Ganze, Piper Verlag, Berlin, 1969.\n[7] Igor V. Komarov, Kovalevskaya basis for the hydrogen atom, Theor.\nMath. Phys. 47 (1981), 76-72.\n[8] Igor V. Komarov, Remarks on Kowalevski’s top, J. Phys. A 34:11\n(2001), 2111-2120.\n[9] Sophie Kowalevski, Sur le Probl`eme de la Rotation d’ un Corps Solide\nautour d’un Point Fixe, Acta Math. 12:1 (1889), 177–232,\n[10] Otto Laporte, Note on Kowalewski’s Top in Quantum Mechanics, Phys-\nical Review 43 (1933), 548-551.\n[11] Otto Laporte, On Kepler Ellipses Starting from a Point in Space, Amer-\nican Journal of Physics 38:7 (1970), 837-840.\n[12] Wilhelm Lenz, ¨Uber den Bewegungsverlauf und Quantenzust¨ande der\ngest¨orten Keplerbewegung, Zeitschrift f¨ur Physik 24 (1924), 197-207.\n[13] Isaac Newton, The Principia, Mathematical Principles of Natural Phi-\nlosophy, New Translation by I. Bernard Cohen and Anne Whitman,\nUniversity of California Press, Berkeley, 1999.\n11\n\n\n[14] W. Pauli, ¨Uber das Wasserstoffspektrum vom Standpunkt der neuen\nQuantenmechanik, Zeitschrift f¨ur Physik 36 (1926), 336-363.\n[15] B.L. van der Waerden, Sources of Quantum Mechanics, Dover Publica-\ntions, New York, 1968.\n[16] Oswald Thomas, Astronomie – Tatsachen und Probleme, Das Bergland-\nBuch, Salzburg, 1949.\nGert Heckman, Radboud University Nijmegen: g.heckman@math.ru.nl\n12\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21222v1.pdf",
    "total_pages": 12,
    "title": "Exercises on the Kepler ellipses through a fixed point in space, after Otto Laporte",
    "authors": [
      "Gert Heckman"
    ],
    "abstract": "This article has a twofold purpose. On the one hand I would like to draw\nattention to some nice exercises on the Kepler laws, due to Otto Laporte from\n1970. Our discussion here has a more geometric flavour than the original\nanalytic approach of Laporte. On the other hand it serves as an addendum to a\npaper of mine from 1998 on the quantum integrability of the Kovalevsky top.\nLater I learned that this integrability result had been obtained already long\nbefore by Laporte in 1933.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}