{
  "id": "arxiv_2502.21115v1",
  "text": "arXiv:2502.21115v1  [cond-mat.mtrl-sci]  28 Feb 2025\nExtremely large magnetoresistance and chiral anomaly in the nodal-line semimetal ZrAs2\nJunjian Mi,1, 2 Sheng Xu,1 Shuxiang Li,1, 2 Chenxi Jiang,1,2 Zheng Li,1, 2 Qian Tao,1 and Zhu-An Xu1, 2, 3, 4, ∗\n1School of Physics, Zhejiang University, Hangzhou, 310058, China\n2State Key Laboratory of Silicon and Advanced Semiconductor Materials, Zhejiang University, Hangzhou, 310027, China\n3Hefei National Laboratory, Hefei, 230088, China\n4Collaborative Innovation Centre of Advanced Microstructures, Nanjing University, Nanjing, 210093, China\n(Dated: March 3, 2025)\nWe performed the detailed magnetotransport measurements and ﬁrst principle calculations to study the elec-\ntronic properties of the transition metal dipnictides ZrAs2, which is a topological nodal-line semimetal. Ex-\ntremely large unsaturated magnetoresistance (MR) which is up to 1.9 × 104 % at 2 K and 14 T was observed\nwith magnetic ﬁeld along the c-axis. The nonlinear magnetic ﬁeld dependence of Hall resistivity indicates the\nmulti-band features, and the electron and hole are nearly compensated according to the analysis of the two-\nband model, which may account for the extremely large unsaturated MR at low temperatures. The evident\nShubnikov-de Haas (SdH) oscillations at low temperatures are observed and four distinct oscillation frequen-\ncies are extracted. The ﬁrst principle calculations and angle-dependent SdH oscillations reveal that the Fermi\nsurface consists of three pockets with different anisotropy. The observed twofold symmetry MR with electric\nﬁeld along the b-axis direction is consistent with our calculated Fermi surface structures. Furthermore, the nega-\ntive magnetoresistance (NMR) with magnetic ﬁeld in parallel with electric ﬁeld is observed, which is an evident\nfeature of the chiral anomaly.\nINTRODUCTION\nThe study of topological semimetals have attracted tremen-\ndous interests due to their novel electronic structure and un-\nconventional transport properties in condensed-matter physics\nin recent years [1–3], such as large longitudinal magnetore-\nsistance, high mobility, nontrivial Berry phase and chiral-\nanomaly induced negative longitudinal MR [4–10]. In these\nmaterials, the topological semimetallic states are character-\nized by band touching points or lines between conduction and\nvalance bands in momentum space. Dirac and Weyl semimet-\nals are characterized by band crossings at a single point in k-\nspace, exhibiting linear dispersion and featuring fourfold and\ntwofold degeneracies, respectively. Dirac points could be di-\nvided into two Weyl points by breaking time-reversal symme-\ntry or inversion symmetry. Dirac semimetals have been con-\nﬁrmed in Cd3As2 and Na3Bi [11–14] and Weyl semimetals\nhave been theoretically proposed and experimentally observed\nin MX (M=Ta or Nb; X=P or As), WTe2 and (Nb,Ta)IrTe4\n[15–21]. In contrast to Dirac or Weyl semimetals, topological\nnodal line semimetals showcase a unique characteristic: one-\ndimensional trajectory within the k-space, forming either an\nopen path or a closed loop. Several candidate materials have\nbeen identiﬁed within the realm of nodal line semimetals, in-\ncluding PbTaSe2, PtSn4, ZrSiX (X = S, Se, Te), and the CaP3\nfamily (A = Ca, Ba, Sr; B = P, As). Each of these materials\nexhibits intriguing topological properties [22–27].\nThe transition metal dipnictides (TMDPs) with the formula\nMX2 (where M = Nb or Ta; X = As or Sb) exhibit a crys-\ntalline structure characterized by the symmetry of C2/m (No.\n12), and they have attracted considerable attention primarily\nowing to their possession of compelling properties, including\nextremely large magnetoresistance (XMR) and negative mag-\nnetoresistance (NMR) [9, 10, 28]. Recently, TMDPs ZrX2\n(where X = P or As) with the space group Pnma (No. 62) were\ntheoretically predicted to be topological nodal-line semimet-\nals, garnering increasing attention. An extremely large mag-\nnetoresistance in ZrP2 has been detected, which might be\ninduced by the compensation of electrons and holes.\nThe\ncompensation of electrons pockets and hole pockets were fur-\nther conﬁrmed by angle-resolved photoemission spectroscopy\n(ARPES) as well as the ﬁrst-principle calculations [29, 30].\nThe band structure of ZrP2 is characterized by a nodal loop\nin the kx = 0 plane without considering spin-orbit coupling\n(SOC) and a small gap along the nodal loop will open when\nconsidering SOC according to the ﬁrst-principle calculations\n[29].\nCompared with ZrP2, the gap of ZrAs2 along the\nnode line should be larger due to the enhanced spin-orbit\ncoupling[6].\nQuantum oscillations, Hall resistivity, and anisotropic MR\nin ZrAs2 have recently been reported [31]. However, the topo-\nlogical properties have yet to be conﬁrmed and the transport\nproperties are worth revisiting with enhanced sample quality.\nOnly one oscillation frequency (i.e., single pocket in Fermi\nsurface) was observed from the SdH oscillations with the cur-\nrent applying along the b- axis and the magnetic ﬁeld in the ac\nplane of ZrAs2. In contrast, multiple pockets were detected\nin de Haas-van Alphen (dHvA) oscillations.\nFurthermore,\nrecent ARPES experiments have reported the surface bands\nand bulk states of ZrAs2, suggesting multi-band feature [32].\nSuch a discrepancy between transport and magnetic measure-\nments could result from the low sample quality indicated by\nthe lower residual resistivity ratio (RRR) of the previous sam-\nples grown by the ﬂux method.\nIn this work, we reported the detailed magnetotransport\nproperties and electronic structure of the topological nodal-\nline semimetal ZrAs2.\nWe used chemical vapor transport\nmethod to grow high quality crystals of ZrAs2 to investigate\ntopologital properties. The Hall resitivity and longitudinal\nMR measurements reveal the concentration of electron (ne ≈\n\n\n2\n3.58×1020cm−3) with a mobility of µe ≈5600 cm2V −1s−1\nand the concentration of hole (nh ≈3.47 × 1020cm−3) with\na mobility of µh ≈5164 cm2V −1s−1 at 2 K, according to the\nanalysis of the two-band model. The XMR up to 1.9 × 104\n% is oberved at 2 K and 14 T, which is considered to stem\nfrom the compensation mechanism [29]. The SdH oscilla-\ntions at low temperature and high magnetic ﬁeld are observed\nand four frequencies F1 = 155 T, F2 = 178 T, F3 = 443 T,\nF4 = 579 T are extracted. The nontrivial Berry phases are\nobtained from the plot of the Landau level index fan diagram.\nMoreover, we observed anistropic MR with two-fold symme-\ntry when the current is applied along the b axis and the mag-\nnetic ﬁeld lies within the ac plane, consistent with the two-\nfold Fermi surfaces (FSs) structure predicted by the DFT cal-\nculations. Furthermore, we observed the evident NMR when\nthe electric ﬁeld is in parallel with magnetic ﬁeld applying\nalong the b axis. According to our analysis and previous theo-\nretical works[33], we argued that the NMR should be induced\nby the chiral anomaly. Our study has provided compelling ev-\nidence for the topological properties of nodal-line semimetals\nin ZrAs2.\nEXPERIMENTAL METHODS\nSingle crystals of ZrAs2 were synthesized by the chemical\nvapor transport method. The Zr power and As power were\nweighted with a molar ratio of 1:2 in sealed fused-silica tubes\nwith 4 mg/mL grain of I2 added to promote crystal growth.\nThe quartz tubes were heated to 850 ◦C over 2 days, kept at\n850 ◦C for 1 week and cooled to room temperature over 1 day,\nas described in Ref [34]. Then needle-like crystals were ob-\ntained. The atomic composition of the ZrAs2 single crystal\nwas determined using energy dispersive X-ray spectroscopy\n(EDS), revealing a Zr to As ratio of 1:1.92. This observed\nratio aligns closely with the nominal ratio of 1:2, taking into\naccount experimental errors. A suitable crystal was selected\nand mounted on a Bruker D8 Venture diffractometer to mea-\nsure the single crystal X-ray diffraction (XRD). The crystal\nwas kept at 170.0 K during data collection. Using Olex2 [35],\nthe structure was solved with the SHELXT [36] structure so-\nlution program using Intrinsic Phasing and reﬁned with the\nSHELXL [37] reﬁnement package using Least Squares min-\nimisation.\nThe measurements of resistivity and magnetic transport\nproperties were performed on a Quantum Design physical\nproperty measurement system (PPMS-DynaCool 14 T). The\nDFT calculations of electronic structure of bulk ZrAs2 were\nperformed by using the Vienna ab initio simulation package\n(VASP) [38] , with the generalized gradient approximation\n(GGA) in the Perdew-Burke-Ernzerhof type as the exchange-\ncorrelation energy [39]. The cutoff energy was set to 350 eV\nand Γ-centered 8 × 15 × 6 mesh were sampled over the Bril-\nlouin zone integration. The lattice constant a = 6.7964 ˚A,\nb = 3.6848 ˚A, c = 9.0214 ˚A was used for all the calcula-\ntions. The tight-binding model of ZrAs2 was constructed by\n0\n50\n100\n150\n200\n250\n300\n0\n10\n20\n30\n40\n[011]\n[002]\n[10-1]\n[-101]\n[-200]\n(e)\n(d)\n(c)\nb\nxx \n(m\n·\ncm)\n1mm\n(b)\n(a)\nT (K)\n RRR= 56\n[010]\nFIG. 1.\n(a) Crystaline structure of ZrAs2.\n(b) Temeperature-\ndependent resistivity of the single crystal ZrAs2. The inset shows a\nphotograph of the grown ZrAs2 single crystal. (c)-(e) Single-crystal\nXRD on ZrAs2 with Diffracted reﬂections in ( 0kl ) plane, ( h0l )\nplane ( hk0 ) plane, respectively.\nthe Wannier90 with 4d orbitals of Zr and 4p orbitals of As,\nwhich based on the maximally-localized Wannier functions\n[40] [41].\nRESULTS AND DISCUSSIONS\nThe crystal structure of ZrAs2 is presented in Fig. 1(a) with\nthe space group of Pnma (No. 62). Fig. 1(b) shows the\ntemperature-dependent ρxx exhibiting a typical metallic be-\nhavior with the electric current along the b-axis. The residual\nresistivity ρxx( 2K) is 0.53 µΩ·cm at 2 K and residual resis-\ntance ratio (RRR=ρxx(300 K)/ρxx(2 K)) is 56 which is higher\nthan previously reported value in Ref. [31]. A higher RRR\nindicates a higher quality of single crystals. The inset shows a\npicture of the needle shaped single crystal ZrAs2 with the easy\ngrowth direction along the b-axis. Figs. 1(c-e) presents the\ndiffracted reﬂections in ( 0kl ) plane, ( h0l ) plane and ( hk0\n) plane, respectively. The lattice constants of ZrAs2 were ob-\ntained as a = 6.7964(3) ˚A, b = 3.6848(2) ˚A, c = 9.0214(4) ˚A,\nwhich are consistent with the previous reported results [34].\nFig. 2(a) shows the ﬁeld-dependent longitudinal MR of\nZrAs2 at various temperatures, where MR is deﬁned as MR\n= (ρxx(B) −ρxx(0))/(ρxx(0)) × 100%. To eliminate the\nHall contribution, the ρxx(B) is calculated from ρxx(B) =\n(ρxx(−B)+ρxx(B))/2 . An extremely large unsaturated MR\nof up to 2.5 × 103 % is observed at 2 K and 8 T. The MR de-\ncreases as temperature increases, reaching 1.6 × 102% at 80\nK and 8 T. To explore the origin of this large and unsaturated\nMR, we also measured the Hall resistivity. The measurements\nof ρxy(B) at different temperatures provide further transport\nfeatures, as shown in Fig. 2(b). The Hall resistivity exhibits\n\n\n3\n-8\n-6\n-4\n-2\n0\n2\n4\n6\n8\n-6\n-4\n-2\n0\n2\n4\n6\n-8\n-6\n-4\n-2\n0\n2\n4\n6\n8\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n0\n2\n4\n6\n8\n-2.0\n-1.5\n-1.0\n-0.5\n0.0\n0\n1\n2\n3\n4\n0\n20\n40\n60\n80\n100\n120\n140\n160\n0.2\n0.4\n0.6\n 2 K  \n 10 \n 30    \n 50 \n 80    \n 110\n 150  \n 200\n 250\nr\nxy\n(mW·\ncm)\nB (T)\n 2 K  \n 10 \n 30    \n 50 \n 80    \n 110\n 150  \n 200\n 250\nB (T)\nMR ( ×\n10\n3\n %)\n(a)\n(b)\n(c)\n(d)\ns\nxy\n (10\n6\n W\n-1\n·\nm\n-1\n)\n 2 K \n 10\n 30 \n 50\n 80 \n 110\n 150 \n Fitting \nB (T)\n m\nh\n m\ne\nm (10\n4\n cm\n2\n/Vs )\n n\nh\n n\ne\nn (10\n20\n cm\n-3\n)\nT (K)\nFIG. 2. (a) The longitudidual MR with the currrent along the b axis\nand magnetic ﬁeld under the ac plane at various temperatures. (b)\nHall resistivities versus magnetic ﬁeld at different temperatures. (c)\nσxy versus magnetic ﬁeld at different temperatures. The red curves\nare the ﬁtting results by two-band model. (d) The temperature depen-\ndence of carrier densities and mobilities of the electrons and holes.\nnonlinear magnetic ﬁeld dependence at low temperatures, im-\nplying its multi-band properties. Furthermore, the mobility\nand concentration of electron and hole can be obtained by a\ntwo-band model ﬁtting. Firstly, we calculated the σxy accord-\ning to the formula σxy = −ρxy/((ρxy)2+(ρxx)2), then we ﬁt\nthe σxy using the two-band model formula as the following.\nσxy(B) = (\nnhµ2\nh\n1 + (µhB)2 −\nneµ2\ne\n1 + (µeB)2 )eB\n(1)\nwhere ne,h and µe,h represent the concentration and mobil-\nity of electrons and holes, respectively. As shown in Fig.\n2(c), the ﬁtted red curves are consistent with the experimental\ndata, from which the temperature-dependent concentrations\nand mobilities are extracted and plotted in Fig. 2(d). At 2 K,\nthe concentration of electron ne ≈3.58 × 1020 cm−3 which\nis almost equal to the concentration of hole nh ≈3.47 × 1020\ncm−3.\nThe mobilities increase with decreasing tempera-\nture.\nµe and µh reach up to 5600 cm2V −1s−1 and 5164\ncm2V −1s−1 at 2 K, respectively. The high mobilities fur-\nther illustrate the good quality of single crystals. According\nto these results and analysis, the compensation mechanism of\nelectrons and holes can account for the origin of the XMR\nat low temperature. Similarly, the compensation mechanism\nof electrons and holes induced XMR has been reported in\nother topological semimetals such as TaAs2, NbAs2 and ZrP2\n[9, 10, 29].\nQuantum oscillation experiments serve as a potent ap-\nproach to investigate the properties of Fermi surfaces [42, 43].\nFig. 3(a) shows the resistivity as a function of magnetic ﬁeld\nat low temperatures with the electric current along the b-axis\nand the magnetic ﬁeld along the c-axis. The SdH oscillations\ncan be clearly observed at low temperatures and high mag-\nnetic ﬁelds. The inset shows obvious oscillations around 14 T.\nThe oscillations gradually decreases as temperature increases\nand almost disappears at 12 K. The oscillatory components\nof the SdH oscillations versus 1/B can be described by the\nLifshitz-Kosevich (LK) formula [44–47]:\n∆ρ ∝\nλT\ncosh(λT )e−λTDsin[2π(F\nB −1\n2 + β + δ)]\n(2)\nwhere λ = (2π2kBm∗)/(¯heB). T D is the Dingle tempera-\nture. The value of δ depends on the dimensionality, δ = 0\nfor 2D systems and δ = ±1/8 for 3D systems. β = φB/2π\nand φB is the Berry phase. After substracting a background,\nthe oscillation component ∆ρ versus 1/B is shown in Fig.\n3(b). The oscillation intensity decreases with increasing tem-\nperature. Four oscillation frequencies can be identiﬁed from\nthe Fast Fourier transform (FFT) analysis with F1 =155 T ,\nF2 =178 T, F3 =443 T and F4 =579 T at low temperatures\nas shown in Fig. 2(c). Furthermore, the harmonic frequency 2\nF3 =886 T and 2 F4 =1158 T can also be observed. Accord-\n0\n500\n1000\n1500\n2\n4\n6\n8\n10\n12\n0.06\n0.09\n0.12\n0.15\n0.18\n-3\n-2\n-1\n0\n1\n2\n0\n2\n4\n6\n8\n10\n12\n14\n0\n40\n80\n120\n13.2\n13.6\n110\n120\n0.00\n0.05\n0.10\n0.15\n0.20\n0\n20\n40\n60\n80\nF\n1\n2F\n4\n2F\n3\n(a)\n(b)\nF\n4\nF\n3\nF\n2\nFFT Amplitude (a.u.)\nF (T)\n(c)\n(d)\n F\n1\n F\n2\n F\n3\n F\n4\n F\n1\n F\n2\n F\n3\n F\n4\nAmplitude\nT (K)\n 2 K\n 3\n 5    \n 7\n 9    \n 12\n1/B (T\n-1\n)\nxx\n (\ncm)\nxx\n (\ncm)\nB (T)\n 2 K\n 3\n 5    \n 7\n 9    \n 12\nxx  \n(\ncm)\nB (T)\n1/B (T\n-1\n)\nN\nFIG. 3. (a) SdH oscillations at low temperatures with current along\nthe b-axis and magnetic ﬁeld along the c-aixs. Inset: enlarged plot\nof SdH oscillations at high ﬁelds. (b) Oscillatory part of the resis-\ntivity ∆ρ as a function of 1/ B at different temperatures. (c) FFT\ncurves indicate the presence of four distinct intrinsic frequencies. In-\nset shows the temperature dependence of relative FFT amplitude of\nthe frequencies as a function of temperature and the read curves are\nthe ﬁtted by the thermal factor of Lifshitz-Kosevich formula. (d)\nLandau-level indices fan diagram for different frequencies as a func-\ntion of 1/ B.\ning to the Onsager relation F = (φ0/2π2) = (¯h/2πe)AF,\nthe oscillation frequency is proportional to the extreme cross-\nsection (AF ) of FS normal to the magnetic ﬁeld. The cal-\nculated AF associated with different frequency were shown\nin Table 1. The inset of Fig. 3(c) shows the temperature-\ndependent FFT amplitudes and the red curve are ﬁtted by the\nthermal factor RT = (λT )/sinh(λT ). The ﬁtting curves are\n\n\n4\nconsistent with experiment datas and the effective masses are\nestimated to be m∗\n1 = 0.10me, m∗\n2 = 0.11me , m∗\n3 = 0.13me\nand m∗\n4 = 0.12me.\nThe detailed ﬁtting results are listed\nin Table 1. Compared to previous reports [31], we obtained\nlighter effective masses, which are coresponding to the Dirac\nfermions with linear dispersion. This suggests that the elec-\ntronic properties of this material are more akin to ideal Dirac\nfermions. Besides, according to the Lifshitz - Onsager quan-\ntization rule N = AF (¯h/2πeB) −1/2 + β + δ, the Berry\nphase can be extracted from the intercept of the linear extrap-\nolation. The Landau indices N as a function of 1/B and the\nﬁtting curves are shown in Fig. 3(d). The values of φB from\nthe different δ are listed in Table 1. The Berry phases of F3\nwith (δ = 1/8) is 1.1 π and F4 with (δ = −1/8) is 0.8 π,\nindicating the nontrivial π Berry phases. The nontrivial Berry\nphases indicate the topological properities of corresponding\nbands and FSs.\nTo further investigate the FS topology and compare it with\nresults of the SdH experiments, we performed the DFT cal-\nculations. The FSs structures in the ﬁrst Brillouim zone are\ndisplayed in Fig. 4(a)-4(c). ZrAs2 has small α hole pock-\nets (blue) near U point and two big β hole pockets as shown\nin Fig. 4(c) and Fig. 4(d) and three type δ electron pockets\n(purple) near Γ point can be devided as δ1 and δ2, which is\nsimilar to its sister compound ZrP2 [6]. In addition, there is\nalso a small electron-like FS inside δ2. There are two addi-\ntional small Fermi surfaces located inside the δ2 Fermi sur-\nfaces. Moreover, both large Fermi surfaces, β and δ2, exhibit\ntwo-fold symmetry in the ﬁrst Brillouin zone.\nAngular-dependent magnetotransport measurements pro-\nvide a valuable approach for investigating the detailed struc-\nture of the FS [43]. Fig. 4(d) shows the angle-dependent MR\nas a function of magnetic ﬁeld at 2 K. The inset of Fig. 4(d)\npresents the deﬁnition of ϕ where the magnetic ﬁeld is always\nperpendicular to the current. The evident SdH oscillations are\nobserved when H rotates from the a axis to c axis. The angle-\ndependent ∆ρ as a function of 1/ B at different angles are\nshown in Fig. 4(e). The itensities of oscillations increase with\ndecreasing ϕ which is consistent with the tendency of MR.\nFig. 4(f) shows the angle-dependent frequency of SdH oscil-\nlations as the rotation angle changes from the a axis (ϕ = 0o)\nto c axis (ϕ = 90o). As we mentioned hereinbefore, the four\nfrequencies, F1, F2, F3 and F4, appear as B//c. Due to the\ncomplicated FSs, we draw a red dash line in Fig. 4(f) to care-\nfully tracke the position of these frequencies at different an-\ngles. The frequencies of F1 and F2 change slightly. However,\nthe signals of F1 and F2 disappear at ϕ = 0o, which possibly is\nobscured by the signal from a larger pocket. The frequencies\nof F3 increased with decreasing ϕ. However, the frequency of\nF4 increases ﬁrst and then decreases with decreasing ϕ. The\nFermi surfaces β and δ2 in ZrAs2 are quite complex, which\nmakes it difﬁcult to distinguish the SdH oscillations of differ-\nent FSs. The calculated frequencies of δ1, δ2 and β pockets\nare 135 T, 394 T and 551 T respectively, with magnetic ﬁeld\nalong the c-axis. The frequency F1=155 T may be associated\nwith a small Fermi surface hidden within δ2. Combined with\n0\n2\n4\n6\n8\n10\n12\n14\n0\n5\n10\n15\n20\n0\n500\n1000\n1500\n2000\n0.09\n0.12\n0.15\n0.18\n0\n30\n60\n90\n120\n150\n180\n210\n240\n270\n300\n330\n0\n5\n10\n15\n20\n0\n5\n10\n15\n20\n(g)\n(e)\nX\nY\nZ\nU\nT\nR\nS\n j = 90°\n j = 75°\n j = 60°\n j = 45°\n j = 30°\n j = 15°\n j = 0°\n(f)\nB\nc\nI // b\na\nj \n j = 0°\n 15°\n 30°\n 45°\n 60°\n 75°\n 90°\nMR ( ×\n10\n3\n%)\nB (T)\nFFT Amplitude (a.u.)\nF\n3\nB // a\nF\n2\nF\n1\nF (T)\nF\n4\nB // c\n(b)\n (a. u.)\n1/B (T\n-1\n)\n j = 90°\n j = 75°\n j = 60°\n j = 45°\n j = 30°\n j = 15°\n j = 0°\n(a)\n(d)\n(c)\nj \n MR (´10\n3\n %)\n 3 T\n 6\n 9\n 12\n 14\nFIG. 4. (a) Brillouin zone and FSs of electron pockets (blue ones).\n(b) FSs of hole pockets (red ones). (c) FSs of electron pockets (pur-\nple ones). (d) Angle-dependent MR as a function of magnetic ﬁeld\nof ZrAs2 by titling the magnetic ﬁelds from B // a direction to the B\n// c direction with the current along the b direction at 2 K. (e) Angle-\ndependent ∆ρ as a function of 1/ B at different angles. (f) Angle-\ndependent frequency from SdH oscillations at different angles. (g)\nAngle-dependent MR at different magnetic ﬁeld by titling the mag-\nnetic ﬁelds under the (ac) plane.\nDFT calculations, we propose that F2 is associated with elec-\ntron pocket δ1, F3 is associated with electron pocket δ2 and\nF4 is associated with hole pocket β as shown in Fig. 4(a)\n- 4(c). However, the oscillation frequency of small hole α\npocket is not observed in the SdH oscillations. The discrep-\nancy between the SdH experiments and the DFT calculations\nmay be induced by the slight variation in chemical potential\nof our sample. The chemical potential is often inﬂuenced by\nthe small changes in the lattice parameters or impurity dop-\ning. In addition, the angle-dependent MR at 2 K is shown\nin Fig. 4(g) with current along the b axis and magnetic ﬁeld\nin the ac plane. Besides, the obvious two-fold symmetry of\nMR were obsrved and the ratio of ρxx(14T, (ϕ = 90o)) /\nρxx(14T, (ϕ = 0o)) ≈3 also indicates a moderate electronic\nstructure anisotropy [43]. The twofold FSs can acount for the\ntwo-fold symmetry anisotropic MR [48]. At 2 K and 14 T,\nthe extremely large unsaturated MR reaches up to 1.9 × 104\n% with magnetic ﬁeld applied along the c axis, which is sig-\nniﬁcantly higher than that of 1.01 × 103 % in previous report\n[31], indicating higher quality of the single crystals.\nIn addition to the non-trivial Berry phase identiﬁed through\nquantum oscillation analysis, a compelling piece of evidence\n\n\n5\nTABLE I. The parameters extracted from SdH oscillations with B⊥c-axis conﬁguration. The F1, F2, F3 and F4 are the FSs from SdH\noscillations; m∗/me is the ratio of the effective mass to the electron mass; φB is the Berry phase.\nPocket\nFrequency(T )\nAF ( ˚A−2)\nφB(δ = −1/8)\nφB(δ = 1/8)\nm∗/me\nF1\n155\n0.015\n1.4π\n0.9π\n0.10\nF2\n178\n0.017\n1.9π\n0.4π\n0.11\nF3\n443\n0.042\n0.6π\n1.1π\n0.13\nF4\n579\n0.055\n0.8π\n1.3π\n0.12\nfor the topological characteristics is the observation of chiral\nanomaly induced negative MR (NMR), which have been ob-\nserved in Weyl semimetal NbAs and Dirac semimetal TaAs2\nand NbAs2 [9, 10]. Fig. 5(a) shows the angle-dependent lon-\ngitudinal MR at 2 K with magnetic ﬁeld rotating from perpen-\ndicular to in parallel with current (I//b). In order to eliminate\nthe inﬂuence of the Hall signal, the ρxx(B) were averaged by\nmeasuring the resitivity over positive and negative ﬁeld direc-\ntions. At θ = 0o, the MR is the largest. As θ decreases ,\nthe MR at 2 K decreases dramatically under magnetic ﬁeld.\nWhen magnetic ﬁeld is collinear with current (θ = 0o), the\nchiral anomaly plays a signiﬁcant role in the transport. As\nshown in Fig. 5(b), when the magnetic ﬁeld is parallel to cur-\nrent (B//I), a clear negative MR is observed. When the mag-\nnetic ﬁeld increases, the MR becomes positive at low ﬁelds\n(B < 5 T) and negative at high ﬁelds below 50K, at θ = 90o.\nIt should be noted that such a NMR was not in Ref. [31]. Sim-\nilar NMR induced by the chiral anomaly has widely observed\nin topological semimetals like NbAs2 in Ref. [9]. According\nto the theoretical works and related experiments[5, 26, 33],\nwhen magnetic ﬁeld is collinear with electric ﬁeld in the topo-\nlogical nodal line semimetal, a chiral anomaly will appear re-\nmarkably which is similar to the Weyl semimetal. The chiral\nanomaly can account for the NMR when the magnetic ﬁeld is\ncollinear with the electric ﬁeld (B//I), which indicates again\nthe topological characteristic of ZrAs2.\n0\n2\n4\n6\n8\n10\n12\n14\n0\n1\n2\n3\n4\n5\n6\n7\n-15\n-10\n-5\n0\n5\n10\n15\n0\n2\n4\n6\n8\n10\nc\nB \n(b)\nI // b\n  a\n90 °\n75\n60\n45\n30\n15\n0\nMR (´10\n3 \n%)\nB (T)\n(a)\nMR (\n10\n1\n %)\nB (T)\n 2 K\n 10\n 25\n 30\n 40\n 50\n 100\nB // I\nFIG. 5. (a) Angle-dependent MR as a function of magnetic ﬁeld of\nZrAs2 by titling the magnetic ﬁelds from the a direction (B ⊥I)\nto the B // I direction at 2 K. (b) Magnetic ﬁeld-dependent MR at\ndifferent temperatures with B//I along the b-axis direction.\nBesides the chiral anomaly, there may be other mechanisms\nthat can also give rise to negative MR. Firstly, our ZrAs2 sam-\nple is high quality single crystalline which should not contain\nany magnetic atoms, thus the inﬂuence of magnetic moments\ncan be excluded. Secondly, Anderson weak antilocalization\n(WAL) can also cause negative MR at low ﬁelds [49]. How-\never, as shown in Fig. 5(b), the negative MR in our case ap-\npears in high magnetic ﬁeld (B > 5 T), therefore the WAL ef-\nfect could be excluded. Thirdly, the NMR can also be induced\nin the quantum limit, where the Fermi energy lies in the only\nthe lowest Landau level [50, 51]. In our case, the quantum\noscillations can be observed at high magnetic ﬁeld as shown\nin Fig. 2(a), the inﬂuence of quantum limit can be excluded.\nFinally, the current jetting effect can induce NMR when in-\nhomogeneous currents are injected into the sample. To miti-\ngate this, we positioned the current injection electrodes across\nthe sample to ensure a uniform current distribution through-\nout the sample, thereby avoiding the inﬂuence of the current\njetting effect [5]. To summarize, based on above discussions,\nand also considering theoretical calculations and analysis, we\nargued that the NMR in ZrAs2 should be induced by the chiral\nanomaly.\nCONCLUSIONS\nIn summary, the detailed magnetotransport properties and\nelectron structures of topological nodal-line semimetal ZrAs2\nwere measured. The extremely large unsaturated MR is ob-\nserved which reaches up to 1.9 × 104 % at 2 K and 14 T. The\nelectron- and hole-type charge carriers are almost compen-\nsated from the analysis based on the two-band model, which\nmay account for the extremely large unsaturated MR at low\ntemperature. The evident SdH oscillations are observed and\nfour frequencies F1 =155 T , F2 =178 T, F3 =443 T and\nF4 =579 T are extracted from the SdH oscillations. The non-\ntrivial π Berry phase and the chiral anomaly induced NMR\nsuggested its nontrivial topological characteristic. Our study\nfurther conﬁrmed the topological characteristics of nodal-line\nsemimetal ZrAs2.\nACKNOWLEDGMENTS\nThis work was supported by the National Science Founda-\ntion of China (Grant No. 12174334; 12204410), the National\nKey & Program of the China (Grant No. 2019YFA0308602),\nthe Innovation Program for Quantum Science and Technol-\nogy (Grant No. 2021ZD0302500), and China Postdoctoral\nScience Foundation (Grant No. 2022M712788)\n\n\n6\n∗zhuan@zju.edu.cn\n[1] C.-K. Chiu, J. C. Y. Teo, A. P. Schnyder, and S. Ryu, Rev. Mod.\nPhys. 88, 035005 (2016).\n[2] N. P. Armitage, E. J. Mele, and A. Vishwanath, Rev. Mod. Phys.\n90, 015001 (2018).\n[3] B. Yan and C. Felser, Annu. Rev. Condens. Matter Phys. 8, 337\n(2017).\n[4] N. Kumar, Y. Sun, N. Xu, K. Manna, M. Yao, V. S¨uss, I. Leer-\nmakers, O. Young, T. F¨orster, M. Schmidt, H. Borrmann, B.\nYan, U. Zeitler, M. Shi, C. Felser, and C. Shekhar, Nat. Com-\nmun. 8, 1642 (2017).\n[5] L. An, X. Zhu, W. Gao, M. Wu, W. Ning, and M. Tian, Phys.\nRev. B 99, 045143 (2019).\n[6] J. Bannies, E. Razzoli, M. Michiardi, H.-H. Kung, I. S. Elﬁ-\nmov, M. Yao, A. Fedorov, J. Fink, C. Jozwiak, A. Bostwick,\nE. Rotenberg, A. Damascelli, and C. Felser, Phys. Rev. B 103,\n155144 (2021).\n[7] D. T. Son and B. Z. Spivak, Phys. Rev. B 88, 104412 (2013).\n[8] Y. Luo, H. Li, Y. Dai, H. Miao, Y. Shi, H. Ding, A. Taylor, D.\nYarotski, R. Prasankumar, and J. Thompson, Appl. Phys. Lett.\n107, 182411 (2015).\n[9] B. Shen, X. Y. Deng, G. Kotliar, and N. Ni, Phys. Rev. B 93,\n195119 (2016).\n[10] Y.-Y. Wang, Q.-H. Yu, P.-J. Guo, K. Liu, and T.-L. Xia, Phys.\nRev. B 94, 041103(R) (2016).\n[11] S. M. Young, S. Zaheer, J. C. Y. Teo, C. L. Kane, E. J. Mele,\nand A. M. Rappe, Phys. Rev. Lett. 108, 140405 (2012).\n[12] Z. Wang, H. Weng, Q. Wu, X. Dai, and Z. Fang, Phys. Rev. B\n88, 125427 (2013).\n[13] Z. K. Liu, B. Zhou, Y. Zhang, Z. J. Wang, H. M. Weng, D. Prab-\nhakaran, S.-K. Mo, Z. X. Shen, Z. Fang, X. Dai, Z. Hussain, and\nY. L. Chen, Science 343, 864 (2014).\n[14] S. Borisenko, Q. Gibson, D. Evtushinsky, V. Zabolotnyy, B.\nB¨uchner, and R. J. Cava, Phys. Rev. Lett. 113, 027603 (2014).\n[15] S.-Y. Xu, N. Alidoust, I. Belopolski, Z. Yuan, G. Bian, T.-R.\nChang, H. Zheng, V. N. Strocov, D. S. Sanchez, G. Chang, C.\nZhang, D. Mou, Y. Wu, L. Huang, C.-C. Lee, S.-M. Huang, B.\nWang, A. Bansil, H.-T. Jeng, and T. Neupert et al., Nat. Phys.\n11, 748 (2015).\n[16] S.-Y. Xu, I. Belopolski, N. Alidoust, M. Neupane, G. Bian, C.\nZhang, R. Sankar, G. Chang, Z. Yuan, C.-C. Lee, S.-M. Huang,\nH. Zheng, J. Ma, D. S. Sanchez, B. Wang, A. Bansil, F. Chou,\nP. P. Shibayev, H. Lin, and S. Jia et al., Science 349, 613 (2015).\n[17] P. Li, Y. Wen, X. He, Q. Zhang, C. Xia, Z.-M. Yu, S. A. Yang,\nZ. Zhu, H. N. Alshareef, and X.-X. Zhang, Nat. Commun. 8,\n2150 (2017).\n[18] B. Q. Lv, H. M. Weng, B. B. Fu, X. P. Wang, H. Miao, J. Ma, P.\nRichard, X. C. Huang, L. X. Zhao, G. F. Chen, Z. Fang, X. Dai,\nT. Qian, and H. Ding, Phys. Rev. X 5, 031013 (2015).\n[19] C. Shekhar, A. K. Nayak, Y. Sun, M. Schmidt, M. Nicklas, I.\nLeermakers, U. Zeitler, Y. Skourski, J. Wosnitza, Z. Liu, Y.\nChen, W. Schnelle, H. Borrmann, Y. Grin, C. Felser, and B.\nYan, Nat. Phys. 11, 645 (2015).\n[20] B. Q. Lv, S. Muff, T. Qian, Z. D. Song, S. M. Nie, N. Xu, P.\nRichard, C. E. Matt, N. C. Plumb, L. X. Zhao, G. F. Chen, Z.\nFang, X. Dai, J. H. Dil, J. Mesot, M. Shi, H. M. Weng, and H.\nDing, Phys. Rev. Lett. 115, 217601 (2015).\n[21] X. W. Huang , X. X. Liu , P. Yu , P. L. Li , J. Cui , J. Yi , J.\nB. Deng , J. Fan , Z. Q. Ji , F. M. Qu , X. N. Jing , C. L. Yang\n, L. Lu , Z. Liu , and G. T. Liu , Chin. Phys. Lett. 36, 077101\n(2019).\n[22] L. M. Schoop, M. N. Ali, C. Straßer, A. Topp, A. Varykhalov,\nD. Marchenko, V. Duppel, S. S. P. Parkin, B. V. Lotsch, and C.\nR. Ast, Nat. Commun. 7, 11696 (2016).\n[23] Y. Wu, L.-L. Wang, D. Mun, D. D. Johnson, D. Mou, L. Huang,\nY. Lee, S. L. Bud’ko, P. C. Canﬁeld, and A. Kaminski, Nat.\nPhys. 12, 667 (2016).\n[24] J. Hu, Z. J. Tang, J. Y. Liu, X. Liu, Y. L. Zhu, D. Graf, K.\nMyhro, S. Tran, C. N. Lau, and J. Wei et al., Phys. Rev. Lett.\n117, 016602 (2016).\n[25] J. Hu, Z. Tang, J. Liu, Y. Zhu, J. Wei, and Z. Mao, Phys. Rev. B\n96, 045127 (2017).\n[26] Q. Xu, R. Yu, Z. Fang, X. Dai, and H. Weng, Phys. Rev. B 95,\n045136 (2017).\n[27] G. Bian, T.-R. Chang, R. Sankar, S.-Y. Xu, H. Zheng, T. Neu-\npert, C.-K. Chiu, S.-M. Huang, G. Chang, I. Belopolski, D. S.\nSanchez, M. Neupane, N. Alidoust, C. Liu, B. Wang, C.-C. Lee,\nH.-T. Jeng, C. Zhang, Z. Yuan, and S. Jia et al., Nat. Commun.\n7, 10556 (2016).\n[28] X.-T. Zhou, C.-H. Hsu, H. Aramberri, M.Iraola C.- Y. Huang,\nJ.- L. Ma˜nes, M.G. Vergniory, H. Lin, and N.Kioussis Phys.\nRev. B 104, 125135 (2021).\n[29] K. Wang, D. Graf, L. Li, L. Wang, and C. Petrovic, Anisotropic\ngiant magnetoresistance in NbSb2, Sci. Rep. 4, 7328 (2014).\n[30] J. Bannies, E. Razzoli, M. Michiardi, H.-H. Kung, I. S. Elﬁ-\nmov, M. Yao, A. Fedorov, J. Fink, C. Jozwiak, A. Bostwick,\nE. Rotenberg, A. Damascelli, and C. Felser, Phys. Rev. B 103,\n155144 (2021).\n[31] S. Nandi, B. B. Maity, V. Sharma, R. Verma, V. Saini, B.\nSingh, D. Aoki, and A. Thamizhavel. Phys. Rev. B 109, 075155\n(2024).\n[32] A. S. Wadge, K. Zberecki, B. J. Kowalski, D. Jastrzebski, P.\nK. Tanwar, P. Iwanowski, R. Diduszko, A. Moosarikandy, M.\nRosmus, N. Olszowska, and A. Wisniewski, Phys. Rev. B 110,\n035142 (2024).\n[33] S. Li, Z. Guo, D. Fu, X.-C. Pan, J. Wang, K. Ran, S. Bao, Z.\nMa, Z. Cai, R. Wang, R. Yu, J. Sun, F. Song, and J. Wen, Sci.\nBull. 63, 535 (2018).\n[34] P. E. Blanchard, R. G. Cavell, and A. Mar, J. Alloys Compd.\n505, 17 (2010).\n[35] Dolomanov, O.V., Bourhis, L.J., Gildea, R.J, Howard, J.A.K.\nand Puschmann, H. (2009), J. Appl. Cryst. 42, 339-341.\n[36] Sheldrick, G.M. (2015). Acta Cryst. A71, 3-8.\n[37] Sheldrick, G.M. (2015). Acta Cryst. C71, 3-8.\n[38] G. Kresse and J. Furthmuller, Phys. Rev. B 54, 11169 (1996).\n[39] J. P. Perdew, K. Burke, and M. Ernzerhof, Phys. Rev. Lett. 77,\n3865 (1996).\n[40] A. A. Mostoﬁ, J. R. Yates, G. Pizzi, Y.-S. Lee, I. Souza, D.\nVanderbilt, and N. Marzari, Comput. Phys. Commun. 185, 2309\n(2014).\n[41] A. Kokalj, J. Mol. Graphics Modell. 17, 176 (1999).\n[42] Y. P. Li, C. C. Xu, M. S. Shen, J. H. Wang, X. H. Yang, X.\nJ. Yang, Z. W. Zhu, C. Cao, and Z. A. Xu, Phys. Rev. B 98,\n115145 (2018).\n[43] Y.-Y. Wang, P.-J. Guo, S. Xu, K. Liu, and T.- L. Xia, Phys. Rev.\nB 101, 035145 (2020).\n[44] I. M. Lifshits and A. M. Kosevich, Sov. Phys. JETP 2, 636\n(1956).\n[45] D. Shoenberg,\n(Cambridge University Press,\nCambridge,\n1984).\n[46] I. Lifshitz, Zh. Eksp. Teor. Fiz. 38, 1569 (1960).\n[47] I. Lifshitz et al., Sov. Phys. JETP 11, 1130 (1960).\n[48] S. Zhang, Q. Wu, Y. Liu, and O. V. Yazyev Phys. Rev. B 99,\n035142 (2019).\n\n\n7\n[49] X. S. Wu, X. B. Li, Z. M. Song, C. Berger, and W. A. de Heer,\nPhys. Rev. Lett. 98, 136801 (2007).\n[50] P. Goswami, J. H. Pixley, and S. Das Sarma, Phys. Rev. B 92,\n075205 (2015).\n[51] P. N. Argyres and E. N. Adams, Phys. Rev. 104, 900 (1956).\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21115v1.pdf",
    "total_pages": 7,
    "title": "Extremely large magnetoresistance and chiral anomaly in the nodal-line semimetal ZrAs2",
    "authors": [
      "Junjian Mi",
      "Sheng Xu",
      "Shuxiang Li",
      "Chenxi Jiang",
      "Zheng Li",
      "Qian Tao",
      "Zhu-An Xu"
    ],
    "abstract": "We performed the detailed magnetotransport measurements and first principle\ncalculations to study the electronic properties of the transition metal\ndipnictides ZrAs2, which is a topological nodal-line semimetal. Extremely large\nunsaturated magnetoresistance (MR) which is up to 1.9 * 10^4 % at 2 K and 14 T\nwas observed with magnetic field along the c-axis. The nonlinear magnetic field\ndependence of Hall resistivity indicates the multi-band features, and the\nelectron and hole are nearly compensated according to the analysis of the\ntwo-band model, which may account for the extremely large unsaturated MR at low\ntemperatures. The evident Shubnikov-de Haas (SdH) oscillations at low\ntemperatures are observed and four distinct oscillation frequencies are\nextracted. The first principle calculations and angle-dependent SdH\noscillations reveal that the Fermi surface consists of three pockets with\ndifferent anisotropy. The observed twofold symmetry MR with electric field\nalong the b-axis direction is consistent with our calculated Fermi surface\nstructures. Furthermore, the negative magnetoresistance (NMR) with magnetic\nfield in parallel with electric field is observed, which is an evident feature\nof the chiral anomaly.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}