{
  "id": "arxiv_2502.20199v1",
  "text": "Exploring experimental limit of deep quantum signal processing using a trapped-ion simulator\nJ.-T. Bu,1, 2, * Lei Zhang,3, * Zhan Yu,4 Jing-Bo Wang,5 W.-Q. Ding,1, 2 W.-F. Yuan,1, 2 B. Wang,1, 2\nH.-J. Du,1, 2 W.-J. Chen,1, 2 L. Chen,1, 6 J.-W. Zhang,6 J.-C. Li,7 F. Zhou,1, 6, † Xin Wang,3, ‡ and M. Feng1, 6, §\n1Wuhan Institute of Physics and Mathematics, Innovation Academy of Precision\nMeasurement Science and Technology, Chinese Academy of Sciences, Wuhan 430071, China\n2University of the Chinese Academy of Sciences, Beijing 100049, China\n3Thrust of Artificial Intelligence, Information Hub, The Hong Kong University\nof Science and Technology (Guangzhou), Guangdong 511453, China\n4Centre for Quantum Technologies, National University of Singapore, 117543, Singapore\n5Beijing Academy of Quantum Information Sciences, Beijing 100193, China\n6Research Center for Quantum Precision Measurement,\nGuangzhou Institute of Industry Co. LTD, Guangzhou, 511458, China\n7Guangzhou Institute of Industrial Intelligence, Guangzhou 511458, China\n(Dated: February 28, 2025)\nQuantum signal processing (QSP), which enables systematic polynomial transformations on quantum data\nthrough sequences of qubit rotations, has emerged as a fundamental building block for quantum algorithms\nand data re-uploading quantum neural networks. While recent experiments have demonstrated the feasibility of\nshallow QSP circuits, the inherent limitations in scaling QSP to achieve complex transformations on quantum\nhardware remain an open and critical question. Here we report the first experimental realization of deep QSP\ncircuits in a trapped-ion quantum simulator. By manipulating the qubit encoded in a trapped 43Ca+ ion, we\ndemonstrate high-precision simulation of some prominent functions used in quantum algorithms and machine\nlearning, with circuit depths ranging from 15 to 360 layers and implementation time significantly longer than\ncoherence time of the qubit. Our results reveal a crucial trade-off between the precision of function simulation\nand the concomitant accumulation of hardware noise, highlighting the importance of striking a balance between\ncircuit depth and accuracy in practical QSP implementation. This work addresses a key gap in understanding\nthe scalability and limitations of QSP-based algorithms on quantum hardware, providing valuable insights for\ndeveloping quantum algorithms as well as practically realizing quantum singular value transformation and data\nre-uploading quantum machine learning models.\nI.\nINTRODUCTION\nQuantum computing, an emerging and pivotal field, holds\nimmense promise for applications across various scientific do-\nmains, including cryptography [1], database searching [2],\nand machine learning [3–7]. By leveraging the inherent prop-\nerties of quantum mechanics, such as superposition and entan-\nglement, these algorithms can process complex computational\nproblems, offering substantial advantages over their classical\ncounterparts [8–12].\nRecent advancements in quantum computing indicate that\nquantum signal processing (QSP) [13] is poised to be a ba-\nsic toolbox for mainstream quantum algorithms. One exam-\nple is the framework of quantum singular value transforma-\ntion (QSVT) [14]. By applying QSP to invariant subspaces\nof input data, QSVT unifies a wide range of well-established\nquantum algorithms [15], including those designed for ampli-\ntude amplification [14], Hamiltonian simulation [16–19], and\nsolving of linear systems’ equations [14]. This framework can\nbe further employed to develop novel quantum algorithms that\naddress computational tasks, such as quantum phase estima-\ntion [15, 20, 21] and quantum entropy estimation [20, 22–24].\n* Co-first authors with equal contribution\n† zhoufei@wipm.ac.cn\n‡ felixxinwang@hkust-gz.edu.cn\n§ mangfeng@wipm.ac.cn\nBeyond the quantum computing perspective, QSP has also\nemerged as a crucial tool in the field of quantum machine\nlearning [4].\nThe structure of QSP is widely used in de-\nsigning quantum neural networks (QNNs) to yield quantum\nadvantage. In particular, the single-qubit data re-uploading\nQNN [25, 26] can universally approximate univariate func-\ntions [27]. This QSP-like structure has been further used to\nconstruct multi-qubit QNNs that could universally approxi-\nmate multivariate functions [28]. Apart from directly con-\nstructing QNNs, quantum machine learning algorithms, e.g.,\nquantum transformer [29], can implement classical neural net-\nworks on a quantum computer, in which QSP is required to\nsimulate activation functions of neural networks.\nHowever, implementing QSP-based quantum algorithms\nremains challenging due to constraints from existing hard-\nware [30–32], such as expensive gate cost and non-negligible\nnoise factors [33, 34]. As the common ground of these algo-\nrithms, it is essential to comprehend the empirical efficacy of\nthe QSP components. The experimental fidelity not only in-\nfluences the precision of polynomial transformation in quan-\ntum algorithms, but also affects the expressivity of QSP-based\nQNN models. Exploiting experimental limitations [35] of the\nQSP will provide valuable insight into the practicality of these\nalgorithms within the confines of quantum hardware.\nThe initial QSP experiment [36] implemented a simplified\nQSVT structure to evaluate quantum device performance un-\nder noises. Subsequent research works have utilized QSP cir-\ncuits for Hamiltonian simulation [37] and channel discrimina-\ntion [38] in trapped-ion systems. Despite those achievements,\narXiv:2502.20199v1  [quant-ph]  27 Feb 2025\n\n\n2\n397 nm\n729 nm\n3.2 GHz\n4S1/2,F=4,mF=4\n4S1/2,F=3,mF=3\n4P1/2\n𝒇\n…\n=\n+\n+\n+\n𝑳 frequencies\n𝒇\n𝒙\n(c). The ion trap and the qubit \n(a). Fourier expansion\n(d). Deg-L simulation \n|0⟩\n$$$\n$$$\n(b). Data encoding and quantum control \nRz(𝜙!) Ry(𝜃!) Rz(𝑥)\nRz(𝜙\") Ry(𝜃\")\nInitialization\nMicrowave sequence\nDetection\n|1⟩\nRequire\nEvaluate\nFunction 𝑓\nQSP Circuit\nTarget\nQSP\n3D5/2,F=6,mF=6\n43Ca+\n397 nm\n729 nm\n𝑗= 0, 1 … 𝑳−1\nQuantum\nMachine\nLearning\nQuantum\nComputing\nAmplitude \nAmplification\n0\n1\n0\n0\n0\n0\nHamiltonian \nSimulation\n𝐱= 𝐀'(𝐛\nSystems of \nLinear Equations\nData \nProcessing\n…\n…\n…\nFig 1. A schematic overview of using a single trapped ion to evaluate experimental limitation of QSP. (Left panel) QSP finds extensive\napplications across various problems ranging from quantum computing to quantum machine learning tasks. The target algorithm is reduced\nto a task of simulating function f. Here it is listed as examples that amplitude amplification aligns with a linear function, Hamiltonian\nsimulation corresponds to an evolution function, and solving linear equations requires an inverse function. Then the simulation process is\ndivided into following four steps (a, b, c, d), which connect quantum computing to quantum machine learning. (a) The truncated Fourier\nseries is computed for optimal approximation. (b) The QSP circuit simulating f is implemented using laser and microwave sequences, from\nthe end of the sideband cooling to the final detection. (c) The ion trap and the level scheme of the 43Ca+ ion, where the trap’s axial and radial\nfrequencies are respectively, ωz/2π = 1.2 MHz and ωr/2π = 1.5 MHz, and the qubit is encoded in the stretched states of the hyperfine\nground state, i.e., |0⟩= |4S1/2, F = 4, mF = 4⟩and |1⟩= |4S1/2, F = 3, mF = 3⟩, where F and mF represent total angular momentum\nand magnetic quantum number. A 3.2 GHz microwave couples the two encoded states for unitary operation. Laser cooling, optical pumping,\nand state measurement are performed with 397 nm and 729 nm lasers. (d) By analyzing the characteristic damping signals and comparing with\nthe target function, the simulation error of this QSP circuit is incorporated back into the quantum algorithm to determine its error bounds.\nthe current depths of QSP circuits remain shallow. Then an\nopen question persists: to what extent can quantum algorithms\nreliably handle sophisticated transformations in quantum de-\nvices?\nThese transformations, while significant, often ex-\nhibit singularities that cannot be approximated by low-degree\npolynomials. The absence of such experiments necessitates\na deeper exploration for practical performance capability of\nQSP-based algorithms [39, 40].\nIn this work, we address this open question by investi-\ngating a tight bound for experimental errors in implement-\ning QSP-based algorithms in the case of noise-free quantum\ndata. Notably, our method is independent of the qubit cost\nof the target algorithm, with any QSP-based algorithm to be\nreduced to a function simulation task with only single-qubit\nimplementation required. To showcase its effectiveness, we\npresent the first experimental realization of deep QSP circuits\nin a trapped-ion quantum simulator, demonstrating the accu-\nrate execution of three important functions with singularities.\nBy exploiting the experimental depth of these QSP circuits,\nour experiments demonstrate that, within an appropriate time\nthat far exceeds the dephasing time of the system, the average\nexperimental error within deep QSP circuits can be exponen-\ntially suppressed. We also identify two main sources of error\nand analyze their effects in deep QSP circuits. These exper-\niments offer reliable references for assessing the fidelity of\nsimulating deep QSP-based algorithms in ion-trap devices.\nII.\nQUANTUM SIGNAL PROCESSING\nThe concept of quantum signal processing (QSP) can be\ntraced back to the seminal work of Low et al. [13], who\ndemonstrated that interleaving rotation gates can facilitate\npolynomial transformations of an input scalar x. By encod-\ning a polynomial P into the rotation angles, QSP simulates its\nperformance P(x) through the expectation value by measur-\ning the qubit [15, 27]. QSP can be further extended to multi-\nqubit frameworks [20, 41–43], empowering quantum circuits\nto simulate polynomial transformation of input matrix data.\nMany quantum algorithms can be interpreted as univariate\nfunction transformations applied to input data. QSP and its\nmulti-qubit extension provide quantum approaches to simu-\nlate these functions and beyond. As listed in the left panel of\nFigure 1, each algorithm can be reduced to a task of simulat-\ning a square-integrable function f : R →C. Notably, am-\nplitude amplification corresponds to a linear function f(x) =\nax; Hamiltonian simulation equates to an evolution function\nf(x) = e−ixt; solving linear systems needs an inverse func-\ntion f(x) = x−1. By approximating f with a polynomial\nexpansion, such as Fourier expansion [44], one can construct\n\n\n3\na QSP-based circuit to simulate f and address the correspond-\ning problem. Nevertheless, the performance of such deep ex-\ntensions on real quantum devices remains largely unexplored,\nwhile verifying a QSP-based algorithm directly would be pro-\nhibitively expensive. This raises a natural question: how ef-\nfectively can we evaluate the performance of QSP-based cir-\ncuits without conducting experiments that may require hun-\ndreds of qubits?\nHere, we propose a method that uses only a single qubit to\nexplore the limitations of QSP-based algorithms on NISQ de-\nvices. The approach involves first distilling the single-qubit\nQSP circuit from the algorithm and then carrying out the\nqubit-experiment. The experimental simulation error of this\nsingle-qubit circuit provides a lower bound for the experi-\nmental error in its multi-qubit extension, and such bound is\ntight when the signal unitary is noise-free. This method is\nrigorously supported by the following theorem, whose formal\nstatement and proof are deferred to Appendix C.\nTheorem 1 (Single-qubit QSP governs the error, informal)\nLet EQSP be the experimental simulation error of a single-\nqubit QSP circuit. Then the simulation error of its multi-qubit\nextension EQSP-EXT with noise-free signal unitary satisfies\nEQSP-EXT = O(EQSP).\nIn other words, when the signal unitary encoding the quan-\ntum data is noise-free, single-qubit experiments are sufficient\nto verify the performance of complex QSP-based algorithms.\nOn the other hand, if the signal unitary is noisy, these exper-\niments still provide a necessary condition for the successful\nimplementation of these algorithms: if the single-qubit exper-\niment fails, the multi-qubit extension will also fail.\nIn the rest of this paper, we will demonstrate the feasibility\nof our proposed method. Regarding the construction, QSP\nhas various conventions depending on the choice of signal\nprocessing unitaries and the signal unitary [14, 27, 45–47].\nHere we consider implementing trigonometric QSP, a variant\nnoted for its good polynomial expressiveness using a single\nqubit [27]. The circuit is given as\nW(x) = A(θ0, ϕ0)\nL\nY\nj=1\nRz(x)A(θj, ϕj)\n(1)\nfor A(θ, ϕ) = Ry(θ)Rz(ϕ). As shown in Fig. 1, each sig-\nnal processing unitary A(θj, ϕj) has been translated into a pa-\nrameterized microwave sequence. Additionally, we encode\nthe function variable x into a Rz(x) gate within each signal\nprocessing block using a data re-uploading process. The ac-\ncuracy parameters in the signal processing unit can be trained\nusing classical optimization methods such as gradient descend\nor quasi-Newton formula.\nIII.\nEXPERIMENTAL SYSTEM AND RESULTS\nWe accomplish the deep QSP circuits experimentally with\na trapped 43Ca+ ion in a linear Paul trap. The 43Ca+ ion pos-\nsesses an electronic spin-1/2 and a nuclear spin-7/2, exhibiting\n-π\n0\nπ -π\n-π\n0\n0\nπ\nπ\nFunction value\nLayer=15\nLayer=180\nLayer=360\nIndependent variable \n0\n1\n-1\n0\n1\n-1\nSTEP function\nSELU function\nReLU function\n0\n1\n-1\nFig 2. Experimental results for simulating STEP, SELU, and ReLU\nfunctions with the layers set as L = 15, 180, and 360. The hori-\nzontal axis is the input signal ranging from −π to π, and the vertical\naxis represents function values. The solid lines represent the classical\nsimulation results, and the data points are obtained from experimen-\ntal observation. Each data point is the average value of 105 trials,\nwith error bars representing the associated standard deviation.\nrich level structure. The ground-state hyperfine levels of the\n43Ca+ ion own a smaller inherent magnetic moment, render-\ning them less sensitive to magnetic field fluctuations in the\nenvironment [48–52]. This results in longer coherence time,\nwhich is beneficial to enhance the performance of quantum\nsimulator. Prior to experimental operations, we have accom-\nplished Doppler cooling and resolved sideband cooling for\nthe ion, yielding the final average phonon number ¯n < 0.1\nalong the axial direction with the Lamb-Dicke parameter η ∼\n0.1. Together with the optical pumping, the system is initially\nprepared in |0⟩. Then we carry out the unitary rotations be-\ntween the two encoded levels and implement projective mea-\nsurement by electron shelving technique. More details are de-\nferred to Appendix D.\nFor our purpose, the light-matter interaction is given by the\nHamiltonian in units of ℏ= 1,\nH = 1\n2Ω(t)eiφ(t)|e⟩⟨g| + H.C.,\n(2)\nwhich can be achieved in the 43Ca+ ion by microwave irradi-\nation under carrier transitions. Ω(t) and φ(t) are time depen-\ndent, representing the driving amplitude (i.e., Rabi frequency)\nand the phase of the microwave, respectively. The single-qubit\nrotation gates Ry(θ) and Rz(ϕ) required by Eq. (1) can be ex-\necuted using Eq. (2) by elaborately controlling Ω(t) and φ(t).\nTo illustrate the experimental capabilities of QSP, we exem-\nplify three representative functions, i.e., the STEP, SELU and\nReLU for implementation. These functions hold significant\nimportance in the realms of quantum algorithms and machine\nlearning. For example, simulating the STEP function enables\n\n\n4\nbinary classification of input quantum data, to achieve com-\nplexity improvements on the quantum phase estimation prob-\nlem [15, 20, 21]. From the machine learning perspective, the\nthree activation functions, i.e., STEP, SELU, and ReLU, en-\nable neural network models to become powerful function ap-\nproximators [53] that can satisfy the universal approximation\ntheorem [54].\nTo distinguish between inherent algorithmic limitations and\nhardware-induced errors, we also perform classical simula-\ntions of noise-free QSP circuits as a comparison to the exper-\nimental observation. For clarity, we refer to the experimental\nimplementation as ‘quantum simulation’. Figure 2 illustrates\nthe behavior of quantum simulation for three representative\nlayers with respect to the classical simulation, as below.\nL=15: Both classical and quantum simulations show lim-\nited accuracy, merely approximating the general shape of the\nfunction. The observed oscillations in function values result\nfrom an insufficient Fourier series expansion, indicating the\nneed for increasing the layer count in order to improve the\nsimulation fidelity.\nL=180: Simulation accuracy improves significantly with\nthe increase of the layer count, reaching optimal performance\nat this configuration. However, this improvement comes at the\ncost of additional computational resources, with each layer re-\nquiring seven extra microwave pulses [55].\nL=360: While classical simulations continue to improve in\naccuracy with additional layers, performance of the quantum\nsimulation shows a marked decline. Notably, the accuracy of\nthe quantum simulation at this setup regresses to levels com-\nparable to those observed when L ranges from 30 to 90.\nIV.\nERROR ANALYSIS\nThe experimental results reveal an intriguing relationship\nbetween the experimental deviation and the circuit depth. To\nexplore the impact of noise factors, we assess the accuracy of\nsimulations using the mean square errors (MSEs) with respect\nto the ideal function, where MSEs is defined as below.\nMSEs =\nN\nX\nn=1\n|WL(xn) −f(xn)|2/N.\n(3)\nHere WL(xn) and f(xn) are, respectively, the results of mea-\nsurement (or calculation) and the ideal function. By summing\nthe errors over N variables and taking their average, the MSEs\nfor L layers can be determined. In contrast, we treat the ex-\nperimental statistical errors as the standard deviation, which\nreflects how much the measurement values spread out from\nthe average. The standard deviation is acquired by measur-\ning the same quantity repeatedly, and labeled as error bars. In\nFigure 3, we evaluate quantum simulation by sampling input\nsignals across ten different QSP circuit layer configurations.\nThe theoretical MSEs serve as a benchmark for achievable\nprecision, revealing an intriguing relationship between exper-\nimental MSEs and circuit depth. When the circuit is shal-\nlow, simulation accuracy is relatively low. However, since\n0\n50\n100\n150\n200\n250\n300\n350\n400\nLayers\nlg(MSEs)\n-3.0\n-2.0\n-1.0\n-4.0\n-3.0\n-2.0\n-1.0\n-4.0\nExperiment MSE\nTheoretical MSE\nSTEP\n-3.0\n-2.0\n-1.0\n-4.0\nExperiment MSE\nTheoretical MSE\nSELU\nExperiment MSE\nTheoretical MSE\nReLU\nFig 3. Mean square errors (MSEs) on the logarithmic scale calcu-\nlated from the results of theoretical computation and experimental\nobservation of the QSP circuits relative to ideal function values, with\nlayer counts ranging from 15 to 360. Theoretical MSEs are esti-\nmated by extensive sampling of classically simulated QSP circuits,\nwhile quantum simulation MSEs are based on a limited number of\nexperimental data points for efficiency.\nthe quantum device maintains strong coherence and the ac-\ncumulated errors from quantum state manipulation are min-\nimal, the MSEs from both simulations are very close. With\nthe number of layers starting to increase, the experimental\nMSEs rapidly decrease towards zero, aligning with theoretical\nMSEs. This phenomenon can be well explained by the Fourier\nconvergence theorem [56]. Beyond 180 layers, however, the\nexperimental MSEs begin to increase, deviating from the ex-\npected trend and reaching the minimum simulation error. This\ndecline stems from two primary sources, i.e., the operational\nerrors caused by imprecise implementation, and the dephas-\ning errors due to time-dependent decoherence. These factors\ncreate a trade-off between QSP circuit layers and simulation\naccuracy.\nTo further understand this trade-off, we classically simulate\ntwo error models based on operational and dephasing errors\nin the QSP circuits, tested by varying angle error rates and co-\nherence error rates. By comparing the performance of these\nclassically-simulated noisy QSP circuits with noise-free ones,\nwe observe that (1) operational error is the primary source\nof error in the case of shallow depth, but its impact dimin-\nishes to become exponentially insignificant as depth increases\nto 200; (2) dephasing error is negligible in the shallow depth\ncase but becomes exponentially significant as depth increases.\nThese observation contributes to the kinks presented in Fig-\nure 3. More discussions on these two error models are detailed\nin Appendix C.\nThese phenomena can be explained by the nature of QSP\ncircuits. In a QSP circuit, the n-th signal processing unitary\ngoverns the coefficient of the n-th term. Since our QSP cir-\n\n\n5\ncuits simulate polynomial expansions, the coefficients of the\ninitial terms dominate the function value when the circuit is\nshallow. In this case, the operational error, affecting the sig-\nnal processing unitary and thus the coefficients of expansion\nterms, is the main source of error. With the increase of the\nlayer count, the significance of the affected coefficients de-\ncreases exponentially, so does the error itself. In contrast, de-\nphasing error becomes predominant. The exponential increase\nin dephasing error occurs as it attempts to evolve the target\nstate to the mixed state with reduced coherence [55], counter-\nacting the exponential decay process achieved by increasing\nlayers, thus increasing the MSEs exponentially. Therefore, we\nconsider that the two distinct noise factors exhibit contrasting\nbehaviors as circuit depth increases, indicating a trade-off to\ncarefully balance the circuit depth against the system’s deco-\nherence time. Such considerations will be crucial for future\nimplementations of QSP-based algorithms and quantum neu-\nral networks.\nV.\nCONCLUDING REMARKS\nIn summary, we have proposed a method for implementing\nQSP-based algorithms in an ion-trap system, for which we\njustified that using a single-qubit one can acquire the lower\nbound of simulation error for complex QSP-based algorithms.\nThen we have experimentally carried out high-precision QSP\ncircuits in a trapped 43Ca+ ion. Utilizing quantum circuits\nwith depths of up to 360 layers, we have executed three\ncomplex functions with singularities, confirming the poten-\ntial of implementing complex QSP-based algorithms in quan-\ntum hardware. In particular, simulating the STEP function\nin QSVT helps unify and improve the solution of quantum\nestimation problems, while simulating activation functions,\nsuch as the STEP, ReLU, and SELU functions, forms a funda-\nmental component for large-scale QNNs to achieve universal\napproximation. Hence, our experimental implementation of\nhigh-accuracy QSP of these functions establishes the ground-\nwork and highlights the potential for further experimental re-\nalization of QSVT algorithms and QNNs in a trapped-ion\nquantum simulator.\nThe QSP can be extended to multi-qubit systems that en-\ncodes quantum data [57, 58] instead of a scalar.\nThis ex-\ntension allows QSP to perform function transformations on\nthe encoded data, thereby serving as a ground component in\nthe design of new quantum algorithms and circuit architec-\ntures. However, the performance of such deep extensions on\nreal quantum devices remains unexplored. With current tech-\nnologies, verifying a QSP-based algorithm with signal uni-\ntaries extended to hundreds of qubits seems prohibitively ex-\npensive. Nevertheless, the evaluation method and experiment\nanalysis presented in this work can serve as reliable refer-\nences for high-precision QSVT and data re-uploading QNN\nimplementations, paving the way for practical applications in\nvarious domains. With further improving experimental condi-\ntions, this applications are anticipated to be constructed using\ndeeper circuits, and hence can be leveraged to tackle challeng-\ning tasks in quantum simulation, quantum linear algebra, and\nquantum machine learning in the future.\nACKNOWLEDGEMENTS\nThis work was supported by National Natural Sci-\nence Foundation of China under Grant Nos.\n12304315,\nU21A20434, 92265107, 12074346, 12074390, by China\nPostdoctoral\nScience\nFoundation\nunder\nGrant\nNos.\n2022M710881,\n2023T160144,\nby\nGuangdong\nProvin-\ncial Quantum Science Strategic Initiative under Grant No.\nGDZX2305004, by Key Lab of Guangzhou for Quantum\nPrecision Measurement under Grant No.\n202201000010,\nby Science and Technology Projects in Guangzhou un-\nder Grant Nos.\n202201011727 and 2023A04J0050, and\nby Nansha Senior Leading Talent Team Project under\nGrant No.\n2021CXTD02.\nX. W. was partially sup-\nported by the National Key R&D Program of China (Grant\nNo. 2024YFE0102500), the National Natural Science Foun-\ndation of China (Grant.\nNo. 12447107), the Guangdong\nProvincial Quantum Science Strategic Initiative (Grant\nNo.\nGDZX2403008,\nGDZX2403001),\nthe\nGuangdong\nProvincial Key Lab of Integrated Communication, Sensing\nand Computation for Ubiquitous Internet of Things (Grant\nNo. 2023B1212010007), the Quantum Science Center of\nGuangdong-Hong Kong-Macao Greater Bay Area, and the\nEducation Bureau of Guangzhou Municipality.\nAppendix A: Supplementary experimental data\nIn this section, we present additional experimental results\nnot included in the main text, which help further understand\nthe performance of QSP circuits.\nLayer=30\nLayer=60\nLayer=120\nLayer=240\nLayer=300\nLayer=330\nFunction value\n-π\n0\nπ\n-π\n-π\n0\n0\nπ\nπ\n-π\n-π\n-π\nπ\nπ\nπ\n0\n0\n0\n0\n0\n1\n1\n-1\n-1\nIndependent variable x\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\nFig 4. Experimental results for the STEP function. (a)-(f) Simulation\nresults for L=30, L=60, L=120, L=240, L=300, L=330, respectively.\n\n\n6\nLayer=30\nLayer=60\nLayer=120\nLayer=240\nLayer=300\nLayer=330\nFunction value\n0\nπ\n-π\n-π\n0\n0\nπ\nπ\n-π\n-π\n-π\nπ\nπ\nπ\n0\n0\n0\n0\n0\n1\n1\n-1\n-1\nIndependent variable x\n-π\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\nFig 5. Experimental results for the SELU function. (a)-(f) Simulation\nresults for L=30, L=60, L=120, L=240, L=300, L=330, respectively.\nLayer=30\nLayer=60\nLayer=120\nLayer=240\nLayer=300\nLayer=330\nFunction value\n-π\n0\nπ\n-π\n-π\n0\n0\nπ\nπ\n-π\n-π\n-π\nπ\nπ\nπ\n0\n0\n0\n0\n0\n1\n1\n-1\n-1\nIndependent variable x\n(a)\n(b)\n(c)\n(d)\n(e)\n(f)\nFig 6. Experimental results for the ReLU function. (a)-(f) Simulation\nresults for L=30, L=60, L=120, L=240, L=300, L=330, respectively.\nAppendix B: Review of Trigonometric QSP\nOur work is based on one QSP variant known as trigono-\nmetric QSP [27], which distinguishes itself by its capability\nto realize general polynomial transformations using a single\nqubit, without resorting to other techniques such as the linear\ncombinations of unitaries (LCU) [59]. Construction of this\nQSP circuit involves a sequence of signal processing unitaries\nA (θj, ϕj) = Ry(θj)Rz(ϕj) interleaved with a signal unitary\nRz(x), given as\nW(x) = Rz(ω)A(θ0, ϕ0)\nL\nY\nj=1\nRz(x)A(θj, ϕj),\n(B.1)\nwhere L is the degree of function approximation, and Rz(ω)\nappearing at the end of QSP circuit is often omitted in practi-\ncal implementation. The following Lemma characterizes the\npower of trigonometric QSP.\nLemma 2 (Lemma 3 in [27]) There exist ω ∈R, θ ∈RL+1\nand ϕ ∈RL+1 such that\nWω,θ,ϕ(x) =\n\u0014\nP(x)\n−Q(x)\nQ∗(x) P ∗(x)\n\u0015\n,\n(B.2)\nif and only if Laurent polynomials P, Q ∈C\n\u0002\neix/2, e−ix/2\u0003\nsatisfy the following conditions,\n1. deg(P), deg(Q) ≤L,\n2. P and Q have parity L mod 2,\n3. ∀x ∈R, |P(x)|2 + |Q(x)|2 = 1.\nThe parity condition, as delineated in Condition 2 and char-\nacterized by binary values of 0 and 1, imposes a restriction on\nthe allowable range of polynomial transformations for QSP\ncircuits. Generally, for a Laurent polynomial P belonging\nto the space C\n\u0002\nz, z−1\u0003\n, the parity is defined as 0 when all\nthe coefficients corresponding to the odd powers of z are nul-\nlified, and the parity is identified as 1 when all coefficients\nassociated with even powers of z are nullified. This parity\nconstraint is a commonality across various established QSP\nconventions, necessitating the use of the LCU technique when\nseeking to implement generic polynomial transformations in\nQSP-based algorithms. In contrast, trigonometric QSP can\ncircumvent the parity constraint.\nThis is achieved by re-\nstricting the scope of expressivity from C\n\u0002\neix/2, e−ix/2\u0003\nto a\nsmaller field C\n\u0002\neix, e−ix\u0003\n, i.e., the set of trigonometric poly-\nnomials. Note that the definition of the degree function in\nC\n\u0002\neix, e−ix\u0003\ndiffers from that in C\n\u0002\neix/2, e−ix/2\u0003\n. The im-\nplication of this restriction is summarized in the subsequent\nstatement.\nLemma 3 (Lemma 4 in [20])\nSuppose F ∈C\n\u0002\neix, e−ix\u0003\nis normalized and real-valued with degree L. There exists\nP, Q ∈C\n\u0002\neix/2, e−ix/2\u0003\nsuch that |P(x)|2 −|Q(x)|2 =\nF(x).\nFurthermore, there exist ω ∈R, θ ∈RL+1 and\nϕ ∈RL+1 such that |ψ(x)⟩= Wω,θ,ϕ(x)|0⟩satisfies\n⟨ψ(x)|Z|ψ(x)⟩= F(x).\n(B.3)\nUsing the fact that trigonometric polynomials can approx-\nimate square-integrable functions through Fourier expansion,\none can eventually confirm the universal approximation prop-\nerties of trigonometric QSP. When the polynomial transfor-\nmation is known, we shorthand the trigonometric QSP circuit\nas W(x) for convenience of discussion.\nTheorem 4 (Theorem 4 in [27]) For any univariate square-\nintegrable function f : [−π, π] →[−1, 1] and for all ε >\n0, there exists a trigonometric QSP circuit W(x) such that\n|ψ(x)⟩= W(x)|0⟩satisfies\n∥⟨ψ(x)|Z|ψ(x)⟩−f(x)∥≤ε.\n(B.4)\nIt is worth noting that when f can be expressed by a conver-\ngent Fourier series, the precision will increase exponentially\nas the depth of W(x) increases. This theory is supported by\nthe experiments conducted in our work.\n\n\n7\nThe limits of trigonometric QSP could be representative of\nall types of single-qubit QSP experiments. QSP conventions\ncan be classified into two classes: Chebyshev-based conven-\ntions [13, 14] that simulate polynomials and Fourier-based\nconventions [27, 45, 46] that simulate trigonometric polyno-\nmials. Trigonometric QSP, as a Fourier-based convention, can\nexpress all trigonometric polynomials using a single-qubit,\nand can be converted to other QSP conventions as shown be-\nlow\nC\n\u0002\neix/2, e−ix/2\u0003\n=⇒\nR\n\u0002\neix/2, e−ix/2\u0003\n⇐⇒\nC[x]\ntrigonometric QSP\nlet ω,ϕj=0\n−−−−−−→\nQSP in Ref. [45, 46]\nadd H on both sides\n←−−−−−−−−−→\nQSP in Ref. [13, 14]\n(B.5)\nThe details of these conversions are deferred to previous\nworks [15, 27].\n1.\nQSP circuits for STEP, SELU and ReLU\nThis section illustrates how to construct the trigonometric\nQSP circuits for STEP, SELU and ReLU functions. First, we\nprovide the definitions of these three functions.\nNote that\nSELU and ReLU are normalized so that their range is re-\nstricted to [−1, 1].\nDefinition 1 For x ∈[−π, π], the STEP, SELU [60] and\nReLU [61] functions are defined as\nSTEP(x) =\n(\n1, x ≥0;\n−1, x < 0.\n(B.6)\nSELU(x) = 1\nπ\n(\nx, x ≥0;\nα (ex −1) , x < 0.\n(B.7)\nReLU(x) = 1\nπ\n(\nx, x ≥0;\n0, x < 0.\n(B.8)\nwhere α = 1.6733 for the SELU function.\nThe QSP circuits were computed using Paddle Quan-\ntum [62].\nSince SELU and ReLU are continuous within\nthe interval (−π, π), these functions can be directly approx-\nimated through truncated Fourier expansion. For each func-\ntion, the built-in function laurent_generator is utilized to de-\ntermine its approximated trigonometric polynomials F. Sub-\nsequently, the corresponding QSP circuit in Lemma 3 is con-\nstructed by employing the built-in functions pair_generation\nand qpp_angle_approximator. The simulation of STEP is\nmore complicated due to its jump discontinuity at x = 0,\nwhich exacerbates the so-called Gibbs phenomenon [63]: the\ntruncated Fourier expansion will exhibit heavy oscillations\nnear the jump discontinuity. To mitigate this issue, it is ob-\nserved that the STEP function can be expressed as the limit of\na continuous function,\nSTEP(x) = 2\nπ lim\nN→∞arctan (Nx) .\n(B.9)\nTherefore, the STEP function can be approximated by simu-\nlating 2\nπ arctan (Nx) for sufficiently large N (which is cho-\nsen to be 100 in this work).\n2.\nMulti-qubit extension\nLet f : [−π, π] →[−1, 1] be a square-integrable function.\nWe can extend the domain of f to the unitary group by apply-\ning f on the eigenphases of these unitaries. Such extension is\ndefined as follows:\nDefinition 2 (Eigenphase transformation)\nLet U be a\nunitary\noperator\nwith\nspectral\ndecomposition\nU\n=\nP\nj eiτj|χj⟩⟨χj|. The eigenphase transformation of U under\nf, denoted as f(U), is defined as\nf(U) =\nX\nj\nf(τj)|χj⟩⟨χj|.\n(B.10)\nWhen f(x) = P\nj cjeijx is a trigonometric polynomial,\nf(U) = P\nj cjU j is simply a polynomial of U. This is where\nquantum phase processing (QPP) [20] comes into play. QPP\nfurther develops the trigonometric QSP by extending the in-\nput scalar signal to 2n eigenphases of n-qubit unitary. By\nusing an ancilla qubit as the control register, QPP queries the\ncontrolled input signal unitary to perform polynomial trans-\nformations on its eigenphases. The QPP circuit for simulating\ndegree-L trigonometric function F is constructed as\nVω,θ,ϕ(U) := Rz(ω)auxA (θ0, ϕ0)aux\n\" L\nY\nl=1\n\u0014\nU †\n0\n0\nI⊗n\n\u0015\nA (θ2l−1, ϕ2l−1)aux\n\u0014\nI⊗n 0\n0\nU\n\u0015\nA (θ2l, ϕ2l)aux\n#\n,\n(B.11)\nwhere A (θj, ϕj)aux is applied on the ancilla qubit. We short-\nhand the QPP circuit as V (U) for simplification. One can\n\n\n8\nshow that QPP circuit essentially performs polynomial trans-\nformations on the eigenspaces of input unitary. Lemma 2 in\nRef. [20] shows that\nV (U) =\n\u0014\nP(U)\n−Q(U)\nQ∗(U) P ∗(U)\n\u0015\n,\n(B.12)\nwhere P, U are Laurent polynomials given in Lemma 3.\nAppendix C: Detailed Error Analysis\nThe simulation error of QSP circuits for a target function f\ncan be decomposed into three components:\n- polynomial approximation error arises when f is not a poly-\nnomial, requiring approximation by a truncated Fourier ex-\npansion P. The approximation error decrease exponentially\nwith the degree of expansion.\n- angle computational error is introduced during the deter-\nmination of the angle sequence in QSP circuits. The angle\ncomputation error is independent of the circuit depth, and can\nbe reduced to the level of machine precision based on existing\ntechniques [20, 46, 64].\n- dephasing error is a type of hardware error specific to ion-\ntrap devices. As the time increases, it becomes increasingly\nhard for devices to maintain the coherence of the qubit system,\nleading to more pronounced dephasing errors.\nIn this section, we analyze the relation between the degree\nof simulation (i.e., the QSP circuit depth), and polynomial ap-\nproximation error and hardware error. Before the analysis, we\ndefine the simulation error and its practical approximation.\nDefinition 3 (Simulation error of single-qubit QSP) Let\nf : [−π, π] →[−1, 1] be a square-integrable function and\nˆf(x) be its approximation implemented by a QSP circuit on\nan ion-trap device.\nThe simulation error is defined as the\nsquared L2-distance between f and ˆf within [−π, π],\nEQSP := ∥f −ˆf∥2 =\nZ π\n−π\n|f(x) −ˆf(x)|2 dx.\n(C.1)\nEQSP depends on the choice of f and the QSP circuit, and\ncan be approximated by sampling an ordered set of distinct\npoints X = {xj}N\nj=1 and computing the mean square error,\nMSEX = 1\nN\nN−1\nX\nj=0\n|f(xj) −ˆf(xj)|2.\n(C.2)\nNote that as N →∞and xj+1 −xj ≈2π/N,\nMSEX = lim\nN→∞\n1\n2π\nN−1\nX\nj=0\n|f(xj) −ˆf(xj)|2(xj+1 −xj)\n= 1\n2π EQSP\n.\n(C.3)\nTherefore EQSP can be well approximated when X is closely\nuniformly sampled, in which case we denote MSEN\n=\nMSEX for convenience.\n1.\nSimulation error of multi-qubit extension\nFor any QPP circuit V (U) in Equation (B.12),\nV (U)(|0aux⟩⊗I) = |0aux⟩⊗P(U)+|1aux⟩⊗Q∗(U). (C.4)\nTo get the eigenphase transformation under a trigonomet-\nric polynomial F, one needs to construct V (U) to simulate\np\n(1 + F(x)) /2, so that\nTraux\n\u0002\nZaux · V (U) (|0aux⟩⟨0aux| ⊗I) V (U)†\u0003\n= F(U).\n(C.5)\nSimilarly, one can define the simulation error of the multi-\nqubit extension.\nDefinition 4 (Simulation error of multi-qubit QSP) Let f :\n[−π, π] →[−1, 1] be a square-integrable function and ˆf(x)\nbe its approximation implemented by a QSP circuit on an ion-\ntrap device. Then the simulation error of the multi-qubit ex-\ntension of this QSP circuit is defined as the maximum perfor-\nmance discrepancy after applying to a quantum state,\nEQSP-EXT = max\nU\n\u001a\n⟨ψ|\n\u0010\nf(U) −ˆf(U)\n\u0011 \u0010\nf(U) −ˆf(U)\n\u0011†\n|ψ⟩: |ψ⟩is a quantum state\n\u001b\n.\n(C.6)\nIn Equation (C.6), the error factors introduced by imple-\nmenting U or its controlled version are not considered, since\nthese factors are dependent on U and |ψ⟩, and we only fo-\ncus on the fundamental limitation of function simulation. In\n\n\n9\nthe following theorem, we show that the simulation error of\nthe quantum eigenphase transformations under f (see Defi-\nnition 2) is equivalent to the simulation error of single-qubit\nQSP circuits.\nTheorem 1 (Single-qubit QSP governs the error, formal)\nLet W(x) be a QSP circuit that approximates a square-\nintegrable function f : [−π, π] →[−1, 1]. Denote V (U)\nas its multi-qubit extension that simulates the eigenphase\ntransformation. Then the simulation error of the multi-qubit\nextension is bounded as\n1\n2π EQSP ≤EQSP-EXT ≤EQSP.\n(C.7)\nProof Denote ˆf for any n-qubit unitary with spectral decom-\nposition U = P\nj eiτj|χj⟩⟨χj|,\nmax\n|ψ⟩⟨ψ|\n\u0010\nf(U) −ˆf(U)\n\u0011 \u0010\nf(U) −ˆf(U)\n\u0011†\n|ψ⟩\n(C.8)\n= max\n|ψ⟩\nX\nj\n|f(τj) −ˆf(τj)|2 · |⟨ψ|χj⟩|2\n(C.9)\n= max\nj |f(τj) −ˆf(τj)|2 ≤\nmax\nx∈[−π,π]|f(x) −ˆf(x)|2\n(C.10)\n= ∥f −ˆf∥2\n∞≤∥f −ˆf∥2 = EQSP.\n(C.11)\nSince U is arbitrary, we have EQSP-EXT ≤EQSP. For the\nfirst inequality, let x′ = argmax\nx\n|f(x) −ˆf(x)| and choose\nunitary U ′ = eixI so that\nmax\n|ψ⟩⟨ψ|\n\u0010\nf(U ′) −ˆf(U ′)\n\u0011 \u0010\nf(U ′) −ˆf(U ′)\n\u0011†\n|ψ⟩\n(C.12)\n= |f(x′) −ˆf(x′)|2 = ∥f −ˆf∥2\n∞\n(C.13)\n≥1\n2π ∥f −ˆf∥2 = 1\n2π EQSP.\n(C.14)\nBy definition EQSP-EXT ≥\n1\n2πEQSP.\n■\nTheorem 1 and Equation (C.3) together suggest that the\nlower bound of the simulation error for a QSP multi-qubit\nextension can be estimated by experimentally computing the\nmean square error of its single-qubit version.\nCorollary 6 Let V (U) be the multi-qubit extension of a QSP\ncircuit. Denote MSEN as the mean square error of the QSP\ncircuit obtained by closely uniformly sampling N points in the\ninterval [−π, π]. Then\nlim\nN→∞MSEN ≤EQSP-EXT.\n(C.15)\nTheorem 1 is also applicable to other QSP conventions.\nSpecifically, the singular value transformation of normal ma-\ntrices is defined as\nf (SV)(A) =\nX\nj\nf(ξj)| ˜ψj⟩⟨ψj|\n(C.16)\nfor singular value decomposition A = P\nj ξj| ˜ψj⟩⟨ψj|. [55].\nBy employing a similar proof to Theorem 1 and using the\nQSP conversion discussed earlier, QSP circuits that simulate\nChebyshev polynomials can similarly bound the simulation\nerror of their multi-qubit extensions, such as the framework\nof quantum singular value transformation [14].\nIn essence, the performance of the multi-qubit extension is\nfundamentally constrained by the efficacy of the single-qubit\nQSP circuit, even if one can implement U without introducing\nadditional noise factors. Consequently, for our objective of\ninvestigating the experimental limitations of function simula-\ntion, it is sufficient to focus on single-qubit QSP circuits in our\nexperiments. The rationale is clear: if the single-qubit QSP\ncircuit does not demonstrate good performance, then neither\ndoes its multi-qubit extension. Therefore, the single-qubit im-\nplementation serves as a reliable benchmark for assessing the\noverall capabilities of implementing QSP-based algorithms.\n2.\nHardware error\nIn addition to the errors arising during the design of QSP\ncircuits, executing these circuits on trapped-ion devices also\nresults in errors due to the imperfections of the hardware,\nwhich are classified as hardware errors. In quantum simu-\nlations, our primary concerns are the errors arising from inac-\ncuracies in experimental operations and decoherence effects.\nIn our experiment, we achieve various degrees of quantum\nstate rotation by controlling the duration of microwave pulses.\nWhen the quantum simulator’s control over the rotation angles\nlacks precision, simulation errors accumulate with increasing\ncircuit depth, preventing the simulation accuracy from reach-\ning the prediction by theoretical MSEs. We attribute such er-\nrors to the operational imperfection of the quantum simulator,\nwhich highlights the importance of analyzing the tolerance of\nQSP circuits to such errors. We define the operational error as\nErr = 1 −{ϕ, θ, x}j′/{ϕ, θ, x}j, where {ϕ, θ, x}j represents\nthe ideal parameter, and {ϕ, θ, x}j′ denotes the experimen-\ntal parameter. Figure 7a illustrates the variation of theoretical\nMSEs under different levels of control error. We find that even\nwhen the discrepancy between the actual and theoretical rota-\ntion angles as large as 0.1, the impact on the final simulation\naccuracy remains minimal. The fidelity of a single microwave\nπ pulse in our experiment exceeds 0.999, corresponding to\nErr<0.001. Therefore, operational errors in the experiment\nhave a negligible effect on the final simulation accuracy.\nTo\nanalyze\nthe\nimpact\nof\ndecoherence\non\nsimula-\ntion accuracy, we mofidy the single qubit rotation gates\nRy(θj), Rz(ϕj), Rz(x) in the QSP circuit. Additionally, to\nstudy the changes in coherence during the execution of the\nQSP circuit, we employ the master equation to observe the\nevolution of the quantum system. We define the states |0⟩=\n|g⟩=\n\u0012\n0\n1\n\u0013\nand |1⟩= |e⟩=\n\u0012\n1\n0\n\u0013\n, with the system initially\nprepared in the state |g⟩, the density matrix at the initial mo-\nment is ρ0 = |g⟩⟨g|.\nDuring the evolution, we introduce\na decoherence term,\nD\n2 (2|e⟩⟨e|ρ|e⟩⟨e| −|e⟩⟨e|ρ −ρ|e⟩⟨e|),\n\n\n10\n-6.5\n-6\n-5.5\n-5\n-4.5\nErr=0.05\n-4.5\n-4\n-3.5\n-3\n-3\n-2.5\n-2\n0\n50\n100\n150\n200\n250\n300\n350\n400\nLayers\nErr=0.1\nErr=0.15\nlg(ΔMSEs)\n(a)\n-8\n-7.5\n-7\n-6.5\nDephasing=0.5\n-7\n-6.5\n-6\n-5.5\n-7\n-6\n-5\n0\n50\n100\n150\n200\n250\n300\n350\n400\nLayers\nlg(ΔMSEs)\nDephasing=1.0\nDephasing=2.0\n(b)\nFig 7. Six panels presenting the MSEs for nine different QSP circuit\ndepths. (a) The impact of operational error on the theoretical MSEs\nfor the STEP function. The three panels illustrate the variation in\nMSEs when the operational error is set to 0.05, 0.1 and 0.15 respec-\ntively. (b) The impact of dephasing on the theoretical MSEs for the\nSTEP function. The three panels illustrate the variation in MSEs\nwhen the dephasing rates are set to 0.5D, D and 2D respectively.\ninto Eq. (1) to modify W(x). The decoherence rate D ≈\n2.25 × 10−4Ωcan be obtained from the experimentally mea-\nsured Ramsey fringes, where the microwave Rabi strength\nΩ≈2π × 35 kHz. Figure 7b shows the MSEs of the STEP\nfunction calculated at different decoherence rates.\nWe define the coherence of the system as the sum of the\nmagnitudes of the off-diagonal elements of the density ma-\ntrix. However, after executing the j-th QSP circuits, the sys-\ntem is not necessarily in a maximally superposed state. In\nour numerical simulations, we allow the system to evolve\nfreely for one Rabi period after the j-th circuit. When the\noff-diagonal elements reach their maximum during this pe-\nriod, we regard the coherence of this quantum system as\nCj(ρ) = P\nm̸=n |ρm,n|.\nAs shown in Figure 8, we have calculated the variation in\ncoherence for Layer=360 of the STEP function as the sys-\ntem evolves. We find that the dephasing occurs more slowly\nduring the execution of the QSP circuit than during the free\nevolution of the system in a noisy environment. This slower\ndecoherence heps ensure the simulation results remain robust,\neven when the circuit duration exceeds the system’s coherence\ntime.\n0\n50\n100\n150\n200\n250\n300\n350\n400\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\nLayer=360\nj \nCoherence\nDuration (ms) \n8\n16\n24\n32\n40\n48\n56\n64\nFig 8. Coherence evolution for Layer=360 of the STEP function. The\nred and blue curves depict the coherence changes under the operation\nof the QSP circuits and without any operation, respectively. The hor-\nizontal axis j represents the number of applied sets of {ϕ, θ, x}, and\nthe uppermost axis indicates the duration to reach the j-th circuit,\nand the vertical axis indicates the coherence magnitude. Each curve\nconsists of 360 data points.\n3.\nDephasing error for a deep QSP circuit\nIn Figure 7b, why would the dephasing error exponen-\ntially deteriorate the simulation precision as the layer depth\ndecreases? One can consider a greatly simplified theoretical\nmodel of simulating a QSP circuit, by making the following\nassumption:\n(1) n is a large number and the first n layers of the QSP circuit\nis noise-less. At this stage, the state passing the first n layers\ncan be expressed as\nρn =\n\u0014\n|Pn|2\n−PnQ∗\nn\n−P ∗\nnQn\n|Qn|2\n\u0015\n,\n(C.17)\nwhere Pn, Qn are Laurent polynomials represented by the\nQSP circuit with first L layers. The hardware noise occurs\nright after the n-th layer of the QSP circuit. Further, this noise\nis described by a completely dephasing noise channel D, i.e.,\nall off-diagonal entries would be removed.\nThe state passing the first (n + 1) layers is\nρn+1(θ, ϕ)\n= D\n\u0000A(θ, ϕ) · D(ρn) · A(θ, ϕ)†\u0001\n= D\n\u0012\nRy(θ)Rz(ϕ)\n\u0014\n|Pn|2\n0\n0\n|Qn|2\n\u0015\nR†\nz(ϕ)R†\ny(θ)\n\u0013\n=\n\u0002\ncos2(θ/2)|Pn|2 + sin2(θ/2)|Qn|2\u0003\n|0⟩⟨0|+\n\u0002\nsin2(θ/2)|Pn|2 + cos2(θ/2)|Qn|2\u0003\n|1⟩⟨1|.\n(C.18)\n\n\n11\nSince n is large, the (n + 1)-th term of the Fourier expansion\nof the target polynomial is small and so are θ and ϕ. There-\nfore, ρn+1(θ, ϕ) evolves towards the completely mixed state\nand hence deteriorates the simulation result. Further, since\nthe effect is cumulative, the rate of such evolution increases\nexponentially as the layer increases.\n4.\nApplication: quantum phase estimation\nWe demonstrate how a single-qubit QSP experiment can\nguide the development of QSP-based algorithms to address\npractical problems. As an example, we examine the problem\nof quantum phase estimation (QPE). In this task, given a uni-\ntary operator U and an eigenstate |χ⟩, the goal is to estimate\nits eigenphase τ ∈[0, 2π) such that U|χ⟩= eiτ|χ⟩. The QPE\napproach, as discussed in [15, 20], employs a binary search\nstrategy. By simulating the STEP function on the unitary op-\nerator, one can measure the ancilla qubit in the extended QSP\nsetup to recursively classify the eigenphases, leading to the\nfollowing result.\nTheorem 7 (Theorem 8 in [20])\nGiven a unitary U and\nan eigenstate |χ⟩of U with eigenvalue eiτ, there exists\na QSP-based algorithm that executes O( 1\nδ Lε,δ) queries to\ncontrolled-U and its inverse to obtain an estimation of τ up\nto δ precision with probability at least 1 −ε. Here Lε,δ =\nO\n\u0000log( 1\nε log 1\nδ )\n\u0001\nis the number of QSP layers.\nThe proof of Theorem 7 intrinsically incorporates the idea\nof Theorem 1, as detailed in Appendix C of Ref. [20]. For a\npredetermined precision δ, the error probability ε of the QSP-\nbased algorithm exhibits exponential decay as a function of\nincreasing QSP circuit depth. This relationship can be math-\nematically expressed as ε = c1e−c2Lε,δ, where c1 and c2 are\nconstants contingent upon the input data and quantum state.\nHowever, practical determination of an experimentally op-\ntimal L to achieve a desired error rate presents a non-trivial\nproblem, given that the input state may exist as an unknown\nsuperposition of quantum states. To address this, our numer-\nical simulations focusing on the STEP function can give the\napproximate trade-off between ε and L. As shown in Table I,\nto achieve an error rate below 10−3, L should be around 180;\nconversely, reducing L to 30 would greatly reduce the depth\nof this algorithm, but make the success probability fall below\n0.99.\nTABLE I. Detailed MSEs of simulating STEP function with respect\nto different depths of deep QSP circuits.\n# of Layers\n30\n120\n240\n360\nexperimental MSE\n2.8 × 10−2\n2.5 × 10−3\n1.9 × 10−3\n5.5 × 10−3\nNote that this trade-off is independent of the input uni-\ntary operator, the specific quantum state, or the system’s di-\nmension. Moreover, this trade-off is realized within a single\n4\n866 nm\n854 nm\n4P!/#\n3D!/#\n729 nm\n3D$/#\n4S%/#\n4P%/#\n3\n(a)\n397 nm\nF=2\nF=3\nF=4\nF=5\nF=3\nF=4\n3.2 GHz\n𝑚&\nF=4\nF=3\n𝑚′&\n3.2 GHz\nStretch \nqubit\n+0\n+0\n+1\n+1\n+2\n+2\n+3\n+3\n+4\n4S%/#\n(b)\nFig 9. (a) The level scheme and hyperfine splitting of the lowest\nenergy levels of the 43Ca+ ion. Two lasers at 397 nm are used for\nDoppler cooling and detection. Additionally, lasers at 854 nm and\n866 nm serve to repump from the D states to the P states. The ultra\nstable laser at 729 nm is used for sideband cooling and optical shelv-\ning. (b) The ground level hyperfine structure in an external magnetic\nfield. Microwave at 3.2 GHz is used for the ground state transition.\nThe qubit is encoded to Stretch transition.\nqubit. Our experiments can provide a computationally effi-\ncient and resource-conservative methodology for guiding the\nexperimental realization of QSP-based algorithms for solving\nthe QPE problem.\nAppendix D: Experiment details\n1.\nSetup and laser cooling\nOur experiment employs a linear Paul trap. The four blade\nelectrodes carry the rf potential for radial confinement and\nthe end-cap electrodes with dc voltage provide confinement\nin the axial direction. The trap is driven at Ωrf/2π = 23.9\nMHz with the power of 3.5 W. The trap axial frequency is\nωz/2π = 1.2 MHz with a voltage of 600 V applied to the\nend-cap electrodes. A magnetostatic field of 8.2 G, gener-\nated by a pair of permanent magnets, defines a quantization\naxis and splits the energy levels of the ground state 4S1/2, the\nmetastable state 3D5/2, and the excited state 4P1/2 into 16,\n48 and 16 hyperfine energy levels respectively. The laser and\n\n\n12\nmicrowave scheme can be found in Fig. 10, where an ultra-\nstable narrow linewidth optical fiber laser for 729 nm transi-\ntions and the 3.2 GHz microwave are critical for the imple-\nmentation of the experiment. The 729 nm fiber laser is locked\nto a high-finesse cavity made of ultra-low expansion material.\nA typical linewidth (FWHM) of 10 Hz is measured from the\nheterodyne beat note with respect to another laser system. The\nlong-term drift of the 729 nm laser is measured to be 0.04 Hz/s\nby observing transitions in the ion. The microwave is directed\nand amplified by a horn antenna. We manipulate the qubit by\ncontrolling the frequency, amplitude, and phase of microwave\nby the direct digital synthesizer (DDS) and field programable\ngate array (FPGA) as shown in section IV.\nFor Doppler cooling and fluorescence detection, the ion is\nexcited on the 4S1/2 ↔4P1/2 dipole transition by two 397\nnm lasers with a frequency difference of approximately 3.2\nGHz.\nTo avoid optical pumping into the 3D3/2 manifold,\nthe 866 nm repumping laser has to be applied. We enhance\nthe repumping efficiency by finely tuning the laser to the\n|3D3/2, F = 3⟩↔|4P1/2, F = 3⟩transition frequency and\nred-shifting a portion of the light using two acousto-optical\nmodulators operating at frequencies of 145 MHz and 235\nMHz. In this manner, all hyperfine 3D3/2 levels are reso-\nnantly coupled to one of the |4P1/2, F = 3, 4⟩levels. We\nemploy two 397 nm right-handed circularly polarized lasers\nto prepare the initial state |4S1/2, F = 4, mf = 4⟩. Sub-\nsequently, we employ 729 nm laser to shelve the population\nof |4S1/2, F = 4, mF = 4⟩to |3D5/2, F = 6, mF = 6⟩\nby a π pulse. Then we can use this quadrupole transition for\nquantum state detection by electron shelving method. High-\nfidelity qubit operations require the ion to be cooled within the\nLamb-Dicke regime and close to the motional ground state.\nThis is achieved by applying sideband cooling on the narrow\n|4S1/2, F = 4, mF = 4⟩to |3D5/2, F = 6, mF = 6⟩transi-\ntion. Since the meta-stable D5/2 level is long lived, it needs\nto be quenched by the 854 nm repumping laser. For optimal\nperformance, the repumping laser intensity has to be modified\nas the ion is cooled to the ground vibrational state.\n2.\nExperimental pulse sequences\nMicrowave frequency sources are based on the frequency\nmixing of the commercial signal generator and DDS. The use\nof the DDS allows for phase and frequency control during a\nsingle experimental sequence. Ry(θj), Rz(ϕj), Rz(x) denote\nrotations of the quantum state around different axes of the\nBloch sphere by varying angles. optimized parameters θj, ϕj\nare converted into microwave pulse sequences with different\npulse time and phases.\nIn Fig. 10(a), a microwave pulse sequence is generated with\nan initial phase of π\n2 and duration of tθj is generated to im-\nplement Ry(θj), where Ry(θj) signifies the evolution of the\nquantum state around y axis of the Bloch sphere for the angle\nof θj, Rz(ϕj) is the evolution of quantum state along z axis\nof the Bloch sphere with the angle of ϕj. The operations can\nbe achieved by controlling FPGA to output three microwave\npulses. The first pulse, with initial phase of π/2 and duration\nof T/2 (T is the duration of the π pulse), rotates the quantum\nstate in the equatorial plane of the Bloch sphere. The second\npulse, with initial phase of 0 and duration of tϕj, induces an\nevolution around z axis of the Bloch sphere with the angle of\nϕj, where tϕj = ϕjT/π. The third pulse is similar to the first\none, rotating the quantum state back from the equatorial plane\nto its original axis. Both Rz(x) and Rz(ϕj) involve similar\noperations. Experimentally, for simulation layers L, the con-\nRy(𝜃!)\nRz(𝑥)\n：\n：\n：\n𝑡\"! = 𝜙!/𝜋) 𝑇\n𝜋/2\n𝑡#! = 𝜃!/𝜋) 𝑇\n𝜋/2\n𝑡$ = 𝑥/𝜋) 𝑇\n𝜋/2\n𝜋/2\n(a)\nRz(𝜙!)\n(b)\nControl system\nj < L\nj ≥ L\n|0⟩\n)))\nRz(𝜙\") Ry(𝜃\")\n|1⟩\nRz(𝜙!) Ry(𝜃!) Rz(𝑥)\nFig 10. Experimental pulse sequences and experimental scheme for\nQSP. (a) is the schematic diagram of microwave pulse sequences for\nimplementing Ry(θj), Rz(ϕj) and Rz(x) rotations. π/2 in the light\ncolored box represents the microwave π/2 pulse. tϕj, tθj and tx in\nthe dark box denote the duration of the Rz(ϕj), Ry(θj) and Rz(x)\nrotations, respectively. (b) is the schematic diagram of implement-\ning the QSP circuit. When the loop count j is less than L, experi-\nmental control system converts the optimized parameters ϕj, θj into\nmicrowave pulse sequences. When the loop count j exceeds L, the\nQSP circuit stops working.\ntrol system continuously outputs microwave pulses to obtain\nfunction value W(x) in the trapped-ion system, following the\nquantum circuit given in Eq. (1). Increasing L by one neces-\nsitates seven additional microwave pulses. Therefore, it can\nbe simplified by adding a loop to enable the control system\nto automatically output microwave pulses. As shown in Fig.\n10(b), we prepare the initial state of 43Ca+ ion in |0⟩. Subse-\nquently, the control system determines whether the loop count\nis greater than L. If not, it converts the optimized parameters\nθj, ϕj and the independent variable x into the Ry(θj), Rz(ϕj)\nand Rz(x) rotations, respectively. Otherwise, the loop termi-\nnates and we make measurements of the states of the ion.\n3.\nMeasurement of coherence\nTo measure the coherence time of the qubit, a Ramsey\nexperiment is performed on the stretched state transition, as\nshown in Fig. 11(a). The phase of the first π/2 pulse is set\nto 0, and then the phase φ of the second π/2 pulse is scanned\nafter a delay time. For a fixed delay time τ, the population\nof |1⟩oscillates as the π/2 pulse changes. The fringe con-\ntrast is C = (Pmax −Pmin)/(Pmax + Pmin), where Pmax\n\n\n13\n0\n10\n20\n30\n40\n50\n60\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\nDelay time\nQSP circuits\nFringe contrast C\nDelay time τ (ms)\nLayers\n15 30\n60\n90\n120\n180\n240\n300\n330\n360\n(c)\n0\nπ\n2 , 0\nQSP circuits\nπ\n2 , φ\n1\n(b)\n0\nπ\n2 , 0\nDelay time τ\nπ\n2 , φ\n1\n(a)\nC=1/e\n☆\nFig 11.\nRamsey phase experiment on the stretched state transi-\ntion. Between the two π/2 pulses, the delay time τ and QSP cir-\ncuits are inserted in (a) and (b), respectively.\nAt each value of\nthe Ramsey free precession time τ, the phase of the second π/2\npulse is varied to produce a set of Ramsey fringes.\n(c) Fringe\ncontrast of (a) and (b), where the black points represent the fringe\ncontrast obtained by inserting different delay time τ in (a), with\nτ = 0, 2.5, 4.7, 9.4, 14, 19, 28, 38, 47, 52, 57 ms, respectively. The\nred points represent the fringe contrast obtained by inserting QSP\ncircuits with different layers of the STEP function in (b), with lay-\ners to be 0, 15, 30, 60, 90, 120, 180, 240, 300, 330, 360, respectively.\nThe blue horizontal line represents the case where the fringe contrast\nequals to 1/e. The blue star indicate the coherence time of 16.5 ms\nmeasured by (a).\nand Pmin are, respectively, the maximum and minimum val-\nues of the population in this oscillation. When the fringe con-\ntrast reaches its maximum value (C = 1 with Pmax = 1\nand Pmin = 0), it indicates the maximum coherence. When\nthe fringe contrast reaches its minimum value (C = 0 with\nPmax = 0.5 and Pmin = 0.5), it indicates no coherence. In\nFig. 11(b), by substituting the delay time with QSP circuits\nof different layers, we can assess the impact of QSP on co-\nherence. To analyze the impact of QSP circuits on coherence,\nwe set the delay time to be equivalent to the duration of the\nmicrowave pulse sequences for different layers. In Fig. 11(c),\nwe find that the coherence of the system is significantly im-\nproved after the QSP circuit is executed. We conjecture that\nthe component pulses in QSP partially act as a spin echo, so\nthat the simulation accuracy remains high even when the du-\nration of the QSP circuits far exceeds the coherence time of\nthe system.\n[1] P. Shor, Algorithms for quantum computation: discrete loga-\nrithms and factoring (1994) pp. 124–134.\n[2] L. K. Grover, A fast quantum mechanical algorithm for\ndatabase search, in Proceedings of the twenty-eighth annual\nACM symposium on Theory of computing (1996) pp. 212–219.\n[3] M. Cerezo, A. Arrasmith, R. Babbush, S. C. Benjamin, S. Endo,\nK. Fujii, J. R. McClean, K. Mitarai, X. Yuan, L. Cincio, and\nP. J. Coles, Variational quantum algorithms, Nature Reviews\nPhysics 3, 625 (2021).\n[4] J. Biamonte, P. Wittek, N. Pancotti, P. Rebentrost, N. Wiebe,\nand S. Lloyd, Quantum machine learning, Nature 549, 195\n(2017).\n[5] M. Larocca, F. Sauvage, F. M. Sbahi, G. Verdon, P. J. Coles, and\nM. Cerezo, Group-invariant quantum machine learning, PRX\nQuantum 3, 030341 (2022).\n[6] N. Liu and P. Rebentrost, Quantum machine learning for quan-\ntum anomaly detection, Phys. Rev. A 97, 042315 (2018).\n[7] J. Gibbs, Z. Holmes, M. C. Caro, N. Ezzell, H.-Y. Huang,\nL. Cincio, A. T. Sornborger, and P. J. Coles, Dynamical sim-\nulation via quantum machine learning with provable general-\nization, Phys. Rev. Res. 6, 013241 (2024).\n[8] I. H. Deutsch, Harnessing the power of the second quantum rev-\nolution, PRX Quantum 1, 020101 (2020).\n[9] E. Gibney, Hello quantum world! google publishes landmark\nquantum supremacy claim, Nature 574, 461 (2019).\n[10] H.-S. Zhong, H. Wang, Y.-H. Deng, M.-C. Chen, L.-C. Peng,\nY.-H. Luo, J. Qin, D. Wu, X. Ding, Y. Hu, et al., Quantum com-\nputational advantage using photons, Science 370, 1460 (2020).\n[11] K. Korzekwa and M. Lostaglio, Quantum advantage in simulat-\ning stochastic processes, Phys. Rev. X 11, 021019 (2021).\n\n\n14\n[12] A. W. Harrow and A. Montanaro, Quantum computational\nsupremacy, Nature 549, 203 (2017).\n[13] G. H. Low, T. J. Yoder, and I. L. Chuang, The methodology\nof resonant equiangular composite quantum gates, Physical Re-\nview X 6, 041067 (2016).\n[14] A. Gilyén, Y. Su, G. H. Low, and N. Wiebe, Quantum sin-\ngular value transformation and beyond: Exponential improve-\nments for quantum matrix arithmetics (ACM, Phoenix AZ\nUSA, 2019) pp. 193–204.\n[15] J. M. Martyn, Z. M. Rossi, A. K. Tan, and I. L. Chuang, A grand\nunification of quantum algorithms, PRX Quantum 2, 040203\n(2021).\n[16] G. H. Low and I. L. Chuang, Hamiltonian Simulation by Qubiti-\nzation, Quantum 3, 163 (2019).\n[17] S. Lloyd, B. T. Kiani, D. R. M. Arvidsson-Shukur, S. Bosch,\nG. De Palma, W. M. Kaminsky, Z.-W. Liu, and M. Marvian,\nHamiltonian singular value transformation and inverse block\nencoding (2021), arXiv:2104.01410 [quant-ph].\n[18] J. M. Martyn, Y. Liu, Z. E. Chin, and I. L. Chuang, Efficient\nfully-coherent quantum signal processing algorithms for real-\ntime dynamics simulation, The Journal of Chemical Physics\n158 (2023).\n[19] A. M. Childs, D. Maslov, Y. Nam, N. J. Ross, and Y. Su, Toward\nthe first quantum simulation with quantum speedup, Proceed-\nings of the National Academy of Sciences 115, 9456 (2018).\n[20] Y. Wang, L. Zhang, Z. Yu, and X. Wang, Quantum phase pro-\ncessing and its applications in estimating phase and entropies,\nPhysical Review A 108, 062413 (2023).\n[21] P. Rall, Faster Coherent Quantum Algorithms for Phase, En-\nergy, and Amplitude Estimation, Quantum 5, 566 (2021).\n[22] T. Gur, M.-H. Hsieh, and S. Subramanian, Sublinear quan-\ntum algorithms for estimating von neumann entropy (2021),\narXiv:2111.11139 [quant-ph].\n[23] T. Li and X. Wu, Quantum query complexity of entropy es-\ntimation, IEEE Transactions on Information Theory 65, 2899\n(2019).\n[24] S. Subramanian and M.-H. Hsieh, Quantum algorithm for es-\ntimating renyi entropies of quantum states, Physical Review A\n104, 022428 (2021).\n[25] F. J. Gil Vidal and D. O. Theis, Input redundancy for\nparameterized quantum circuits, Frontiers in Physics 8,\n10.3389/fphy.2020.00297 (2020).\n[26] A. Pérez-Salinas, A. Cervera-Lierta, E. Gil-Fuster, and J. I.\nLatorre, Data re-uploading for a universal quantum classifier,\nQuantum 4, 226 (2020).\n[27] Z. Yu, H. Yao, M. Li, and X. Wang, Power and limitations\nof single-qubit native quantum neural networks, in Advances\nin Neural Information Processing Systems, Vol. 35, edited by\nS. Koyejo, S. Mohamed, A. Agarwal, D. Belgrave, K. Cho, and\nA. Oh (Curran Associates, Inc., 2022) pp. 27810–27823.\n[28] Z. Yu, Q. Chen, Y. Jiao, Y. Li, X. Lu, X. Wang, and J. Z. Yang,\nNon-asymptotic approximation error bounds of parameterized\nquantum circuits, in The Thirty-eighth Annual Conference on\nNeural Information Processing Systems (2024).\n[29] N. Guo, Z. Yu, M. Choi, A. Agrawal, K. Nakaji, A. Aspuru-\nGuzik, and P. Rebentrost, Quantum linear algebra is all you\nneed for transformer architectures (2024), arXiv:2402.16714\n[quant-ph].\n[30] A. Ciavarella, Algorithm for quantum computation of particle\ndecays, Phys. Rev. D 102, 094505 (2020).\n[31] T. Keen, E. Dumitrescu, and Y. Wang, Quantum algorithms\nfor ground-state preparation and green’s function calculation,\narXiv preprint arXiv:2112.05731 (2021).\n[32] A. Roggero, Spectral-density estimation with the gaussian inte-\ngral transform, Phys. Rev. A 102, 022409 (2020).\n[33] M. Cattaneo, M. A. Rossi, G. García-Pérez, R. Zambrini, and\nS. Maniscalco, Quantum simulation of dissipative collective ef-\nfects on noisy quantum computers, PRX Quantum 4, 010324\n(2023).\n[34] A. Chenu, M. Beau, J. Cao, and A. del Campo, Quantum simu-\nlation of generic many-body open system dynamics using clas-\nsical noise, Phys. Rev. Lett. 118, 140403 (2017).\n[35] C. W. Bauer,\nZ. Davoudi,\nA. B. Balantekin,\nT. Bhat-\ntacharya, M. Carena, W. A. de Jong, P. Draper, A. El-Khadra,\nN. Gemelke, M. Hanada, D. Kharzeev, H. Lamm, Y.-Y. Li,\nJ. Liu, M. Lukin, Y. Meurice, C. Monroe, B. Nachman,\nG. Pagano, J. Preskill, E. Rinaldi, A. Roggero, D. I. San-\ntiago, M. J. Savage, I. Siddiqi, G. Siopsis, D. Van Zanten,\nN. Wiebe, Y. Yamauchi, K. Yeter-Aydeniz, and S. Zorzetti,\nQuantum simulation for high-energy physics, PRX Quantum 4,\n027001 (2023).\n[36] Y. Dong, K. B. Whaley, and L. Lin, A quantum hamiltonian\nsimulation benchmark, npj Quantum Information 8, 131 (2022).\n[37] Y. Kikuchi, C. M. Keever, L. Coopmans, M. Lubasch, and\nM. Benedetti, Realization of quantum signal processing on\na noisy quantum computer, npj Quantum Information 9, 93\n(2023).\n[38] K. DeBry, J. Sinanan-Singh, C. D. Bruzewicz, D. Reens, M. E.\nKim, M. P. Roychowdhury, R. McConnell, I. L. Chuang, and\nJ. Chiaverini, Experimental quantum channel discrimination us-\ning metastable states of a trapped ion, Physical Review Letters\n131, 170602 (2023).\n[39] J. Carrasquilla, D. Luo, F. Pérez, A. Milsted, B. K. Clark,\nM. Volkovs, and L. Aolita, Probabilistic simulation of quantum\ncircuits using a deep-learning architecture, Phys. Rev. A 104,\n032610 (2021).\n[40] Y. Du, M.-H. Hsieh, T. Liu, and D. Tao, Expressive power\nof parametrized quantum circuits, Phys. Rev. Res. 2, 033125\n(2020).\n[41] D. Motlagh and N. Wiebe, Generalized quantum signal process-\ning, PRX Quantum 5, 020368 (2024).\n[42] T. Odake, H. Kristjánsson, P. Taranto, and M. Murao, Univer-\nsal algorithm for transforming hamiltonian eigenvalues (2023),\narXiv:2312.08848 [quant-ph].\n[43] C. Sünderhauf, Generalized quantum singular value transfor-\nmation (2023), arXiv:2312.00723 [quant-ph].\n[44] N. A. Nemkov, E. O. Kiktenko, and A. K. Fedorov, Fourier ex-\npansion in variational quantum algorithms, Phys. Rev. A 108,\n032406 (2023).\n[45] J. Haah, Product decomposition of periodic functions in quan-\ntum signal processing, Quantum 3, 190 (2019).\n[46] R. Chao, D. Ding, A. Gilyen, C. Huang, and M. Szegedy, Find-\ning angles for quantum signal processing with machine preci-\nsion (2020), arXiv:2003.02831 [quant-ph].\n[47] Z. M. Rossi and I. L. Chuang, Multivariable quantum sig-\nnal processing (m-qsp): Prophecies of the two-headed oracle,\nQuantum 6, 811 (2022).\n[48] T. Takeshita, N. C. Rubin, Z. Jiang, E. Lee, R. Babbush, and\nJ. R. McClean, Increasing the representation accuracy of quan-\ntum simulations of chemistry without extra quantum resources,\nPhys. Rev. X 10, 011004 (2020).\n[49] N. K. Lysne, K. W. Kuper, P. M. Poggi, I. H. Deutsch, and\nP. S. Jessen, Small, highly accurate quantum processor for\nintermediate-depth quantum simulations, Phys. Rev. Lett. 124,\n230501 (2020).\n[50] M. Y. Niu, S. Boixo, V. N. Smelyanskiy, and H. Neven, Univer-\nsal quantum control through deep reinforcement learning, npj\n\n\n15\nQuantum Information 5, 33 (2019).\n[51] D. M. Lucas, B. C. Keitch, J. P. Home, G. Imreh, M. J. McDon-\nnell, D. N. Stacey, D. J. Szwer, and A. M. Steane, A long-lived\nmemory qubit on a low-decoherence quantum bus (2007).\n[52] T. P. Harty, D. T. C. Allcock, C. J. Ballance, L. Guidoni, H. A.\nJanacek, N. M. Linke, D. N. Stacey, and D. M. Lucas, High-\nfidelity preparation, gates, memory, and readout of a trapped-\nion quantum bit, Phys. Rev. Lett. 113, 220501 (2014).\n[53] X. Glorot and Y. Bengio, Understanding the difficulty of train-\ning deep feedforward neural networks, Journal of Machine\nLearning Research - Proceedings Track 9, 249 (2010).\n[54] K. Hornik, M. Stinchcombe, and H. White, Multilayer feedfor-\nward networks are universal approximators, Neural Networks\n2, 359 (1989).\n[55] The basis in Equation (C.16) could be |ψj⟩⟨ψj|, depending on\nthe choice of f.\n[56] F. Weisz, Summability of multi-dimensional trigonometric\nfourier series (2012).\n[57] D. Camps, L. Lin, R. Van Beeumen, and C. Yang, Explicit\nquantum circuits for block encodings of certain sparse matri-\nces, SIAM Journal on Matrix Analysis and Applications 45, 801\n(2024).\n[58] C. Sünderhauf, E. Campbell, and J. Camps, Block-encoding\nstructured matrices for data input in quantum computing, Quan-\ntum 8, 1226 (2024).\n[59] A. M. Childs and N. Wiebe, Hamiltonian simulation using lin-\near combinations of unitary operations, Quantum Information\n& Computation 12, 901 (2012).\n[60] G. Klambauer, T. Unterthiner, A. Mayr, and S. Hochreiter, Self-\nnormalizing neural networks, in Advances in Neural Informa-\ntion Processing Systems, Vol. 30, edited by I. Guyon, U. V.\nLuxburg, S. Bengio, H. Wallach, R. Fergus, S. Vishwanathan,\nand R. Garnett (Curran Associates, Inc., 2017).\n[61] V. Nair and G. E. Hinton, Rectified linear units improve re-\nstricted boltzmann machines, in Proceedings of the 27th inter-\nnational conference on machine learning (ICML-10) (2010) pp.\n807–814.\n[62] B. Research, Paddle Quantum, https://github.com/\nPaddlePaddle/Quantum (2023).\n[63] M. Bocher, Introduction to the theory of fourier’s series, Annals\nof Mathematics 7, 81 (1906).\n[64] Y. Dong, X. Meng, K. B. Whaley, and L. Lin, Efficient phase-\nfactor evaluation in quantum signal processing, Physical Re-\nview A 103, 042419 (2021).\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20199v1.pdf",
    "total_pages": 15,
    "title": "Exploring experimental limit of deep quantum signal processing using a trapped-ion simulator",
    "authors": [
      "J. -T. Bu",
      "Lei Zhang",
      "Zhan Yu",
      "Jing-Bo Wang",
      "W. -Q. Ding",
      "W. -F. Yuan",
      "B. Wang",
      "H. -J. Du",
      "W. -J. Chen",
      "L. Chen",
      "J. -W. Zhang",
      "J. -C. Li",
      "F. Zhou",
      "Xin Wang",
      "M. Feng"
    ],
    "abstract": "Quantum signal processing (QSP), which enables systematic polynomial\ntransformations on quantum data through sequences of qubit rotations, has\nemerged as a fundamental building block for quantum algorithms and data\nre-uploading quantum neural networks. While recent experiments have\ndemonstrated the feasibility of shallow QSP circuits, the inherent limitations\nin scaling QSP to achieve complex transformations on quantum hardware remain an\nopen and critical question. Here we report the first experimental realization\nof deep QSP circuits in a trapped-ion quantum simulator. By manipulating the\nqubit encoded in a trapped $^{43}\\textrm{Ca}^{+}$ ion, we demonstrate\nhigh-precision simulation of some prominent functions used in quantum\nalgorithms and machine learning, with circuit depths ranging from 15 to 360\nlayers and implementation time significantly longer than coherence time of the\nqubit. Our results reveal a crucial trade-off between the precision of function\nsimulation and the concomitant accumulation of hardware noise, highlighting the\nimportance of striking a balance between circuit depth and accuracy in\npractical QSP implementation. This work addresses a key gap in understanding\nthe scalability and limitations of QSP-based algorithms on quantum hardware,\nproviding valuable insights for developing quantum algorithms as well as\npractically realizing quantum singular value transformation and data\nre-uploading quantum machine learning models.",
    "published_date": "2025-02-27",
    "source": "arxiv"
  }
}