{
  "id": "arxiv_2502.21268v1",
  "text": "Stochastic dynamics at the back of a gene drive\neradication wave\nLéna Kläy*,1, Léo Girardin2, Florence Débarre†1, and Vincent Calvez‡3\n1Institute of Ecology and Environmental Sciences Paris (IEES Paris), Sorbonne Université, CNRS, IRD, INRAE,\nUniversité Paris Est Creteil, Université de Paris, Paris Cedex 5, France.\n2Institut Camille Jordan, UMR 5208 CNRS and Universite Claude Bernard Lyon 1, France\n3CNRS, Univ Brest, UMR 6205, Laboratoire de Mathématiques de Bretagne Atlantique, France\nAbstract\nGene drive alleles bias their own inheritance to offspring. They can fix in a wild-type population in\nspite of a fitness cost, and even lead to the eradication of the target population if the fitness cost is\nhigh. However, this outcome may be prevented or delayed if areas previously cleared by the drive are\nrecolonised by wild-type individuals. Here, we investigate the conditions under which these stochastic\nwild-type recolonisation events are likely and when they are unlikely to occur in one spatial dimen-\nsion. More precisely, we examine the conditions ensuring that the last individual carrying a wild-type\nallele is surrounded by a large enough number of drive homozygous individuals, resulting in a very\nlow chance of wild-type recolonisation. To do so, we make a deterministic approximation of the dis-\ntribution of drive alleles within the wave, and we split the distribution of wild-type alleles into a deter-\nministic part and a stochastic part. Our analytical and numerical results suggest that the probability of\nwild-type recolonisation events increases with lower fitness of drive individuals, with smaller migra-\ntion rate, and also with smaller local carrying capacity. Numerical simulations show that these results\nextend to two spatial dimensions. We also demonstrate that, if a wild-type recolonisation event were\nto occur, the probability of a following drive reinvasion event decreases with smaller values of the in-\ntrinsic growth rate of the population. Overall, our study paves the way for further analysis of wild-type\nrecolonisation at the back of eradication traveling waves.\nKeywords: gene drive, chasing, fitness, migration rate, carrying capacity.\n*Corresponding author: lena.klay@univ-brest.fr\n†Corresponding author: florence.debarre@normalesup.org\n‡Corresponding author: vincent.calvez@math.cnrs.fr\n1\narXiv:2502.21268v1  [q-bio.PE]  28 Feb 2025\n\n\n1\nIntroduction\nArtificial gene drive is a genetic engineering technology that could be used for the management of\nnatural populations [1–3]. Gene drive alleles bias their own inheritance towards a super-Mendelian\nrate, therefore driving themselves to spread quickly through a population despite a potential fitness\ncost [2, 4, 5]. Homing gene drives rely on gene conversion to bias their transmission. In a heterozy-\ngous cell, the gene drive cassette located on one chromosome induces a double-strand break on the\nhomologous chromosome. This damage is repaired through homology directed repair, which dupli-\ncates the cassette. By repeating through generations, such gene conversion favours the spread of the\ndrive cassette in the target population. Gene conversion can theoretically take place at any point in\nthe life cycle, either in the germline or in the zygote. Current implementations however focus on gene\nconversion in the germline [6].\nGene drive constructs can be designed to either spread a gene of interest in a population (an out-\ncome called population replacement), or to reduce the size of the target population by lowering the\nfitness of drive individuals (called population suppression if the intended goal is to reduce population\ndensity, and population eradication if the intended goal is to eradicate the population). The fitness cost\ncarried by the drive, usually caused by the alteration of an essential fertility or viability gene, associated\nwith the super-Mendelian propagation, can lead to the complete extinction of the target population\n[2, 7–10].\nHowever, eradication may fail because of the recolonisation of cleared areas by wild-type individ-\nuals. Such recolonisation dynamics can prevent the total elimination of the target population. Some\nwild-type individuals might then stay indefinitely in the environment, or the wild-type subpopulation\nmay be invaded again by drive individuals, leading to local extinction of the sub-population; after-\nwards, the resulting cleared area can be recolonised again by some wild-type individuals, and so on.\nThese infinite dynamics have been referred to as “colonisation-extinction” dynamics [11] or “chasing”\ndynamics [12]. In this article, we use the term “wild-type recolonisation” if the recolonising wild-type\nindividuals stay indefinitely in the environment (Figure 1(b)), and “chasing” if at least another drive\nrecolonisation event follows, leading to potential infinite reinvasions (Figure 1(c)).\nFigure 1: Illustrations of the different outcomes of drive propagation, presented as snapshots (top row,\nat a fixed time t ) and kymographs (bottom row, from time 0 to t ), showing the different types of out-\ncomes (columns). The drive fitness cost varies from low on the right column to high on the left column.\nNumber of drive alleles (in red) and wild-type alleles (in blue) are represented on the y-axis in the top\nrow, and in color intensities in the bottom row. The top row corresponds to a horizontal slice of the\nbottom row at the last time t . For a better visualisation, we adjusted the colormap of the bottom row\nto have saturation for 50 drive individuals and 100 wild-type individuals. The drive eradication wave\nmight lead to different dynamics in space: (a) no recolonisation event at all, (b) wild-type recolonisa-\ntion and persistence, (c) successive wild-type recolonisation and drive reinvasion (chasing).\nWild-type recolonisation events have been observed in compartmental models [13] and discrete\nindividual-based models of eradication gene drive [11, 12, 14–20]. Previous studies have shown the\ninfluence of ecological factors on the chance of wild-type recolonisation after the spread of an erad-\n2\n\n\nication gene drive: high rates of dispersal reduce the chance of recolonisation [12, 19]; high levels of\ninbreeding increase the likelihood of recolonisation [12]; the presence of a competing species or preda-\ntor facilitates extinction without recolonisation [17]. The release pattern of the drive seems to have\nlittle effect on recolonisation outcomes [12]. Drive fitness might also impact the risk of recolonisation:\nbased on simulations, Champer et al. found that a higher fitness reduces the chance of recolonisation\n[12], while Paril and Phillips obtained contrasted results on X-shredder and W-shredder drives [19].\nBuilding on these previous works, our study also investigates the impact of the drive’s fitness and the\nmigration rate, but through an analytical approach supported by simulations. In addition, we explore\nthe influence of the carrying capacity which, as far as we are aware, has not been done before. To\nsimulate systems with very large numbers of individuals (up to 1012 on the whole domain), we imple-\nment our model in a population-based way, such that we follow the population size in each spatial site\ninstead of the position of each living individual.\nIn this work, we focus on quantifying the probability that a wild-type recolonisation event does\nnot occur within a realistic time window (Figure 1(a)). The rationale of this analysis is based on the\nfollowing idea: if the last individual carrying a wild-type allele is surrounded by many drive individu-\nals, then it is very unlikely that stochastic fluctuations can leave behind individuals carrying wild-type\nalleles capable of repopulating the empty place. On the contrary, if individuals carrying wild-type al-\nleles are still present when the drive population is scarce, then it is conceivable that these individuals\ncan recolonise with significant probability. Here, we will focus on the first facet of this rationale, using\na deterministic approach to approximate the location of dense drive population. This approximation\nmust however be completed with a stochastic approximation to determine the position of the last in-\ndividual carrying at least one wild-type allele. We explain how to handle the deterministic parts in\nan analytical way, then we give some preliminary steps of how to deal with the stochastic part. The\nformer is based on the theory of reaction-diffusion traveling waves, which was the main focus of [21],\nwhereas the latter is based on a heuristical connection with extinction time in Galton-Watson branch-\ning processes. Interestingly, we find that, when parameters vary, most of the variation of the chance of\nrecolonisation is due to the analytical contribution, for which we have explicit formulas.\nTo investigate the presence/absence of wild-type recolonisation events, we restrict our study case\nto a specific range of drive fitness values. Based on previous work [10, 21], we know that if the drive\nfitness is high enough, a drive monostable invasion occurs and the final drive proportion is 1. On the\ncontrary if the drive fitness is low enough, a wild-type monostable invasion occurs and the final drive\nproportion is 0 (the drive wave retreats and the wild-type wave advances). For intermediate values\nof the drive fitness, we either observe bistable dynamics (the final drive proportion is either 0 or 1\ndepending on the initial condition) or coexistence final states (the final drive proportion is strictly\nbetween 0 and 1). Coexistence ensures genetic diversity at the back of the wave; we believe this would\ntake us out of the rationale described above (the last individual carrying at least one wild-type allele is\nnot surrounding by multiple drive individuals). Therefore we will not consider this case in this paper\nand restrict ourselves to the case of monostable drive invasion.\nOur results suggest that the probability of wild-type recolonisation events increases with smaller\nfitness of drive individuals, smaller migration rate, and smaller local carrying capacity. To check the\nrobustness of our analytical and numerical findings in one spatial dimension, we run stochastic sim-\nulations in two spatial dimensions varying both the fitness cost and the carrying capacity. The 2D\nresults are consistent with the 1D case, except that wild-type recolonisation events happen faster in\n2D than in 1D (as they can occur in a variety of directions). We also give analytical arguments to show\nthat, in case of a wild-type recolonisation event, the probability of a following drive reinvasion event\ndecreases with smaller values of the intrinsic growth rate of the population.\n2\nModels\n2.1\nContinuous deterministic model\nWe extend a model developed in previous articles [10, 21], assuming a partial conversion of rate c ∈\n(0,1) occurring in the germline. We assume that the individuals live in a one-dimensional space; they\ninteract and reproduce locally, and they move in a diffusive manner. We therefore use a reaction diffu-\nsion framework. We denote by n the total number of individuals in the population, by ni the number\nof individuals with genotype i in the population, by K the maximum carrying capacity of the envi-\nronment, and by σ2 the diffusion rate. Note that unlike our previous work [10, 21], we consider the\nnumber of individuals instead of the rescaled density. We follow three genotypes: wild-type homozy-\ngotes (i = W W ), drive homozygotes (i = D D ) and heterozygotes (i = DW ). Wild-type homozygotes\nhave fitness fW W = 1, drive homozygotes have fitness fD D = 1 −s, where s ∈(0,1) is the fitness cost of\n3\n\n\nthe drive, and drive heterozygotes have fitness fDW = 1−sh, where h ∈(0,1) is the dominance param-\neter. The intrinsic growth rate is r ∈(0,+∞), and we assume logistic growth, with density dependence\naffecting fecundity. We assume locally random mixing and we do not distinguish between sexes. With\nthis, we obtain:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n∂t nDD −σ2∂2\nx x nDD = (1 −s)\n\u0010\nr\n\u0010\n1 −n\nK\n\u0011\n+ 1\n\u0011\n1\n4 (1 + c )2 n2\nDW + (1 + c ) nDWnDD + n 2\nDD\nn\n−nDD,\n∂t nDW −σ2∂2\nx x nDW = (1 −sh)\n\u0010\nr\n\u0010\n1 −n\nK\n\u0011\n+ 1\n\u0011 (1 + c ) nWWnDW + 2 nWWnDD + 1\n2 (1 −c 2) n 2\nDW + (1 −c ) nDWnDD\nn\n−nDW,\n∂t nWW −σ2∂2\nx x nWW =\n\u0010\nr\n\u0010\n1 −n\nK\n\u0011\n+ 1\n\u0011 n 2\nWW + (1 −c ) nWWnDW + 1\n4 (1 −c )2 n2\nDW\nn\n−nWW.\n(1)\n2.1.1\nFrom genotypes to alleles\nIn [21], we established that model (1) can be reduced to two equations instead of three, focusing on\nallele numbers (nD,nW) instead of genotype numbers (nDD,nDW,nWW). The transformation is given by\nnD = nDD +α nDW and nW = nWW +(1−α) nDW, with α = 1+c\n2 when gene conversion occurs in the germline.\nWith this transformation, system (1) is equivalent to the following one:\n\n\n\n\n\n∂t nD −σ2∂2\nx x nD = nD\n\ng D(nD,nW) −1\n\n,\n∂t nW −σ2∂2\nx x nW = nW\n\ngW(nD,nW) −1\n\n,\n(2)\nwhere g D and gW are the per-capita growth rates associated with each allele, and are given by:\ngD(nD,nW) =\n\u0010\nr\n\u0010\n1 −n\nK\n\u0011\n+ 1\n\u0011\n(1 −s)\nnD\nn + (1 −sh) (1 + c )\nnW\nn\n\n,\n(3a)\ng W(nD,nW) =\n\u0010\nr\n\u0010\n1 −n\nK\n\u0011\n+ 1\n\u0011 nW\nn + (1 −sh) (1 −c )\nnD\nn\n\n.\n(3b)\nIn the following, the term “number of drive alleles” (resp. “number of wild-type alleles”) refers to the\nquantities nD (resp. nW ), and represents an haploid count.\n2.1.2\nDrive invasion and traveling waves\nAs it is classical in spatial ecology [22], we investigate the spatial invasion of the drive allele by means\nof traveling waves. We seek stationary solutions in a reference frame moving at speed vco (“co” stands\nfor continuous model),\n\u001a\nnD(t , x) = ND(x −vcot ) = ND(z)\n(∀t > 0) (∀x ∈R),\nnW(t , x) = NW(x −vcot ) = NW(z)\n(∀t > 0) (∀x ∈R),\n(4)\nPlugging this particular shape of a solution in (2), we deduce the following pair of equations for the\ntraveling wave profiles (ND, NW):\n\n\n\n\n\n\n\n−vcoN ′\nD −σ2N ′′\nD\n= ND\n\nr\n\n1 −N\nK\n\n+ 1\n\n(1 −s)\nND\nN + (1 −sh) (1 + c )\nNW\nN\n\n−1\n\n,\n−vcoN ′\nW −σ2N ′′\nW\n= NW\n\nr\n\n1 −N\nK\n\n+ 1\n NW\nN + (1 −sh) (1 −c )\nND\nN\n\n−1\n\n.\n(5)\nWe impose the following conditions:\n\n\n\nvco > 0,\nND(−∞) = 0,\nND(+∞) = 0,\nNW(−∞) = 0,\nNW(+∞) = 1.\n(6)\nThese conditions mean that we consider a drive eradication wave propagating from the left-hand side\nto the right-hand side of our figures. A schematic illustration of the wave is drawn in Figure 4(a). In\nthis mathematical framework, the limiting values ND,W(−∞) = 0 listed in system (6) correspond to the\n4\n\n\neradication of the population after the drive wave has passed. The condition to attain this outcome\nreads r <\ns\n1−s [10, 21].\nTraveling wave solutions contain important information for the biological interpretation of the\nresults. The speed vco is the rate of propagation of the drive population. Under assumptions (6), the\nprofile ND(z) has exponential decay both when z goes to +∞and −∞(Figure 4(a)). The profile NW(z)\nhas exponential decay when z goes to −∞. This can be expressed as follows:\nAt the front of the wave:\nND(z) ≈exp\n\u0000λfront\nD, coz\n\u0001\n,\n(7a)\nAt the back of the wave:\nND(z) ≈exp\n\u0000λback\nD, coz\n\u0001\n,\n(7b)\nAt the back of the wave:\nNW(z) ≈exp\n\u0000λback\nW, coz\n\u0001\n.\n(7c)\nThe rates of decay denoted by λ play a key role in our analysis. It would be possible to derive\nseveral qualitative conclusions to some extent of generality, but we opt for simplicity, and we limit our\nanalysis to the case of pulled traveling waves (see [21] for the notion of pulled versus pushed waves\nin the context of population eradication by a gene drive), because the speed vco is explicitly known in\nthat case:\nvco = v lin\nco = 2\np\n(1 −sh)(1 + c ) −1\n(8)\n(see Appendix B.1 for details).\nWe therefore assume that all the waves that we consider are pulled. As shown in [21], when gene\nconversion occurs in the germline, the drive wave is always pulled for h < 0.5. In this study, we consider\nh = 0.4 for the numerical illustrations. We obtain formulas for the exponential rates of profiles nD and\nnW at the front and at the back of the wave, namely:\nλfront\nD, co = 1\nσ\n\n−\np\n(1 −sh)(1 + c ) −1\n\n,\n(9a)\nλback\nD, co = 1\nσ\n\n−\np\n(1 −sh)(1 + c ) −1 +\np\n(1 −sh)(1 + c ) −(r + 1)(1 −s)\n\n,\n(9b)\nλback\nW, co = 1\nσ\n\n−\np\n(1 −sh)(1 + c ) −1 +\np\n(1 −sh)(1 + c ) −(r + 1)(1 −sh)(1 −c )\n\n,\n(9c)\n(see Appendix B.1 for details).\n2.2\nDiscrete stochastic model\nTo observe wild-type recolonisation events, we need to consider a stochastic discrete model, based on\nthe allele dynamics described by system (2). We denote the number of drive and wild-type alleles at\nspatial site x and time t as:\nnD(t , x) = n t ,x\nD\n,\nnW(t , x) = n t ,x\nW\nand\nn(t , x) = n t ,x\n∀t ∈{0,d t ,2d t ,...}, ∀x ∈{0,d x,2d x,...}.\n(10)\nIn our stochastic simulations, each individual reproduces, dies and disperses independently of the\nreproduction, death, and dispersal of others. We alternate between two types of events: 1) allele pro-\nduction/disappearance in each spatial site and 2) allele migration in the neighbouring spatial sites.\nDuring one time unit, a drive allele duplicates on average gD(n t ,x\nD\n,n t ,x\nW ) times, as defined in equation\n(3a), and a wild-type allele duplicates on average g W(n t ,x\nD\n,n t ,x\nW ), as defined in equation (3b). One allele\n(drive or wild-type) disappears at rate 1 within one time unit, corresponding to the death of an individ-\nual carrying it. To model the number of new alleles and removed alleles, we use Poisson distributions\nwith these respective means. A Poisson distribution corresponds to the number of events observed\nduring a time interval of given length, when the waiting time between two consecutive events is given\nby an exponential distribution. For one type of event, under an exponential distribution, the expected\nfuture waiting time is independent of waiting time already passed.\nSecond, we consider migration: at each time step, an allele migrates with probability m outside\nits original site. It goes to one neighbouring spatial site, either on the right or on the left, with equal\nprobabilities. To model this event, we use two Bernoulli distributions: one with probability m to de-\ntermine if the individual migrates, the second with probability 1\n2 in case of success, to determine the\nwelcoming site (right or left).\nRemark 1 (Migration rate vs. diffusion coefficient) Both the migration rate (denoted m, discrete mod-\nels) and the diffusion coefficient (denoted σ2, continuous models) describe the ability of individuals to\nmove in space. Their relationship is given by\nσ2 = m(∆x)2\n2∆t\n.\n(11)\n5\n\n\nWe implement this model in a population-based way: we follow the number of alleles in each spa-\ntial site instead of following the position of each living individual (which would then be an individual-\nbased model). In each site, we draw independent events of production/disappearance of alleles rela-\ntive to the number of alleles in this site, and the same goes for migration events.\nThese dynamics are summarised in Figure 2 and the detailed code is provided in Appendix A. The\nmain advantage of this approach is that it allows to simulate systems with very large number of alleles.\nFigure 2: Consecutive steps in the stochastic discrete model.\nThe discrete model also exhibits finite speed propagation, but the rate of propagation differs from\nits continuous version (8) for two reasons: firstly, the stepping-stone discretisation, and secondly, the\nstochastic effects due to finite population size. These two corrections of the speed are very well doc-\numented [23, 24]. However, for the sake of simplicity, we prefer to conduct our analysis based on the\nformulas of the continuous model, as in Section 2.1. In the following sections, we briefly present each\ncorrection, and we compare the outcomes of the theory and the numerical simulations, in order to\nsupport our continuous approximation.\n2.2.1\nCorrection of the speed due to the stepping stone discretisation\nWe consider a deterministic version of the discrete model, that is, the one obtained by considering\nthe expectation in each site, which can be deduced in the limit of large carrying capacity K →+∞.\nWhen the wave is pulled, the speed vdi is given by the following minimization problem (for details, see\nSection B.2):\nvdi = v lin\ndi = min\nλ<0 (V (λ)) = min\nλ<0\nlog([((1 −sh)(1 + c ) −1) dt + 1] [1 −m + m cosh(λ dx)])\n−λ dt\n\n,\n(12)\nwhich coincides with (8) in the limit dt ,dx →0. The rates of (discrete) exponential decay can be\ndeduced from (12), similarly as in (7) (see Appendix B.2 for detail). In particular, the rate of decay at\nthe front, λfront\nD, di is the λ giving rise to the minimal value.\n2.2.2\nCorrection of the speed due to the finite size of the population\nThe wave is pulled, meaning that its speed is determined by the few drive individuals at the front of\nthe wave. The model being stochastic, small densities exhibit relatively stochastic fluctuations in their\ndynamics, so that the speed of propagation in stochastic simulations is smaller than (12). This dis-\ncrepancy has been predicted analytically in [23, 24] (see also [25, 26] for the mathematical proof) to\nbe:\nvdi (cor) ≈vdi −\nV ′′(λfront\nD, di) π2 (λfront\nD, di)2\n2\n\u0000log\n\u0000 1\nK\n\u0001\u00012\n,\n(13)\nwhere vdi (cor) is the corrected discrete speed, and the function V is given in equation (12). This ana-\nlytical prediction was obtained heuristically by a cut-off argument which takes into account the fact\nthat the distribution of individuals vanishes beyond some finite range, in contrast with the continuous\nmodel where the density is positive everywhere.\nIn Table 1, we compare the following quantities, respectively for s = 0.3 and s = 0.7 (see Table 2 for\nthe set of all parameters): i) the continuous speed vco given by (8); ii) the discrete speed vdi given by (12);\niii) the discrete speed corrected due to stochastic effects vdi (cor) given by (13); and iv) the numerical\nspeed vnum as measured in stochastic numerical simulations. The best approximation of the speed\ncomputed numerically is indeed the corrected discrete speed, given by (13).\n6\n\n\ns value\nSpeed\nvco\nvdi\nvdi (cor)\nvnum\n0.3\n1.64\n1.63\n1.62\n1.61\n0.7\n1.21\n1.21\n1.20\n1.19\nTable 1: Comparison of the speed values for s = 0.3 or 0.7 and K = 108; see Table 2 for the other\nparameter values. The continuous speed vco is given by (8), the discrete speed vdi is given by (12),\nthe correction of the discrete speed vdi (cor) is given by (13) and the numerical speed vnum is computed\nnumerically.\n2.3\nInitial conditions and parameters for numerical simulations\nInitial conditions for our numerical simulations are illustrated in Figure 3. The left half of the domain\nis full of drive alleles (nD = K ), and the right half is full of wild-type alleles (nW = K ). Reference to right\nor left positions are made in the context of this initial state.\nFigure 3: Initial conditions for numerical simulations in one spatial dimension.\nNumerical simulations are performed with the same set of parameters (unless specified otherwise),\nsummarised in Table 2. The code is available on GitHub (https://github.com/LenaKlay/gd_\nproject_1/tree/main/stochastic). We ran our simulations in Python 3.6, with the Spyder envi-\nronment.\nParameter\nRange value\nValue\nDescription\nr\n(0,+∞)\n0.1\nIntrinsic growth rate\nc\n[0,1]\n0.9\nConversion rate\ns\n(0,1)\n0.3 or 0.7\nFitness cost of drive homozygotes\nh\n[0,1]\n0.4\nDrive dominance\nm\n[0,1]\n0.2\nMigration rate\nK\n(0,+∞)\nfrom 103 to 108\nLocal carrying capacity\nd x\n(0,1]\n1\nSpatial step between two sites\nd t\n(0,1]\n0.1\nTemporal step\nT\n(0,+∞)\n1000\nSimulation maximum time\nTable 2: Model parameters and numerical values used in the simulations.\n3\nResults\n3.1\nDrive eradication waves in the continuous model\nThe parameters detailed in Section 2.3 have been chosen to verify two conditions in the determinis-\ntic model: i) the final equilibrium is an empty environment (eradication) ii) the drive invades for all\ninitial conditions (monostable drive invasion). Such conditions establish a suitable framework for the\nobservation of wild-type recolonisation events in the stochastic model (suitable but not sufficient).\nFigure 4(a) represents the typical outcome expected in the continuous model under these assump-\ntions, with the two profiles ND (red) and NW (blue) and a speed of propagation v, as described by the\n7\n\n\nset of equations (5)–(6). The relative intensities of exponential decay at the back of the wave are key to\nour analysis, see Figure 4(b).\nThe eradication condition is given by:\nr <\ns\n1 −s ,\n(14)\nwhich is equivalent to λback\nD, co > 0 (9b). Hence, this demographic eradication condition is equivalent to\nhaving an exponential decay at the back of the wave, as expected.\nThe monostable drive invasion condition is given by:\n(1 −sh)(1 + c ) > 1,\n(15)\nor equivalently denoted as s < s2,g in [21]. This condition ensures a strictly positive drive allele produc-\ntion at the front of the wave, as the production of drive alleles relies on heterozygotes (with a fitness of\n(1−sh), a drive allele production rate of (1+ c ) and a mortality rate of 1). Indeed, wild-type alleles are\nso numerous at the front of the wave that at least one parent in each couple is wild-type homozygote\n(WW), and offspring carrying drive alleles are necessarily heterozygotes.\nRemark 2 (Exclusion of the particular case of coexistence) The monostable drive invasion condition\ndoes not exclude the existence of a final coexistence state, however, this case is rather easy to appreciate,\nwhich is why we address it separately in this remark. By definition, the coexistence case results in a final\ndrive proportion strictly between 0 and 1 at the back of the wave in the continuous model [21]. The\nquestion raised in this article — \"Is the last individual carrying a drive allele at the back of the wave\nsurrounded by a sufficiently large number of drive alleles?\" — would then receive a negative answer\nand we expect that such coexistence state would very likely lead to recolonisation events in stochastic\nsimulations, due to a relatively large number of wild-type alleles in small population areas. Therefore,\nwe add a third condition to exclude coexistence cases:\n(1 −sh)(1 −c ) < (1 −s).\n(16)\nWe insist on the fact that coexistence is only a relative equilibrium among frequencies, because this\ncan occur while the whole population goes extinct (under condition (14)). We then observe a transition in\nthe analytical computations and find λback\nW, co = λback\nD, co, meaning that the drive and wild-type alleles decay\nwith the same exponential rate at the back of the wave, and that they both reach non-zero equilibrium\nfrequencies at −∞in space. On the contrary, condition (16) denoted as s < s1 in [21], is equivalent to\nλback\nW, co > λback\nD, co ensuring that the drive curve is less steep than the wild-type curve as in Figure 4(b). Under\ncondition (16), the final drive proportion reaches 1 (and the final wild-type proportion reaches 0) [21].\n3.2\nStochastic recolonisation of the wild-type at the back of the wave\nThe continuous representation fails at very low number of alleles per site. This can be seen in Figures\n4(c–f), showing the outcomes of stochastic simulations, and where the drive and the wild-type allelic\ndistributions are plotted in log scale. Only the back of the wave is shown on these panels to focus on the\noccurrence of recolonisation events. Multiple time points are superimposed in these figures, and the\ncurves are translated to have a constant number of wild-type alleles at the spatial origin on the right\nhand side (either 100 or 1000 alleles depending on the figures). The black lines are the exponential\napproximations for each, as described with detail in Appendix B.2 (they are the analogues of expres-\nsions (9) for the stepping stone discrete approximation). For a large drive fitness cost (s = 0.7) and a\nrelatively small carrying capacity (K = 105), we observe one wild-type recolonisation event within this\nwindow of time (Figure 4(f)). Note that in this example, the slopes of the wild-type and drive curves\nare similar, and carrying capacity is relatively low.\n3.3\nA theoretical framework to characterize the absence of recolonisation\nWe posit that wild-type recolonisation or chasing can very likely be prevented if the last individual car-\nrying a wild-type allele is surrounded by a sufficiently large number of drive individuals. This reference\nnumber, denoted by N , should be large enough to avoid stochastic effects, but much smaller than the\ncarrying capacity K . We choose N = 100 in this paper.\nTo get a clearer view, we superimpose in Figure 4(g) the distribution of drive alleles at several times\n(nD in red), the distribution of wild-type alleles at a single time (nW in blue) and the histogram of the po-\nsition of the last wild-type allele (light blue). We see that a clear separation exists between the distribu-\ntion of the last wild-type allele and the area with few drive alleles (below 100) when s = 0.3 preventing\nthe wild-type recolonisation with high probability.\n8\n\n\n(a) Propagating wave in the continuous model\n(b) Zoom at the back of the wave: both densities decay\nexponentially fast to zero in case of eradication\n(c) K = 108, s = 0.3\n(d) K = 105, s = 0.3\n(e) K = 108, s = 0.7\n(f) K = 105, s = 0.7 – Wild-type recolonisation\n(g) K = 108, s = 0.3\nFigure 4: Number of drive alleles (in red) and number of wild-type alleles (in blue) at the back of the\nwave, for the continuous model in linear scale (panels (a, b)) and the stochastic model in log scale\n(panels (c, d, e, f, g)). The points of abscissa z = 0 is arbitrary placed at the last spatial site with more\nthan 1000 wild-type alleles in panels (c, d, e, f) and with more than 100 wild-type alleles in panel (g).\nWe superimpose multiple realisations corresponding to 2000 different timepoints in the simulation,\nto observe the stochastic variations. The exponential approximations from Appendix B.2 are shown\nfor each wave in black. We observe a wild-type recolonisation event for s = 0.7 and K = 105. In panel\n(g), for s = 0.3 and K = 108, we add in the figure a histogram showing the spatial distribution of the last\nwild-type allele in lighter blue, highlighting the high stochasticity of this position.\n9\n\n\n3.4\nSpatial separation\nTo determine when wild-type recolonisation or chasing is very unlikely, and evaluate the contributions\nof each parameter, we aim to separate the space between a deterministic zone and a stochastic zone\nat the back of the wave, depending on the number of alleles per site.\nWe denote by ℓthe distance between the last position with more than N drive alleles and the last\nposition with more than N wild-type alleles, illustrated in Figure 4(g). We make the strong hypothesis\nthat this distance can be well approximated by a deterministic model. This entails choosing N suffi-\nciently large. Moreover, to ease the analytical calculations, we are going to use the spatially continuous\nmodel rather than the discrete one for the values of λ characterizing the curves.\nThe second quantity of interest is LN\n1 , the distance between the position of the last individual\ncarrying a wild-type allele and the last position with more than N wild-type alleles, also illustrated in\nFigure 4(g). In contrast to ℓ, this distance is genuinely stochastic.\nFigure 5 represents the distribution of the furthest spatial positions associated with at least N =\n100 drive alleles (in red) and N = 100 wild-type alleles (in blue), and the furthest spatial position as-\nsociated with a single wild-type allele in the site, that is, the position of the last individual carrying a\nwild-type allele. We clearly see that the two former distributions are concentrated around a determin-\nistic value, whereas the latter is more spread out.\nWe can recast our mathematical problem as LN\n1\n< ℓwith high probability, meaning that the last\nwild-type individuals is very likely surrounded by more than N alleles, which is clearly the case in\nFigure 5(a) for small value of the drive fitness cost s (s = 0.3). In contrast, when s is larger (s = 0.7),\nthe last wild-type allele is possibly surrounded by relatively few drive alleles when s = 0.7, because the\ndistribution of the position of the last wild-type allele (light blue) falls beyond the distribution of the\nlast site with more than N = 100 alleles (Figure 5(b)). Note that deterministic distance ℓ(between\nthe red and blue distributions) accounts for most of the variation when s decreases, while stochastic\ndistance LN\n1\n(between the light blue and blue distributions) remains similar.\nHere, the value of N is quite arbitrary, but it has little influence on the mathematical argument.\nOur conclusions will be mainly qualitative, as we are lacking analytical predictions, in particular about\nthe stochastic part LN\n1 .\n(a) K = 108, s = 0.3\n(b) K = 108, s = 0.7\nFigure 5: Relative positions of the last spatial site with more than 100 drive alleles at the back of the\nwave (in red), the last spatial site with more than 100 wild-type alleles at the back of the wave (in blue)\nand the last wild-type allele at the back of the wave (in light blue). We collected these positions at 2000\ndifferent time points during the simulation to plot these histograms. We arbitrary set the last spatial\nsite with more than 100 wild-type alleles at the points of abscissa z = 0. The statistical distribution of\nthe last wild-type individuals is highly stochastic in contrast with the two other involving more than 100\nalleles. We also observe that this distribution is not symmetric, indicating rare events of last individuals\ncarrying a wild-type allele being far away at the back of the wave. Note that deterministic distance ℓ\n(between the red and blue distributions) accounts for most of the variation, while stochastic distance\nLN\n1\n(between the light blue and blue distributions) remains similar.\n3.5\nThe deterministic distance ℓ\nIn the deterministic continuous approximation at the back of the wave, the quantity ℓcorresponds to\nthe distance between the two points of abscissa zD and zW such that\nρback\nD\nK exp(λback\nD, cozD ) = ρback\nW\nK exp(λback\nD, cozW ) = N .\n(17)\n10\n\n\nThe factor ρback\nD\n∈(0,1) , resp. ρback\nW\n∈(0,1), is characterized by the shape of the continuous traveling\nwave profile ND , resp. NW . We arbitrary set N so that the continuous profile is accurately approxi-\nmated by an exponential ramp for z < 0, see Figure 4(b). This leads to the following approximation for\nℓwith zD < zW < 0:\nℓ= zW −zD =\n1\nλback\nW, co\nlog\n\u0012\nN\nρback\nW\nK\n\u0013\n−\n1\nλback\nD, co\nlog\n\u0012\nN\nρback\nD\nK\n\u0013\n,\n(18)\nwith the decay exponents λback\nW, co (9b) and λback\nD, co (9b). The next three sections are devoted to the an-\nalytical investigation of the influence of the carrying capacity K , the diffusion coefficient σ2 and the\ndrive fitness cost s on distance ℓ. Figure 6 illustrates numerically distance ℓwith respect to the carrying\ncapacity and the drive fitness cost.\nFigure 6: Distance ℓfor different values of the carrying capacity K and the drive fitness cost s, com-\nputed through deterministic simulations as in [21]. The distance ℓincreases with K and decreases\nwith s.\n3.5.1\nThe deterministic distance ℓis increasing with the carrying capacity K\nThe carrying capacity K influences the height of the spatial profile without changing the slope values\nat the back of the wave (λback\nD, co is independent from K ). From equation (18), we know that distance ℓ\nincreases with respect to the carrying capacity K . More precisely, if the carrying capacity is multiplied\nby a factor 10, then ℓincreases by log(10)\n\n1\nλback\nD, co\n−\n1\nλback\nW, co\n\n. This quantity is strictly positive under\ncondition (16). Note that in case of a coexistence state (excluded from the study), ℓwould not increase\nwith K as λback\nW, co = λback\nD, co.\n3.5.2\nThe deterministic distance ℓis increasing with the diffusion coefficient σ2\nThe influence of the diffusion rate σ2 can be appreciated by noting that λback\nD, co (9b) and λback\nW, co (9b) are\ninversely proportional to σ. Therefore, ℓis proportional to σ (equation (18)) and increases with the\nmigration rate m (Remark 1).\n3.5.3\nThe deterministic distance ℓis decreasing with the drive fitness cost s\nIn this section, we determine the sign of the derivative of ℓ= zW −zD regarding to the drive fitness\ncost s. This part is the most technical one. Indeed, it is not complicated to see that both zW and zD\nare decreasing with respect to the fitness cost s, but establishing the monotonicity of the difference is\nmore involved. We begin with an approximation of ℓto ease the computations:\nℓ=\n\n1\nλback\nW, co\n−\n1\nλback\nD, co\n\nlog\nN\nK\n\n+\n1\nλback\nW, co\nlog\n 1\nρW\n\n−\n1\nλback\nD, co\nlog\n 1\nρD\n\n∼\n\n1\nλback\nW, co\n−\n1\nλback\nD, co\n\nlog\nN\nK\n\n(19)\nas ρW < 1 ≪K /N , and ρD < 1 ≪K /N in logarithmic scale. Below we are going to establish analyti-\ncally that\nd\nd s\n\n1\nλback\nW, co\n−\n1\nλback\nD, co\n\n> 0,\n(20)\n11\n\n\nleading to the conclusion that ℓis decreasing with s in the approximation (19) because log\n\u0000 N\nK\n\u0001\n< 0.\nInstead of comparing the two explicit solutions λback\nD, co and λback\nW, co, we start from the characteristic equa-\ntions satisfied by each component. The following equations can be deduced from (5), and lead to the\nformulas (9), see Section B.1.2 for details.\n0 = σ2(λback\nD, co)2 + v lin\nco λback\nD, co +\n\n(r + 1)(1 −s) −1\n\n,\n(21)\n0 = σ2(λback\nW, co)2 + v lin\nco λback\nW, co +\n\n(r + 1)(1 −sh)(1 −c ) −1\n\n.\n(22)\nFor the sake of simplicity, we introduce a notation for the zeroth order coefficients:\nqD (s) = (r + 1)(1 −s) −1\nand\nqW (s) = (r + 1)(1 −sh)(1 −c ) −1,\n(23)\nand the (common) velocity wave for which we recall the formula:\nv(s) = v lin\nco = 2σ\np\n(1 −sh)(1 + c ) −1.\n(24)\nWe differentiate each equation (21) and (22) with respect to s, and we find:\n0 = σ22λback\nD, co(s)\nd λback\nD, c o\nd s\n(s) + v(s)\nd λback\nD, c o\nd s\n(s) + d v\nd s (s)λback\nD, co(s) + dqD\nd s (s),\n(25)\n0 = σ22λback\nW, co(s)\nd λback\nW, c o\nd s\n(s) + v(s)\nd λback\nW, c o\nd s\n(s) + d v\nd s (s)λback\nW, co(s) + d qW\nd s (s),\n(26)\nfrom which we deduce:\nd\nd s\n\n1\nλback\nD, co\n\n(s) =\nv ′(s)λback\nD, co(s) + q ′\nD (s)\nλback\nD, co(s)2(σ22λback\nD, co(s) + v(s))\n= F\n\u0000q ′\nD ,λback\nD, co\n\u0001\n,\n(27)\nd\nd s\n\n1\nλback\nW, co\n\n(s) =\nv ′(s)λback\nW, co(s) + q ′\nW (s)\nλback\nW, co(s)2(σ22λback\nW, co(s) + v(s))\n= F\n\u0000q ′\nW ,λback\nW, co\n\u0001\n.\n(28)\nWe are going to use the monotonicity properties of F combined with some useful properties about\nqD ,qW and λback\nD, co,λback\nW, co in order to establish the chain of inequalities leading to the result\nF\n\u0000q ′\nD ,λback\nD, co\n\u0001\n< F\n\u0000q ′\nD ,λback\nW, co\n\u0001\n< F\n\u0000q ′\nW ,λback\nW, co\n\u0001\n.\nFirstly, the function F is increasing with respect to the variable λ:\n∂F\n∂λ (q,λ) = v ′λ2(σ22λ + v) −(v ′λ + q ′)(σ26λ2 + 2vλ)\nλ4(σ22λ + v)2\n= −4σ2v ′λ3 −v v ′λ2 −6σ2q ′λ2 −2vq ′λ\nλ4(σ22λ + v)2\n> 0.\n(29)\nIn fact, each term in the above numerator is positive: −v ′(s) > 0 (24), and −q ′(s) > 0, both for q ′\nD and\nq ′\nW (23). When this partial monotonicity is combined with the aforementioned fact that λback\nW, co > λback\nD, co\n(condition (16)), we get that\nF\n\u0000q ′\nD ,λback\nD, co\n\u0001\n< F\n\u0000q ′\nD ,λback\nW, co\n\u0001\n(30)\nSecondly, the function F is clearly increasing with respect to the variable q ′. Moreover, we have q ′\nD (s) =\n−(r + 1) < −(1 −c )h(r + 1) = q ′\nW (s) < 0, because (1 −c )h < 1. Therefore, we can deduce that\nF\n\u0000q ′\nD ,λback\nW, co\n\u0001\n< F\n\u0000q ′\nW ,λback\nD, co\n\u0001\n.\n(31)\nBringing inequalities (30) and (31) together, we obtain:\nd\nd s\n\n1\nλback\nD, co\n\n= F\n\u0000q ′\nD ,λback\nD, co\n\u0001\n< F\n\u0000q ′\nW ,λback\nW, co\n\u0001\n= d\nd s\n\n1\nλback\nW, co\n\n,\n(32)\nfrom which we deduce (20) and the fact that ℓis decreasing with respect to s.\nRemark 3 (Intrinsic fitness vs. fitness cost) In the literature, the intrinsic fitness fD is sometimes con-\nsidered instead of the fitness cost s. The drive intrinsic fitness is the overall ability of drive alleles to\nincrease in frequency when the drive proportion is close to zero. Its value is closely linked with s, and\ngiven by first line of system (2):\nfD = (1 −sh)(1 + c ) −1\n⇐⇒\ns = c −fD\nh(1 + c ).\n(33)\nThe fitness fD and the fitness cost s are in negative relationship, so that any conclusion on the influence\nof s can be immediately transferred to fD.\n12\n\n\n3.6\nThe stochastic distance LN\n1\nWe now consider the position of the last individual carrying a wild-type allele, for which stochastic\neffects are predominant (Figure 5). The aim of this section is to draw a parallel with spatial Galton-\nWatson processes in a fixed frame, for which there exists a mathematical theory – see for instance [27].\nGalton-Watson processes describe a single isolated population in time, based on the assumption\nthat individuals give birth and die independently of each other, and follow the same distribution for\neach of these events. It appears that Galton-Watson processes with migration are very sensitive to\nspatial parameters: as we work on a limited spatial domain, we focus on extinction time instead of\ndistance to the last wild-type allele, less affected by this restriction.\nWe need to verify two assumptions before heuristically reducing our stochastic problem to a spatial\nGalton-Watson process: i) first, the stochastic distance LN\n1\n(L100\n1\nin the following) can be transformed\ninto an extinction time problem and ii) second, the dynamics of the wild-type alleles at the back of\nthe wave can be approximated by a stochastic process of an ideal population consisting of wild-type\nalleles only in a isolated space.\nIn the following, the positions of the last wild-type allele and the extinction times are all computed\nconditionally to the absence of wild-type recolonisation in the global simulation: as we try to charac-\nterise the conditions preventing wild-type recolonisation in a realisable time window, we assume that\nrecolonisation has not happened yet.\n3.6.1\nConverting distances to extinction times\nWe denote by L100\n0\nthe distance between the empty site right on the left of the last wild-type allele, and\nthe last position with more than 100 wild-type alleles at the back of the wave. We have:\nL100\n0\n= L100\n1\n+ d x,\n(34)\nwith d x the size of a spatial step. We also define T 100\n0\nas the time that the last spatial site with more than\n100 wild-type alleles (at the back of the wave) takes to go extinct. As the wave is moving at a constant\nspeed vnum, we ask whether the distance L100\n0\nfollows the same distribution as the time T 100\n0\nmultiplied\nby the speed of the wave (vnum). Figure 7 shows the two distributions for two values of the drive fitness\ncost s = 0.3 and s = 0.7. In both cases, they appear very close from each other, which validates our first\nassumption.\n(a) s = 0.3\n(b) s = 0.7\nFigure 7: Superimposition of the statistical distributions of distance L100\n0\n(in light blue) and extinction\ntime T 100\n0\nmultiplied by the speed of the wave vnum (in light green). These distributions are calculated\nfor K = 108, over 500 different time points. The two distributions are very close for s = 0.3, and for\ns = 0.7. The distribution of L100\n1\n, the relative position of the last wild-type individual is asymmetric,\nlike already observed in Figure 5; this asymmetry is preserved in the distribution of extinction time\nT 100\n0\ntimes speed vnum.\n3.6.2\nFrom a global dynamics to an isolated population\nWe now ask whether the time T 100\n0\n(time that the last spatial site with more than 100 wild-type indi-\nviduals at the back of the wave takes to go extinct) can be approximated by the extinction time T 100\n0 gw\nof a single isolated population modelled with an auxiliary stochastic stepping stone process. We con-\nsider a spatial Galton-Watson process in a fixed domain, where the population is distributed with an\n13\n\n\nexponential spatial profile at initial time. At the back of the wave and in the absence of wild-type re-\ncolonisation, we assume that:\nn t ,x\nD\nn t ,x ∼1 ,\nn t ,x\nW\nn t ,x ≪1 and n t ,x ≪1.\n(35)\nWe know from (3b) that a wild-type allele at the back of the wave produces on average gW(n t ,x\nD\n,n t ,x\nW )\nalleles (in offspring) during one time unit, with\ngW(n t ,x\nD\n,n t ,x\nW ) =\n\nr (1 −n t ,x\nK\n) + 1\n\u0014 n t ,x\nW\nn t ,x + (1 −sh) (1 −c )\nn t ,x\nD\nn t ,x\n\u0015\n≈(r + 1)(1 −sh)(1 −c ),\n(36)\nand disappears on average at rate 1. Thanks to this approximation, the dynamics do not depend on\nnD any more, and we can simulate a single isolated wild-type population. As before, at each time step,\na wild-type allele migrates to the adjacent site on the right with probability m\n2 and to the left with\nprobability m\n2 .\nTo be consistent in the comparison between T 100\n0\n(global dynamics) and T 100\n0 gw (single population\napproximation), we initiate the simulation with the profile exp(z λback\nW, di) approximating the exponential\ndecay of wild-type allele numbers at the back of the wave (Section 2.2.1). We also observe that migra-\ntion from dense areas to less dense areas in the exponential profile plays a major role and significantly\nincreases the extinction time T 100\n0 gw (Appendix C). Thus, we had to consider a large exponential initial\ncondition with a maximum number of individuals per site being 106, to fully capture the wild-type\ndynamics at the end of the wave.\nTo obtain the statistical distribution of T 100\n0 gw, we run the simulation 500 times. In Figure 8, we su-\nperimpose this distribution (multiply by the speed of the wave vnum to obtain a distance) with the\ndistribution of T 100\n0\n(also multiplied by vnum). The histograms are very close for s = 0.3 and s = 0.7: our\nsecond assumption is verified. This result paves the way for further analysis; if one was able to char-\nacterise analytically extinction time T 100\n0 gw of this spatial Galton Watson process, we would also have\nan analytical approximation of distance L100\n0\nand consequently, an analytical condition ensuring the\nabsence of wild-type recolonisation event with high probability in a realisable time window.\n(a) s = 0.3\n(b) s = 0.7\nFigure 8: Superimposition of the statistical distributions of extinction times T 100\n0\n(in light green) and\nT 100\n0 gw (in dark green), multiplied by the speed of the wave vnum to obtain distances. The extinction time\nT 100\n0\nis collected over 500 different time points in the global dynamics, while T 100\n0 gw is obtained running\nthe spatial Galton-Watson process detailed in the main text 500 times. The distribution of T 100\n0 gw (single\npopulation approximation) fits very well the distribution of T 100\n0\n(global dynamics) and the asymmetry\nis again preserved.\n3.7\nNumerical conclusions\nIn Figure 4(g), the probability to observe one wild-type recolonisation event in a realisable time win-\ndow is extremely low when s = 0.3: the furthest away the last individual carrying a wild-type allele\nmight be is a spatial site with more than 104 drive alleles. However, when s = 0.7, this very last position\ncorresponds to a number of drive alleles below 100 (Figure 5 (b), and consequently, a non-negligible\nchance of wild-type recolonisation.\nIn Figure 9, we numerically approximate the probability to observe wild-type recolonisation within\n1000 units of time, for different values of s the drive fitness cost and K the local carrying capacity.\nEach point of the graph is determined by the proportion of replicates where we observe wild-type\n14\n\n\nrecolonisation, over 100 replicates. This probability increases with s and decreases with K . Noticeably\nfor a given local carrying capacity K , the transition between very low (< 10%) and very high (> 90%)\nchances of wild-type recolonisation within 1000 units of time when the fitness cost s varies, is relatively\nrestricted: these two extreme conditions can be reached at two different s values within a range of 0.2.\nFigure 9: Proportion of simulations encountering at least one wild-type recolonisation event within\n1000 units of time, as a function of s, the fitness disadvantage for drive, and K , the carrying capacity\non one spatial step. For each point, we ran 100 simulations. When K = 108, the probability to observe\nwild-type recolonisation over 1000 units of time is close to 0 for s = 0.3, and approximately 0.63 when\ns = 0.7.\n3.8\nComparison with the two-dimensional case\nWe extend the 1D stochastic model to a 2D version, using the same probabilistic framework. Traveling\nwaves now move in multiple directions at the same time, instead of one.\nIn Figure 10, we compare the numerical outcomes for medium versus large carrying capacity (K =\n105 and K = 108), and small versus high fitness cost (s = 0.3 and s = 0.7). Similarly to the one-\ndimensional case, we observe in 2D that the probability of wild-type recolonisation events increases\nwith higher drive fitness cost and smaller carrying capacity. Note that λback\nD, co and λback\nW, co formulas stay\nunchanged in 2D, meaning that all analytical results from Section 3.5 still hold.\nThe main discrepancy between 1D and 2D simulations relies on the fact that rare stochastic events\ntend to happen on average faster in 2D than in 1D, as they can occur in a variety of directions each\ntime. For small drive fitness cost, the probability of wild-type recolonisation event is so low that 1D\nand 2D simulations result in the same outcome of complete extinction (Figure 10(a,b)). However for\nhigher fitness cost, wild-type recolonisation events occur faster in 2D than in 1D (Figure 10(c,d)). Sim-\nilarly, we only observe drive reinvasion event(s) in the 2D simulations within this time window (Fig-\nure 10(c,d)). Additional simulations in line with these observations are shown in Appendix D, with a\nsmaller carrying capacity K = 103.\n15\n\n\n(a) K = 108,s = 0.3\n(b) K = 105,s = 0.3\n(c) K = 108,s = 0.7\n(d) K = 105,s = 0.7\nFigure 10: Comparison between the 1D and the 2D stochastic models, using the same numerical\nframework, with drive fitness cost s = 0.3 or s = 0.7 and carrying capacity K = 103 ou K = 105. Wild-\ntype alleles are shown in blue and drive alleles in red. In 1D, the y-axis represents the number of alleles,\nwhile in 2D, the number of alleles is shown in shades of colour: the darker the colour, the more alleles\nof the corresponding type on the spatial site. For small drive fitness cost s = 0.3, both 1D and 2D sim-\nulations show similar outcomes, i.e. the full eradication of the population. For high drive fitness cost\ns = 0.7, the system is more sensitive to wild-type recolonisation events. The 2D domain amplifies this\ndiscrepancy: it facilitates the emergence of rare events as they can occur in a variety of directions each\ntime. As expected, a larger carrying capacity reduces the stochasticity and consequently the probabil-\nity of wild-type recolonisation event, both in 1D and 2D.\n3.9\nFrom wild-type recolonisation events to chasing dynamics\nTo ensure eradication in the vast majority of cases, we focus in this paper on a condition under which\nwild-type recolonisation is highly unlikely. However, eradication also seems plausible after a wild-type\n16\n\n\nrecolonisation event followed by several drive reinvasion events, as observed in Figure 10(d) 2D. In this\nsection, we briefly explore the drive reinvasion dynamics, and whether they could eventually result in\nthe eradication of the population.\nWe first introduce the three-step cycle underlying chasing dynamics (Figure 11). The cycle is com-\nposed of a wild-type stochastic recolonisation event (A) occurring with probability pA ∈(0,1), a drive\nstochastic reinvasion event (B) occurring with probability pB ∈(0,1), and the eradication following the\ndrive (re)invasion (C) occurring with probability pC = 1 under Condition (14). If pA ≫pB, we would\nexpect a full wild-type recolonisation, whereas if pB ≫pA, we would expect the population to be fully\neradicated. Infinite chasing dynamics might emerge when pA and pB get closer.\nFigure 11: Illustration of the the three-step cycle underlying chasing dynamics. Wild-type recoloni-\nsation event (A) and drive reinvasion event (B) are stochastic events occurring with probabilities\npA,pB ∈(0,1), while the eradication following the drive (re)invasion (C) occurs with probability pC = 1\nunder Condition (14). If pA ≫pB, we would expect a full wild-type recolonisation, whereas if pB ≫pA,\nwe would expect the population to be fully eradicated. Infinite chasing dynamics might emerge when\npA and pB get closer.\nTo explore the probability of drive reinvasion pB, we position ourselves in time when the wild-type\nrecolonisation wave is already formed behind the drive eradication wave, as shown in panel (B) from\nFigure 11. The wild-type recolonisation wave travels at speed v WT\nco (given by the second line of system\n(2) with nD = 0) while the drive eradication wave travels at speed vco (see Section 2.1.2):\nv WT\nco = 2pr\nand\nvco = 2\np\n(1 −sh)(1 + c ) −1,\n(37)\nwith r the intrinsic growth rate. If v WT\nco is small enough compared to vco, drive reinvasion events are\nunlikely to occur as the two waves increasingly move apart (illustration in Figure 1(b)).\nThe eradication final state observed in Figure 10(d) 2D seems to result from a relatively higher\nprobability of drive reinvasion compare to the probability of wild-type recolonisation (pB ≫pA). To\nconfirm this intuition, we try to reverse the dynamics by artificially reducing the value of r : by slow-\ning down the wild-type recolonisation wave (v WT\nco decreases), we would reduce the probability of drive\nreinvasion. We choose r = 0.02 instead of r = 1, changing the value of v WT\nco from approximately 0.632\nto 0.283, and plot the comparison in Figure 12. The value of vco stays unchanged, approximately 1.213\n(with s = 0.7, and c and h given in Table 2). As expected when r = 0.02, the wild-type wave remains far\nbehind the drive eradication wave, disabling drive reinvasion events and we witness a full wild-type\nrecolonisation (Figure 12(a)). Several other cases have been investigated in Appendix E, all supporting\nthis intuition.\n17\n\n\n(a) r = 0.02\n(b) r = 0.1\nFigure 12: Comparison of 2D numerical simulations for two different values of the intrinsic growth\nrate r = 0.02 or 0.1, with carrying capacity K = 105 and drive fitness cost s = 0.7. The case r = 0.1\ncorresponds to Figure 10(d). On one hand, when r = 0.02, the wild-type wave remains far behind the\ndrive eradication wave, disabling drive reinvasion events; we witness a full wild-type recolonisation.\nOn the other hand, when r = 0.1, the wild-type recolonisation event is shortly followed by at least three\ndrive reinvasion events, which lead to the complete eradication of the population.\n4\nDiscussion\nGiven both the promise and risk of eradication drives, their dynamics are worthy of careful examina-\ntion. In this work, we introduced a theoretical framework to characterise the conditions leading to\nsuccessful extinction of a population targeted by an eradication gene drive. We sought to delimit the\nconditions for the absence of wild-type recolonisation in a pulled drive eradication wave in a realis-\nable time window. More precisely, we considered that if the last individual carrying a wild-type allele is\nsurrounded by a large number of drive individuals (set to N = 100 alleles in this work) then wild-type\nrecolonisation is very unlikely. To attest if this is the case, we determined the distance between the last\nindividual carrying a wild-type allele and the last spatial site with more than 100 drive alleles, at the\nback of the wave. This value is not straightforward to find, so we proceeded in two steps.\nFirst, we determined the distance ℓbetween the drive and the wild-type wave at the level line cor-\nresponding to 100 alleles. This distance is almost deterministic, as we chose N = 100 large enough for\nstochastic fluctuations to be negligible. We deduced this distance from a deterministic simulation and\nanalytically proved that it increases with the carrying capacity K , increases with the migration rate m\nand decreases with the drive fitness cost s. We also found that if the carrying capacity K is multiplied\nby a factor 10, the distance ℓincreases by\n\u0010\n1\nλback\nD, di −\n1\nλback\nW, di\n\u0011\nlog(10), with λback\nD, di, resp. λback\nW, di, the exponent\nof the exponential profile at the back of the drive, resp. wild-type, wave. All these analytical results still\nhold in 2D.\nSecond, we determined the distance L100\n1\nbetween the position of the last wild-type allele and the\nlast position with more than 100 wild-type alleles. This distance highly depends on the stochastic fluc-\ntuations of the last individual, and its distribution is difficult to characterise. To simplify the problem,\nwe considered an isolated wild-type population, and we reduced heuristically the distance distribution\nto an extinction time distribution of a spatial Galton-Watson process, with the appropriate initialisa-\ntion. Multiplying this time by the speed of the wave, we obtained a good approximation of the distance\nL100\n1\n. We leave open the quality of this approximation in mathematical terms, as well as the analysis of\nthe distribution of the extinction time.\nCombining the two distances ℓand L100\n1\nallowed us to determine precisely the conditions under\nwhich wild-type recolonisation is highly unlikely. Numerically, we observed that distance L100\n1\nshows\nlittle variation, indicating that most of the variation is due to the distance ℓ, which varies inversely with\nthe probability of wild-type recolonisation. The larger the carrying capacity is, the fewer recolonisation\nevents we observe numerically. And the fitter the drive, the smaller the chance of wild-type recoloni-\nsation, in agreement with the results obtained in [12]. Noticeably in our study, the transition between\nvery low (< 10%) and very high (> 90%) chances of wild-type recolonisation when the drive fitness cost\nvaries is relatively restricted: for s the drive fitness cost varying between 0 (no drive fitness cost) and\n1 (no possible survival for drive individuals), this happens within a range of 0.2. Focusing on the drive\n18\n\n\nintrinsic fitness, i.e. the overall ability of drive to increase in frequency when the drive proportion is\nclose to zero, we agree on the observations made by [19]: the fitter the drive, the sharper the drive wave\nat the front (9a), and the faster the speed (8) as initially showed in [28]. In contrast at the back of the\nwave, the fitter the drive, the wider the drive wave, reducing the risk of wild-type recolonisation (see\nSection 3.5.3). We also demonstrated that if we consider the same migration rate for all genotypes,\nhigh migration rates would reduce the chance of wild-type recolonisation. This result is in agreement\nwith the numerical observations made in [12, 19].\nThe outcomes of our 2D simulations are consistent with our 1D conclusions: the probability of\nwild-type recolonisation events increases with higher drive fitness cost and smaller carrying capacity.\nNevertheless, we observe that stochastic events (both wild-type recolonisation and drive reinvasion\nevents) emerge in average more frequently in 2D than in 1D, leading to faster dynamics. This is due to\nthe fact that stochastic events can occur in a variety of directions each time in 2D, instead of only one\nin 1D.\nFinally, we explored the drive reinvasion dynamics after one (or a few) hypothetical wild-type re-\ncolonisation event(s). We demonstrated that the probability of drive reinvasion depends on the speed\nof both the wild-type recolonizing wave and the drive eradication wave, and decreases with smaller\nvalues of the intrinsic growth rate r . If the probability of drive reinvasion is way higher than the prob-\nability of wild-type recolonisation, we expect the population to go extinct.\nThe models that we used in this study are generalist: they could be applied to different species\nand gene drive constructs. They provide general conclusions but also come with necessary simplifi-\ncations. For instance, we assumed a uniform landscape with random movement, which is extremely\nrare in the wild. Realistic migration patterns over both small and large scales would need to be taken\ninto account to obtain better predictions. In mosquito populations, gene drive propagation can be\naccelerated by long distance migrations: mosquitoes can benefit from fast air currents (transporting\nthem for hundreds of kilometres in a few hours) [29–31] or human-based modes of travel such as cars\n[32] or planes [33]. This could make it easier for wild-type individuals to permeate the drive wave, and\ninitiate the recolonisation of empty areas.\nA variety of other ecological parameters must also be taken into account before any field release.\nA previous study showed that the presence of a competing species or predator in the ecosystem could\nmake eradication substantially easier than anticipated and prevent wild-type recolonisation [17]. The\nlife cycle of the species, the survival characteristics, the mating system, the ecological differences be-\ntween males and females, the seasonal population fluctuations are all biological characteristics that\nmight also influence outcomes.\nThe type of gene drive constructs might also bias our prediction depending on how the fitness\ndisadvantage impacts the individual (in our model, it impacts the birth rate) and the possible emerging\nresistances that might alter the gene conversion ability of the drive (we consider a constant conversion\nrate c ) [1, 34–36].\nBecause of its generic nature, our model cannot be used directly for risk assessment, but informs,\nqualitatively, on the potential failure of an eradication drive.\n19\n\n\nAppendix\nA\nImplementation of the stochastic model\n1 ###\nInitialization\n2\n3 # Number of\nindividuals\nin each\nspatial\nsite\n4 nD = np.zeros(nb_sites).astype(int);\nnD[: nb_sites //2] = K*dx\n# Drive\nindividuals\n5 nW = np.zeros(nb_sites).astype(int);\nnW[nb_sites //2:] = K*dx\n# Wild -type\nindividuals\n6 # Fecundity\n7 fD = np.zeros(nb_sites)\n# Drive\nfecundity\n8 fW = np.zeros(nb_sites)\n# Wild -type\nfecundity\n9\n10\n11 ###\nEvolution\nin time\n12\n13 for t in np.arange (0, T, dt):\n14\n15\n### Stop\nthe\nsimulation\nif the\nwave\ngoes\noutside\nthe\nwindow\n16\n17\nif np.where(nD== max(nD))[0][0] > len(nD) -10 :\n18\nprint(\"t =\",t)\n19\nbreak\n20\n21\n### Birth\nand\nDeath\n22\n23\n# Index\nfor\nempty\nand non\nempty\nsites\n24\nextinct_index = np.where(nD+nW ==0) [0]\n25\nsurvive_index = np.delete(np.arange(nb_sites), extinct_index )\n26\n# Fecundity\nfor non\nempty\nsites\n27\nsv_pop = nD[ survive_index ] + nW[ survive_index ]\n28\nsv_nD = nD[ survive_index ]; sv_nW = nW[ survive_index ]\n29\nfD[ survive_index ] = ( 1+r*(1- sv_pop /(K*dx)) ) * ( (1-s)*sv_nD + (1-s*h)\n*(1+c)*sv_nW ) /sv_pop\n30\nfW[ survive_index ] = ( 1+r*(1- sv_pop /(K*dx)) ) * ( (1-c)*(1-s*h)*sv_nD +\nsv_nW ) /sv_pop\n31\n# For\nempty\nsites , the\nfecundity\nis 0.\n32\nfD[ extinct_index ] = 0\n33\nfW[ extinct_index ] = 0\n34\n# Add\nbirths\nand\nsubstract\ndeaths (mortality = 1)\n35\nnD = nD + np.random.poisson(fD*nD*dt) - np.random.poisson(nD*dt)\n36\nnW = nW + np.random.poisson(fW*nW*dt) - np.random.poisson(nW*dt)\n37\n# Transform\nnegative\nnumber of\nindividuals\ninto 0\n38\nnD[np.where(nD <0) [0]]=0\n39\nnW[np.where(nW <0) [0]]=0\n40\n41\n42\n###\nMigration\n43\n44\n# Number of\nmigrants\nin each\nsite\n45\nnD_mig = np.random.binomial(nD ,m)\n46\nnW_mig = np.random.binomial(nW ,m)\n47\n# Half\nmigrate\nto the right , half to the\nleft\n48\nnD_mig_left = np.random.binomial(nD_mig ,0.5); nD_mig_right = nD_mig -\nnD_mig_left\n49\nnW_mig_left = np.random.binomial(nW_mig ,0.5); nW_mig_right = nW_mig -\nnW_mig_left\n50\n# Substract\nthe\nmigrants\nleaving\n51\nnD\n-= nD_mig\n52\nnW\n-= nW_mig\n53\n# ...\nexcept\nfor\nthose\ngoing\noutside\nthe\nwindows (they\nstay in the\nborder\nsite)\n54\nnD[0] +=\nnD_mig_left [0]; nW [0] +=\nnW_mig_left [0]\n55\nnD[-1] +=\nnD_mig_right [ -1]; nW[-1] +=\nnW_mig_right [-1]\n56\n# Add the\nmigrants\nin the\nneighboor\nsites\n57\nnD [1:] +=\nnD_mig_right [: -1]; nW [1:] +=\nnW_mig_right [: -1]\n58\nnD[: -1] +=\nnD_mig_left [1:]; nW[: -1] +=\nnW_mig_left [1:]\n20\n\n\nB\nSpeed and exponential approximations of the wave\nB.1\nContinuous model\nSince the wave is pulled, we deduce the speed vco and the exponential approximations at the back and\nat the front of the wave from system (5) as detailed in the following sections.\nB.1.1\nAt the front of the wave\nAt the front of the wave, we assume that:\nND\nN ≪1 ,\nNW\nN ∼1 and N ∼1.\n(38)\nCombined with system (5), we know the solution of equation (39) is an approximation of ND at the\nfront of the wave:\n0 = σ2N ′′\nD + vcoN ′\nD + ND\n\n(1 −sh) (1 + c ) −1\n\n.\n(39)\nSince the wave is pulled, the speed vco is given by the minimal speed v lin\nco of the problem linearised\nat low drive allele numbers at the front of the wave. We approximate the decreasing drive section at\nthe front of the wave by an exponential function of the form ND(z) ≈ρ\nf r ont\nD\nexp(λfront\nD, coz):\n0 = σ2(λfront\nD, co)2 + vco λfront\nD, co +\n\n(1 −sh) (1 + c ) −1\n\n,\n(40)\nwith the determinant ∆= (vco)2 −4σ2\n(1−sh) (1+c )−1\n\n. The minimal speed v lin\nco is given by ∆= 0,\nthus:\nv lin\nco = 2σ\np\n(1 −sh)(1 + c ) −1,\n(41)\nand the corresponding exponent is given by:\nλfront\nD, co = −\nv lin\nco\n2σ2 = −1\nσ\np\n(1 −sh)(1 + c ) −1.\n(42)\nThe quantity (1−sh)(1+ c )−1 is always strictly positive for a pulled wave in case of drive invasion\n[21].\nB.1.2\nAt the back of the wave\nAt the back of the wave, we assume that:\nND\nN ∼1 ,\nNW\nN ≪1 and N ≪1.\n(43)\nBy definition of a traveling wave, the speed at the front and at the back of the wave is equal.\nDrive increasing section\nUsing (43) in system (5), we know the solution of the following equation (44) is an approximation of\nND at the back of the wave:\n0 = σ2N ′′\nD + v lin\nco N ′\nD + ND\n\n(r + 1)(1 −s) −1\n\n.\n(44)\nWe approximate the increasing drive section at the back of the wave by an exponential function of\nthe form ND(z) ≈ρback\nD\nexp(λback\nD, coz) and deduce from (44):\n0 = σ2(λback\nD, co)2 + v lin\nco λback\nD, co +\n\n(r + 1)(1 −s) −1\n\nr.\n(45)\nThe solutions are given by:\n{λback\nD, co}+,−= 1\n2σ2\n\n−v lin\nco ±\nr\n(v lin\nco )2 −4σ2\n\n(r + 1)(1 −s) −1\n \n,\n= 1\n2σ2\n\n−2σ\np\n(1 −sh)(1 + c ) −1 ±\nr\n4σ2\n\n(1 −sh)(1 + c ) −1\n\n−4σ2\n\n(r + 1)(1 −s) −1\n \n,\n= 1\nσ\n\n−\np\n(1 −sh)(1 + c ) −1 ±\np\n(1 −sh)(1 + c ) −1 + 1 −(r + 1)(1 −s)\n(46)\n21\n\n\nSince we study an eradication drive, we have r <\ns\n1 −s ⇐⇒1 −(r + 1)(1 −s) > 0 [21]. Therefore,\nthe two solutions of (46) are of opposite sign. At the back of the wave, the number of drive individuals\ntends to zero when z →−∞therefore we only conserve the positive solution of (46).\nλback\nD, co = 1\nσ\n\n−\np\n(1 −sh)(1 + c ) −1 +\np\n(1 −sh)(1 + c ) −(r + 1)(1 −s)\n\n.\n(47)\nWild-type increasing section\nUsing (43) in system (5), we know the solution of the following equation (48) is an approximation of\nNW at the back of the wave:\n0 = σ2N ′′\nW + vN ′\nW + NW\n\n(r + 1)(1 −sh)(1 −c ) −1\n\n.\n(48)\nWe approximate the increasing wild-type section at the back of the wave by an exponential function\nof the form NW(z) ≈ρback\nW\nexp(λback\nW, coz) and deduce from (48):\n0 = σ2(λback\nW, co)2 + v lin\nco λback\nW, co +\n\n(r + 1)(1 −sh)(1 −c ) −1\n\n.\n(49)\nThe solutions are given by:\n1\n2σ2\n\n−v lin\nco ±\nr\n(v lin\nco )2 −4σ2\n\n(r + 1)(1 −sh)(1 −c ) −1\n \n,\n= 1\n2σ2\n\n−2σ\np\n(1 −sh)(1 + c ) −1 ±\nr\n4σ2\n\n(1 −sh)(1 + c ) −1\n\n−4σ2\n\n(r + 1)(1 −sh)(1 −c ) −1\n \n,\n= 1\nσ\n\n−\np\n(1 −sh)(1 + c ) −1 ±\np\n(1 −sh)(1 + c ) −1 + 1 −(r + 1)(1 −sh)(1 −c )\n\n.\n(50)\nSince we study an eradication drive, we have r <\ns\n1 −s ⇐⇒r + 1 <\n1\n1 −s [21] and therefore :\n(r + 1)(1 −sh)(1 −c ) < 1 −sh\n1 −s (1 −c ) < 1 −c < 1\n(51)\nThe two solutions of (50) are of opposite sign. At the back of the wave, the number of wild-type\nindividuals tends to zero when z →−∞: we only conserve the positive solution of (50).\nλback\nW, co = 1\nσ\n\n−\np\n(1 −sh)(1 + c ) −1 +\np\n(1 −sh)(1 + c ) −(r + 1)(1 −sh)(1 −c )\n\n(52)\nB.2\nDiscrete model\nTo determine the speed of the wave and the exponential approximations in the discrete stochastic\nmodel, we focus on the mean dynamics. For drive alleles, we have:\n\n\n\n\n\nn t + d t\n2 ,x\nD\n=\n\n(gD(n t ,x\nD ,n t ,x\nW ) −1) d t + 1\n\nn t ,x\nD ,\nn t +d t ,x\nD\n= (1 −m) n t + d t\n2 ,x\nD\n+ m\n2 (n t + d t\n2 ,x+d x\nD\n+ n t + d t\n2 ,x−d x\nD\n),\n(53)\nand for wild-type alleles:\n\n\n\n\n\nn t + d t\n2 ,x\nW\n=\n\n(gW(n t ,x\nD ,n t ,x\nW ) −1)d t + 1\n\nn t ,x\nW ,\nn t +d t ,x\nW\n= (1 −m) n t + d t\n2 ,x\nW\n+ m\n2 (n t + d t\n2 ,x+d x\nW\n+ n t + d t\n2 ,x−d x,\nW\n).\n(54)\nwhere the first lines correspond to the birth and death dynamics, and the second lines correspond\nto the migration. Combining the two lines in each system, we obtain:\n22\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nn t +d t ,x\nD\n=\n\n(gD(n t ,x\nD ,n t ,x\nW ) −1) d t + 1\n\n(1 −m) n t ,x\nD\n+\n\n(gD(n t ,x+d x\nD\n,n t ,x+d x\nW\n) −1) d t + 1\n m\n2 n t ,x+d x\nD\n+\n\n(gD(n t ,x−d x\nD\n,n t ,x−d x\nW\n) −1) d t + 1\n m\n2 n t ,x−d x\nD\n,\nn t +d t ,x\nW\n=\n\n(gW(n t ,x\nD ,n t ,x\nW ) −1)d t + 1\n\n(1 −m) n t ,x\nW +\n\n(gW(n t ,x+d x\nD\n,n t ,x+d x\nW\n) −1)d t + 1\n m\n2 n t ,x+d x\nW\n+\n\n(gW(n t ,x−d x\nD\n,n t ,x−d x\nW\n) −1)d t + 1\n m\n2 n t ,x−d x\nW\n.\n(55)\nwith:\ngD(nD,nW) = (r (1 −n) + 1)\n\n(1 −s)\nnD\nn + (1 −sh) (1 + c )\nnW\nn\n\n,\n(56)\ngW(nD,nW) = (r (1 −n) + 1)\n nW\nn + (1 −sh) (1 −c )\nnD\nn\n\n.\n(57)\nThe speed of the wave in the discrete model is denoted vdi.\nB.2.1\nAt the front of the wave\nAt the front of the wave, we assume that:\nn t ,x\nD\nn t ,x ≪1 ,\nn t ,x\nW\nn t ,x ∼1 and n t ,x ∼1.\n(58)\nThese approximations are also true around x, at the spatial sites x +d x and x −d x. Using (58) in\nthe first line of system (55), we know the solution of the following equation (59) is an approximation\nof nD at the front of the wave:\nn t +d t ,x\nD\n= (((1 −sh)(1 + c ) −1) d t + 1)\n\u0010\n(1 −m) n t ,x\nD\n+ m\n2 (n t ,x+d x\nD\n+ n t ,x−d x\nD\n)\n\u0011\n.\n(59)\nIn case of a pulled wave, the speed vdi is given by the minimal speed v lin\ndi of the problem linearised\nat low drive allele numbers at the front of the wave. We approximate the decreasing drive section at\nthe front of the wave by an exponential function of the form n x−vdit\nD\n= N z\nD ≈e λfront\nD, diz , and deduce from\n(59):\ne −λfront\nD, di vdi d t = (((1 −sh)(1 + c ) −1) d t + 1)\n\n1 −m + m e (λfront\nD, di)d x + e −(λfront\nD, di)d x\n2\n\n= (((1 −sh)(1 + c ) −1) d t + 1)\n\u00001 −m + m cosh(λfront\nD, di d x)\n\u0001\n(60)\nThe minimal speed v lin\ndi of the problem linearised at low drive allele numbers is given by:\nv lin\ndi =\nmin\n(−λfront\nD, di)>0\n\nlog\n\u0000\u0002\n((1 −sh)(1 + c ) −1) d t + 1\n\u0003 \u0002\n1 −m + m cosh(λfront\nD, di d x)\n\u0003\u0001\n−λfront\nD, di d t\n\n.\n(61)\nB.2.2\nAt the back of the wave\nNote that if the back of the wave can be defined as z →−∞in the continuous model, it does not make\nsense any more in the discrete model. After a certain spatial site, there is no more individual on the left\ndue to eradication: the exponential approximations do not hold any more. In the discrete stochastic\nmodel, the back of the wave corresponds to the non-empty spatial sites in the early increasing section\nof the wave.\nAt the back of the wave, we have:\nn t ,x\nD\nn t ,x ∼1 ,\nn t ,x\nW\nn t ,x ≪1 and n t ,x ≪1.\n(62)\nThese approximations are also true around x, at the spatial sites x +d x and x −d x. By definition\nof a traveling wave, the speed at the front and at the back of the wave is the same, in our case v lin\ndi .\n23\n\n\nDrive increasing section\nUsing (62) in the first line of system (55), we know the solution of the following equation (63) is an\napproximation of nD at the back of the wave:\nn t +d t ,x\nD\n= (((r + 1)(1 −s) −1) d t + 1)\n\u0010\n(1 −m) n t ,x\nD\n+ m\n2 (n t ,x+d x\nD\n+ n t ,x−d x\nD\n)\n\u0011\n.\n(63)\nWe approximate the increasing drive section at the back of the wave by an exponential function of\nthe form n x−v lin\ndi t\nD\n= N z\nD ≈e λback\nD, diz , and deduce from (63):\ne −λback\nD, di v lin\ndi d t = (((r + 1)(1 −s) −1) d t + 1)\n\u0010\n1 −m + m\n2 (e λback\nD, did x + e −λback\nD, did x )\n\u0011\n.\n(64)\nWe solve equation (64) numerically to obtain the value of λback\nD, di.\nWild-type increasing section\nUsing (62) in the second line of system (55), we know the solution of the following equation (65) is an\napproximation of nW at the back of the wave:\nn t +d t ,x\nW\n= (((r + 1)(1 −sh)(1 −c ) −1)d t + 1)\n\u0010\n(1 −m) n t ,x\nW\n+ m\n2 (n t ,x+d x\nW\n+ n t ,x−d x\nW\n)\n\u0011\n.\n(65)\nWe approximate the increasing drive section at the back of the wave by an exponential function of\nthe form n x−v lin\ndi t\nW\n= N z\nW ≈e λback\nW, diz and deduce from (65):\ne −λback\nW, di v lin\ndi d t = (((r + 1)(1 −sh)(1 −c ) −1) d t + 1)\n\u0010\n1 −m + m\n2 (e λback\nW, did x + e −λback\nW, did x )\n\u0011\n.\n(66)\nWe solve equation (66) numerically to obtain the value of λback\nW, di.\n24\n\n\nC\nInfluence of the migration on the extinction time\nExtinction time T 100\n0 gw is supposed to approximate extinction time T 100\n0\nin a single isolated population\nmodelled with a spatial Galton-Watson process. To be consistent in the comparison, we set the ini-\ntial single population size with an exponential profile exp(z λback\nW, di) approximating the wild-type allele\nnumber at the back of the wave in the global simulation (Section 2.2.1). T 100\n0\nmeasures the time that\nthe last spatial site with more than 100 wild-type individuals at the back of the wave takes to go extinct\nin the global simulation; multiplied by the speed of the wave vnum, it gave us a good approximation\nof distance L100\n1\n(Section 3.6.1). T 100\n0 gw measures the time that the last spatial site with more than 100\nindividuals in the initial exponential decay takes to go extinct in the spatial Galton-Watson simulation.\nThe initial condition being largely heterogeneous (because of the exponential decay), we wonder\nhow migration from dense areas to less dense areas impact the distribution of T 100\n0 gw. More precisely,\nwe focus on how large the exponential initial condition might be for T 100\n0 gw to be a good approximation\nof T 100\n0\n. In Figure 13(a), we crop the initial condition on the right so that the maximum number of\nindividuals in one spatial site (maxini) gradually increases from 103 to 108. In Figure 13(b), we observe\nthat the mean of the distribution T 100\n0 gw, multiplied by the speed vnum to obtain a distance, consequently\nincreases from 2 to 3 time units. Thus, it is very important to consider a large exponential initial con-\ndition to fully capture the wild-type dynamics at the end of the wave.\na1 s = 0.3\na2 s = 0.7\n(a) Initial conditions for the spatial Galton-Watson process, in shades of blue. The exponential profile used to\ninitiate the simulation is cropped at different population size on the right, from 103 to 108, to evaluate the impact\nof migration from dense to less dense areas. The black line with a circle at the top represents the last spatial site\nwith more than 100 individuals in the initial condition. We record the extinction time T 100\n0 gw of this site, and run\nthe simulation 500 times to obtain its statistical distribution. This distribution (multiplied by the speed vnum to\napproximate distance L 100\n1 ) is illustrated in Figure 13(b).\nb1 s = 0.3\nb2 s = 0.7\n(b) Statistical distribution of extinction time T 100\n0 gw, multiplied by the speed vnum (to approximate distance L 100\n1 ).\nWe consider the initial conditions described in Figure 13(a) in shades of blue; each blue corresponds to a different\nspace window in which the maximum number of individuals per site is maxini. We record the time T 100\n0 gw at which\nthe last spatial site with more than 100 individuals in the initial condition goes extinct (definitively). The dashed\nlines are the means values of each histogram.\nFigure 13: Initial conditions and extinction times for the isolated population.\n25\n\n\nD\nComparison with the 2D case, small carrying capacity K = 103\nWe run the same simulations than in Figure 10 except for the carrying capacity that is taken smaller\nK = 103. For small drive fitness cost (s = 0.3), the outcomes stays unchanged: we observe no wild-type\nrecolonisation event and the drive propagation leads to the full eradication of the population both in\n1D and 2D. For large drive fitness cost (s = 0.7), we observe several wild-type recolonisation and drive\nreinvasion events, due to the small carrying capacity value (in comparison, we observe less stochastic\nevents for K = 105 in Figure 10(d)). The stochastic events appear to be more frequent in 2D than in\n1D, similarly to what we observed for K = 105 and K = 108.\n(a) K = 103,s = 0.3\n(b) K = 103,s = 0.7\nFigure 14: Comparison between the 1D and the 2D stochastic models for a small carrying capacity\n(K = 103). Wild-type alleles are shown in blue and drive alleles in red. In 1D, the y-axis represents\nthe number of alleles, while in 2D, the number of alleles is shown in shades of colour: the darker the\ncolour, the more alleles of the corresponding type on the spatial site. For a small carrying capacity\ns = 0.3, we observe no wild-type recolonisation events and the full eradication of the population in\n1D and 2D, similarly to the numerical outcomes obtained with larger carrying capacity (Figure 10(a,\nb)). Note that the drive presence on the first half of the domain, in the earliest 1D snapshot of panel\n(a), is a simulation artefact due to the initial condition (Figure 3). For a large drive fitness cost s =\n0.7, reducing the carrying capacity results in a higher number of wild-type recolonisation and drive\nreinvasion events (in comparison with Figure 10(d)). Once again here, these stochastic events appear\nto be more frequent in 2D than in 1D.\n26\n\n\nE\nExploring chasing dynamics\nWe test various values of intrinsic growth rate r in order to appreciate its influence on the probability\nof drive reinvasion events after a wild-type recolonisation. Both the simulations in 1D (Figure 15) and\nthe simulations in 2D (Figure 16) illustrate the concept described in Section 3.9: as r increases, the\nwild-type recolonisation wave and the drive eradication wave get closer, increasing the probability to\nobserve drive reinvasion events. In the following example, both the wild-type recolonisation proba-\nbility (pA) and the drive reinvasion probability (pB) are high and relatively close for high values of r ,\nwhich leads to infinite chasing dynamics (Figure 15(c) and 16(c)).\n(a) r = 0.05\n(b) r = 0.1\n(c) r = 0.2\nFigure 15: Simulations in 1D for K = 103 and s = 0.7. As the value of r increases, drive reinvasion\nevents are more and more frequent.\n(a) r = 0.02\n(b) r = 0.05\n(c) r = 0.1\nFigure 16: Simulations in 2D for K = 102 and s = 0.3. As the value of r increases, drive reinvasion\nevents are more and more frequent.\n27\n\n\nAcknowledgements\nThis work is funded by ANR-19-CE45-0009-01 TheoGeneDrive. This project has received funding from\nthe European Research Council (ERC) under the European Union’s Horizon 2020 research and inno-\nvation program (grant agreement No 865711).\nReferences\n[1]\nNicolas O. Rode et al. “Population management using gene drive: molecular design, models\nof spread dynamics and assessment of ecological risks”. Conservation Genetics 20.4 (Aug. 1,\n2019), pp. 671–690. ISSN: 1572-9737. DOI: 10.1007/s10592-019-01165-5.\n[2]\nAustin Burt. “Site-specific selfish genes as tools for the control and genetic engineering of natu-\nral populations.” Proceedings of the Royal Society B: Biological Sciences 270.1518 (May 7, 2003),\npp. 921–928. ISSN: 0962-8452. DOI: 10.1098/rspb.2002.2319.\n[3]\nGernot Segelbacher et al. “New developments in the field of genomic technologies and their\nrelevance to conservation management”. Conservation Genetics 23.2 (Apr. 1, 2022), pp. 217–242.\nISSN: 1572-9737. DOI: 10.1007/s10592-021-01415-5.\n[4]\nLuke S. Alphey et al. “Standardizing the definition of gene drive”. Proceedings of the National Academy of Sciences\n117.49 (Dec. 8, 2020). Publisher: Proceedings of the National Academy of Sciences, pp. 30864–\n30867. DOI: 10.1073/pnas.2020417117.\n[5]\nAustin Burt and Andrea Crisanti. “Gene Drive: Evolved and Synthetic”. ACS Chemical Biology\n13.2 (Feb. 16, 2018). Publisher: American Chemical Society, pp. 343–346. ISSN: 1554-8929. DOI:\n10.1021/acschembio.7b01031.\n[6]\nEthan Bier. “Gene drives gaining speed”. Nature Reviews Genetics 23.1 (2022), pp. 5–22.\n[7]\nKyros Kyrou et al. “A CRISPR–Cas9 gene drive targeting doublesex causes complete popula-\ntion suppression in caged Anopheles gambiae mosquitoes”. Nature Biotechnology 36.11 (Nov.\n2018). Number: 11 Publisher: Nature Publishing Group, pp. 1062–1066. ISSN: 1546-1696. DOI:\n10.1038/nbt.4245.\n[8]\nAndrew Hammond et al. “Gene-drive suppression of mosquito populations in large cages as\na bridge between lab and field”. Nature Communications 12.1 (July 28, 2021). Number: 1 Pub-\nlisher: Nature Publishing Group, p. 4589. ISSN: 2041-1723. DOI:10.1038/s41467-021-24790-\n6.\n[9]\nH. Charles J. Godfray, Ace North, and Austin Burt. “How driving endonuclease genes can be used\nto combat pests and disease vectors”. BMC Biology 15.1 (Sept. 11, 2017), p. 81. ISSN: 1741-7007.\nDOI: 10.1186/s12915-017-0420-4.\n[10]\nLéo Girardin and Florence Débarre. “Demographic feedbacks can hamper the spatial spread of\na gene drive”. Journal of Mathematical Biology 83.6 (Dec. 4, 2021), p. 67. ISSN: 1432-1416. DOI:\n10.1007/s00285-021-01702-2.\n[11]\nAce R. North, Austin Burt, and H. Charles J. Godfray. “Modelling the suppression of a malaria vec-\ntor using a CRISPR-Cas9 gene drive to reduce female fertility”. BMC Biology 18 (Aug. 11, 2020),\np. 98. ISSN: 1741-7007. DOI: 10.1186/s12915-020-00834-z.\n[12]\nJackson Champer et al. “Suppression gene drive in continuous space can result in unstable per-\nsistence of both drive and wild-type alleles”. Molecular Ecology 30.4 (Feb. 2021), pp. 1086–1101.\nISSN: 1365-294X. DOI: 10.1111/mec.15788.\n[13]\nJames J Bull, Christopher H Remien, and Stephen M Krone. “Gene-drive-mediated extinction is\nthwarted by population structure and evolution of sib mating”. Evolution, Medicine, and Public Health\n2019.1 (Jan. 1, 2019), pp. 66–81. ISSN: 2050-6201. DOI: 10.1093/emph/eoz014.\n[14]\nAce R. North, Austin Burt, and H. Charles J. Godfray. “Modelling the potential of genetic control\nof malaria mosquitoes at national scale”. BMC Biology 17.1 (Mar. 29, 2019), p. 26. ISSN: 1741-\n7007. DOI: 10.1186/s12915-019-0645-5.\n[15]\nAysegul Birand et al. “Gene drives for vertebrate pest control: Realistic spatial modelling of eradi-\ncation probabilities and times for island mouse populations”. Molecular Ecology 31.6 (Mar. 2022),\npp. 1907–1923. ISSN: 0962-1083. DOI: 10.1111/mec.16361.\n28\n\n\n[16]\nSamuel E Champer et al. “Anopheles homing suppression drive candidates exhibit unexpected\nperformance differences in simulations with spatial structure”. eLife 11 (Oct. 14, 2022). Ed. by\nGeorge H Perry, Sebald ANR Verkuijl, and Jim Bull. Publisher: eLife Sciences Publications, Ltd,\ne79121. ISSN: 2050-084X. DOI: 10.7554/eLife.79121.\n[17]\nYiran Liu et al. “Adversarial interspecies relationships facilitate population suppression by gene\ndrive in spatially explicit models”. Ecology Letters 26.7 (2023), pp. 1174–1185. ISSN: 1461-0248.\nDOI: 10.1111/ele.14232.\n[18]\nYiran Liu and Jackson Champer. “Modelling homing suppression gene drive in haplodiploid or-\nganisms”. Proceedings of the Royal Society B: Biological Sciences 289.1972 (Apr. 13, 2022). Pub-\nlisher: Royal Society, p. 20220320. DOI: 10.1098/rspb.2022.0320.\n[19]\nJeff F. Paril and Ben L. Phillips. “Slow and steady wins the race: spatial and stochastic processes\nand the failure of suppression gene drives”. Molecular Ecology (July 5, 2022), mec.16598. ISSN:\n0962-1083, 1365-294X. DOI: 10.1111/mec.16598.\n[20]\nYutong Zhu and Jackson Champer. “Simulations Reveal High Efficiency and Confinement of a\nPopulation Suppression CRISPR Toxin-Antidote Gene Drive”. ACS Synthetic Biology 12.3 (Mar. 17,\n2023). Publisher: American Chemical Society, pp. 809–819. DOI:10.1021/acssynbio.2c00611.\n[21]\nLéna Kläy et al. “Pulled, pushed or failed: the demographic impact of a gene drive can change\nthe nature of its spatial spread”. Journal of Mathematical Biology 87.2 (July 16, 2023), p. 30. ISSN:\n1432-1416. DOI: 10.1007/s00285-023-01926-4.\n[22]\nJames D Murray. Mathematical biology: I. An introduction. Vol. 17. Springer Science & Business\nMedia, 2007.\n[23]\nEric Brunet and Bernard Derrida. “Shift in the velocity of a front due to a cutoff”. Physical Review E\n56.3 (Sept. 1, 1997). Publisher: American Physical Society, pp. 2597–2604. DOI:10.1103/PhysRevE.\n56.2597.\n[24]\nÉric Brunet and Bernard Derrida. “Effect of Microscopic Noise on Front Propagation”. Journal of Statistical Physics\n103.1 (Apr. 1, 2001), pp. 269–282. ISSN: 1572-9613. DOI: 10.1023/A:1004875804376.\n[25]\nJean Bérard and Jean-Baptiste Gouéré. “Brunet-Derrida Behavior of Branching-Selection Parti-\ncle Systems on the Line”. Communications in Mathematical Physics 298.2 (Sept. 1, 2010), pp. 323–\n342. ISSN: 1432-0916. DOI: 10.1007/s00220-010-1067-y.\n[26]\nCarl Mueller, Leonid Mytnik, and Jeremy Quastel. “Effect of noise on front propagation in reaction-\ndiffusion equations of KPP type”. Inventiones mathematicae 184.2 (May 1, 2011), pp. 405–453.\nISSN: 1432-1297. DOI: 10.1007/s00222-010-0292-5.\n[27]\nDaniela Bertacchi and Fabio Zucca. Recent results on branching random walks. May 4, 2018. DOI:\n10.48550/arXiv.1104.5085. arXiv: 1104.5085[math].\n[28]\nR. A. Fisher. “The Wave of Advance of Advantageous Genes”. Annals of Eugenics 7.4 (1937). _eprint:\nhttps://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1469-1809.1937.tb02153.x, pp. 355–369. ISSN:\n2050-1439. DOI: 10.1111/j.1469-1809.1937.tb02153.x.\n[29]\nJason W. Chapman, V. Alistair Drake, and Don R. Reynolds. “Recent Insights from Radar Studies\nof Insect Flight”. Annual Review of Entomology 56.1 (2011). _eprint: https://doi.org/10.1146/annurev-\nento-120709-144820, pp. 337–356. DOI: 10.1146/annurev-ento-120709-144820.\n[30]\nGao Hu et al. “Mass seasonal bioflows of high-flying insect migrants”. Science 354.6319 (Dec. 23,\n2016). Publisher: American Association for the Advancement of Science, pp. 1584–1587. DOI:\n10.1126/science.aah4379.\n[31]\nDiana L. Huestis et al. “Windborne long-distance migration of malaria mosquitoes in the Sahel”.\nNature 574.7778 (Oct. 2019). Number: 7778 Publisher: Nature Publishing Group, pp. 404–408.\nISSN: 1476-4687. DOI: 10.1038/s41586-019-1622-4.\n[32]\nAndrea Egizi et al. “The hitchhiker’s guide to becoming invasive: exotic mosquitoes spread across\na US state by human transport not autonomous flight”. Molecular Ecology 25.13 (2016). _eprint:\nhttps://onlinelibrary.wiley.com/doi/pdf/10.1111/mec.13653, pp. 3033–3047. ISSN: 1365-294X.\nDOI: 10.1111/mec.13653.\n[33]\nRoger Eritja et al. “Direct Evidence of Adult Aedes albopictus Dispersal by Car”. Scientific Reports\n7.1 (Oct. 24, 2017), p. 14399. ISSN: 2045-2322. DOI: 10.1038/s41598-017-12652-5.\n[34]\nAndrea K. Beaghton et al. “Gene drive for population genetic control: non-functional resistance\nand parental effects”. Proceedings of the Royal Society B: Biological Sciences 286.1914 (Oct. 30,\n2019). Publisher: Royal Society, p. 20191586. DOI: 10.1098/rspb.2019.1586.\n29\n\n\n[35]\nAndrew M. Hammond et al. “The creation and selection of mutations resistant to a gene drive\nover multiple generations in the malaria mosquito”. PLOS Genetics 13.10 (Oct. 4, 2017). Pub-\nlisher: Public Library of Science, e1007039. ISSN: 1553-7404. DOI: 10.1371/journal.pgen.\n1007039.\n[36]\nTom A. R. Price et al. “Resistance to natural and synthetic gene drive systems”. Journal of Evolutionary Biology\n33.10 (Oct. 1, 2020), pp. 1345–1360. ISSN: 1010-061X. DOI: 10.1111/jeb.13693.\n30\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21268v1.pdf",
    "total_pages": 30,
    "title": "Stochastic dynamics at the back of a gene drive propagation wave",
    "authors": [
      "Léna Kläy",
      "Léo Girardin",
      "Florence Débarre",
      "Vincent Calvez"
    ],
    "abstract": "Gene drive alleles bias their own inheritance to offspring. They can fix in a\nwild-type population in spite of a fitness cost, and even lead to the\neradication of the target population if the fitness cost is high. However, this\noutcome may be prevented or delayed if areas previously cleared by the drive\nare recolonised by wild-type individuals. Here, we investigate the conditions\nunder which these stochastic wild-type recolonisation events are likely and\nwhen they are unlikely to occur in one spatial dimension. More precisely, we\nexamine the conditions ensuring that the last individual carrying a wild-type\nallele is surrounded by a large enough number of drive homozygous individuals,\nresulting in a very low chance of wild-type recolonisation. To do so, we make a\ndeterministic approximation of the distribution of drive alleles within the\nwave, and we split the distribution of wild-type alleles into a deterministic\npart and a stochastic part. Our analytical and numerical results suggest that\nthe probability of wild-type recolonisation events increases with lower fitness\nof drive individuals, with smaller migration rate, and also with smaller local\ncarrying capacity. Numerical simulations show that these results extend to two\nspatial dimensions. We also demonstrate that, if a wild-type recolonisation\nevent were to occur, the probability of a following drive reinvasion event\ndecreases with smaller values of the intrinsic growth rate of the population.\nOverall, our study paves the way for further analysis of wild-type\nrecolonisation at the back of eradication traveling waves.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}