{
  "id": "arxiv_2502.21209v1",
  "text": "End-to-End Deep Learning in Phase Noisy\nCoherent Optical Link\nOmar Alnaseri∗, Senior Member, IEEE and Yassine Himeur§, Senior Member, IEEE\n∗Electrical Engineering Department, DHBW Cooperative State University, Ravensburg, Germany,\nEmail: alnaseri.omar@dozent.dhbw-ravensburg.de\n§College of Engineering and Information Technology, University of Dubai, Dubai, United Arab Emirates,\nEmail: yhimeur@ud.ac.ae\nAbstract—In coherent optical orthogonal frequency-division\nmultiplexing (CO-OFDM) fiber communications, a novel end-\nto-end learning framework to mitigate Laser Phase Noise (LPN)\nimpairments is proposed in this paper. Inspired by Autoencoder\n(AE) principles, the proposed approach trains a model to learn\nrobust symbol sequences capable of combat LPN, even from low-\ncost distributed feedback (DFB) lasers with linewidths up to 2\nMHz. This allows for the use of high-level modulation formats\nand large-scale Fast Fourier Transform (FFT) processing, maxi-\nmizing spectral efficiency in CO-OFDM systems. By eliminating\nthe need for complex traditional techniques, this approach offers\na potentially more efficient and streamlined solution for CO-\nOFDM systems. The most significant achievement of this study\nis the demonstration that the proposed AE-based model can\nenhance system performance by reducing the bit error rate (BER)\nto below the threshold of forward error correction (FEC), even\nunder severe phase noise conditions, thus proving its effectiveness\nand efficiency in practical deployment scenarios.\nIndex Terms—Fiber optics communications, CO-OFDM, deep\nneural network, laser phase noise, autoencoder\nI. INTRODUCTION\nCoherent Optical Orthogonal Frequency-Division Multi-\nplexing (CO-OFDM) is a leading technology for long-haul\nfiber transmission [1]. This is due to its superior capability to\nmitigate Polarization-Mode Dispersion (PMD) and Chromatic\nDispersion (CD), while maintaining high spectral utilization\n[2], [3]. However, the performance of CO-OFDM systems can\nbe severely affected by Laser Phase Noise (LPN), particularly\nwhen employing advanced modulation schemes and large-\nscale Fast Fourier Transform (FFT) processing. To address\nthese challenges, various advancements have been made in\nCarrier Phase Recovery (CPR) techniques, particularly in the\nareas of pilot symbol design and estimation algorithms [4].\nFor instance, [5] and [6] introduced a novel feedforward\ncarrier recovery algorithm designed for M-ary Quadrature Am-\nplitude Modulation (M-QAM) constellations in an coherent\noptical receiver. The algorithm stands out because it does not\nutilize any feedback loop, making it exceptional resilience to\nLPN. This characteristic is especially beneficial when employ-\ning higher-level QAM constellations. Further advancing these\nmethods, [7] proposed a residual carrier modulation technique\nthat enables efficient recovery of both carrier frequency and\nphase. This innovative approach improves the bit rate by\n41%, surpassing conventional time-domain pilot techniques,\nthis approach sets a new record for the product of laser\nlinewidth and symbol duration. The scheme is particularly\nadvantageous for MHz linewidth Distributed Feedback (DFB)\nlasers, which are commonly used in affordable coherent optical\ncommunications.\nBuilding on this foundation, [8] explored various blind\nphase noise detection methods for CO-OFDM transmission,\nintroducing a decision-direct-free method with a testing pro-\ncess consisting of three phases. This method demonstrates\nsimilar performance to conventional techniques but with re-\nduced complexity. Additionally, the researchers proposed a\nnovel cost function aimed at enhancing the efficiency of phase\nnoise compensation.\nDespite these innovations, RF pilot tones remain a popular\napproach for mitigating LPN. In [9], the performance of a\nsystem employed an RF-pilot-based method for mitigation\nLPN was compared to the traditional common-phase error\nmethod. The results showed that the RF-pilot-based scheme\nsignificantly enhances the tolerable laser linewidth. For ex-\nample, in a 112-Gb/s transmission, the laser linewidth toler-\nance was ten times higher than that of traditional common-\nphase error compensation methods. Furthermore, [10] and\n[11] proposed a Sub-carrier-Index Modulation OFDM (SIM-\nOFDM) employing the RF-pilot, which combats both LPN\nand fiber nonlinearities in CO-OFDM transmission with a\nlarge-scale FFT of 1024 and 16-QAM modulation form. SIM-\nOFDM revealed a higher tolerance to LPN than conventional\nCO-OFDM and achieves better performance in terms of Bit\nError Rate (BER) and optical Signal-to-Noise Ratio (OSNR)\ncompared to techniques like self-cancellation and Partial Car-\nrier Filling (PCF). Moreover, [12] investigated the correlation\nbetween phase noise in the symbol domain of Discrete Fourier\nTransform (DFT)-Spread CO-OFDM transmission and its ef-\nfects in the time domain. The study proposed a DFT-Spread\nOFDM-based phase noise compensation method, specifically\ndesigned for higher-level QAM transmission with large-scale\nFFT processing. The simulation of a dual polarization CO-\nOFDM system with 64-QAM over 80 km illustrated the effec-\ntive of using PNC in mitigating Inter-Carrier Interference (ICI)\ninduced by LPN. The findings suggest that the PNC scheme\nimproves laser linewidth tolerance in CO-OFDM transmission,\nProviding a promising solution for short-distance, high bit rate,\nand high-level QAM coherent transmission.\nWhile traditional methods continue to dominate commu-\narXiv:2502.21209v1  [eess.SP]  28 Feb 2025\n\n\nFig. 1. AE end-to-end learning structure\nnication systems, they typically rely on a chain of separate\ntransmitter and receiver signal processing blocks [13]. This\nsegmented approach often leads to sub-optimal module per-\nformance, ultimately limiting the achievable information rates\n[14]. In contrast, Deep Learning (DL)-based communication\nsystems, which are inspired by Autoencoder (AE) architec-\ntures, have garnered significant attention in recent years [15],\n[16]. These systems offer the potential to optimize end-to-\nend communication performance by leveraging the ability of\ndeep learning models to learn robust latent representations.\nSpecifically, AEs can effectively capture the characteristics of\nthe communication channel, as well as the impacts of noise\nand interference. Recently, [17] investigated the challenge of\nphase noise (PN) impairment in sub-THz communications.\nEmploying a Wiener phase noise model and stringent PAPR\nconstraints, would lead to some limitations in constellation de-\nsign flexibility, potentially leading to suboptimal performance.\nBuilding upon this concept, [18] proposed an end-to-end\nlearning for OFDM systems operating in multipath chan-\nnels. Their study demonstrated promising results for QPSK\nmodulation and small FFT sizes. However, the exploration\nof DL-based solutions for achieving higher spectral effi-\nciency—characterized by larger FFT sizes and advanced\nmodulation formats—remains relatively unexplored. Recent\nresearch by [19] has highlighted the effectiveness of AEs\nin mitigating LPN generated by low-cost DFB lasers (with\nlinewidths exceeding 1 MHz) in a transmission system utiliz-\ning 16-QAM and a 1024-FFT size. Remarkably, these models\nhave outperformed traditional RF pilot-based techniques [20],\n[21]. Nevertheless, it is worth noting that the model presented\nin [19] only accounted for a channel layer of Additive White\nGaussian Noise (AWGN) during training, limiting its general\napplicability.\nIn this paper, we aim to address the pressing challenge\nof mitigating high LPN in CO-OFDM fiber communications,\nparticularly when employing high-level modulation formats\nand large-scale FFT processing. To achieve this, we propose a\nnovel AE-based communication model that is specifically tai-\nlored for Inverse Fast Fourier Transform (IFFT)/FFT of1024-\npoint, and 16-QAM format. By training the AE on a random\nwalk phase noise channel to demonstrate exceptional resilience\nto LPN, we effectively address the regression problem inherent\nin this application. Notably, this approach eliminates the need\nfor additional LPN mitigation techniques, offering a significant\nadvantage over traditional RF-pilot-based methods by reduc-\ning complexity and potential performance bottlenecks. Our\nproposed method presents a promising solution for achieving\nrobust CO-OFDM transmission in practical fiber optic envi-\nronments. The key contributions of this paper are as follows:\n• This model is specifically designed for 1024-point FFT-\nsize, 16-QAM CO-OFDM fiber transmission, addressing\nthe challenge of LPN in high-level modulation formats\nand large-scale FFT systems.\n• By training the model on a random walk phase noise\nchannel, the proposed solution demonstrates exceptional\ntolerance to LPN, eliminating the need for additional\nmitigation techniques such as RF-pilot-based methods.\n• The model offers a significant advantage over traditional\ntechniques by reducing the complexity and potential\nperformance bottlenecks, making it a practical solution\n\n\nfor robust CO-OFDM transmission in real-world fiber\noptic environments.\nII. OFDM-AUTOENCODER BASED COMMUNICATION\nSYSTEMS\nAEs are a class of deep learning neural networks primarily\ndesigned for data reconstruction, offering a novel and powerful\napproach to enhancing communication systems [15]. In the\ncontext of communication, the AE framework enables the\ntransmitter to function as an encoder, generating robust latent\nrepresentations that are resistant to various channel impair-\nments. The receiver, acting as a decoder, is responsible for\naccurately reconstructing the original data from these latent\nrepresentations. This end-to-end training paradigm optimizes\ntogether the transceiver and the receiver, ensuring efficient\ndata transmission across noisy or impaired channels. A key\nadvantage of this approach is the encoder’s ability to learn and\ngenerate resilient latent representations, which are encoded in\nits hidden layers. Once trained, the transmitter and receiver can\noperate independently while leveraging the learned weights\nand layer structures to ensure robust performance.\nAs depicted in Figure 1, To process complex-valued data\nin neural networks, a concatenation operation is employed\nto separate the real and imaginary components into two\ndistinct real-valued representations (R2C). The output from\nthe network is then converted back to complex form using\nthe inverse operation(C2R). The proposed AE architecture\ncomprises two dense layers employing Rectified Linear Unit\n(ReLU) activation functions. Each dense layer in both the en-\ncoder and decoder is followed by a batch normalization layer.\nThis batch normalization speeds up AE training and reduces\noverfitting [22]. The final layer employs a linear activation\nfunction, which generates numerical data representations. The\nencoder is responsible for producing a latent representation,\ndenoted as w, which is passed through a random walk phase\nnoise channel. The output from this noisy channel, represented\nby r, is then fed into the decoder, where the original data x\nis reconstructed. This approach enables efficient mitigation of\nchannel impairments, such as phase noise, thereby enhancing\nthe overall performance of the communication system.\nA. Laser Phase Noise Layer\nTo simulate LPN, random noise samples with a specified\nvariance are added to the oscillator’s phase at each time step\n[23]. This accumulation of noise over time models the random-\nwalk phase noise process, which is a significant impairment\nin coherent optical communication systems. The discrete-time\nrandom-walk model is generated iteratively for N samples,\ncan be defined as:\nθi+1 = θi + C,\ni ∈{0, N −1},\n(1)\nwhere θi is the phase noise at sample i, and θi+1 represents\nthe phase noise at the next time step. The random variable\nC follows a normal distribution with mean µ and standard\ndeviation σ, defined as:\nC ∼N(µ, σ2).\n(2)\nThis random variable follows a zero-mean normal distribu-\ntion, where the standard deviation σ is directly related to the\nlaser linewidth ∆v and the sampling period Ts:\nσ2 = 2π · ∆v · Ts.\n(3)\nThe diffusion coefficient of the Wiener process is also\nlinked to the variance, where σ2 = Dcoeff · t. This diffusion\ncoefficient, Dcoeff, dictates how rapidly the random walk\nspreads over time. Thus, it is an important key in character-\nizing the behavior of the random-walk phase noise. A higher\nlaser linewidth increases the diffusion coefficient, leading to\nfaster phase noise spread over time. Similarly, a reducing\nsampling period leads to a larger diffusion coefficient, further\nemphasizing the impact of these parameters on phase noise\ndynamics.\nB. Autoencoder Training\nThe goal of this work is to train an AE to mitigate\nthe effects of LPN in CO-OFDM systems, specifically by\nreconstructing 16-QAM in the presence of random walk phase\nnoise. The training process focuses on discovering resilient\nsymbol representations w that can effectively counteract the\nphase noise impact. As illustrated in Figure 1, the proposed\nend-to-end learning architecture begins with an input layer of\ndimension N, equivalent to the iFFT size. This is followed by\ndense encoder layers that utilize ReLU activation and a batch\nnormalization, extracting features of dimension 2N. The phase\nnoise channel, characterized by different linewidths ∆v (e.g.,\n10 kHz and 100 kHz), is introduced at the channel layer, which\nremains non-trainable. The baud rate (Ts) is set to 32 GHz,\nand the decoder mirrors the encoder structure, concluding with\na linear output layer of dimension N.\nIn this architecture, the AE is trained to reconstruct 16-\nQAM symbols despite the occurrence of a random walk\nphase noise channel. The model’s objective is to learn robust\nsymbol representations w that are resilient to phase noise\nimpairments. As training progresses, the encoder and decoder\nlayers leverage ReLU activation and a batch normalization\nto enhance the extraction and reconstruction processes. The\nnon-trainable phase noise channel layer introduces varying\nlinewidths (10 kHz and 100 kHz), simulating real-world condi-\ntions where LPN can significantly impair system performance.\nThe detailed training hyperparameters are presented in Table I.\nFigure 2 shows the convergence behavior of the AE during\ntraining for various levels of LPN. The mean squared error\n(MSE) is considered as a loss function, that is defined by:\nLMSE = 1\nN\nN\nX\ni=1\n|ˆx −x|2,\n(4)\nwhere N represents the number of samples, and x and ˆx\nare the original and estimated 16-QAM symbols, respectively.\nThe results reveal that the model converges to a loss of\n\n\nTABLE I\nAE TRAINING HYPERPARAMETERS\nHyperparameter\nDescription\nValue\nBatch size\nThe batch size used for training\nN\nOptimizer\nOptimizer algorithm\nAdam\nReduceLROnPlateau\nA callback mechanism to reduce the learning rate when a metric plateaus.\nLearning rate\nThe minimum learning rate\n1 · 10−10\nFactor\nThe learning rate reduction factor\n0.1\nPatience\nPatience parameter\n10\nEarlyStopping\nEarly stopping mechanism\nMin delta\nMinimum change to consider as improvement\n0.0001\nPatience\nPatience parameter\n50\nTABLE II\nSIMULATION PARAMETERS\nParameter\nDescription\nValues\nFFT Size\nSize of the iFFT/FFT used in the system\n1024\nModulation Format\nType of modulation used\n16-QAM\nLaser Linewidth\nRange of laser linewidths considered\n10 kHz, 100 kHz, 200 kHz, 500 kHz, 1 MHz, 2 MHz, 3 MHz\nBaud Rate\nSymbol rate of the system\n32 GHz\nNoise Model\nType of noise model used for simulation\nRandom Walk Phase Noise\nAE models\nTrained AE model under linewidths\n10 kHz, 100 kHz\n0\n20\n40\n60\n80\n0\n0.2\n0.4\nEpoch\nMSE Loss\nTraining at 10kHz LW\nTraining at 100kHz LW\nFig. 2. Loss function convergence (MSE)\napproximately 0.001 within 24 epochs for a 10 kHz linewidth\nand 37 epochs for a 100 kHz linewidth. This observation\nsuggests that higher phase noise levels require slightly more\ntraining time to achieve convergence, highlighting the model’s\nadaptability to different noise environments.\nThe training results confirm the effectiveness of proposed\nAE in mitigating LPN, by successfully learning to reconstruct\ntransmitted symbols even in challenging noise conditions. This\nachievement underscores the potential of deep learning-based\nsolutions for addressing complex impairments in communica-\ntion systems.\nC. Algorithm of the proposed method\nAlgorithm 1 outlines an end-to-end AE-based approach\nto combat LPN in CO-OFDM communication systems. The\nprocess begins with mapping the input data into a latent repre-\nsentation using dense layers employing ReLU activation and a\nbatch normalization. This encoded data is then passed through\na simulated channel where random walk phase noise is applied,\nrepresenting the LPN experienced in real-world transmission.\nThe noisy data is fed into a decoder, which reconstructs\nthe original data using a similar dense-layer structure. The\nperformance of the model is optimized by minimizing the\nMSE between the original input and the estimated output,\nusing the Adam optimizer. By training on this setup, the\nAE learns to mitigate the phase noise effectively, offering an\nefficient alternative to traditional CO-OFDM systems.\nIII. SIMULATION SETUP\nTo integrate AE parts into a CO-OFDM transmission sys-\ntem, the AE encoder is positioned at the transmitter as shown\nin Figure 3. An IFFT of 1024-point is then applied to the\noutput of encoder(latent space), with each output mapped to a\ndistinct OFDM subcarrier. The transmitted signal is subject\nto channel impairments, including various linewidths and\nAdditive White Gaussian Noise (AWGN). At the receiver, an\nFFT of 1024-point FFT is applied to the received signal, trans-\nforming it into the time domain. The decoder subsequently\nreconstructs the original data transmitted by the encoder.\nAE\nEncoder\niFFT\nFFT\nAE\ndecoder\nw\nr\nejθ\nn\nFig. 3. CO-OFDM Simulation Setup\n\n\nAlgorithm 1: AE-Based CO-OFDM Communication\nSystem\nInput: Transmitted data x, FFT size N, Laser\nlinewidth ∆v\nOutput: Reconstructed data ˆx\nStep 1: Encoder\nEncode perform the mapping of input data x into\nlatent representation w using dense layers (ReLU\nactivation).\nNormalize the encoded data.\nStep 2: Channel with Phase Noise\nApply random walk phase noise to the latent\nrepresentation w.\nSimulate the phase noise according to:\nθi+1 = θi + C,\nC ∼N(0, σ2),\nwhere σ2 = 2π · ∆v · Ts.\nStep 3: Decoder\nFeed the phase-noisy representation r into the decoder.\nReconstruct the original data ˆx using dense layers with\nReLU activation followed by a linear output layer.\nStep 4: Loss Computation and Optimization\nCompute the mean squared error (MSE) between the\noriginal and reconstructed data:\nLMSE = 1\nN\nN\nX\ni=1\n|x −ˆx|2.\nOptimize the AE model using the Adam optimizer to\nminimize the MSE loss.\nIV. SIMULATION RESULTS\nTable II shows the simulation parameters used in this paper.\nTo assess the resilience of the proposed AE to LPN, simula-\ntions were conducted using various linewidths ranging from 10\nkHz to 3 MHz. Both AEs, trained under 10 kHz (Figure 4) and\n100 kHz (Figure 5) LPN conditions, demonstrated effective\nmitigation up to 2 MHz. However, neither model could ade-\nquately handle 3 MHz linewidths. Interestingly, the AE trained\nunder a 10 kHz linewidth exhibited superior performance at 1\nMHz over the AE trained under a 100 kHz linewidth, as BER\nof a system employed a 1 MHz linewidth experiences an error\nfloor in Figure 5 while not in Figure 4.\nFigure 6 illustrates the OSNR required to achieve the FEC\nthreshold for various laser linewidths. Both AEs, trained under\n10 kHz and 100 kHz conditions, demonstrate resilience to\nlinewidth up to 2 MHz. Notably, the AE trained with a 10\nkHz linewidth consistently outperforms the 100 kHz model.\nThis suggests that for CO-OFDM systems employing 16-QAM\nmodulation and IFFT/FFTs of 1024-point, the 10 kHz-trained\nAE offers a more robust solution for mitigating linewidth up\nto 1 MHz.\n0\n10\n20\n30\n10−6\n10−5\n10−4\n10−3\n10−2\n10−1\nOSNR(dB)\nBER\n10kHz LW\n100kHz LW\n200kHz LW\n500kHz LW\n1MHz LW\n2MHz LW\n3MHz LW\nFig. 4. OSNR vs. BER of AE trained at 10 kHz laser linewidth\n0\n10\n20\n30\n10−6\n10−5\n10−4\n10−3\n10−2\n10−1\nOSNR(dB)\nBER\n10kHz LW\n100kHz LW\n200kHz LW\n500kHz LW\n1MHz LW\n2MHz LW\n3MHz LW\nFig. 5. OSNR vs. BER of AE trained at 100 kHz laser linewidth\n0\n0.5\n1\n1.5\n2\n·106\n10\n12\n14\n16\n18\n20\n22\nLinewidth(Hz)\nRequired OSNR(dB)\nTraining at 10kHz LW\nTraining at 100kHz LW\nFig. 6. OSNR required to achieve FEC threshold vs. laser linewidth\n\n\nV. CONCLUSIONS\nThis research introduces a novel AE-based approach for\nCO-OFDM fiber transmission that offers exceptional resilience\nto LPN without relying on traditional mitigation techniques.\nBy eliminating the complexity and potential performance\nbottlenecks associated with conventional methods, this pro-\nposed approach paves the way for simplified communication\nsystems. This approach demonstrates remarkable tolerance to\nLaser Phase Noise (LPN), effectively handling linewidths up to\n2 MHz which makes it ideal for compensating for DFB lasers\nin high-level modulation formats and large FFT sizes, where\nspectral efficiency is paramount. The results demonstrate that\nusing AE components trained with a 10 kHz laser linewidth\nachieve exceptional BER performance, offering a viable alter-\nnative to computationally demanding conventional phase noise\nmitigation techniques. Training the proposed AE model with\na channel layer simulating a 10 kHz laser linewidth remark-\nably enhances its robustness to LPN variations, particularly\ncompared to that AE model simulating a 100 kHz linewidth.\nThis finding underscores the criticality of carefully designing\nthe AE model to achieve effective performance across diverse\nlaser linewidth conditions. Future work should investigate two\npoints: (1) combining AEs with techniques like RF pilot\ntones or digital signal processing algorithms might provide\nenhanced performance, (2) investigating the application of AE-\nbased techniques to other types of impairments in CO-OFDM\nsystems.\nREFERENCES\n[1] I. Roumpos, L. D. Marinis, M. Kirtas, N. Passalis, A. Tefas, G. Con-\ntestabile, N. Pleros, M. Moralis-Pegios, and K. Vyrsokinos, “High-\nperformance end-to-end deep learning im/dd link using optics-informed\nneural networks,” Optics Express, vol. 31, no. 12, pp. 20 068–20 079,\n2023.\n[2] J. Armstrong, “Ofdm for optical communications,” Journal of Lightwave\nTechnology, vol. 27, no. 3, pp. 189–204, 2009.\n[3] M. Srinivasan, J. Song, A. Grabowski, K. Szczerba, H. K. Iversen,\nM. N. Schmidt, D. Zibar, J. Schr¨oder, A. Larsson, C. H¨ager et al.,\n“End-to-end learning for vcsel-based optical interconnects: State-of-the-\nart, challenges, and opportunities,” Journal of Lightwave Technology,\nvol. 41, no. 11, pp. 3261–3277, 2023.\n[4] S. Xing, Z. Li, C. Huang, G. Li, A. Sun, A. Yan, W. Shen, J. Shi,\nZ. Li, C. Shen et al., “End-to-end deep learning for a flexible coherent\npon with user-specific constellation optimization,” Journal of Optical\nCommunications and Networking, vol. 16, no. 1, pp. 59–70, 2023.\n[5] T. Pfau, S. Hoffmann, and R. Noe, “Hardware-efficient coherent digital\nreceiver concept with feedforward carrier recovery for m-qam constel-\nlations,” Journal of Lightwave Technology, vol. 27, no. 8, pp. 989–999,\n2009.\n[6] A. Al-Bermani, C. W¨ordehoff, K. Puntsri, J. Omar, U. R¨uckert, and\nR. Noe, “Real-time synchronous 16-qam optical transmission system\nusing blind phase search and qpsk partitioning carrier recovery tech-\nniques,” Jan. 2012, 2012.\n[7] X. Fang, Y. Zhu, X. Cai, W. Hu, Z. He, S. Yu, and F. Zhang, “Over-\ncoming laser phase noise for low-cost coherent optical communication,”\nNature Communications, vol. 15, no. 6339, 2024.\n[8] Q. Zhuge, M. H. Morsy-Osman, and D. V. Plant, “Low overhead\nintra-symbol carrier phase recovery for reduced-guard-interval co-ofdm,”\nJournal of Lightwave Technology, vol. 31, no. 8, pp. 1158–1169, 2013.\n[9] S. Randel, S. Adhikari, and S. L. Jansen, “Analysis of rf-pilot-based\nphase noise compensation for coherent optical ofdm systems,” IEEE\nPhotonics Technology Letters, vol. 22, no. 17, pp. 1288–1290, 2010.\n[10] O. Jan, D. Sandel, M. El-Darawy, K. Puntsri, A. Al-Bermani, and\nR. Noe, “Phase noise robustness of sim-ofdm in co-ofdm transmission,”\nin 2012 38th European Conference and Exhibition on Optical Commu-\nnications, Amsterdam, Netherlands, 2012.\n[11] O. H. A. Jan, D. Sandel, K. Puntsri, A. Al-Bermani, M. El-Darawy, and\nR. No´e, “The robustness of subcarrier-index modulation in 16-qam co-\nofdm system with 1024-point fft,” Optics Express, vol. 20, pp. 28 963–\n28 968, 2012.\n[12] Z. Wu, W. Wang, X. Yi, F. Li, and Z. Li, “Analysis of phase noise for\ndft-spread ofdm systems in coherent optical communication,” Optical\nFiber Technology, vol. 84, pp. 103 745–103 745, May 2024.\n[13] M. Jian, G. C. Alexandropoulos, E. Basar, C. Huang, R. Liu, Y. Liu,\nand C. Yuen, “Reconfigurable intelligent surfaces for wireless communi-\ncations: Overview of hardware designs, channel models, and estimation\ntechniques,” Intelligent and Converged Networks, vol. 3, no. 1, pp. 1–32,\n2022.\n[14] B. S. d. C. da Silva, V. D. Souto, R. D. Souza, and L. L. Mendes, “A\nsurvey of papr techniques based on machine learning,” Sensors, vol. 24,\nno. 6, p. 1918, 2024.\n[15] T. J. O’Shea and J. Hoydis, “An introduction to machine learning com-\nmunications systems,” IEEE Transactions on Cognitive Communications\nand Networking, vol. 3, no. 4, pp. 563–575, 2017.\n[16] C. Zou, Y. Fang, S. Jian, and H. Zhu, “Channel autoencoder for\nwireless communication: State of the art, challenges, and trends,” IEEE\nCommunications Magazine, vol. 59, no. 5, pp. 126–131, 2021.\n[17] D. Marasinghe, L. H. Nguyen, J. Mohammadi, Y. Chen, T. Wild, and\nN. Rajatheva, “Constellation shaping under phase noise impairment for\nsub-thz communications,” in ICC 2024-IEEE International Conference\non Communications.\nIEEE, 2024, pp. 3833–3838.\n[18] A. Felix, S. Cammerer, S. D¨orner, J. Hoydis, and S. T. Brink, “Ofdm-\nautoencoder for end-to-end learning of communications systems,” in\n2018 IEEE 19th International Workshop on Signal Processing Advances\nin Wireless Communications (SPAWC), Kalamata, Greece, 2018.\n[19] O. Alnaseri, I. R. K. Al-Saedi, and A. Al-Asadi, “Laser phase noise\nmitigation based on autoencoder for end-to-end learning of co-ofdm\nsystems,” in 2023 6th International Conference on Signal Processing\nand Information Security (ICSPIS).\nIEEE, 2023.\n[20] B. Inan, S. Randel, S. L. Jansen, A. Lobato, S. Adhikari, and N. Hanik,\n“Pilot-tone-based nonlinearity compensation for optical ofdm systems,”\nin Optical Communication (ECOC), 2010 36th European Conference\nand Exhibition on.\nIEEE, 2010, pp. 1–3.\n[21] O. Jan, A. Al-Bermani, K. Puntsri, D. Sandel, C. Woerdehoff, U. Rueck-\nert, and R. No´e, “An experiment of coherent optical dft-spread ofdm with\nlaser phase noise,” in ITG Symposium Proceedings-Photonic Networks.\nVDE, 2013, pp. 1–3.\n[22] S. Ioffe and C. Szegedy, “Batch normalization: Accelerating deep\nnetwork training by reducing internal covariate shift,” arXiv preprint\narXiv:1502.03167, 2015.\n[23] M. R. Khanzadi, R. Krishnan, and T. Eriksson, “Estimation of phase\nnoise in oscillators with colored noise sources,” IEEE Communications\nLetters, vol. 17, no. 11, pp. 2160–2163, November 2013.\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21209v1.pdf",
    "total_pages": 6,
    "title": "End-to-End Deep Learning in Phase Noisy Coherent Optical Link",
    "authors": [
      "Omar Alnaseri",
      "Yassine Himeur"
    ],
    "abstract": "In coherent optical orthogonal frequency-division multiplexing (CO-OFDM)\nfiber communications, a novel end-to-end learning framework to mitigate Laser\nPhase Noise (LPN) impairments is proposed in this paper. Inspired by\nAutoencoder (AE) principles, the proposed approach trains a model to learn\nrobust symbol sequences capable of combat LPN, even from low-cost distributed\nfeedback (DFB) lasers with linewidths up to 2 MHz. This allows for the use of\nhigh-level modulation formats and large-scale Fast Fourier Transform (FFT)\nprocessing, maximizing spectral efficiency in CO-OFDM systems. By eliminating\nthe need for complex traditional techniques, this approach offers a potentially\nmore efficient and streamlined solution for CO-OFDM systems. The most\nsignificant achievement of this study is the demonstration that the proposed\nAE-based model can enhance system performance by reducing the bit error rate\n(BER) to below the threshold of forward error correction (FEC), even under\nsevere phase noise conditions, thus proving its effectiveness and efficiency in\npractical deployment scenarios.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}