{
  "id": "arxiv_2502.20688v1",
  "text": "arXiv:2502.20688v1  [math-ph]  28 Feb 2025\nSolving the Riccati Equation\nEverardo Rivera-Oliva∗\nDepartamento de Física\nCentro de Investigación y de Estudios Avanzados del Instituto Politécnico Nacional\nP.O. box 14-740 C.P. 07000 Ciudad de México;México\n(Dated: March 3, 2025)\nIn this study, the Riccati equation is resolved using the generalized recursive integrating factor\nmethod. By applying a non-linear transformation to the dependent variable y(x) of the Riccati\nequation, a second-order linear diﬀerential equation is derived for a variable u(x) that is related to\ny(x) through the aforementioned transformation. The second-order diﬀerential equation is then ad-\ndressed using the aforementioned integrating factors method to derive the general solution for u(x),\nwhich is subsequently transformed back to obtain the general solution for y(x), thereby resolving\nthe Riccati equation. The general solution to the Riccati equation is presented, followed by solving\na few illustrative application examples.\n∗everardo.rivera@cinvestav.mx\n\n\n2\nI.\nINTRODUCTION\nThe Riccati equation, a non-linear ordinary diﬀerential equation, was discovered by Jacopo Riccati in [1] in 1724,\nover three centuries ago. This equation is prevalent in numerous physical phenomena. For example, it is encountered\nin several Newtonian dynamic problems, especially central potential problems, as discussed in [2]. In Quantum Me-\nchanics, it serves as a method to analyze the one-dimensional Schrödinger equation as explored in [3, 4]. Furthermore,\nin Cosmology, it manifests in the form that the Friedmann equations take when modeling a spatially homogeneous\nand isotropic universe, as investigated in [5], among other areas of physics where this equation models a physical\nphenomenon.\nAlthough the Riccati equation was discovered three centuries ago, a comprehensive method to obtain a general so-\nlution remains elusive, despite various advances. As outlined in standard texts on diﬀerential equations (see [6–8]),\nthe Riccati equation can be transformed into a second-order linear diﬀerential equation with variable coeﬃcients. For\nspeciﬁc instances of the Riccati equation, it is feasible to derive a general solution using this transformation method\nwhen the resulting second-order equation corresponds to one with known solutions. Additionally, a standard method\nof quadrature is detailed in fundamental diﬀerential equations literature (see [6–8]), which facilitates the determi-\nnation of the general solution to the Riccati equation if a particular solution is available. Nonetheless, the process\nof identifying a particular solution that satisﬁes the Riccati equation is often more reliant on conjecture than on\nsystematic procedure.\nIn this study it is found the general solution to the Riccati equation through the employment of the generalized\nrecursive integrating factors method. By implementing a transformation on the Riccati equation variable y(x), a\nsecond-order linear diﬀerential equation is formulated for a new variable u(x), which is correlated to y(x) via the\npreviously mentioned transformation. The resolution of this equation for u(x) can be achieved utilizing the gen-\neralized integrating factors technique, which addresses second-order linear equations, as demonstrated in [9] where\na comprehensive solution to such equations was established. Upon resolving the second-order equation for u(x), it\nbecomes feasible to revert to the original variable y(x) by means of the inverse transformation, thereby achieving the\nsolution to the Riccati equation.\nThe structure of this work is organized as follows: Section II introduces the recursive method for resolving diﬀeren-\ntial equations, closely adhering to [9]. Section III examines the generalized recursive integrating factors method for\nsolving second-order linear diﬀerential equations, also closely following [9]. In Section IV, the general solution to the\nRiccati equation is derived, accompanied by a few illustrative examples. Finally, Section presents the conclusions and\nperspectives.\nII.\nREVIEW OF RECURSIVE METHOD TO SOLVE ORDINARY DIFFERENTIAL EQUATIONS\nIn this section the recursive method to solve ordinary diﬀerential equations will be introduced by following closely\na previous work [9].\nAs outlined in standard texts on diﬀerential equations (for an introductory examination, refer to [7]; for exhaustive\nreviews, see [6], [8], and [10]), an ordinary diﬀerential equation pertaining to the unknown function y(x) is an equation\ncomprising y(x) and the derivatives of y(x) with respect to the independent variable x.\nTypically, an ordinary\ndiﬀerential equation for y(x) is written as:\nF\n\u0012\ny(x), dy\ndx, d2y\ndx2 , . . . , dny\ndxn , x, f(x)\n\u0013\n= 0.\n(1)\nin which f(x) is designated as the inhomogeneous function of the equation, remaining independent of y(x). The\ndetermination of the order of the diﬀerential equation as indicated by Eq.(1) is contingent upon the order of the\nhighest derivative of y(x) that is encompassed therein. The categorization of the various types of ordinary diﬀerential\nequations represented by Eq.(1) is based on the properties satisﬁed by F(y, y′, ..., y(n), f).\nA comprehensive resolution strategy for diﬀerential equations of the form delineated in Eq.(1) is currently unavailable;\nsolutions are accessible solely for speciﬁc instances of the functional form F(y, y′, ..., y(n), f) (cf. [6–8]). Within this\ncontext, a recursive methodology is proposed to address diﬀerential equations characterized by Eq.(1). This recursive\napproach necessitates solving for y(x) in terms of y(x), implying that the solution y(x) is formulated as a function of\nitself and its derivatives. The method involves transforming F(y, y′, ..., y(n), f) into a known and tractable diﬀerential\nequation H(y, y′, ..., y(m), g) that is suﬃciently straightforward to be resolved for y(x):\nF(y, y′, ..., y(n), f) = H(y, y′, ..., y(m), g).\n(2)\nwhere H(y, y′, ..., y(m), g) denotes a diﬀerential equation for y(x), which is recognized to be solvable. This is achieved\nat the expense that the inhomogeneous function within H(y, y′, ..., y(m), g) does not remain independent of y(x) or\n\n\n3\nits derivatives; rather, it is expressed as a function dependent on them:\ng = g(y, y′, .., y(k), x).\n(3)\nAs a result, the solution for y(x) obtained through this methodology will be expressed as a function of y(x) itself\ntogether with its derivatives, exhibiting a recursive nature delineated by:\ny(x) = G\n\u0012\ny(x), dy\ndx, d2y\ndx2 , . . . , dny\ndxn , x, f(x)\n\u0013\n.\n(4)\nsuch that:\nF\n\u0012\nG, dG\ndx , d2G\ndx2 , . . . , dnG\ndxn , x, f(x)\n\u0013\n= 0.\n(5)\nEquation (4) represents a recursive equation to y(x) and serves as a solution to the ordinary diﬀerential equation\nspeciﬁed in Eq.(1). By methodically applying recursive substitutions of the recursive relationship for y(x) into y(x),\nthe explicit solution for Eq.(1) can be determined:\ny(x) = G(G(G...(G(x))...)).\n(6)\nIn general, the recursive relationship may necessitate an inﬁnite series of iterations, with no guarantee of convergence\nto a universal solution or even convergence of the function itself. The approach proves to be of practical signiﬁcance\nwhen a discernible pattern within the recursion can be identiﬁed, thereby facilitating the derivation of an explicit\nexpression for y(x). An eminent attribute of this method is its applicability in conjunction with other well-established\nmethodological frameworks for solving diﬀerential equations. In the current study, it is employed with additional\ntechniques to resolve second-order ordinary diﬀerential equations.\nIII.\nREVIEW OF GENERALIZED RECURSIVE INTEGRATING FACTORS\nIn this section the generalized recursive integrating factors method to solve second order linear diﬀerential equations\nwill be introduced by following closely a previous work [9].\nThe examination of second-order linear diﬀerential equations shall now commence. The canonical form of a second-\norder ordinary diﬀerential equation is presented as:\nd2y\ndx2 + p(x)dy\ndx + q(x)y(x) = f(x).\n(7)\nThe applicability of methods for solving Eq.(7) is contingent upon the fulﬁllment of the conditions outlined in\np(x), q(x), f(x). Within the realm of physics, the Frobenius method, as delineated in [11] regarding series solutions,\nrepresents one of the most prevalently utilized techniques. However, for certain diﬀerential equations, particularly\nthose characterized by constant coeﬃcients and Cauchy-Euler equations, distinct methods, as elucidated in [6–8],\nare employed. A principal advantage of the recursive method is its ability to convert ordinary diﬀerential equations\ninto recognized solvable forms, thereby facilitating integration into established expressions. Moreover, this method\ncan be eﬀectively amalgamated with other solution techniques when advantageous. Consequently, the fundamental\nprinciple of the integrating factor method, relevant to ﬁrst-order equations, is employed to reformulate Eq.(7) as an\nexact diﬀerential equation by multiplying Eq.(7) by two functions α(x), β(x):\nα(x)β(x)\n\u0012 d2y\ndx2 + p(x)dy\ndx + q(x)y(x)\n\u0013\n= f(x)α(x)β(x).\n(8)\nObserve that:\nd\ndx\n\u0012\nα(x)β(x)dy\ndx\n\u0013\n= α(x)β(x)d2y\ndx2 + dα\ndx β(x)dy\ndx + α(x)dβ\ndx\ndy\ndx.\n(9)\nd\ndx\n\u0012dα\ndx β(x)y(x)\n\u0013\n= d2α\ndx2 β(x)y(x) + dα\ndx\ndβ\ndx y(x) + dα\ndx β(x)dy\ndx.\n(10)\n\n\n4\nd\ndx\n\u0012\nα(x)dβ\ndx y(x)\n\u0013\n= dα\ndx\ndβ\ndx y(x) + αd2β\ndx2 y(x) + α(x)dβ\ndx\ndy\ndx.\n(11)\nBy summing Eq. (9) and Eq. (11), followed by the subtraction of Eq. (10), the resulting expression is obtained:\nd\ndx\n\u0012\nα(x)β(x)dy\ndx\n\u0013\n−d\ndx\n\u0012dα\ndx β(x)y\n\u0013\n+ d\ndx\n\u0012\nα(x)dβ\ndx y\n\u0013\n= α(x)β(x)d2y\ndx2 + 2α(x)dβ\ndx\ndy\ndx + α(x)d2β\ndx2 y −β(x)d2α\ndx2 y.\n(12)\nTo transform Eq.(8) into an exact diﬀerential, it is imperative that the following conditions are fulﬁlled:\ndβ\ndx = β(x)p(x)\n2\n.\n(13)\nα(x)d2β\ndx2 −β(x)d2α\ndx2 = α(x)β(x)q(x).\n(14)\nIn the event that α(x), β(x) is identiﬁed in accordance with the prescribed conditions, it becomes possible to construct\na ﬁrst integral:\nα(x)β(x)dy\ndx +\n\u0012\n−dα\ndx β(x) + α(x)dβ\ndx\n\u0013\ny(x) =\nZ x\n0\nα(t)β(t)f(t)dt + C1.\n(15)\nFollowing this development, a ﬁrst-order linear diﬀerential equation is deduced. Upon reformulating this ﬁrst-order\nordinary diﬀerential equation into its canonical form, it is obtained:\ndy\ndx + d\ndx ln\n\u0012β\nα\n\u0013\ny(x) =\nC1\nα(x)β(x) +\n1\nα(x)β(x)\nZ x\n0\nα(t)β(t)f(t)dt.\n(16)\nThe ﬁrst-order ordinary diﬀerential equation delineated in Eq.(16) can be resolved through the application of the\nintegrating factor method or, alternatively, via the recursive method previously seen:\nµ(x) = β(x)\nα(x).\n(17)\nthen:\nd\ndx\n\u0012\ny(x)\nβ\nα(x)\n\u0013\n=\nC1\nα2(x) +\n1\nα2(x)\nZ x\n0\nα(t)β(t)f(t)dt.\n(18)\nConsequently, integration of this equation yields y(x):\ny(x) = C2\nα(x)\nβ(x) + C1\nα(x)\nβ(x)\nZ x\n0\ndt\nα2(t) + α(x)\nβ(x)\nZ x\n0\n1\nα2(t)\nZ t\n0\nα(t′)β(t′)f(t′)dt′dt.\n(19)\nThis represents the general solution to the second-order linear diﬀerential equation as speciﬁed in Eq.(7). Thus,\ngiven that α(x), β(x) are identiﬁable, one can obtain the general solution for y(x) by employing this methodological\napproach, herein referred to as generalized recursive integrating factors. Upon resolving Eq.(13), β(x) is obtained:\nβ(x) = exp\n\u0012Z x\n0\np(x)\n2\n\u0013\n.\n(20)\nBy substituting Equation (13) into Equation (14), an expression for α(x) is derived:\nα(x)\n\u00121\n2\ndp\ndx + p2\n4\n\u0013\n−d2α\ndx2 = α(x)q(x).\n(21)\nthen in canonical form:\nd2α\ndx2 + α(x)\n\u0014\nq(x) −1\n2\ndp\ndx −p2\n4\n\u0015\n= 0.\n(22)\n\n\n5\nDeﬁne h(x) by:\nh(x) = −q(x) + 1\n2\ndp\ndx + p2\n4 .\n(23)\nConsequently Eq.(22) can be expressed as:\nd2α\ndx2 −h(x)α(x) = 0.\n(24)\nTo obtain α(x), it is needed to resolve a second-order linear ordinary diﬀerential equation, whose general solution\nis not usually known. Hence, the recursion method shall be employed, focusing directly on the equation’s second\nderivative while considering all other terms as inhomogeneous components. Subsequently, a ﬁrst integral for α(x) is\nderived:\nα(x) = C2 + C1x +\nZ x\n0\nZ t1\n0\nh(t2)α(t2)dt2dt1.\n(25)\nThe objective is not to determine the general solution α(x), but rather to identify a particular solution. For the sake\nof simplicity, let us assume C1 = 0, C2 = 1. Consequently:\nα(x) = 1 +\nZ x\n0\nZ t1\n0\nh(t2)α(t2)dt2dt1.\n(26)\nBy working out the ﬁrst recursion it is obtained:\nα(x) = 1 +\nZ x\n0\nZ t1\n0\nh(t2)dt2dt1 +\nZ x\n0\nZ t1\n0\nZ t2\n0\nZ t3\n0\nh(t2)α(t4)dt4dt3dt2dt1.\n(27)\nAt this stage, a discernible pattern becomes apparent within the recursive procedure:\nα(x) = 1 +\nZ x\n0\nZ t1\n0\nh(t2)dt2dt1 +\nZ x\n0\nZ t1\n0\nZ t2\n0\nZ t3\n0\nh(t2)h(t4)dt4dt3dt2dt1 + . . .\n(28)\nIn a compact notation α(x) can be expressed as follows:\nα(x) = 1 +\n∞\nX\nj∈2Z+\njY\ni∈2Z+\nZ ti\n0\nZ ti+1\n0\nh(ti+2)dti+2dti+1.\n(29)\nwhere t0 = x. It can be shown that Eq.(28) fulﬁlls the requirements of Eq.(24) by calculating the second derivative\nof α(x):\ndα\ndx =\nZ x\n0\nh(t2)dt2 +\nZ x\n0\nZ t2\n0\nZ t3\n0\nh(t2)h(t4)dt4dt3dt2 + . . . .\n(30)\nd2α\ndx2 = h(x) + h(x)\nZ x\n0\nZ t3\n0\nh(t4)dt4dt3 + . . . .\n(31)\nd2α\ndx2 = h(x)\n\u0014\n1 +\nZ x\n0\nZ t1\n0\nh(t2)dt2dt1 +\nZ x\n0\nZ t1\n0\nZ t2\n0\nZ t3\n0\nh(t2)h(t4)dt4dt3dt2dt1 + . . .\n\u0015\n.\n(32)\nd2α\ndx2 = h(x)α(x).\n(33)\nThus, α(x) as delineated in Eq.(27) fulﬁlls the role of a solution to Eq.(33), thereby functioning as an integrating\nfactor for Eq.(7). By rearranging the sequence of integration for α(x), a simpliﬁcation of the expression is attainable:\nα(x) = 1 +\nZ x\n0\n(x −t)h(t)dt +\nZ x\n0\nZ t\n0\n(x −t)(t −t1)h(t)h(t1)dt1dt + . . .\n(34)\n\n\n6\nBy deﬁning x = t0 and deﬁnining a function H(x) as follows:\nH(tn) = (tn−1 −tn)h(tn).\n(35)\nthen α(x) can be expressed as:\nα(x) = 1 +\nZ t0\n0\nH(t1)dt1 +\nZ t0\n0\nZ t1\n0\nH(t2)H(t1)dt2dt1 + . . .\n(36)\nHowever, Equation (36) represents the expansion of the product-ordered exponential (refer to [12] for a comprehensive\nreview). Consequently:\nα(x) = τ\n\u0014\nexp\n\u0012Z x\n0\nH(t)dt\n\u0013\u0015\n.\n(37)\nTherefore y(x) can be explicitly expressed as:\ny(x) =C2e−\nR x\n0\np(t)\n2 dtτ\n\u0014\ne\nR x\n0 (x−t)\n\u0010\n−q(t)+ 1\n2\ndp\ndt + p2\n4\n\u0011\ndt\n\u0015\n+ C1e−\nR x\n0\np(t)\n2 dtτ\n\u0014\ne\nR x\n0 (x−t)\n\u0010\n−q(t)+ 1\n2\ndp\ndt + p2\n4\n\u0011\ndt\n\u0015 Z x\n0\ndt\nτ\n\u0014\ne\n−\nR t\n0 (t−t′)\n\u0010\n−q(t′)+ 1\n2\ndp\ndt′ + p2\n4\n\u0011\ndt′\u00152\n+ e−\nR x\n0\np(t)\n2 dtτ\n\u0014\ne\nR x\n0 (x−t)\n\u0010\n−q(t)+ 1\n2\ndp\ndt + p2\n4\n\u0011\ndt\n\u0015 Z x\n0\nR t\n0 f(t′)e\nR t′\n0\np(z)\n2\ndzτ\n\u0014\ne\nR t′\n0 (t′−z)\n\u0010\n−q(z)+ 1\n2\ndp\ndz + p2\n4\n\u0011\ndz\n\u0015\nτ\n\u0014\ne−\nR t\n0 (t−t′)\n\u0010\n−q(t′)+ 1\n2\ndp\ndt′ + p2\n4\n\u0011\ndt′\u00152\ndt′dt.\n(38)\nEquation (38) describes the general solution to the second-order linear diﬀerential equation as speciﬁed by Eq. (7).\nThough the notation may initially seem complex relative to the concise form of Eq. (18) concerning integrating factors,\nit has the advantage of being expressed explicitly in terms of the functions p(x), q(x) within the diﬀerential equation.\nTherefore, by employing the generalized integrating factor method alongside the recursive method, second-order linear\ndiﬀerential equations can be systematically addressed in the general case.\nIV.\nTHE RICCATI EQUATION\nThe Riccati equation, a ﬁrst-order non-linear diﬀerential equation, was ﬁrst identiﬁed by Riccati in [1] in the year\n1724, marking over three centuries since its initial discovery. In contemporary notation, the diﬀerential equation as\npresented in [6, 7] is as follows:\ndy\ndx = q0(x) + q1(x)y(x) + q2(x)y2(x).\n(39)\nAs articulated in foundational texts on diﬀerential equations, including [6–8], Equation (39) may be transformed\ninto a second-order linear diﬀerential equation characterized by variable coeﬃcients through the application of the\nsubsequent transformation:\ny(x) = −\nu(x)′\nq2(x)u(x).\n(40)\nwhere u(x) satisiﬁes the following second order diﬀerential equation:\nd2u\ndx2 −\n\u0012\nq1(x) + d\ndx ln(q2(x))\n\u0013 du\ndx + q2(x)q0(x)u(x) = 0.\n(41)\nThus, through the explicit resolution of Eq.(41) for u(x) and the employment of the transformation articulated in\nEq.(40), one can obtain a solution to the Riccati equation. The subsequent terms are identiﬁed from Eq.(41):\np(x) = −q1(x) −d\ndx ln(q2(x)).\n(42)\n\n\n7\nq(x) = q2(x)q0(x).\n(43)\nThus, through the application of the generalized recursive integrating factors method [9], one can determine the\ngeneral solution for Eq.(41).Prior to elucidating the speciﬁc values for α(x), β(x), it is prudent to initially articulate\nall components in terms of these integrating functions. Given that the equation for u(x) is homogeneous, the general\nsolution is the following as speciﬁed by Eq.(19):\nu(x) = C2\nα(x)\nβ(x) + C1\nα(x)\nβ(x)\nZ x\n0\ndt\nα2(t).\n(44)\nIn order to reconstruct y(x), it is necessary to compute the logarithm of u(x) followed by its diﬀerentiation. The\nlog(u(x)) is provided as follows:\nln(u) = ln α(x) −ln β(x) + ln\n\u0012\nC2 + C1\nZ x\n0\ndt\nα2(t)\n\u0013\n.\n(45)\nSubsequently its derivative is given by:\nln(u)′ = α′(x)\nα(x) −β′(x)\nβ(x) +\nC1\nα2(x)\n1\nC2 + C1\nR x\n0\ndt\nα2(t)\n.\n(46)\nRenaming the integration constants appearing in Eq.(46) the expression reduces into:\nln(u)′ = α′(x)\nα(x) −β′(x)\nβ(x) +\n1\nα2(x)\n1\nC +\nR x\n0\ndt\nα2(t)\n.\n(47)\nBy substituting Eq.(47) into Eq.(40) the general solution y(x) for the Riccati equation is given by:\ny(x) =\nβ′(x)\nq2(x)β(x) −\nα′(x)\nq2(x)α(x) −\n1\nq2(x)α2(x)\n1\nC +\nR x\n0\ndt\nα2(t)\n.\n(48)\nEquation (48) reveals that the general solution for the Riccati equation is comprised of a particular solution yp(x) that\nis independent of the integration constant and satisﬁes the Riccati equation itself (see [6, 7]), as well as a commonly\nreferred solution by quadrature yq(x) dependent on the constant of integration, satisfying a Bernoulli equation through\na change of variable (see [6, 7]). Consequently:\ny(x) = yp(x) + yq(x).\n(49)\nwhere:\nyp(x) =\nβ′(x)\nq2(x)β(x) −\nα′(x)\nq2(x)α(x),\nyq(x) = −\n1\nq2(x)α2(x)\n1\nC +\nR x\n0\ndt\nα2(t)\n.\n(50)\nAs evidenced in Eq. (50), the quadrature solution of the Riccati equation is solely dependent on a single integration\nconstant, which is consistent with the nature of ﬁrst-order diﬀerential equations. Despite the resolution of the equation\nthrough a second-order diﬀerential equation pertaining to u(x), which incorporated two integration constants C1, C2,\nas illustrated in Eq.\n(44), the logarithmic transformation linking u(x) with y(x) in Eq.\n(46) necessitates that\nthese integration constants appear as a quotient for y(x), rendering only C1/C2 signiﬁcant. Consequently, it can be\nreformulated into a new constant C. Having derived the general solution to the Riccati equation in terms of the\nintegrating factors α(x), β(x), it is imperative to determine explicit expressions for these functions in terms of the\ncomponent functions presented in Eq. (39). According to Eq. (20) and Eq. (42), the function β(x) is given as follows:\nβ(x) = exp\n\u0000−1\n2\nR x\n0 q1(t)dt\n\u0001\np\nq2(x)\n.\n(51)\nTo compute α(x), it is imperative to initially determine h(x), as delineated in Eq.(23). Once q(x), p(x) has been\nidentiﬁed, the function h(x) can subsequently be articulated as follows:\nh(x) = −q2(x)q0(x) −1\n2\ndq1(x)\ndx\n−1\n2\nd2\ndx2 ln(q2(x)) + 1\n4q2\n1(x) + 1\n2q1(x) d\ndx ln(q2(x)) + 1\n4\n\u0012 d\ndx ln(q2(x))\n\u00132\n.\n(52)\n\n\n8\nSubsequently we compute H(x) function as follows:\nH(x) = (x −x′)\n\"\n−q2q0 −1\n2\ndq1\ndx′ −1\n2\nd2 ln q2\ndx2\n+ 1\n4q2\n1 + 1\n2q1\nd ln q2\ndx′\n+ 1\n4\n\u0012d ln q2\ndx′\n\u00132#\n.\n(53)\nConsequently α(x) is given by the exponential ordered product of the integral of H(x) as follows:\nα(x) = τ\n\"\nexp\nZ x\n0\n \n(t′ −t)\n \n−q2q0 −1\n2\ndq1\ndt −1\n2\nd2 ln q2\ndt2\n+ 1\n4q2\n1 + 1\n2q1\nd ln q2\ndt\n+ 1\n4\n\u0012d ln q2\ndt\n\u00132!!\ndt\n#\n.\n(54)\nUpon calculating α(x), β(x), expressions for yp, yq can be derived in terms of the component functions of the Riccati\nequation. By inserting the values of α(x), β(x) into Eq.(50), the following result is obtained:\nyp(x) = −\n1\nq2(x)\nd\ndx ln\n \nτ\n\"\nexp\nZ x\n0\n \n(t′ −t)\n \n−q2q0 −1\n2\ndq1\ndt −1\n2\nd2 ln q2\ndt2\n+ 1\n4q2\n1 + 1\n2q1\nd ln q2\ndt\n+ 1\n4\n\u0012d ln q2\ndt\n\u00132!!\ndt\n#!\n−\n1\n2q2(x)\n\u0014\nq1(x) + d ln q2(x)\ndx\n\u0015\n.\n(55)\nyq(x) = −\n \nC +\nR x\n0\n\u0014\nτ\n\u0014\nexp\nR t\n0\n\u0012\n(z −y)\n\u0012\n−q2q0 −1\n2\ndq1\ndy −1\n2\nd2 ln q2\ndy2\n+ 1\n4q2\n1 + 1\n2q1\nd ln q2\ndy\n+ 1\n4\n\u0010\nd ln q2\ndy\n\u00112\u0013\u0013\ndy\n\u0015\u0015−2\ndt\n!−1\nq2(x)\n\u0014\nτ\n\u0014\nexp\nR x\n0\n\u0012\n(t′ −t)\n\u0012\n−q2q0 −1\n2\ndq1\ndt −1\n2\nd2 ln q2\ndt2\n+ 1\n4q2\n1 + 1\n2q1\nd ln q2\ndt\n+ 1\n4\n\u0010\nd ln q2\ndt\n\u00112\u0013\u0013\ndt\n\u0015\u00152\n.\n(56)\nIt is evident that Eq.(55) and Eq.(56) are intricate and lengthy, but constitute the general solution to the Riccati\nequation. Practically, a more straightforward approach is to compute directly for α(x), β(x) and subsequently employ\nthe transformation delineated in Eq.(40) to derive the general solution.\nTo demonstrate the eﬀectiveness of the derived general solution to the Riccati equation, a couple of illustrative\nexamples shall be solved.\nConsider the following Riccati equation:\ndy\ndx = −λ exp\n\u0012x2\n2\n\u0013\n+ xy + exp\n\u0012\n−x2\n2\n\u0013\ny2.\n(57)\nFrom here, the following functions are identiﬁed:\nq0(x) = −λ exp\n\u0012x2\n2\n\u0013\n,\nq1(x) = x,\nq2(x) = exp\n\u0012\n−x2\n2\n\u0013\n.\n(58)\nSubsequently, the functions p(x), q(x) are constructed by following Eq.(42) and Eq.(43) as follows:\np(x) = 0,\nq(x) = −λ.\n(59)\nFrom Eq.(59) and by following Eq.(20) β(x) is computed:\nβ(x) = 0.\n(60)\nIn the same way, following Eq.(24) an equation for α(x) is computed:\nd2α\ndx2 = λα.\n(61)\nThe solution for Eq.(61) is given by Eq.(37) as follows:\nα(x) = exp\n\u0010√\nλx\n\u0011\n.\n(62)\n\n\n9\nHaving computed α(x), β(x) the particular and quadrature solutions to Riccati equation are reconstructed by following\nEq.(50) as follows:\nyp(x) = −\n√\nλ exp\n\u0012x2\n2\n\u0013\n,\nyq(x) = −\nexp\n\u0010\nx2\n2 −2\n√\nλx\n\u0011\nC −\n1\n2\n√\nλ exp\n\u0010\n−2\n√\nλx\n\u0011.\n(63)\nThen the general solution to this Riccati equation is given by:\ny(x) = −\n√\nλ exp\n\u0012x2\n2\n\u0013\n−\nexp\n\u0010\nx2\n2 −2\n√\nλx\n\u0011\nC −\n1\n2\n√\nλ exp\n\u0010\n−2\n√\nλx\n\u0011.\n(64)\nAs an additional example consider the following Riccati equation:\ndy\ndx = −2\nx2 exp (sin(x)) + cos(x)y + exp (−sin(x)) y2.\n(65)\nFrom here, the following functions are indentiﬁed:\nq0(x) = −2\nx2 exp (sin(x)) ,\nq1(x) = cos(x),\nq2(x) = exp (−sin(x)) .\n(66)\nFrom Eq.(66) and by following Eq.(20) β(x) is computed:\nβ(x) = 0.\n(67)\nIn the same way, following Eq.(24) an equation for α(x) is computed:\nd2α\ndx2 = 2\nx2 α.\n(68)\nThe solution for Eq.(68) is given by Eq.(37) as follows:\nα(x) = x2.\n(69)\nHaving computed α(x), β(x) the particular and quadrature solutions to Riccati equation are reconstructed by following\nEq.(50) as follows:\nyp(x) = −2\nx exp (sin(x)) ,\nyq(x) = −exp (sin(x))\nCx4 −x\n3\n.\n(70)\nThen the general solution to this Riccati equation is given by:\ny(x) = −2\nx exp (sin(x)) −exp (sin(x))\nCx4 −x\n3\n.\n(71)\nV.\nCONCLUSIONS\nBy employing the non-linear transformation detailed in Eq.(40), the Riccati equation was transformed into a\nsecond-order linear diﬀerential equation. This linear equation was subsequently solved using the generalized recursive\nintegrating factors method as referenced in [9]. Upon resolution of the second-order diﬀerential equation, the appli-\ncation of the inverse transformation allowed for the reconstruction of the general solution to the Riccati equation, as\nindicated in Eq.(48). This process illustrates the eﬃcacy of recursive methods in addressing diﬀerential equations,\nincluding those that are non-linear. Although Eq.(48) provides a general solution formula for the Riccati equation,\nthe convergence of this expression was not discussed. Consequently, despite its representation as a general formula,\nit may not converge to a solution in all cases. Further investigation into this aspect is warranted in future studies.\n\n\n10\nACKNOWLEDGMENTS\nEverardo Rivera-Oliva wishes to express his gratitude for the support provided by the Ph.D. scholarship No. 743129\nfrom SECIHTI (CONAHCYT)-Mexico.\n[1] J. Riccati, Actorum Eruditorum Supplementa 8, 66 (1724).\n[2] M. Nowakowski and H. C. Rosu, Phys. Rev. E 65, 047602 (2002).\n[3] S. Fraga, J. de la Vega,\nand E. Fraga, The Schrödinger and Riccati Equations, Lecture Notes in Chemistry (Springer\nBerlin Heidelberg, 1999).\n[4] D. Schuch, Journal of Physics: Conference Series 538, 012019 (2014).\n[5] V. Faraoni, American Journal of Physics 67, 732 (1999), https://pubs.aip.org/aapt/ajp/article-pdf/67/8/732/7528258/732_1_online.p\n[6] G. Arfken, G. Arfken, H. Weber, and F. Harris, Mathematical Methods for Physicists: A Comprehensive Guide (Elsevier\nScience, 2013).\n[7] D. Zill, Diﬀerential Equations with Boundary-Value Problems (Cengage Learning, 2016).\n[8] E. Butkov, Mathematical Physics, A-W series in advanced physics (Addison-Wesley Publishing Company, 1968).\n[9] E.\nRivera-Oliva,\n“Solving linear diﬀerential equations by recursion and integrating factors,”\n(2025),\narXiv:2502.20219 [math-ph].\n[10] S. Hassani, Mathematical Physics: A Modern Introduction to Its Foundations (Springer International Publishing, 2013).\n[11] C. W. Borchardt, ed., “Ueber die integration der linearen diﬀerentialgleichungen durch reihen. von herrn g. frobenius,” in\nBand 76 (De Gruyter, Berlin, Boston, 1873) pp. 214–235.\n[12] M. Grossman and R. Katz, Non-Newtonian Calculus: A Self-contained, Elementary Exposition of the Authors’ Investigations ...\n(Lee Press, 1972).\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20688v1.pdf",
    "total_pages": 10,
    "title": "Solving the Riccati Equation",
    "authors": [
      "Everardo Rivera-Oliva"
    ],
    "abstract": "In this study, the Riccati equation is resolved using the generalized\nrecursive integrating factor method. By applying a non-linear transformation to\nthe dependent variable $y(x)$ of the Riccati equation, a second-order linear\ndifferential equation is derived for a variable $u(x)$ that is related to\n$y(x)$ through the aforementioned transformation. The second-order differential\nequation is then addressed using the aforementioned integrating factors method\nto derive the general solution for $u(x)$, which is subsequently transformed\nback to obtain the general solution for $y(x)$, thereby resolving the Riccati\nequation. The general solution to the Riccati equation is presented, followed\nby solving a few illustrative application examples.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}