{
  "id": "arxiv_2502.21233v1",
  "text": "Structure and Dynamics of Deep Eutectic\nSystems from Cluster-Optimized Energy Functions\nKai T¨opfer, Jingchun Wang, Shimoni Patel, and Markus Meuwly∗\nDepartment of Chemistry, University of Basel, Klingelbergstrasse 80, CH-4056 Basel,\nSwitzerland.\nE-mail: m.meuwly@unibas.ch\n1\narXiv:2502.21233v1  [physics.chem-ph]  28 Feb 2025\n\n\nMarch 3, 2025\nAbstract\nGenerating energy functions for heterogeneous systems suitable for quantitative\nand predictive atomistic simulations is a challenging undertaking. The present work\ncombines a cluster-based approach with electronic structure calculations at the density\nfunctional theory level and machine learning-based energy functions for a spectroscopic\nreporter for eutectic mixtures consisting of water, acetamide and KSCN. Two water\nmodels are considered: TIP3P which is consistent with the CGenFF energy function and\nTIP4P which - as a water model - is superior to TIP4P. Both fitted models, M2TIP3P\nand M2TIP4P, yield favourable thermodynamic, structural, spectroscopic and transport\nproperties from extensive molecular dynamics simulations. In particular, the slow\nand fast decay times from 2-dimensional infrared spectroscopy and the viscosity for\nwater-rich mixtures are described realistically and consistent with experiments. On\nthe other hand, including the co-solvent (acetamide) in the present case is expected\nto further improve the computed viscosity for low-water content.\nIt is concluded\nthat such a cluster-based approach is a promising and generalizable route for routine\nparametrization of heterogeneous, electrostatically dominated systems.\nIntroduction\nAtomistic simulations are a powerful approach to investigate the energetics, structural dy-\nnamics, and spectroscopy of heterogeneous systems in the condensed phase. This has, inter\nalia, been demonstrated for hydrated proteins, ionic liquids, or deep eutectic mixtures.1–6\nSuch studies can ideally complement experimental efforts and provide molecular-level charac-\nterization and interpretation.7,8 From a computational viewpoint the main challenges are a)\nthe accuracy of the energy function to carry out atomistic simulations and b) the time scale\non which such simulations can be run. Conversely, from an experimental and measurement\nperspective, one of the great challenges is the fact that usually the “full system” is probed. In\n2\n\n\nother words, for heterogeneous systems it is difficult to arrive at a molecular-level structural\ninterpretation for a specific part of the system from measurements that report on the entire\nsystem.9 Also, it is demanding to cover multiple time scales ranging from the femtosecond to\nthe second time scale in a single measurement, although recent progress has been made here.10\nThe quality of atomistic simulations is directly linked to the accuracy with which the inter-\nand intramolecular interactions are described. Ideally, the classical (Newton) or quantum\nmechanical (Schr¨odinger) time evolution equations to follow the nuclear dynamics would\nbe solved by using energies and forces from high-level quantum chemistry calculations with\nlarge basis sets. However, this is usually not feasible but for the smallest systems (molecules\nwith ∼5 heavy atoms) and on short time scales (tens to hundreds of picoseconds). Machine\nlearning-based energy functions have improved this situation considerably, in particular if\nmore specialized techniques such as transfer learning (TL) are employed.11–14 Nevertheless,\nroutine application of ML-based energy functions to heterogeneous condensed-phase systems\nis still not routine. Instead, targeted improvements of empirical energy functions remain an\nattractive alternative as they combine the robustness of a coordinate-dependent functional\ndependence with the flexibility of a parametrized model that can be adapted to either quan-\ntum chemical reference data, experimental observables, or both. Still, one of the challenges\nfor more physics-based models is to develop energy functions that retain the precision of the\nquantum mechanical methods they are often based on.\nTraditionally, empirical energy functions use harmonic springs to represent bonds and valence\nangles, and periodic functions for dihedrals. For the non-bonded interactions it is common to\nemploy atom-centered point charges and a Lennard-Jones (LJ) representation for van-der-\nWaals (vdW) interactions.15 For applications to vibrational spectroscopy it is necessary to\ngo beyond the harmonic approximation and to include effects of mechanical anharmonicity\nand coupling between different internal degrees of freedom. Such improvements can, e.g., be\n3\n\n\nachieved through the use of machine learning-based approaches.16–20\nSimilarly, the electrostatic model can be improved by going beyond the first-order treatment\nbased on atom-centered point charges to better describing anisotropic contributions to the\ncharge density.21 Including higher-order atomic multipoles improves the accuracy but at the\nexpense of increased computational cost and implementation complexity.22–25 Accounting\nfor polarizability is another contribution that has been included in empirical force fields and\nshows promise for further improvements of the computational models.26 From an empirical\nforce field perspective the vdW interactions are often represented as Lennard-Jones terms\nwith ad hoc (Lorentz-Berthelot) combination rules. Alternative and potentially improved\nrepresentations are the buffered 14-7 parametrization27 and/or modified combination rules28,29\nDeep eutectic solvents (DESs) are multicomponent mixtures consisting of molecular species\nacting as hydrogen bond acceptors and hydrogen bond donors at particular molar ratios.30–32\nIn DESs the melting point of the mixture is lower than that of the individual components.33\nThey also remain in the liquid phase over a wider temperature range.33 If the mixtures\ncontain ions, the intermolecular interactions involve pronounced electrostatic contributions\nwhich is also - in part - due to crowding. The particular mixture considered here consists\nof water, acetamide and KSCN which is present as solvated K+ and SCN−(thiocyanate)\nions.34,35 Acetamide forms low-temperature eutectics with a wide range of inorganic salts\nand the resulting non-aqueous solvents have a high ionicity. Such mixtures have also been\nrecognized as excellent solvents and molten acetamide is known to dissolve inorganic and\norganic compounds. The SCN−anion is a suitable spectroscopic probe because the CN-stretch\nvibration absorbs in an otherwise empty region of the infrared region. Advantage of this\nhas been recently taken to probe the effect of water addition to urea/choline chloride and in\nacetamide/water mixtures.5,36\n4\n\n\nComputational approaches for deep eutectic solvents have been recently reviewed.37 Previous\nefforts to parametrize empirical energy functions for deep eutectic used a range of protocols\nand approaches37–44 In almost all the cases, the starting point was a conventional energy\nfunction such as the General Amber Force Field (GAFF),45 but adapted for particular appli-\ncations46 In a next step, particular parameters were and to readjusted38,44 which included\nscaling of partial charges43 and/or scaling of van-der-Waals parameters to reproduce observed\nproperties such as diffusivities, viscosities or the densities.44 Alternatively, models were also\ndeveloped based on symmetry adapted perturbation theory (SAPT)42 and to refine them\nby comparing with first principles MD simulations. More recent work47 focused on using\ncluster systems extracted from molecular dynamics (MD) simulations and computing total\ninteraction energies based on electronic structure calculations.48 Using reference data from\ndensity functional theory calculations, specific force field parameters were adjusted to best\nreproduce the reference data. This protocol,47 referred to as M2 in previous and the present\nwork, can be amended by comparison with available and reliable measured properties of the\nsystem but a priori no experimentally measured data is required.\nThe present work aims at parametrizing atomistic force fields using state-of-the art methods\nby combining machine learning-based approaches for bonded and nonbonded terms, refine-\nment of the Lenard-Jones interactions with respect to thermodynamic data and validation\non structural, spectroscopic and thermodynamic measurements. First, the methods are\npresented, followed by the reparametrization and validation of the energy functions. Next,\nextended MD simulations are analyzed with respect to pair distribution functions, frequency\nfluctuation correlation functions from experiment and simulations are compared, and the\nviscosities of different mixtures are determined. Finally, conclusions are drawn.\n5\n\n\nComputational Methods\nSimulation Setup\nMolecular dynamics simulations were carried out using the CHARMM program49 with provi-\nsions for electrostatics based on the flexible minimal distributed charge model50 (fMDCM)\nand bonded interactions described by a reproducing kernel Hilbert space (RKHS).51,52 The\nmolar composition of the mixtures was changed by varying the number of water and acetamide\nmolecules while keeping constant the total concentration of K+ and SCN−, see Table S1. The\ncutoff for nonbonded interactions was 14 ˚A and electrostatic interactions were treated using\nthe Particle Mesh Ewald algorithm.54 and bonds involving hydrogen atoms were constrained\nusing the SHAKE algorithm.53 In total, 5 independent random initial configurations for\neach of the 9 system compositions were set up using PACKMOL.55 After 100 ps of heating\nand equilibration simulation, respectively, NpT production simulations were run at 300 K\nand normal pressure (1 atm) were performed for 5 ns with a time step of 1 fs using the\nleap-frog integrator and a Hoover thermostat within the extended system constant pressure\nand temperature algorithm as implemented in CHARMM.56,57 The mass of the pressure\npiston and piston collision frequency were 406 u and 5 ps−1, respectively, and the mass of\nthe thermal piston was 4060 kcal/mol ps2. For each system composition a total of 25 ns was\nsampled.\nInter- and Intramolecular Interactions\nThe representation and fitting of the intra- and inter-molecular contributions to the total\nenergy function were described in previous work.47 Here, a brief summary is given. The total\nenergy function for the heterogeneous mixture (water, acetamide, K+, SCN−) was described\nby a combination of the all-atom CGenFF force field58 for acetamide, the TIP3P water\nmodel59 to be used together with CGenFF, and literature LJ parameters for the potassium\n6\n\n\ncation K+ with an assigned atom charge of +1.0.60 For the thiocyanate anion (SCN−) the\nbonding potential was a reproducing kernel Hilbert space (RKHS)52,61 representation based\non ab initio data at the PNO-LCCSD(T)-F12/aug-cc-pVTZ-F12 level of theory. The SCN−\nelectrostatics were based on the fMDCM model50 fitted to the electrostatic potential (ESP)\ncalculated at the M06-2X/aug-cc-pVTZ level of theory. For the fMDCM model, 8 point\ncharges were distributed around the SCN−atoms with positions within the local axis frame\ndetermined by 3rd order polynomial functions f(x) with x = 1 −cos2 θ and the SCN−bond\nangle θ. The 96 parameters of the 24 polynomial functions - 4 parameters per polynomial for\neach Cartesian coordinate (3) and distributed charge (8) - were optimized to best reproduce\nthe reference ESPs for different SCN−conformations.\nFigure 1: Distributed charge positions (red spheres as negative charges and blue spheres\npositive charges) predicted by the fMDCM model to represent the ESP of SCN−(transparent\nspheres) for the (A) linear equilibrium conformation and (B) at a valence angle θ = 160◦.\nThe present work focuses primarily on model M2 which is a combination of fMDCM and\noptimized LJ parameters of SCN−to best reproduce ab initio interaction energies between\nSCN−with cluster shells of different sizes and composition.47 For this, the LJ parameters ϵ\nand rmin of SCN−were adjusted to best match counterpoise-corrected62 interaction energies\nfrom electronic structure calculations. The systems considered included one SCN−anion\nsurrounded by (i) 16 water molecules; (ii) 14 water molecules with one K+ ion, (iii) 14 water\nmolecules with one additional SCN−; (iv) 12 water molecules with both, one additional\n7\n\n\nSCN−and K+ ion. For each type of system (i) to (iv) 50 independent conformations were\nextracted randomly from previous MD simulations.5 Reference interaction energies were\nthen determined at the M06-2X/aug-cc-pVTZ level of theory using the Gaussian program.63\nHigher levels of quantum chemical theory, such as coupled cluster energies, are not feasible\ndue to the unfavourable scaling of the computations with system and basis set size.\nIn addition to the TIP3P model, an independent parametrization was carried out by using the\nTIP4P model because the TIP3P model has known deficiencies.64 However, strictly speaking,\nthe TIP4P model is not fully compatible with CGenFF, see above. For the reference quantum\nchemistry calculations, SCN−centered cluster conformations were extracted from previous\nMD simulations with TIP4P water model,5 but using the previous optimized LJ parameter\nfor SCN−in TIP3P water containing clusters. As a consequence to changed local densities,\nthe cluster composition (iii) is adjusted to 13 water molecules with one additional SCN−. Still,\nfor each type of system (i) to (iv) 50 independent conformations were extracted randomly\nand counterpoise-corrected interaction energies from electronic structure calculations between\nSCN−and the cluster shell were computed. The LJ parameters of SCN−were optimized to\nbest match these interaction energies.\nIn the past, the TIP3P water model has been found to have various limitations when compar-\ning experimentally measured quantities with those from simulations.64 It should, however, be\nkept in mind that the CGenFF energy function was parametrized together with the TIP3P\nwater model. After fitting the LJ parameters to the cluster energies from electronic structure\ncalculations it is found that the two water models yield similarly accurate representations of\nthe intermolecular interactions. For the remainder of the present work, simulation results\nfrom parametrizations following method M2 - fitting of LJ-parameters based on quantum\nchemistry for cluster models - using water models TIP3P and TIP4P (models M2TIP3P and\nM2TIP4P) are presented and discussed.\n8\n\n\nAnalysis\nThe hydration free energy ∆Ghyd for the SCN−anion in water solvent was computed from\nthermodynamic integration.65 One SCN−anion was sampled in the gas phase and in pure\nwater. The condensed-phase simulations were carried out in the NpT ensemble with 997\nwater molecules (cubic box size ∼303 ˚A3).65,66 The coupling parameter λ ∈(0, 1) included\n24 evenly spaced values for the electrostatic and vdW interactions, respectively. Initial\nconditions for these simulation were taken from an unbiased simulation, equilibrated for 50 ps\nwith the respective coupling parameter λ and run for another 150 ps for statistical sampling.\nThe hydration free energy was then accumulated from\n∆Ghyd =\nX\nλ\n[(Helec\nsolv(λ) −Helec\ngas (λ)) + (HvdW\nsolv (λ) −HvdW\ngas (λ))]∆λ\n(1)\nFor a triatomic such as SCN−, Helec\ngas (λ) = HvdW\ngas (λ) = 0 due to the 1-2 and 1-3 nonbonded\ninteraction exclusion.67 Therefore, only Helec\nsolv(λ) and HvdW\nsolv (λ) needed to be accumulated.\nThe density of aqueous KSCN solution was determined from 500 ps simulations in the NpT\nensemble (100% water in Table S1) with a KSCN molality of b(KSCN) = 3.821 mol/kg. The\nequilibrium simulation box volume was computed as the average box volume from the last\n100 ps of the simulations (400–500 ps) during the production run. Convergence within the\nreported precision was checked by comparing with the average taken from the results of the\nfull production run of 500 ps.\nFor the frequency fluctuation correlation function (FFCF), the frequency trajectories ωi(t)\nfor each oscillator i were determined from an instantaneous normal mode (INM) analysis of\nthe CN-vibrational frequencies ωi.68 All SCN−ions were analyzed on snapshots separated\n9\n\n\nby 100 fs along the first 2 ns of each production simulation (10 ns in total for each system\ncomposition). For the INM analysis the structure of each SCN−ion was optimized whereby\nthe positions of all remaining atoms in the system were frozen. This was followed by a\nnormal mode analysis using the same force field that was employed for the MD simulations.\nPreviously, such an approach has been validated for N−\n3 in solution by comparing with\nrigorous quantum bound state calculations.16\nFrom the frequency trajectory ωi(t) for each oscillator the FFCF δωi(t) = ω(t)−< ωi > was\ndetermined which contains information on relaxation time scales corresponding to the solvent\ndynamics around the solute. The FFCFs were fit to an empirical expression65,69\n⟨δω(t)δω(0)⟩= a1e−t/τ1 + a2e−t/τ2 + ∆2\n0\n(2)\nusing an automated curve fitting function (scipy.optimize.curve fit) from the SciPy\nlibrary using the default trust region reflective algorithm.70 Here, ai, τi, γ and ∆2\n0 are the\namplitudes, decay time scales, phase and asymptotic value of the FFCF.\nThe viscosities η for varying acetamide/water ratios were determined from the stress tensor\nP(t) according to η =\nV\n6kBT\nP\nα≤β\nR ∞\n0 ⟨¯Pαβ(0) ¯Pαβ(t)⟩dt (α, β = x, y, z) where ¯Pαβ are the\nupper triangular elements of the modified stress tensor ¯P(t).44,71 Due to the strong inter-\nmolecular interactions and high viscosities, converging η can be rather demanding and is not\nattempted here. Rather, 5 independent NV T simulations of 5 ns each were carried out for\neach composition and the results were averaged to obtain illustrative results for an average\n< η > and a fluctuation around it.\n10\n\n\nResults\nValidation of the Energy Function\nFigure 2: Correlation between interaction energies from reference ab initio calculations and\nthose based on the fitted model for KSCN using the (A) TIP3P and (B) TIP4P water models.\nRandom snapshots were taken from equilibrium simulations, respectively. Panel C shows the\ncorrelation of setup (B) M2TIP4P but with scaled LJ parameter rmin by a factor of 0.96, see\nFigure 3. The systems considered always consist of one SCN−anion surrounded by shells as\nindicated in the legend with corresponding RMSE. The overall RMSEs are 15.56 kcal/mol,\n16.61 kcal/mol, and 17.33 kcal/mol in panels A to C, respectively.\nTo set the stage, the performance of the two optimized energy functions is compared in Figure\n2. The clusters used in the parametrization consist of SCN−(H2O)16 (blue), SCN−K+(H2O)14\n(red), (SCN−)2(H2O)14 or (SCN−)2(H2O)13 (green), and (SCN−)2K+(H2O)12 (magenta). For\nthe M2TIP3P the RMSE of 15.56 kcal/mol compares with 16.61 cal/mol for M2TIP4P. Given\nthe overall energy range of about 150 kcal/mol covered by the data set and the small number\nof adjustable parameters (6 LJ parameters), a 10% difference is acceptable. In addition, for\neach of the subsets (i) to (iv) the correlation between reference and model is clearly established.\nBoth parametrizations underestimate the attractive interaction energy between the center\nSCN−with K+ in the cluster shell, but overestimate the interaction energy between the center\nSCN−and a second SCN−in the cluster shell. The equivalence of the two parametrizations\n11\n\n\nis even more notable as the cluster geometries were generated from two entirely independent\nsimulations, one carried out using the TIP3P water model and the other one using TIP4P.\nEven the RMSE for the four subgroups are within 2 kcal/mol of each other.\nThe optimized energy functions M2TIP3P and M2TIP4P together with the previously pub-\nlished47 multipolar (MTP) electrostatic setup M0 with literature LJ parameter60 were\nvalidated in terms of the system density from NpT simulation of a 3.8 mol/kg KSCN so-\nlution in water and the hydration free energy ∆Ghyd of a single SCN−in water. Figure 3\nreports the results for differently scaled LJ parameters rmin of the SCN−atoms by a factor\nf in the range from f = 0.9 to f = 1.1. The results are compared with the measured\ndensity of an aqueous KSCN solution (ρexp = 1.139 g/cm3) at the equivalent KSCN mo-\nlality of b(KSCN) = 3.821 mol/kg,72 and the estimated hydration free energy for SCN−of\n∆Ghyd ∼−72 kcal/mol73 which compares with related anions such as HS−(−74.0 kcal/mol),\nN−\n3 (−72.0 kcal/mol),74 or CN−(−72.0 ± 0.7 kcal/mol).75\nModel M0 overestimates the experimental density and range of ∆Ghyd even with scaled\nLJ parameters rmin by a factor of f = 1.1, i.e. increased by 10% in order to reduce the\nelectrostatic interactions. Note that all results from MD simulations using model M0 in the\npresent work were performed with scaled LJ parameter rmin by fM0 = 1.1. On the other hand,\nthe optimized energy function M2TIP3P shows good agreement even for fM2,TIP3P = 1.0 with\nan estimated density of ρ = 1.119 g/cm3. Energy function M2TIP4P however, shows the best\nmatch for a scaling factor fM2,TIP4P = 0.96 with ρ = 1.133 g/cm3. In terms of the computed\nhydration free energy of SCN−, both optimized M2 energy functions yield results within the\nexpected range of the experiments (indicated by dashed and dotted lines in Figure 3) for\nunscaled LJ parameter (fM2,TIP3P = fM2,TIP4P = 1.0). For M2TIP4P and a scaling factor of\nfM2,TIP4P = 0.96, where the density is matched best, ∆Ghyd is still within the expected range.\n12\n\n\nThe effect of the LJ parameter scaling fM2,TIP4P = 0.96 for the optimized energy functions\nM2TIP4P on the interaction energy correlation is shown in Figure 2C. The match between\nthe fitted models ∆EFF and the ab initio values deteriorate somewhat with an RMSE of\n17.33 kcal/mol compared with the fully optimized LJ parameter set (RMSE = 16.61 kcal/mol).\nFigure 3: Left panel: Computed density of a 3.8 mol/kg KSCN solution in water at different\nscaled rmin values using models M0 (scaled LJ parameters60 with MTP electrostatics,47 blue),\nM2TIP3P (red), and M2TIP4P (green). Right panel: Hydration free energies ∆Ghyd of a single\nSCN−ion in water solution. The dashed lines are experimental hydration free energies for\nN−\n3 and CN−and the reported ∆Ghyd ∼−72 kcal/mol for SCN−.73 For the density (left\npanel) the result for M2TIP4P indicates that scaling rmin by 0.96 further improves the density.\nEvaluating the training set in Figure 2B with this scaling leads to a deterioration of the\noverall RMSE by 0.7 kcal/mol, see Figure 2C.\nStructure and Ordering of the Mixture\nNext, MD simulations 25 ns in length for the different compositions considered were carried\nout using parametrization M2TIP4P. From these simulations, radial pair distribution functions\ng(r) were determined and compared with results from empirical potential structure refinement\n(EPSR) fits to best reproduce neutron diffraction measurements of aqueous KSCN solution.76\nIt is important to stress that such pair distribution functions are not determined directly from\nexperiments but rather adjusted empirically to reproduce the neutron scattering amplitude\n13\n\n\nwhich is written as a weighted average over pair distribution functions.76 Figure 4 reports\nSCN−–water (top) and SCN−–SCN−(bottom) pair correlation functions for different mixtures\nKSCN in solution (0, 50%, 80%, 100% water content) compared with data obtained from\nEPSR (black).\nFigure 4: Radial distribution function g(r) between (A-C) SCN−atoms and oxygen of water\nand (D-F) between both SCN−anions. The results are shown from simulations using (A, D)\nthe MTP model and scaled LJ parameters, (B, E) the fMDCM approach and cluster fitted\nLJ parameters in TIP3P water and (C, F) the fMDCM approach and fitted LJ parameters\nin TIP4P water. In comparison to the 3.8 mol/kg KSCN/water mixture (100%), g(r) of an\naqueous KSCN solution (2.5 mol/kg) obtained from empirical potential structure refinement\n(EPSR) to match experimentally measured neutron diffraction data are shown as solid black\nlines.76\nThe radial distribution functions g(r) in Figures 4B and C (models M2TIP3P and M2TIP4P)\n14\n\n\nare considerably smoother than those using the MTP model in Figure 4A.47 For simulations in\npure water (100%) direct comparisons between simulations (dot-dashed black line) and EPSR\nresults (solid black line) are possible.76 For model M0, the overall shape of gN−OW(r) agrees\nreasonably well with the EPSR results although the computed pair distribution function is\noverstructured with a local maximum around 5.5 ˚A. Such maxima are not found for models\nmodels M2TIP3P and M2TIP4P for which the position of the maximum is shifted to larger\nseparations and the height of the maximum is overestimated for M2TIP3P but rather well\ndescribed by M2TIP4P. For both M2 models the height of the first peak increases with\ndecreasing water content. In other words, with decreasing water density the ion recruits\nwater molecules. The shapes of g(rS/C/N−O) from simulations using the two M2 models are\nconsistent with those inferred from measurements but typically the peak maxima are shifted\nto longer separations r. A notable feature when using M2TIP4P is the fact that the EPSR\ndata shows some structure in g(rS−O) around 3 ˚A which is captured by M2TIP4P but rather\nabsent when using M2TIP3P. On the other hand, the maximum height of the first peak from\ng(rS−O) is consistent with the EPSR results for simulations with M2TIP3P but clearly too\npronounced for M2TIP4P. Hence, interaction between SCN−and water is too strong at the\nN-end of SCN−for M2TIP3P but at the S-end of SCN−for M2TIP4P.\nThe anion–anion pair distributions functions (Figure 4) for the S–S contacts agree favourably\nbetween EPSR results and simulations using M2TIP3P and M2TIP4P, see panels E and F. Using\na MTP representation (Figure 4D, model M0) for the electrostatics leads to overstructuring\nand the amplitude of the main peak is more than a factor of 2 higher than that derived from\nthe measurements. As the water content decreases, the g(rSS) from M2TIP3P and M2TIP4P\nbehave in a comparable fashion. Only for the water-free system (blue) simulations using\nM2TIP4P yield a higher maximum peak than from using M2TIP3P.\nFor the other two SCN−–SCN−contacts considered (g(rSN) and g(rNN)) the results from using\n15\n\n\nM2TIP3P and M2TIP4P are comparable. The maxima of the first peak are shifted to larger\nseparations by ∼1 ˚A and the maximum heights are somewhat under- and over-estimated,\nrespectively. Compared with simulations using multipolar model M0 using scaled literature\nLJ parameter by a scaling factor fM0 = 1.1, the M0 setup gets the same first peak position\nfor simulation in pure water (see dash-dotted black lines) but the amplitudes are much too\nhigh. The first peaks of g(rSN) are at larger distances then the EPSR data with a slightly\nlarger amplitude in the pure water simulation (Figure 4D).\nThe differences in the SCN−–SCN−radial distribution function from the simulation are\na consequence of the different LJ parameters, ϵ and rmin, of the SCN−atoms and their\ncharges.\nIgnoring the electrostatic multipole components, the MTP model in M0 as-\nsigns atomic charges of qMTP = {−0.183, −0.362, −0.455} e−and the sum of distributed\ncharges to their nearest atoms SCN−in the fMDCM approach (M2TIP3P and M2TIP4P) are\nqfMDCM = {−0.858, 1.000, −1.142} e−for the S, C and N atom, respectively. The large charge\namplitudes in the electrostatic fMDCM approach are the result of fitting the model ESP\nto the ab initio reference ESP, but it causes higher, generally more attractive, electrostatic\ninteraction contribution to the interaction energies between SCN−and other residues such\nas water in comparison to the smaller atomic charges in the MTP model. Due to the larger\nfMDCM charges, the fitted LJ parameters rmin parameter for SCN−atoms are generally larger\n(except for the center carbon atom) than the scaled literature parameter in M0 setup, see LJ\nparameters in Table S3 and S4 in comparison to Table S2. Larger LJ parameters rmin effect\nrepulsive interaction contribution earlier for decreasing nonbonding atom distances to counter\nthe more attractive electrostatic interaction, which also affects the equilibrium SCN−–SCN−\npair distribution and radial distribution functions in the solvent mixtures between the models\nM0 and both M2TIP3P and M2TIP4P.\nTwo-dimensional distributions functions P(α, rCC), P(θ, rCC), and P(α, θ) in Figure 5 provide\n16\n\n\nFigure 5: Contour plots of the radial-angular distribution plots of SCN−pairs in different\nwater/acetamide solutions (columns) from simulations using (A, M2TIP4P) and B, M0. The\ndata for model M0 is from previous work47 and the coordinate system as in the upper\nright-hand side.\n17\n\n\na complementary view of the relative orientation of the anions. The definition of the coordi-\nnates is also provided in this Figure. The bottom row (P(α, rCC)) in Figure 5A shows that\nwith increasing water content the average C–C separation in simulations using the M2TIP4P\nmodel shifts to larger values. This is consistent with Figure 4F and with simulations using\nM2TIP3P, see Figure 4D. On the other hand, the maximum of the relative angular orientation,\ndescribed by α, remains the same for all solvent mixtures although the angular constraint\ntightens as the water concentration increases. Finally, the average azimuthal orientation θ\nremains around 90◦for all solvent compositions. These distributions contrast with those\nfrom simulations using model M0 which are reported in Figure 5B. Atomic multipoles have\npronounced directionality as they are based on p- and d-orbitals if moments up to quadrupole\nare included. This directionality can lead to overstructuring which is particularly prevalent\nfor the θ−direction (green and blue distributions).\nDynamics of the Mixtures\nNext, the dynamics of the mixtures was studied by analyzing the C–N vibrations from\ninstantaneous normal modes68 of the SCN−anion. For this, the frequency fluctuation cor-\nrelation functions (FFCF) for varying water content were determined, see Figure 6A/B for\nthe FFCFs from simulations with models M2TIP3P and M2TIP4P, respectively. Figure 6C\nreports the experimentally measured FFCFs from the 2D-IR experiments.47 The FFCFs\nfeature a pronounced dependence on the water content from 0% (red) to 100% (purple) water\nfraction and the computed decay curves rather realistically describe the measurements for\nboth optimized models. Assuming a single exponential function for representing the computed\nFFCFs leads to a considerably deteriorated fit compared with assuming two time scales.\nHence, for the FFCFs from the simulations a bi-exponential fit was used as a meaningful\nmodel for all mixtures from which two time scales τfast and τslow were extracted.\n18\n\n\nTo allow direct comparison between experiment and simulations, the experimental data was\nalso fit to a double-exponential, see Eq. 2A. The resulting lifetimes τfast and τslow are shown\nin Figure 7. All optimized parameters of the bi-exponential fit are reported in Figure S9 and\nTable S5. Qualitatively, the two M2 models capture the experimentally observed FFCFs and\ntheir dependence on the amount of water in the solvent mixture.\nFigure 6: Panels A and B: FFCF (solid lines) of the INM frequencies ν3 of SCN−anion\nfrom simulation with water models for different mixing ratios of acetamide and water. Panel\nC: Measured spectral diffusion.47 Gray lines in panel C are experimental results for which\nno simulations were carried out. A bi-exponential function (dashed lines) was fit to each\ncomputed FFCF (A, B) and to the experimental data in panel C in the range from 0.25 ps to\n1 ns. All computed FFCFs are normalized.\nA quantitative analysis and comparison with measurements is afforded by considering the\ndecay times of the FFCFs depending on water content, see Figure 7. Experimentally, the\nslow decay τ exp\nslow (black filled triangles) decreases almost monotonously with increasing water\ncontent. This is qualitatively reproduced from simulations using both models. However, it is\ninteresting to note that for the highest water content the M2TIP4P model is rather consistent\nwith the experiment whereas for M2TIP3P τslow continues to decrease with increasing water\ncontent. For the fast decay τ exp\nfast (black open triangles) an increase with increasing water\ncontent up to ∼30 % is observed followed by a monotonous decrease. Both, M2TIP3P and\nM2TIP4P, do not reproduce the plateau between 20 % and 40 %. On the other hand, the\ndecrease for τfast above 60 % water content is realistically described. From a quantitative\n19\n\n\nperspective, results from simulations using M2TIP4P are in somewhat closer agreement with\nexperiment.\nFigure 7: Panel A: Fitted lifetimes (log-scale) τslow (full marker) and τfast (open marker) of\na bi-exponential function to the FFCF of the INM frequencies ν3 of the SCN−anion from\nsimulation with different water models. The lifetimes from the bi-exponential fit to the\nexperimental spectral diffusion are shown in black. Panel B: Amplitude-weighted decay times\nτcomb for all results, see text. For results on a linear scale, see Figure S9.\nIt is, however, known that in biexponential fits the parameters can be strongly correlated.\nTherefore, amplitude-weighted decay times τcomb = aslowτslow + afastτfast were also considered,\nsee Figure 7B, with amplitudes reported in Figure S9A. Again, the computations reproduce\nthe general trend: the decrease in τcomb with increasing water content. However, simulations\nusing both M2 models considered here feature a somewhat too steep decrease with increasing\nwater content except for M2TIP4P for the highest water ratio.\nFinally, simulations of KSCN in acetamide using models M2TIP3P and M2TIP4P yield average\nviscosities of 40.9 ± 15.0 mPa·s and 17.8 ± 3.8 mPa·s, respectively, that differ by a factor of 3\nfor the water-free system (i.e. only acetamide as the solvent) which underestimate the experi-\nmentally reported value η = 127.3 mPa·s at 303.15 K.77,78 With increasing water content η\ndecreases exponentially which is correctly captured from both M2 models. For KSCN in pure\n20\n\n\nFigure 8: Computed viscosity from the Green-Kubo relation (see main text) using the stress\ntensor correlation function from simulations of KSCN in acetamide/TIP3P M2TIP3P and\nacetamide/TIP4P mixtures M2TIP4P. The results were obtained from 5 individual runs of\n5 ns NV T simulations each per mixture. The standard deviation of the viscosity estimations\nper run are shown as error bar. It is important to stress that the simulation length (5 ns) is\nnot sufficient for convergence, in particular for low water content. Experimental measured\nviscosities for KSCN in acetamide (upper and lower triangle)77 and in water (open square)72\nare shown but at different temperatures.\n21\n\n\nwater, the experimentally reported viscosity of 0.92 mPa·s (for c = 3.355 mol/l)72 at lower\ntemperature of 298.15 K compares with 0.56 mPa·s (M2TIP3P) and 0.72 mPa·s (M2TIP4P) at\n300 K, which is rather encouraging. Hence, part of the disagreement for low-water content\ncan probably be mitigated by including acetamide in the fitting procedure. With respect to\ncomparing results from simulations and experiments it is worthwhile to mention that the\nexperiments hint towards a pronounced effect of temperature on η: increasing T by 10 K\nreduces η by a factor of two. It should also be noted that further converging η requires\nprobably longer simulation times. From a computer efficiency perspective it appears to be\nadvisable to consider η as a validation property rather than a property used for fitting the\nintermolecular interactions.\nThe smaller viscosities of the KSCN in different acetamide/water mixtures using both M2\nmodels can be related to the larger LJ parameter rmin than in literature for SCN−. Even\nthough the LJ parameter is optimized to fit reference interaction energies between SCN−and\nwater-containing cluster shells, no fits to interaction energies including acetamide have been\ndone. In general, increased LJ parameters rmin on SCN−increase space between the anion\nand other surrounding species (see radial distribution functions in Figure 4) which leads to\nweaker interactions with acetamide, increased mobility and hence reduced viscosity.\nConclusions\nThe present work validates a cluster-based parametrization workflow for energy functions of\nelectrostatically driven systems (here eutectic liquids) based on quantum chemical interaction\nenergies. Irrespective of the water model used (TIP3P or TIP4P) the thermodynamic (density\nρ, hydration free energy ∆Ghyd), structural (pair distribution functions g(r)), spectroscopic\n(2d-infrared), and transport (viscosity η) properties are realistically described by using models\n22\n\n\nM2TIP3P and M2TIP4P from extensive MD simulations.\nThe fact that the cluster-based approach is largely insensitive to the water model used (here\nTIP3P vs. TIP4P) indicates that other, yet “better” water models (BWM) can be employed\nto conceive models M2BWM. The performance of such models is expected to be particularly\nrealistic for high-water content whereas for low-water content the parametrization protocol\nneeds to include the cosolvent (here acetamide).\nIn conclusion, the present work demonstrates that in the absence or limited availability\nof reference measurements to validate such parametrizations, conceiving energy functions\nfollowing model M2 provides a meaningful starting point for (semi-)quantitative simulations,\ndepending on the property considered. It will be interesting to apply the present approach to\nother compositions and different systems, such as ionic liquids.\nAcknowledgment\nThis work has been financially supported by the Swiss National Science Foundation (NCCR\nMUST, 200020 219779, 200021 215088 to MM), the University of Basel (to MM) by European\nUnion’s Horizon 2020 research and innovation program under the Marie Sk lodowska-Curie\ngrant agreement No 801459 -FP-RESOMUS (to KT).\nSupporting Information\nThe supporting material includes Table S1 to S5 and Figure S9.\n23\n\n\nData Availability\nRelevant data for the present study are available at https://github.com/MMunibas/DES3.\nReferences\n(1) Dodson, G. G.; Lane, D. P.; Verma, C. S. Molecular simulations of protein dynamics:\nnew windows on mechanisms in biology. EMBO reports 2008, 9, 144–150.\n(2) Klepeis, J. L.; Lindorff-Larsen, K.; Dror, R. O.; Shaw, D. E. Long-timescale molecular\ndynamics simulations of protein structure and function. Current opinion in structural\nbiology 2009, 19, 120–127.\n(3) Liu, H.; Maginn, E.; Visser, A. E.; Bridges, N. J.; Fox, E. B. Thermal and transport\nproperties of six ionic liquids: an experimental and molecular dynamics study. Industrial\n& Engineering Chemistry Research 2012, 51, 7242–7254.\n(4) Habasaki, J.; Ngai, K. Heterogeneous dynamics of ionic liquids from molecular dynamics\nsimulations. J. Chem. Phys. 2008, 129.\n(5) T¨opfer, K.; Pasti, A.; Das, A.; Salehi, S. M.; Vazquez-Salazar, L. I.; Rohrbach, D.;\nFeurer, T.; Hamm, P.; Meuwly, M. Structure, Organization, and Heterogeneity of\nWater-Containing Deep Eutectic Solvents. J. Am. Chem. Soc. 2022, 144, 14170–14180.\n(6) Zhang, J.; Pagotto, J.; Gould, T.; Duignan, T. T. Scalable and accurate simulation of\nelectrolyte solutions with quantum chemical accuracy. 2025,\n(7) Soloviov, M.; Das, A. K.; Meuwly, M. Structural Interpretation of Metastable States in\nMyoglobin–NO. 2016, 55, 10126–10130.\n(8) El Hage, K.; Hedin, F.; Gupta, P. K.; Meuwly, M.; Karplus, M. Valid molecular dynamics\nsimulations of human hemoglobin require a surprisingly large box size. Elife 2018, 7,\ne35560.\n24\n\n\n(9) Salehi, S. M.; Koner, D.; Meuwly, M. Dynamics and infrared spectrocopy of monomeric\nand dimeric wild type and mutant insulin. J. Phys. Chem. B 2020, 124, 11882–11894.\n(10) Helbing, J.; Hamm, P. Versatile femtosecond laser synchronization for multiple-timescale\ntransient infrared spectroscopy. J. Phys. Chem. A 2023, 127, 6347–6356.\n(11) K¨aser, S.; Boittier, E. D.; Upadhyay, M.; Meuwly, M. Transfer learning to CCSD (T):\nAccurate anharmonic frequencies from machine learning models. J. Chem. Theo. Comp.\n2021, 17, 3687–3699.\n(12) K¨aser, S.; Meuwly, M. Transfer-learned potential energy surfaces: Toward microsecond-\nscale molecular dynamics simulations in the gas phase at CCSD (T) quality. J. Chem.\nPhys. 2023, 158.\n(13) K¨aser, S.; Richardson, J. O.; Meuwly, M. Transfer learning for affordable and high-\nquality tunneling splittings from instanton calculations. J. Chem. Theo. Comp. 2022,\n18, 6840–6850.\n(14) K¨aser, S.; Richardson, J. O.; Meuwly, M. Accurate Tunneling Splittings for Ever-Larger\nMolecules from Transfer-Learned, CCSD (T) Quality Energy Functions. arXiv preprint\narXiv:2407.21366 2024,\n(15) Mackerell, A. D. Empirical Force Fields for Biological Macromolecules: Overview and\nIssues. J. Comp. Chem. 2004, 25, 1584–1604.\n(16) Salehi, S. M.; Koner, D.; Meuwly, M. Vibrational Spectroscopy of N−\n3 in the Gas and\nCondensed Phase. J. Phys. Chem. B 2019, 123, 3282–3290.\n(17) Koner, D.; Salehi, S. M.; Mondal, P.; Meuwly, M. Non-conventional Force Fields for\nApplications in Spectroscopy and Chemical Reaction Dynamics. J. Chem. Phys. 2020,\n153, 010901.\n25\n\n\n(18) Koner, D.; Meuwly, M. Permutationally invariant, reproducing kernel-based potential\nenergy surfaces for polyatomic molecules: From formaldehyde to acetone. J. Chem.\nTheo. Comp. 2020, 16, 5474–5484.\n(19) Nandi, A.; Qu, C.; Bowman, J. M. Full and fragmented permutationally invariant poly-\nnomial potential energy surfaces for trans and cis N-methyl acetamide and isomerization\nsaddle points. J. Chem. Phys. 2019, 151.\n(20) Li, J.; Carter, S.; Bowman, J. M.; Dawes, R.; Xie, D.; Guo, H. High-level, first-principles,\nfull-dimensional quantum calculation of the ro-vibrational spectrum of the simplest\ncriegee intermediate (CH2OO). J. Phys. Chem. Lett. 2014, 5, 2364–2369.\n(21) Stone, A. The Theory of Intermolecular Forces; Oxford University Press: Cambridge,\n2013.\n(22) Handley, C. M.; Hawe, G. I.; Kell, D. B.; Popelier, P. L. A. Optimal Construction of a\nFast and Accurate Polarisable Water Potential Based on Multipole Moments Trained\nby Machine Learning. Phys. Chem. Chem. Phys. 2009, 11, 6365.\n(23) Bereau, T.; Kramer, C.; Meuwly, M. Leveraging Symmetries of Static Atomic Multipole\nElectrostatics in Molecular Dynamics Simulations. J. Chem. Theo. Comput. 2013, 9,\n5450–5459.\n(24) Devereux, M.; Raghunathan, S.; Fedorov, D. G.; Meuwly, M. A Novel, Computationally\nEfficient Multipolar Model Employing Distributed Charges for Molecular Dynamics\nSimulations. J. Chem. Theo. Comp. 2014, 10, 4229.\n(25) Bereau, T.; Meuwly, M. Many-Body Effects and Electrostatics in Biomolecules; Jenny\nStanford Publishing, 2016; pp 251–286.\n(26) Jing, Z.; Liu, C.; Cheng, S. Y.; Qi, R.; Walker, B. D.; Piquemal, J.-P.; Ren, P. Polarizable\n26\n\n\nForce Fields for Biomolecular Simulations: Recent Advances and Applications. Ann.\nRev. Biophys. 2019, 48, 371–394.\n(27) Halgren, T. A. The Representation of Van Der Waals (vdw) Interactions in Molecular\nMechanics Force Fields: Potential Form, Combination Rules, and Vdw Parameters. J.\nAm. Chem. Soc. 1992, 114, 7827–7843.\n(28) Bzowski, J.; Mason, E.; Kestin, J. On Combination Rules for Molecular Van Der Waals\nPotential-well Parameters. Int. J. Therm.. 1988, 9, 131–143.\n(29) Delhommelle, J.; Milli´e, P. Inadequacy of the Lorentz-berthelot Combining Rules for\nAccurate Predictions of Equilibrium Properties by Molecular Simulation. Mol. Phys.\n2001, 99, 619–625.\n(30) Abbott, A. P.; Capper, G.; Davies, D. L.; Rasheed, R. K.; Tambyrajah, V. Novel solvent\nproperties of choline chloride/urea mixtures. Chem. Commun. 2003, 70–71.\n(31) Marcus, Y. Deep Eutectic Solvents; Springer, 2019; pp 185–191.\n(32) Martins, M. A.; Pinho, S. P.; Coutinho, J. A. Insights into the nature of eutectic and\ndeep eutectic mixtures. Journal of Solution Chemistry 2019, 48, 962–982.\n(33) Smith, E. L.; Abbott, A. P.; Ryder, K. S. Deep eutectic solvents (DESs) and their\napplications. Chem. Rev. 2014, 114, 11060–11082.\n(34) Isaac, I. Y.; Kerridge, D. H. Molten acetamide–potassium thiocyanate eutectic: spec-\ntroscopy of first-row transition metal compounds in a room temperature melt. J. Chem.\nSoc., Dalton Trans. 1988, 2701–2704.\n(35) Kalita, G.; Rohman, N.; Mahiuddin, S. Viscosity and molar volume of potassium\nthiocyanate+ sodium thiocyanate+ acetamide melt systems. J. Chem. Eng. Data 1998,\n43, 148–151.\n27\n\n\n(36) Sakpal, S. S.; Deshmukh, S. H.; Chatterjee, S.; Ghosh, D.; Bagchi, S. Transition of a\ndeep eutectic solution to aqueous solution: A dynamical perspective of the dissolved\nsolute. J. Phys. Chem. Lett. 2021, 12, 8784–8789.\n(37) Velez, C.; Acevedo, O. Simulation of deep eutectic solvents: Progress to promises. Wiley\nIntern. Rev. Comp. Mol. Sci. 2022, 12, e1598.\n(38) Ferreira, E. S.; Voroshylova, I. V.; Pereira, C. M.; DS Cordeiro, M. N. Improved force\nfield model for the deep eutectic solvent ethaline: Reliable physicochemical properties.\nJ. Phys. Chem. B 2016, 120, 10124–10137.\n(39) Goloviznina, K.; Gong, Z.; Padua, A. A. The CL &Pol polarizable force field for the\nsimulation of ionic liquids and eutectic solvents. Wiley Intern. Rev. Comp. Mol. Sci.\n2022, 12, e1572.\n(40) Maglia de Souza, R.; Karttunen, M.; Ribeiro, M. C. C. Fine-tuning the polarizable\nCL&Pol force field for the deep eutectic solvent ethaline. J. Chem. Inf. Model. 2021,\n61, 5938–5947.\n(41) Doherty, B.; Acevedo, O. OPLS force field for choline chloride-based deep eutectic\nsolvents. J. Phys. Chem. B 2018, 122, 9982–9993.\n(42) Jeong, K.-J.; McDaniel, J. G.; Yethiraj, A. Deep eutectic solvents: Molecular simulations\nwith a first-principles polarizable force field. J. Phys. Chem. B 2021, 125, 7177–7186.\n(43) Garc´ıa, G.; Atilhan, M.; Aparicio, S. The impact of charges in force field parameterization\nfor molecular dynamics simulations of deep eutectic solvents. J. Mol. Liq. 2015, 211,\n506–514.\n(44) Zhang, Y.; Squire, H.; Gurkan, B.; Maginn, E. J. Refined classical force field for choline\nchloride and ethylene glycol mixtures over wide composition range. J. Chem. Eng. Data\n2022, 67, 1864–1871.\n28\n\n\n(45) Wang, J.; Wolf, R. M.; Caldwell, J. W.; Kollman, P. A.; Case, D. A. Development and\ntesting of a general amber force field. J. Comp. Chem. 2004, 25, 1157–1174.\n(46) Perkins, S. L.; Painter, P.; Colina, C. M. Experimental and computational studies of\ncholine chloride-based deep eutectic solvents. J. Chem. Eng. Data 2014, 59, 3652–3662.\n(47) T¨opfer, K.; Boittier, E.; Devereux, M.; Pasti, A.; Hamm, P.; Meuwly, M. Force Fields for\nDeep Eutectic Mixtures: Application to Structure, Thermodynamics and 2D-Infrared\nSpectroscopy. J. Phys. Chem. B 2024, 128, 10937–10949.\n(48) Devereux, M.; Boittier, E. D.; Meuwly, M. Systematic improvement of empirical energy\nfunctions in the era of machine learning. J. Comp. Chem. 2024, 45, 1899–1913.\n(49) Brooks, B. R.; Brooks III, C. L.; MacKerell Jr., A. D.; Nilsson, L.; Petrella, R. J.;\nRoux, B.; Won, Y.; Archontis, G.; Bartels, C.; Boresch, S. et al. CHARMM: The\nBiomolecular Simulation Program. J. Comp. Chem. 2009, 30, 1545–1614.\n(50) Boittier, E. D.; Devereux, M.; Meuwly, M. Molecular Dynamics with Conformationally\nDependent, Distributed Charges. J. Chem. Theo. Comp. 2022, 18, 7544–7554.\n(51) Hwang, W.; Austin, S. L.; Blondel, A.; Boittier, E. D.; Boresch, S.; Buck, M.; Buckner, J.;\nCaflisch, A.; Chang, H.-T.; Cheng, X. et al. CHARMM at 45: Enhancements in\nAccessibility, Functionality, and Speed. J. Phys. Chem. B 2024, 128, 9976–10042.\n(52) Unke, O. T.; Meuwly, M. Toolkit for the construction of reproducing kernel-based\nrepresentations of data: Application to multidimensional potential energy surfaces. J.\nChem. Theo. Comp. 2017, 57, 1923–1931.\n(53) Ryckaert, J.-P.; Ciccotti, G.; Berendsen, H. J. C. Numerical integration of the cartesian\nequations of motion of a system with constraints: molecular dynamics of n-alkanes. J.\nChem. Phys. 1977, 23, 327–341.\n29\n\n\n(54) Darden, T.; York, D.; Pedersen, L. Particle mesh Ewald: An N*log(N) method for\nEwald sums in large systems. J. Chem. Phys. 1993, 98, 10089–10092.\n(55) Mart´ınez, L.; Andrade, R.; Birgin, E. G.; Mart´ınez, J. M. Packmol: A Package for\nBuilding Initial Configurations for Molecular Dynamics Simulations. J. Comp. Chem.\n2009, 30, 2157–2164.\n(56) Hoover, W. G. Canonical dynamics: Equilibrium phase-space distributions. Phys. Rev.\nA 1985, 31, 1695–1697.\n(57) Feller, S. E.; Zhang, Y.; Pastor, R. W.; Brooks, B. R. Constant pressure molecular\ndynamics simulation: The Langevin piston method. J. Chem. Phys. 1995, 103, 4613–\n4621.\n(58) Vanommeslaeghe, K.; Hatcher, E.; Acharya, C.; Kundu, S.; Zhong, S.; Shim, J.; Dar-\nian, E.; Guvench, O.; Lopes, P.; Vorobyov, I. et al. CHARMM general force field: A\nforce field for drug-like molecules compatible with the CHARMM all-atom additive\nbiological force fields. J. Comp. Chem. 2010, 31, 671–690.\n(59) Jorgensen, W. L.; Chandrasekhar, J.; Madura, J. D.; Impey, R. W.; Klein, M. L.\nComparison of Simple Potential Functions for Simulating Liquid Water. J. Chem. Phys.\n1983, 79, 926–935.\n(60) Bian, H.; Chen, H.; Zhang, Q.; Li, J.; Wen, X.; Zhuang, W.; Zheng, J. Cation effects\non rotational dynamics of anions and water molecules in alkali (Li+, Na+, K+, Cs+)\nthiocyanate (SCN−) aqueous solutions. J. Phys. Chem. B 2013, 117, 7972–7984.\n(61) Ho, T.; Rabitz, H. A general method for constructing multidimensional molecular\npotential energy surfaces from ab-initio calculations. J. Chem. Phys. 1996, 104, 2584–\n2597.\n30\n\n\n(62) Boys, S. F.; Bernardi, F. The calculation of small molecular interactions by the differences\nof separate total energies. Some procedures with reduced errors. Mol. Phys. 1970, 19,\n553–566.\n(63) Frisch, M. J.; Trucks, G. W.; Schlegel, H. B.; Scuseria, G. E.; Robb, M. A.; Cheese-\nman, J. R.; Scalmani, G.; Barone, V.; Petersson, G. A.; Nakatsuji, H. et al. Gaussian˜16\nRevision C.01. 2016; Gaussian Inc. Wallingford CT.\n(64) Kadaoluwa Pathirannahalage, S. P.; Meftahi, N.; Elbourne, A.; Weiss, A. C.; Mc-\nConville, C. F.; Padua, A.; Winkler, D. A.; Costa Gomes, M.; Greaves, T. L.; Le, T. C.\net al. Systematic comparison of the structural and dynamic properties of commonly\nused water models for molecular dynamics simulations. J. Chem. Inf. Model. 2021, 61,\n4521–4536.\n(65) Lee, M. W.; Carr, J. K.; G¨ollner, M.; Hamm, P.; Meuwly, M. 2D IR spectra of cyanide\nin water investigated by molecular dynamics simulations. J. Chem. Phys. 2013, 139,\n054506.\n(66) Straatsma, T.; Berendsen, H. Free energy of ionic hydration: Analysis of a thermody-\nnamic integration technique to evaluate free energy differences by molecular dynamics\nsimulations. J. Chem. Phys. 1988, 89, 5876–5886.\n(67) Mackerell Jr., A. D. Empirical force fields for biological macromolecules: Overview and\nissues. J. Comp. Chem. 2004, 25, 1584–1604.\n(68) Cho, M.; Fleming, G. R.; Saito, S.; Ohmine, I.; Stratt, R. M. Instantaneous Normal\nMode Analysis of Liquid Water. J. Chem. Phys. 1994, 100, 6672–6683.\n(69) Kozi´nski, M.; Garrett-Roe, S.; Hamm, P. Vibrational spectral diffusion of CN−in water.\nChem. Phys. 2007, 341, 5–10.\n31\n\n\n(70) Virtanen, P.; Gommers, R.; Oliphant, T. E.; Haberland, M.; Reddy, T.; Cournapeau, D.;\nBurovski, E.; Peterson, P.; Weckesser, W.; Bright, J. et al. SciPy 1.0: fundamental\nalgorithms for scientific computing in Python. Nat. Meth. 2020, 17, 261–272.\n(71) Zhang, Y.; Poe, D.; Heroux, L.; Squire, H.; Doherty, B. W.; Long, Z.; Dadmun, M.;\nGurkan, B.; Tuckerman, M. E.; Maginn, E. J. Liquid Structure and Transport Properties\nof the Deep Eutectic Solvent Ethaline. J. Phys. Chem. B 2020, 124, 5251–5264.\n(72) Mitchell, J. P.; Butler, J. B.; Albright, J. G. Measurement of Mutual Diffusion Coeffi-\ncients, Densities, Viscosities, and Osmotic Coefficients for the System KSCN-H2O at\n25°C. J Solution Chem 1992, 21, 1115–1129.\n(73) Marcus, Y. Ion Properties; Ion Properties 1; Taylor & Francis, 1997.\n(74) Pearson, R. G. Ionization potentials and electron affinities in aqueous solution. J. Am.\nChem. Soc. 1986, 108, 6109–6114.\n(75) Pliego, J. R.; Riveros, J. M. New values for the absolute solvation free energy of univalent\nions in aqueous solution. Chem. Phys. Lett. 2000, 332, 597–602.\n(76) Botti, A.; Pagnotta, S. E.; Bruni, F.; Ricci, M. A. Solvation of KSCN in Water. J. Phys.\nChem. B 2009, 113, 10014–10021.\n(77) Liu, B.; Liu, Y. Properties for binary mixtures of (acetamide+KSCN) eutectic ionic\nliquid with ethanol at several temperatures. J. Chem. Thermodyn. 2016, 92, 1–7.\n(78) Liu, B.; Zhao, J.; Wei, F. Effects of water on the properties of acetamide-KSCN eutectic\nionic liquids at several temperatures. J. Mol. Liq. 2013, 187, 309–313.\n32\n\n\nSupporting Information: Force Fields for Deep Eutectic Systems: K+/SCN−in\nWater/Acetamide Mixtures\nSupporting Figures and Tables\nTable S1: Molar fraction and number of molecules (Water/W, Acetamide/ACM,\nK+ and SCN−) used on the MD simulations for each component of the systems\nfor given W:ACM mixing ratio.\nMolar Fraction\nNumber of Molecules\nW:ACM\nH2O\nAcetamide\nKSCN\nH2O\nAcetamide\nKSCN\n100\n0.901\n0.000\n0.099\n685\n0\n75\n90\n0.791\n0.092\n0.118\n506\n59\n75\n80\n0.686\n0.179\n0.135\n381\n100\n75\n70\n0.586\n0.263\n0.152\n290\n130\n75\n50\n0.399\n0.418\n0.183\n164\n171\n75\n40\n0.312\n0.490\n0.198\n119\n186\n75\n30\n0.229\n0.559\n0.212\n81\n198\n75\n20\n0.149\n0.626\n0.225\n50\n209\n75\n0\n0.000\n0.750\n0.250\n0\n225\n75\nFigure S9: Panels A to C: Optimized amplitudes, (τfast, τslow) (linear scale) and ∆2\n0 of the\nbi-exponential fits to the computed frequency-frequency correlation functions and the spectral\ndiffusion. The vibrational mode considered was ν3 of SCN−and frequencies were determined\nfrom instantaneous normal modes.\nS33\n\n\nTable S2: Bonded and non-bonded parameters for Model M0 using atomic\nmultipoles (MTP) up to quadrupole. Nonbonded LJ parameters for SCN−are\nadopted from Ref. 60 with rmin scaled by f = 1.1.\nResidues\nParameters\nAcetamide\nCGenFF58\nWater\nTIP3P59\nK+\nNonbonded60\nϵ (kcal/mol)\nrmin (˚A)\nq (e)\nK+\n0.1004\n3.7378\n+1\nSCN−\nBonded\nRKHS (see a)\nNonbonded\nϵ (kcal/mol)\nrmin (˚A)\nq (e)\nS\n0.3639\n4.3462 (= 1.1 · 3.9510)\n−0.183\nC\n0.0741\n4.0870 (= 1.1 · 3.7154)\n−0.455\nN\n0.1016\n4.1362 (= 1.1 · 3.7602)\n−0.362\nAtomic Multipoles\nS\nC\nN\nQ00\n−0.183\n−0.362\n−0.455\nQ10\n1.179\n0.163\n0.319\nQ11c\n0.0\n0.0\n0.0\nQ11s\n0.0\n0.0\n0.0\nQ20\n−1.310\n−0.929\n−3.114\nQ21c\n0.0\n0.0\n0.0\nQ21s\n0.0\n0.0\n0.0\nQ22c\n0.0\n0.0\n0.0\nQ22s\n0.0\n0.0\n0.0\nahttps://github.com/MMunibas/DES2/blob/main/M0/source/rkhs_SCN_rRz.csv\nS34\n\n\nTable S3: Bonded and non-bonded parameters for simulation using the TIP3P\nwater model labeled as M2TIP3P. Nonbonded LJ parameters for SCN−are adopted\nfrom cluster interaction energy fit.\nResidues\nParameters\nAcetamide\nCGenFF58\nWater\nTIP3P59\nK+\nNonbonded60\nϵ (kcal/mol)\nrmin (˚A)\nq (e)\nK+\n0.1004\n3.7378\n+1\nSCN−\nBonded\nRKHS (see a)\nNonbonded\nϵ (kcal/mol)\nrmin (˚A)\nq (e)\nS\n0.1836\n4.8558\n−\nC\n0.0001\n3.7868\n−\nN\n0.0223\n4.5720\n−\nElectrostatic Model\nfMDCM (see b)\nahttps://github.com/MMunibas/DES2/blob/main/M2/source/rkhs_SCN_rRz.csv\nbhttps://github.com/MMunibas/DES2/blob/main/M2/source/scn_fluc.dcm\nTable S4: Bonded and non-bonded parameters simulation using the TIP4P water\nmodel labeled as M2TIP4P. Nonbonded LJ parameters for SCN−are adopted from\ncluster interaction energy fit.\nResidues\nParameters\nAcetamide\nCGenFF58\nWater\nTIP4P59\nK+\nNonbonded60\nϵ (kcal/mol)\nrmin (˚A)\nq (e)\nK+\n0.1004\n3.7378\n+1\nSCN−\nBonded\nRKHS (see a)\nNonbonded\nϵ (kcal/mol)\nrmin (˚A)\nq (e)\nS\n0.1118\n5.3984\n−\nC\n0.0001\n3.1786\n−\nN\n0.0037\n5.0388\n−\nElectrostatic Model\nfMDCM (see b)\nahttps://github.com/MMunibas/DES2/blob/main/M3/source/rkhs_SCN_rRz.csv\nbhttps://github.com/MMunibas/DES2/blob/main/M3/source/scn_fluc.dcm\nS35\n\n\nTable S5:\nFitted lifetimes in ps to the (M0, M1, M2) computed FFCFs\nand (Exp.)\nexperimentally measured spectral diffusion from KSCN in wa-\nter(W)/acetamide(ACM) mixtures for given W:ACM mixing ratios.\nM2TIP3P\nM2TIP4P\nExp.\nW:ACM\nτfast\nτslow\nτfast\nτslow\nτfast\nτslow\n0\n6.28\n78.21\n5.26\n67.89\n2.20\n22.74\n10\n-\n-\n-\n-\n2.97\n15.30\n20\n5.26\n54.64\n5.10\n49.11\n4.66\n21.55\n30\n-\n-\n-\n-\n3.92\n17.16\n40\n-\n-\n-\n-\n4.14\n16.01\n50\n2.47\n24.14\n2.43\n22.95\n3.28\n12.87\n60\n-\n-\n-\n-\n2.99\n11.76\n70\n1.31\n12.33\n1.46\n13.29\n3.10\n12.24\n80\n0.90\n8.23\n1.23\n12.36\n3.14\n11.80\n90\n0.65\n5.87\n1.00\n14.13\n2.54\n10.37\n100\n0.42\n3.64\n0.71\n14.07\n1.29\n10.01\nS36\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21233v1.pdf",
    "total_pages": 36,
    "title": "Structure and Dynamics of Deep Eutectic Systems from Cluster-Optimized Energy Functions",
    "authors": [
      "Kai Töpfer",
      "Jingchun Wang",
      "Shimoni Patel",
      "Markus Meuwly"
    ],
    "abstract": "Generating energy functions for heterogeneous systems suitable for\nquantitative and predictive atomistic simulations is a challenging undertaking.\nThe present work combines a cluster-based approach with electronic structure\ncalculations at the density functional theory level and machine learning-based\nenergy functions for a spectroscopic reporter for eutectic mixtures consisting\nof water, acetamide and KSCN. Two water models are considered: TIP3P which is\nconsistent with the CGenFF energy function and TIP4P which - as a water model -\nis superior to TIP4P. Both fitted models, {\\bf M2$^{\\rm TIP3P}$} and {\\bf\n  M2$^{\\rm TIP4P}$}, yield favourable thermodynamic, structural, spectroscopic\nand transport properties from extensive molecular dynamics simulations. In\nparticular, the slow and fast decay times from 2-dimensional infrared\nspectroscopy and the viscosity for water-rich mixtures are described\nrealistically and consistent with experiments. On the other hand, including the\nco-solvent (acetamide) in the present case is expected to further improve the\ncomputed viscosity for low-water content. It is concluded that such a\ncluster-based approach is a promising and generalizable route for routine\nparametrization of heterogeneous, electrostatically dominated systems.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}