{
  "id": "arxiv_2502.21210v1",
  "text": "A decision analysis model for colorectal cancer\nscreening\nDaniel Corrales, MSc, daniel.corrales @ icmat.es ∗a, David R´ıos Insua, PhD, david.rios\n@ icmat.es a, and Marino J. Gonz´alez, PhD, marino-jose.gonzalez @ unirioja.es b\naInstitute of Mathematical Sciences, ICMAT-CSIC, 28049 Madrid, Spain\nbDepartment of Economics, University of La Rioja, 26006 Logro˜no, Spain\nAbstract\nBackground and Objective\nWith minor differences, most national colorectal\ncancer (CRC) screening programs in Europe consist of one-size-fits-all aged-based\nstrategies. This paper provides a decision analysis-based approach to personalized\nCRC screening, supporting decisions concerning whether and which screening\nmethod to consider and/or whether a colonoscopy should be administered.\nMethods\nWe use an influence diagram which characterizes CRC risk with re-\nspect to different variables of interest and includes comfort, costs, complications,\nand information as decision criteria, the last one assessed through information\ntheory measures. The criteria are integrated with a multi-attribute utility model.\nOptimal screening policies are then computed.\nResults\nThe proposed model is used to support personalized individual screen-\ning based on relevant characteristics. It serves to assess existing national screen-\ning programs and design new ones. In particular, it suggests replacing current\nage-based strategies followed in many European countries by more personalized\nstrategies based on the type of model proposed. Additionally, the model facili-\ntates benchmarking of novel screening devices.\nConclusions\nThis work creates a framework supporting personalized CRC\nscreening improving upon current age-based screening strategies.\n1\nIntroduction\nAlthough colorectal cancer (CRC) is the third most common type of cancer worldwide,\nmaking up for about 10 % of all cases, only about 14 % of susceptible EU citizens\nparticipate in CRC screening programs. At the moment, these are mainly one-size-\nfits-all\nstrategies [1] focused on age and using fecal testing and colonoscopy (CS).\nThe latter is considered highly invasive, influencing quite negatively program uptake\namong the general population [2]. It has been reported [3] through the European Health\n∗Corresponding author.\n1\narXiv:2502.21210v1  [stat.AP]  28 Feb 2025\n\n\nInterview Survey (2018-2020) that the coverage of faecal tests in the population aged\n50-74 varies according to the organisation of the screening programme. In countries\nwith fully rolled-out programmes it varies from 37.7% in Croatia to 74.9% in Denmark;\nin turn, in countries without programmes or with localised programmes it varies from\n6.3% in Bulgaria to 34.2% in Latvia. This study also found statistical evidence that less\nparticipation in screening programmes corresponds to unmarried adult patients which\nhave a low educational level, live in rural areas, have an unhealthy lifestyle or spend\nlong periods without health checks.\nHence, on the one hand, there is a clear need\nfor accurate, non-invasive, cost-effective screening tests using novel technologies as well\nas, on the other, for raising awareness about the disease and its early detection. In\naddition, genetic, socioeconomic, and behavioral factors can influence the development\nof CRC and lead to different disease onsets. Recent studies [4] show that early-onset\nCRC incidence is rising in several countries, pointing at some of the mentioned risk\nfactors as potential causes. Personalized screening strategies that consider these factors\nseem relevant together with decision tools with guarantees that support experts in\ntheir implementation. This is especially important given the discrepancies among the\nstrategies implemented in different countries [5].\nAs an example, in 2013 the European Union (EU) drafted guidelines for quality\nassurance in CRC screening and diagnosis, recommending the use of national programs\nbased on fecal immunochemical tests (FIT) and CS [6]. Such guidelines suggested that\nthe identification and invitation of the target population, diagnosis and management\nof the disease, and the appropriate surveillance of people with detected lesions could\nbe achieved by following and adopting the proposed recommendations. Interestingly,\nthough the screening program structure is similar across many countries, details such as\nage or test cutoffs differ [7]. In Western Europe, most programs are regional or national\nand based on FIT or gFOBT (guiac fecal occult blood test), with wide differences in\nparticipation rates. In Eastern Europe, countries mostly rely on pilot or opportunistic\nprograms, also based on FIT or gFOBT, with lower participation rates.\nRelevant analyses have been developed to assess the importance of various factors\ninfluencing the effectiveness of CRC screening programs. A significant portion of the\nwork in the field is dedicated to applying Markov models for cost-effectiveness analyses\nof screening [8], or to modeling patients’ preferences concerning screening methods\ntaking into account their risk tolerance [9]. An important and complementary approach\nto further improve the evaluation of program needs, effectiveness, and objectives is the\ndevelopment of CRC predictive models that form the foundation of decision-support\ntools for screening.\nIn particular, Bayesian Networks (BNs) [10] are used to infer\nthe influence that certain risk factors can have on CRC and how they could affect\nthe decisions made by policymakers.\nInfluence Diagrams (IDs) [11] extend BNs by\nincorporating decision nodes and utility variables to support multiple criteria decisions\nunder uncertainty.\nThese analyses have proved to be relevant in medical decision-\nmaking [12, 13].\nThis paper constructs a decision support model that serves to benchmark CRC\nscreening programs, among other uses. We draw upon earlier work on CRC risk assess-\nment through BNs [14] and complement it to design an ID that identifies the screening\nmethods adopted, their impacts, and their associated utilities. It will be used to dis-\ncuss relevant policy questions concerning CRC screening. For this, Section 2 defines\nhow the problem is structured and present the underlying prediction and preference\n2\n\n\nmodels. After that, Section 3 describes a set of important use cases including support-\ning personalized screening decisions, assessing national screening strategies, designing\nsuch strategies, and specifying benchmarks for novel screening technologies. Software\nsupporting the proposed approach produced in GeNIe [15] and its Python wrapper\nPySMILE is available at [16] for reproducibility purposes.\n2\nMethods\n2.1\nCRC screening decision problem structure\nThis section describes the structure of our CRC personalized screening decision support\nmodel.\n2.1.1\nCRC underlying predictive model\nOur model relies on a BN predictive model previously developed for CRC risk mapping\npurposes [14] . The BN aggregates exhaustive expert information and data from a\nlarge occupational health assessment study.\nIt relates modifiable (physical activity,\nsleep duration, alcohol consumption, smoking status, body mass index (BMI), anxiety,\ndepression) and non-modifiable (sex, age, socio-economic status) risk factors as well\nas medical conditions (hypercholesterolemia, hypertension, diabetes) relevant to CRC,\nassessing such relations through local probability distributions at the nodes. Figure\n1 presents the original BN, with variables in different colors depending on whether\nthey refer to non-modifiable (green) or modifiable (red) risk factors, medical conditions\n(blue), or the CRC target (purple) variable. Black arrows were initially elicited from\nexpert information, whereas red arrows were discovered and incorporated using a large\ndatabase of annual occupational health assessments (2M people). Procedures to assess\nthe probability tables and the BN use for risk mapping and influential variable detection\nare detailed in [14].\n2.1.2\nCRC screening decision model\nFor the construction of the ID for the CRC screening decision-support problem, a set\nof variables (chance, decision, and values) are defined and incorporated, together with\nthe corresponding arcs, into the original BN.\nHypotheses\nBefore presenting the variables, let us first introduce four hypotheses used in construct-\ning the model.\n1. Rather than the prevalent one-size-fits-all strategies [1], essentially based on age,\nwe aim to provide more personalized advice using influential variables whose in-\nformation does not require more than a general practitioner (GP) checkup. In any\ncase, the model is easily adapted if additional information based on other relevant\nrisk factors or medical conditions is available, as Section 3.1 will illustrate.\n3\n\n\nFigure 1: Originating CRC Bayesian Network [14]\n2. We adapt to the standard strategy based on applying or not a screening device,\nsay FIT, and, if screened and positive, apply a colonoscopy. The objective of the\ndecision model is to suggest to a person with certain features the most convenient\nscreening policy.\n3. The decision to be made should be based on the selected variables, the infor-\nmation provided by the screening results, the costs, the entailed complications,\nand the patient’s comfort. Note that, in doing this, we focus on the short-term\noutcomes of the screening intervention, ignoring pointers to longer-term outcomes\nlike, e.g., expected QALYs gained. This is motivated mostly by our interest in\nbenchmarking novel screening devices for which little information will be typi-\ncally available. The model allows for assessing the relative importance of various\ncriteria as described below through their integration into a multi-attribute utility\nfunction.\n4. Suggested decisions will be based on the maximum expected utility (EU) principle\n[17], with the utility vision of either the patient, the doctor, or the health policy\nmaker, as later discussed.\nThese hypotheses are broadly aligned with the recommendations from the European\nNetwork for Health Technology Assessment [18], reflecting a shared direction while\nallowing for nuanced differences. Based on them, we describe the remaining elements\nrequired to structure qualitatively the problem.\nNew nodes and arcs\nTo complete the design of the ID, the following nodes and arcs are added to the BN in\nFigure 1\n4\n\n\nDecision nodes. The screening method implemented is considered as a decision\nvariable. Its potential alternatives are the currently most common CRC screening meth-\nods, to wit: gFOBT, FIT, blood-test, stool DNA test, computed tomography colonography\n(CTC) and colon capsule (CC). Of course, we also include the possibility of conducting\nno screening.\nA second decision node refers to the possibility of performing a colonoscopy. It is\na successor of the previous one and, hence, we consider the possibility of performing it\nafter (or without) screening. Note that it is standard in many European countries to\nperform a colonoscopy if screening suggests the presence of CRC, say through a positive\nFIT. On the other hand, several countries opt for directly performing a colonoscopy on\nsusceptible patients. Both possibilities are thus covered within our model and, even\nenriched, as they can be combined, and further information, beyond age, is used to\nsupport the corresponding screening decisions.\nChance nodes. Besides the chance nodes from the original BN, we include three\nadditional ones.\nFirst, we consider the potential complications associated with the\neventual screening and colonoscopy interventions [5], which are bleeding, retention, per-\nforation, death and, obviously, no complications.\nThe other two nodes refer to the\nresults of both interventions, screening results and colonoscopy results, assimilated to\ntwo possible reports: predicted true (interpreted as screening or colonoscopy suggesting\nthe presence of CRC) and predicted false (interpreted otherwise). We include as well a\nNo result state to handle the case when the corresponding intervention is not actually\nperformed.\nValue nodes. We introduce a multiple criteria preference model [17] to support\nCRC screening decisions. As primary criteria, the model includes the cost of complica-\ntions, the cost of the intervention, the comfort of the intervention and the information\nprovided by screening and/or colonoscopy. Finally, we include a value node aggregating\nthe four criteria through a multi-attribute utility function.\nArcs Arcs from the original BN are preserved. Besides, we include arcs which es-\nsentially reflect our starting hypothesis and the information relations between decisions\nand values.\nFirst of all, based on hypothesis 1, initially we assume that the screening decision\nis made knowing variables that are easy to obtain or request (BMI, Age, PA, Sex,\nAlcohol consumption status, Smoking status, Sleeping duration), hence the arcs from\nsuch variables to the screening node.\nNotwithstanding these, the diagram is easily\nmodifiable if we know other variables from the patient, like its eventual hypertension,\nas Section 3 illustrates.\nThe arc between the decision nodes and the arc connecting the screening results\nwith the colonoscopy decision reflect hypothesis 2 and facilitate covering all standard\nscreening protocols. In turn, the arcs going into the value nodes reflect hypotheses\n3 and 4. Note that some arcs are displayed in a lighter color. This is because the\nvalue function defined in Section 2.2.2 will depend on the parent nodes of CRC and\nthe decision nodes. However to simplify the analysis and visual structure of the model\n5\n\n\nwe just kept the original color of the arcs coming from results of screening, results of\ncolonoscopy, and CRC.\n2.1.3\nFinal influence diagram\nFigure 2 reflects the structure of the ID produced. In line with our comments, the\npossible influential variables considered for the screening decision include those whose\nretrieval does not require further than a GP checkup.\nHowever, the socioeconomic\nsituation together with the presence of depression and anxiety have not been taken into\nconsideration as optimizing expected utility based on these variables generates obvious\nethical conflicts. The diagram was presented to several medical experts who validated\nit for concept and meaning.\nFigure 2: CRC Screening Decisions Influence Diagram\n2.2\nQuantifying the CRC screening decision model\nThis section describes the probability and preference models included in the proposed\nID for CRC screening decision support.\n6\n\n\n2.2.1\nProbability models at chance nodes\nFirst, the ID inherits the probability models at nodes from the original BN. We refer\nto [14] for details concerning how the corresponding tables were built based on prior\ndistributions and the available occupational health assessment database. Note that, as\na consequence, the probabilities available were assessed with some uncertainty through\nposterior predictive distributions. We shall use here just the mode of such distributions.\nFor the other three chance nodes, we used public sources, mainly [5], to obtain the\nrequired parameters. In particular, Table 19 (Appendix A) includes the sensitivities and\nspecificities of screening methods and that of colonoscopy, from which we deduce the\nrequired probabilities in the nodes results of screening and results of colonoscopy, given\nthe presence (or not) of CRC and the method chosen. As an example, the probability\ntable at node result of colonoscopy, which depends on the presence of CRC and the use\nof colonoscopy would be Table 1, with e.g. the probability of reporting Doesn’t have\nCRC, given that the person goes through a colonoscopy and she does not have CRC,\nbeing 0.03.\nColonoscopy\nYes\nNo\nCRC\nYes CRC\nNo CRC\nYes CRC\nNo CRC\nHas CRC\n0.97\n0.01\n0\n0\nDoes not have CRC\n0.03\n0.99\n0\n0\nNo result\n0\n0\n1\n1\nTable 1: Probabilities of colonoscopy results, given antecessors.\nSimilarly, the probabilities in the first seven columns of Table 20 (Appendix A)\nwere used to build the probability table of complications associated with each screening\nmethod and colonoscopy. Full details of the tables are available in the accompanying\nsoftware [16].\n2.2.2\nPreference models\nWe discuss first the preference model for each criterion and aggregate them through a\nmulti-attribute utility model.\nSingle criterion preferences\nCost cint of intervention. This criterion aggregates the costs of the eventual\nscreening and colonoscopy interventions. Both should be minimized. We adopt the\ncosts in € assessed in [5] for France, displayed in Table 19 (bottom row).\nCost ccomp of complications. These are assessed through their entailed expected\ncosts in € and obtained from public sources in [5] for France, available in Table 20\n(right column).\nComfort com. Lacking a natural attribute to assess intervention comfort, we used\na constructed attribute [19] with four decreasing levels, the best level (4) referring to\nno screening; the worst one (1), corresponding to colonoscopy. Though, in principle, we\n7\n\n\ncould assess this in a personalized manner, we constructed the scale reflected in Table\n2, later validated by several experts and patients.\ncom\nDescription\nInterventions\n4\nThe patient does not experience any discomfort\nNo screening\n3\nThe patient experiences a minor discomfort or the test\nimplies a small inconvenience: time lost, emotional dif-\nficulty, or slight physical pain.\nFIT,\ngFOBT,\nsDNA,\nBlood-\ntest\n2\nThe discomfort experienced by the patient is noticeable.\nThere is a noteworthy emotional aversion and a few mo-\nments of physical discomfort.\nCTC, CC\n1\nThe discomfort is very significant. The test causes some\nperiods of pain resulting in remarkable distress.\nColonoscopy\nTable 2: Comfort levels for interventions.\nTorrance et al. [20] provide scales within their HUI:2 quality of life system covering\nseveral criteria with one of them, pain, close to ours. However, their effort is addressed\ntowards assessing the quality of life over the years by creating a utility function, whereas\nours, in line with a short-term health assessment focus [18], is more geared towards just\navoiding uncomfortable episodes.\nImportantly, when both screening and colonoscopy are implemented in a patient,\nthe comfort value would be that of colonoscopy, that is 1, since this is perceived as\nmuch more uncomfortable than any of the six analyzed screening methods.\nInformation vinfo provided. The more complex attribute refers to short-term in-\nformational effects of interventions. These essentially entail moving from a state of\nuncertainty based on the probability of a person having CRC (and that of not having\nit) given their features and the same probability (and its complementary) when we\nknow, as well, the screening and/or colonoscopy results.\nAs an example, consider the case of a male adult, age 44-54, with normal sleep dura-\ntion, physically active, normal weight, non-smoker, and with low alcohol consumption.\nFurther, the patient is negative in all medical conditions considered. We shall use it\nas a benchmark patient below. Table 3 displays the CRC probability for this individ-\nual and his eventual probabilities after screening with FIT and colonoscopy for various\nresults. For instance, a FIT with positive result would move the individual from the\nprior uncertainty (0.0009, 0.9991) to the posterior (0.02, 0.98). We would like to assess\nthe information provided by various results taking into account such probabilities (and\nthe complementary ones of not having CRC).\np(CRC)\np(CRC|FIT−)\np(CRC|FIT+)\np(CRC|FIT+, COL−)\np(CRC|FIT+, COL+)\n0.0009\n0.0002\n0.02\n0.0006\n0.65\nTable 3: Probabilities of CRC depending on screening outcomes for benchmark patient.\nTherefore, we seek ways to evaluate such changes in uncertainty, that is to assess the\nvalue of the information that the interventions provide concerning the presence of CRC.\n8\n\n\nAssume that we want to assess the amount of uncertainty reduced by a screen-\ning strategy. Let us denote by CRC the random variable describing the presence of\nCRC, and Rs and Rc the respective variables describing the results of screening and\ncolonoscopy. Our interest is in calculating MI(CRC; (Rs, Rc)) where MI designates\nthe mutual information (MI) function [21]. Note that both Rs and Rc depend on the\ndecision of which screening test to use and whether or not to perform a colonoscopy,\nwhile the distribution of CRC will depend on the evidence collected from its parent\nnodes in the ID. However, we shall not make explicit such dependence to lighten the\nnotation. Then, the mutual information is written as\nMI(CRC; (Rs, Rc)) = MI(CRC; Rs) + MI((CRC; Rc)|Rs)\n(1)\n= Ecrc,rs\n\u0014\nlog\n\u0012 p(crc, rs)\np(crc)p(rs)\n\u0013\u0015\n+ Ecrc,rs,rc\n\u0014\nlog\n\u0012\np(crc, rc|rs)\np(crc|rs)p(rc|rs)\n\u0013\u0015\n= Ecrc,rs,rc\n\u0014\nlog\n\u0012p(crc|rs)\np(crc)\n\u0013\n+ log\n\u0012p(crc|rs, rc)\np(crc|rs)\n\u0013\u0015\n.\nNow, as the suggested decision in our problem will be based on maximum expected util-\nity (hypothesis 4), a natural value function that will effectively quantify the information\nprovided by a screening strategy would be\npmi(crc, rs, rc) = log\n\u0012p(crc|rs)\np(crc)\n\u0013\n+ log\n\u0012p(crc|rs, rc)\np(crc|rs)\n\u0013\n.\nWe refer to this value as the pointwise mutual information of CRC and (Rs, Rc). Al-\nthough the domain of this function is the set of real numbers, the MI (that is, the\nexpectation of the PMI ) will always be positive and bounded by the entropy of either of\nthe variables. As we are interested in the uncertainty concerning the presence of CRC,\nwe shall normalize the MI dividing it by its entropy H(CRC) = −P p(crc) log p(crc),\nso that the final value function lies in the interval [0, 1]. In summary, the value of\ninformation vinfo provided by a screening strategy concerning the presence of CRC will\nbe given by the normalized or relative pointwise mutual information (RPMI) defined\nthrough\nvinfo(crc, rs, rc) = pmi(crc, rs, rc)\n\u000e\nH(CRC).\n(2)\nIntuitively, the expected value of this function refers to the proportion of uncertainty\nreduced by the screening strategy from the total uncertainty in relation to the presence\nof CRC.\nImportantly, this proposal facilitates acknowledging some difficulties usually en-\ncountered in the preference elicitation scenarios considered in the CRC domain. For\ninstance, in relation to the psychological cost of unnecessary assessments associated\nwith false positives [22] and the possibility of a delay in the CRC diagnosis and sub-\nsequent dissuasion of participants for later assessment [7], the proposed mechanism\nweighs these situations through their corresponding uncertainty.\nAs examples, Tables 4 and 5 respectively provide the vinfo for our benchmark patient\nwhen not undertaking screening and when performing FIT. Positive values correspond\nto correct predictions; negative values, to wrong ones; and, finally, zero indicates no\nchange in uncertainty. Values corresponding to cases in which CRC is present are larger\n9\n\n\nScr\nNo screening\nRs\nNo pred\nCRC\nFalse\nTrue\nCol\nNo Col\nColonoscopy\nNo Col\nColonoscopy\nRc\nNo pred\nPred False\nPred True\nNo pred\nPred False\nPred True\nvinfo\n0.0\n0.12\n-11.44\n0.0\n-509.19\n654.93\nTable 4: No screening vinfo for benchmark.\nScr\nFIT\nRs\nPred False\nPred True\nCRC\nFalse\nTrue\nFalse\nTrue\nCol\nNo Col\nColonoscopy\nNo Col\nColonoscopy\nNo Col\nColonoscopy\nNo Col\nColonoscopy\nRc\nNo pred\nPred False\nPred True\nNo pred\nPred False\nPred True\nNo pred\nPred False\nPred True\nNo pred\nPred False\nPred True\nvinfo\n0.09\n0.12\n-2.97\n-196.80\n-706.08\n466.52\n-2.59\n0.04\n-151.00\n448.05\n-58.63\n966.01\nTable 5: FIT vinfo for benchmark.\nin magnitude as they have a low probability. This conforms with the argument that a\nmissed CRC positive scenario is much worse than a misdiagnosed healthy patient [23].\nRecall that we look for the best screening strategy and contemplate the decision to\nperform the colonoscopy depending on the output of the first screening. Thus, the\nvalue tables will not contain the expected vinfo but rather the extension of its values\ndepending on the results of screening, that is, Ecrc,rc|rs[vinfo], which does not necessarily\nlie in the [0, 1] interval, as Table 6 portrays. Indeed, observe how for the first alternative\nregarding no screening, the value lies in [0, 1] as no other result is possible and, thus,\ncoincides with its expectation. When screening is performed, not much information is\ngained when the result predicts false, the most likely scenario in general. However, the\ninformation provided is much larger when the prediction is true, increasing its value\nwhen a colonoscopy is further performed.\nNotice how in a low prevalence scenario\nhighly specific tests, like FIT, provide more information, whereas highly sensitive tests,\nlike sDNA, do not have as much of an impact.\nScreening\nNo screening\nFIT\nsDNA\nResult of Scr\nNo pred\nPredicted False\nPredicted True\nPredicted False\nPredicted True\nColonoscopy\nNo Col\nCol\nNo Col\nCol\nNo Col\nCol\nNo Col\nCol\nNo Col\nCol\nExp. vinfo\n0.0\n0.532\n0.049\n0.187\n5.722\n15.802\n0.086\n0.134\n0.911\n4.394\nTable 6: Expected information of different policies for reference patient\nFigure 3 plots the vinfo function for all possible values of the probability of having\nCRC facilitating comparison of screening methods in terms of information. Observe\nthat blood-test, CTC, and gFOBT are bounded above by the rest of screening methods\nin terms of the information measure used. From this, we conclude that we could discard\nblood-test and CTC as they are equal or worse to FIT in the four criteria (information,\ncomfort, specificity, sensitivity) considered. This is not the case, however, for gFOBT\nas it is the cheapest method and has non-dominated performance metrics. Further\nobserve that at very low probabilities of CRC, FIT is the method that provides the\nbest information on its own.\nNote that the asymmetries of vinfo in Figure 3 derive from the differences between\nspecificity and sensitivity. More specific tests, like FIT, take their maximum at lower\np(CRC) values, whereas more sensitive ones, like sDNA, do so at larger p(CRC) values.\n10\n\n\nFigure 3: vinfo for various CRC screening alternatives.\nMultiple criteria preference aggregation\nLastly, let us aggregate the criteria through a utility function u, first employing a\nmulticriteria value function, then transformed to take into account risk aversion, see\n[24] for a detailed conceptual description.\nWe first aggregate the costs in € so that cost = cint+ccomp for each intervention. The\ninformation provided by the screening strategy is already in compact form and, thus,\nwe next define the global value function as a weighted aggregation of the intervention\ncosts and information, taking into account comfort. To wit, for a fixed comfort level\nk, under reasonably general conditions [24], we use a general weighted additive value\nmodel. However, after initial numerical experiments with the original information and\ncost scales, we decided to log10 this last one, adopting the model\nv(cost, info, comf = k) = λk × vinfo −log10(cost + 1),\nwhere λk is a weighting factor that depends on the comfort of the screening strategy\nand serves as a trade-off between information and log-cost.\nThe elicitation of the λk parameters is delicate and we adopted the following strat-\negy. Assume that only one test is performed at each time and the amount of information\ncorresponds to the reduction of uncertainty through a single independent test, that is,\nvinfo = MI(CRC, Rs)/H(CRC). Consider two screening methods with the same com-\nfort level k, yet different costs and values, say (info1, cost1) and (info2, cost2), where,\ntypically, the more informative the method is, the more expensive it will be. Assume\nthat no method dominates the other, in the sense of being both cheaper and more in-\nformative than the other, and that the individual declaring his preferences reveals that\nhe favours (info1, cost1) to (info2, cost2), represented as (info1, cost1) ≻(info2, cost2).\nThen, we interactively ask the individual for a cost value smaller than cost2 such that\n(info1, cost1) ∼(info2, cost). Such options would have the same value, that is,\nλk × info1 −log10(cost1 + 1) = λk × info2 −log10(cost + 1),\n(3)\nand we would solve for λk = (log10((cost1 + 1)/(cost + 1))/(info1 −info2). Such value\nwould then be subject to standard consistency checks, see e.g. [25]. A more robust\n11\n\n\nestimation of the parameter would perform this exercise for each pair of screening\nmethods at each comfort level, obtain the corresponding estimations, and reconcile and\nrobustify them through their median. This final estimation would typically be more\nrobust than just a single estimation made out of a chosen pair of screening methods,\nbut has the drawback of requiring a larger elicitation effort on behalf of the decision\nrespondent. Note that we would expect that for lower discomfort, the value of λ should\nbe larger, that is, λ4 > λ3 > λ2 > λ1, suggesting that information is more valuable\nwhen obtained from a more comfortable screening tool.\nExample 1 For reference purposes, consider the benchmark patient to elicit the com-\nfort parameters.\nTable 7 presents the vinfo provided by all interventions.\nFigure 4\nNo scr.\ngFOBT\nFIT\nBlood\nsDNA\nCTC\nCC\nColonos.\nvinfo\n0\n0.129\n0.245\n0.121\n0.197\n0.159\n0.225\n0.532\nTable 7: Expected information of interventions benchmark\ncontains the cost and information provided by the methods for the benchmark patient\nas well as their comfort. Note that, in this case, the screening alternatives that are\nnon-dominated are no screening, gFOBT, FIT, and colonoscopy. This will not always\nbe the case as our information value assesses uncertainty and depends on the probability\nof having CRC, see Section 3.5 for examples.\nFigure 4: Scatterplot\nTo illustrate the elicitation process, let us focus on comfort level 2.\nCTC and CC\nrespectively provide a vinfo of 0.159 and 0.225, while their aggregated costs are 96.51€\nand 510.64€. Suppose the individual declares preferring CTC to CC. He is interactively\nasked how much would the cost of CC have to be so that they are indifferent to one\nor the other.\nAssuming that the interview converges to 180€, using (3) we obtain\nλ2 = 4.17. For comfort level 3, FIT and gFOBT respectively provide a vinfo of 0.245\nand 0.129, while their aggregated costs are 14.34€ and 12.14€. Suppose the patient\ndeclares preferring FIT and that the indifference cost for gFOBT is 3€.\nThen, we\nobtain λ3 = 5.04. Repeating this process for all pairs of methods at this comfort level\n12\n\n\nand taking their median, we obtain λ3 = 6.80. Table 21 (Appendix B) reflects the full\nelicitation exercise.\nParameter\nValue\nλ1\n4.01\nλ2\n4.17\nλ3\n6.80\nλ4\n7\nTable 8: Values of λ parameters.\nComfort levels 1 and 4 are slightly different as we only have one option for them. For\ncomfort level 1 we consider a synthetic test, providing a vinfo of 0.4 and an indifference-\nassociated cost with respect to colonoscopy of 300. In that case λ1 = 4.01. For comfort\nlevel 4, in this case both the vinfo and the cost are 0. Therefore, λ4 has no impact in the\ncalculation of the value function, and we just assign λ4 so that the monotonicity of the\nλ’s is preserved, leading to Table 8.\n△\nOnce the value function is elicited, assuming (constant absolute) risk aversion [24]\nwe adopt the following expression for the utility function\nu(cost, info, comf) = a −b × exp (−ρv(cost, info, comf)),\nwhere ρ is the risk aversion coefficient and a and b are scaling constants constraining\nthe utility to the [0, 1] interval for the three reference alternatives, determined using,\ne.g., the classic probability equivalent (PE) method [26].\nExample 2 (Cont.) Observe that, in our problem, we assume that the presence of CRC\nis uncertain and, hence, the best outcome in terms of information collected will be de-\ntecting a high-risk patient with a very specific test and then performing a colonoscopy.In\nturn, the worst outcome in terms of information would be not doing anything as it has no\nadded value. Concerning cost, the best possible option would be a costless test, while the\nworst possible option would be a very expensive test with all possible complications, hav-\ning an added cost for the patient. Thus, we choose as references the pairs (cost∗= 0€,\ninfo∗= 15.75) and (cost∗= 8131.71€, info∗= 0).\nSuppose now that the reference to assess the risk aversion coefficient is (cost = 50€,\ninfo = 4.1).1 Assume all interventions are comfort level 3 and suppose we interactively\nobtain from the interview that the PE is 0.7. We then have the system\n\n\n\n\n\na −b × exp (−ρv(8131.71, 0, 3)) = 0\na −b × exp (−ρv(0, 15.75, 3)) = 1,\na −b × exp (−ρv(50, 4.1, 3)) = 0.7\nleading to the parameters in Table 9.\n△\nWe shall employ such parameters in our discussion of use cases in Section 3.\n1These values have been chosen to maximize the tool’s capability for classification as a validation\nmechanism, maximizing the F1-score. See the end of Section 3.3\n13\n\n\nParam.\nValue\na\n1.015\nb\n0.872\nρ\n0.039\nTable 9: Utility parameters.\n3\nResults\nOnce with our ID built and validated, we illustrate its application in relevant use\ncases referring to providing personalized screening advice, assessing national age-based\nscreening strategies, designing personalized national screening strategies, and bench-\nmarking novel screening technologies.\n3.1\nManaging individual cases\nLet us exemplify a few cases of individuals for which our model would propose different\nscreening advice showcasing how our approach personalizes screening recommendations,\nas summarised in Table 10.\nStart with the benchmark patient from Section 2.2.2 whose probability of having\nCRC was 0.00085. Running our model, the decision with maximum EU for him would\nbe not performing screening (EU 0.143). As a comparison, the decision with the second\nhighest EU (0.142) is FIT (followed by a colonoscopy if the predicted result is positive).\nSuppose now that the preference model is more risk-seeking, reducing the risk aver-\nsion coefficient ρ from 0.039 to 0.005. Then, the optimal suggested policy would be FIT\n(EU 0.147), followed by a colonoscopy if the FIT result is positive (and no colonoscopy\nif negative). Furthermore, all of the tests, except for CC and blood-based, are pre-\nferred to no screening. Intuitively, in the context of this problem, a risk-seeker would\nbe willing to make a larger expense for the information.\nAs mentioned, the model is easily adaptable when additional medical information\nis available, beyond the seven variables obtainable through a GP visit. This is done\nby just adding the corresponding arrows that go from the new variables of interest to\nthe decision node. As an example, suppose that we also know that the benchmark is\nhypertense and has diabetes. His probability of having CRC is much larger (0.0039).\nUsing the model, the advice would be sDNA (EU 0.146), followed by a colonoscopy if\nthe prediction is positive.\nSuppose now that for a given person we have access to an exogenous variable that\nchanges the probability of CRC to 0.1, e.g. based on knowing that the patient has CRC\nfamily antecedents. In this situation, the recommendation for the first decision would\nbe FIT with an EU of 0.183; the policy with the highest EU would be FIT followed by\nno colonoscopy even if the result is positive.The reason behind this is that the change\nin uncertainty that a test can produce at these relatively high levels of CRC probability\nis not worth the cost of a colonoscopy. Indeed, the information provided by FIT in\nthis case is already quite significant as it changes the prior probability of CRC from\np(CRC) = 0.1 to p(CRC|FIT+) = 0.710 when the result of FIT is positive, rendering\nsomewhat redundant the results of a colonoscopy.\n14\n\n\n1st\nEU\n2nd\nEU\nEU Pred False\nEU Pred True\nrecom\nrecom\nNo col\nCol\nNo col\nCol\nBenchmark patient\nNo scr\n.143\nFIT\n.142\n-\n-\n-\n-\nBP risk seeking\nFIT\n.147\nsDNA\n.145\n.139\n.133\n.293\n.370\nBP added ev.\nsDNA\n.146\nFIT\n.145\n.084\n.056\n.289\n.536\nExogen. var. p = .1\nFIT\n.183\nsDNA\n.173\n.131\n.098\n.631\n.554\nTable 10: Personalized screening strategies in the four cases\n3.2\nAssessing the French national screening strategy\nOur goal now is to assess, as an example, the current one-size-fits-all French screening\nstrategy based on age. More precisely, the target population for CRC screening are\ncitizens in the age range [50-74] which do not have any hereditary condition or familiar\nCRC antecedents; when FIT is positive, participants are suggested to undertake a\ncolonoscopy [27]. Let us present three cases that are not properly prioritized in the\ncurrent strategy.\n1. Consider a man with age [54-64], normal sleep, normal BMI, physically active,\nnon-smoker, low alcohol consumption and not having diabetes or hypertension.\nHis probability of having CRC is 0.0022. Because of his age, he would be required\nto undertake FIT. However, the proposed model suggests that it is better to\nadminister sDNA (EU 0.145) rather than FIT (EU 0.144). Both would be followed\nby a colonoscopy if the screening prediction is CRC-positive.\n2. Consider now a man with age [44-54], with similar characteristics but having\ndiabetes and hypertension. His probability of having CRC is 0.0039. Because of\nhis age, he would not be called to participate in the screening program. However,\nthe model suggests this patient should undertake sDNA (EU 0.146), followed by\ncolonoscopy if sDNA is positive.\n3. Finally, for the case of a man with age [44-54], overweight, normal sleep, high-\nalcohol consumption, physically inactive, and ex-smoker, the probability of having\nCRC will be 0.0018. The proposed model suggests that the maximum EU method\nis FIT with 0.143, followed by a colonoscopy if its result is positive.\nThese examples show how the current age-based strategy may fail in various ways at\ndetecting cases with highest EU. As an example, the second patient should be pri-\noritized over the first one within a screening program. Further, sDNA may be more\nrecommendable for higher-risk patients, while FIT is a better choice for moderate-risk\npatients. Predictive models for decision-making can aid in redistributing the efforts for\nmore efficient screening programs, as we next show.\n3.3\nDesigning a national personalized screening strategy\nLet us discuss now how the design of a national screening strategy could be based on\nour model. For this, we use a database with around 350000 individuals whose records\nwere kept for testing purposes for the BN model in Section 2.1.1, as fully described\nin [14]. We use all thirteen available variables in the network in this use case. As our\n15\n\n\ndatabase does not include data from screening or colonoscopy results, we simulate them\nbased on the sensitivity and specificity information of various interventions available in\nTable 19.\nWhen designing a screening program, we should expect constraints on the maximum\nnumber of colonoscopies and screening operations performable because of lab, personnel,\nand device availability, as well as due to budget limits. The issue is, then, how do we\nallocate such resources using the decision support model in Section 2. Our approach\nwill assign screening methods in order of maximum EU: individuals with higher EU\nwill be offered screening earlier as they are assimilated with the population benefiting\nmore from screening. The intervention choice will be that providing highest EU to the\nindividual; once we saturate the ni tests available for the i-th screening method, we\nremove it from the list of available methods and search for those of maximum EU among\nthe remaining ones. This process continues until we reach all available test limits or\ncover the entire targeted population. We assume that there is no limit on the available\ncolonoscopies after a positive screening prediction as these are fundamental for a correct\ndiagnosis.This is a reasonable assumption as it is the standard health practice.\nLet us see how this strategy performs by comparing three setups:\n1. We assume there are no constraints when applying this new strategy.\n2. Constraints are set on the number of tests for each screening method, as expressed\nin Table 11 middle row. Specifically, we limit the maximum number of direct\ncolonoscopies to 3000; gFOBT to 30000; FIT to 42000; blood-based tests to 7000;\nsDNA to 6000; CTC to 2000; and, CC to 2000, therefore being able to cover 91000\nindividuals (out of the 350000).\n3. Finally, the current national age-based strategy.\nWith the parameters developed throughout the text, the distribution of recom-\nmended tests and results for the first two strategies would be as Table 11 shows, where\nthe first row indicates tests administered when no constraints are included; the middle\nrow indicates test constraints; and, finally, the last row indicates the number of tests\nwhen constraints are included. Interestingly, only sDNA and FIT are the recommended\nstrategies. The excess of recommended sDNA tests is distributed by administering FIT\nand implementing no screening. No direct colonoscopy would be recommended in this\ngeneral context. For 291707 patients, no screening is preferred to the remaining alter-\nnative screening methods even when setting operational limits.\nNothing\nColon.\ngFOBT\nFIT\nBlood\nsDNA\nCTC\nCC\nTotal\nNo lim recom.\n291323\n0\n0\n560\n0\n47824\n0\n0\n48384\nOp. limit\n∞\n3000\n30000\n42000\n7000\n6000\n2000\n2000\n-\nFinal recom.\n291707\n0\n0\n42000\n0\n6000\n0\n0\n48000\nNational\n290633\n0\n0\n49074\n0\n0\n0\n0\n49074\nTable 11: Comparison of strategies with no constraints (top row) and with constraints\n(bottom row). Operational limits are shown in the middle row.\nWe apply the three strategies described and obtain the results for 200 simulations.\nTables 12-14 contain their confusion matrices for CRC classification with values corre-\nsponding to the mean over the 200 simulations and their standard deviations. Table\n16\n\n\n12 shows how the current age-based strategy has a poor performance in detecting pa-\ntients with CRC, that is a poor sensitivity (0.36), while the proposed unconstrained\nnew strategy, shown in Table 13, increases detection sensitivity to 0.45. However, this\ncomes with the trade-off of a decrease in precision (0.82 to 0.64), resulting in a larger\nnumber of false positives for the proposed strategy. Concerning cost, the unconstrained\nnew strategy entails an increase in the average cost (44.62 € vs. 7.24€ per patient).\nTo account for that excessive increase in cost and the considerable precision decrease,\nwe set operational limits (middle row Table 11) on the number of tests usable for each\nmethod. Table 14 shows the corresponding classification metrics from this strategy,\nwith more moderate costs (12.79 € vs. 7.24€ per patient). There is still an increase\nin the sensitivity (0.37) and a decrease in precision (0.79), but both are more subtle\nnow. Depending on the cost-information trade-off and risk attitude, the take on the\nresults of the new strategy is that such investment may be recommended to reach higher\nsensitivity levels and thus increase the number of detected patients in screening pro-\ngrams. However, this is not always manageable and demands an operational limit in\nmore realistic scenarios.\nPredicted No CRC\nPredicted CRC\nNo CRC\n339472.1 ± 4.0\n16.9 ± 4.0\nCRC\n139.8 ± 4.4\n78.3 ± 4.4\nTable 12: Mean classification results for current strategy. Cost per patient: 7.24€\nPredicted No CRC\nPredicted CRC\nNo CRC\n339425.2 ± 8.2\n63.8 ± 8.2\nCRC\n121.3 ± 3.1\n96.7 ± 3.1\nTable 13: Mean classification results for new strategy, no constraints. Cost per patient:\n44.62€\nPredicted No CRC\nPredicted CRC\nNo CRC\n339466.5 ± 4.9\n22.5 ± 4.9\nCRC\n134.8 ± 4.1\n83.2 ± 4.1\nTable 14: Mean classification results for new strategy with operational constraints.\nCost per patient: 12.81€\nFor validation purposes, assume that the current system can cover 49,074 FIT tests,\nthe number of people in the population from our 2016 dataset in the age range [54,64].\nAssuming this, we compare the current strategy with our model by taking the 49,074\npatients with highest FIT EU and performing 200 simulations to assess the differences\nin performance and cost. Table 15 shows a subtle increase in sensitivity when using\nthe model, correctly detecting an average of one more patient (an increase of 1%) and\nreducing the cost of the whole strategy by around 33000€. Although the improvement\nmight seem relatively low, when extrapolated to a real-sized population, the method\ncan save many lives and money. As an example, France and Spain respectively have\n17\n\n\npopulations of 8, 591, 286 and 6, 583, 183 within the screening age [54-64]. Thus, just\nan implementation of the model within the mentioned target population would detect\naround 175 and 134 more positive patients in France and Spain, respectively.\nPredicted No CRC\nPredicted CRC\nNo CRC\n339472.5 ± 4.0\n16.54 ± 4.0\nCRC\n138.9 ± 4.6\n79.1 ± 4.6\nTable 15: Mean classification results for new strategy on 49074 patients with highest\nFIT utility. Cost per patient: 7.14€\n3.4\nBenchmarking of new screening devices\nGiven the increasing importance of CRC from a public health policy perspective, it\nis likely that, in the near future, there will be novel CRC screening devices.2\nWe\ndiscuss here how the approach proposed may be used to benchmark new devices. For\nillustration purposes, suppose we have come out with two new devices with features as\nin Table 16.\nDevice\nCost\nSpecif.\nSensit.\nComfort\nDev1\n250\n0.85\n0.8\n2\nDev2\n3\n0.85\n0.94\n3\nTable 16: Features of two new screening devices, Dev1 and Dev2\nFirst of all, we should check whether the new devices are not dominated by the\ncurrent ones. As an example, we would reject Dev1 because it is dominated by sDNA,\nwhose features are cost = 236.88€, specif = 0.866, sensit = 0.923 and comfort = 3.\nHowever, Dev2 is non-dominated. Let us assess it with our model. Figure 5 shows\nthat for most of the range of the CRC probability below 0.55, the new test reduces\nuncertainty more than currently available screening tests.\nFor extremely low CRC\nprobability values, FIT still provides more information due to its better specificity.\nHowever, as Dev2 is much cheaper than FIT and has the same comfort value, we have\nthat for the benchmark patient, the EU of the new test is 0.179, which is higher than\nthat of the previous recommendation which was no screening (Section 3.1).\nNothing\nColon.\ngFOBT\nFIT\nBlood\nsDNA\nCTC\nCC\nNew\nTotal\nNo lim. recom.\n0\n0\n0\n0\n0\n0\n0\n0\n339707\n339707\nOp. limit\n∞\n3000\n30000\n42000\n7000\n5000\n2000\n2000\n50000\n-\nFinal recom.\n287920\n0\n0\n1787\n0\n0\n0\n0\n50000\n51787\nTable 17: Comparison of strategies when adding the new test.\nSuppose that we implement this test. As Table 17 shows, with the considerations\nthat our model makes in terms of cost, comfort, and information, we would be recom-\nmending this test to the entire population. However, this is in general hard to achieve\n2As an example, this is one of the aims of the ONCOSCREEN project https://oncoscreen.health/\n18\n\n\nFigure 5: Plot of vinfo at different levels of p(CRC)\nand would entail a large cost (63.86€ per patient) due to the high number of colono-\nscopies carried out. Hence, we generate a case in which we have 50,000 new Dev2 tests\nand the same resources as in the examples from Section 3.3. Table 18 provides the clas-\nsification results with this strategy, which essentially increases the number of detected\npatients by more than 10, an increase of around 20%. The number of false positives\nalso increases, as well as the total cost (9.85€ per patient), as more patients are being\npredicted CRC positive and require a colonoscopy. However, the increment in the F1\nscore, a common classification measure that balances the importance of true and false\npositives and negatives [28], from 0.50 in the original strategy to 0.54 shows that the\nbenefit would be significant in classification.\nPredicted No CRC\nPredicted CRC\nNo CRC\n339458.5 ± 5.4\n30.5 ± 5.4\nCRC\n126.8 ± 3.8\n91.2 ± 3.8\nTable 18: New strategy including new tests. Cost per patient: 9.85€\n3.5\nSensitivity analysis\nWe conclude by performing several relevant sensitivity analysis with our model, specif-\nically in relation to the utility function obtained.\n3.5.1\nSensitivity analysis with respect to the probability equivalent\nWe first analyze the impact of the probability equivalent (PE) elicited to determine\nthe risk aversion coefficient in the allocation of screening tests.\nFigure 6 plots the\noptimal screening resource allocations showing how information generally impacts test\nallocation more than cost, as changes are more noticeable vertically than horizontally.\nIn general, the total number of recommended tests increases as the weight given to the\nvalue of information increases and decreases as the weight given to cost increases.\nThe intuition behind this is that sDNA is, given the comfort levels, the recommended\ntest for higher-risk patients as it is the most sensitive one and thus provides the highest\n19\n\n\nquality information. However, suppose a larger weight is given to information at lower\ncosts. In that case, the number of FITs will increase as it is one of the cheapest methods\nand provides quite competitive information regarding CRC presence. Suppose now that\ninformation is valued more at higher costs. In that case, the number of sDNA tests\nallocated will increase as long as its information-cost tradeoff surpasses the utility of\nnot performing screening.\nFigure 6: Plot with different PE info and PE cost\n3.5.2\nSensitivity analysis with respect to comfort parameters\nLet us discuss now sensitivity with respect to the comfort parameters λ. Remember that\nby repeating the elicitation exercise for comfort 3 screening methods, we ensured some\nrobustness of the method. However, for the other comfort levels, this cannot be done due\nto the absence of additional tests for comparison. Moreover, the elicitation of comfort\nvalues depends on the available tests and does not account for alternative or future\ntests and their respective information values. This is complicates extrapolating results\nto new strategies, as seen in Section 3.4 where, with the established elicited parameters\n20\n\n\nusing the original tests, the new test is recommended to the entire population due to its\ngreat features, being this recommendation far from manageable. We look into how the\nvariability in these values can lead to differences in recommendations and thus highlight\nthe importance of consistency and robustness in the elicitation protocol.\nFigure 7 shows two screening test recommendation distributions. The first one cor-\nresponds to decreasing the value of level 3 comfort to λ3 = 6.3; observe how a lower\ncomfort parameter reduces the number of screenings performed, increasing the amount\nof non-screened people. The second case corresponds to raising the value of level-1\ncomfort to λ1 = 4.8 and level 2 to λ2 = 5; the increase in the weight given to the com-\nfort value for colonoscopy has a large effect in increasing the number of recommended\nsDNA tests. Recall that a colonoscopy is usually performed after a positive screening\nresult, and thus, as the weight given to the comfort value for colonoscopy increases, the\nexpected value of all screening methods also increases. However, this change is more\nnoticeable for sDNA, it being the most sensitive tool, thus detecting more CRC positive\ncases.\n(a)\n(b)\nFigure 7: Screening count distribution for different λ values\nTherefore, a moderate modification of comfort parameters impacts program results.\nTo ensure consistency, we would recommend following the elicitation protocol in a\nmoderate number of patients chosen at random, asking them about their indifference\nbetween cost, information, and comfort. Repetition and randomization would enable a\nmore robust estimation of comfort parameters which would benefit model applicability.\n4\nDiscussion\nWe have developed a decision analysis model and decision support system for person-\nalised screening in connection with CRC detection. Stemming from an earlier predictive\nmodel [14] we incorporated new chance, decision, and value nodes as well as new arcs,\nassessing the new probability tables. We introduced a multi-attribute utility model\nto support what combination of screening and colonoscopy decisions should be im-\nplemented for an individual with certain features. This could help to strengthen the\n21\n\n\nmonitoring systems of colorectal screening programmes, as has been proposed for Eu-\nropean countries [29]. As showcased, this facilitates a more personalized approach to\nCRC screening as well as designing large-scale screening strategies taking into account\nconstraints on treatment availability. Apart from the viability of the use of the model\nin public health management, it can also serve to simulate screening scenarios, regard-\ning how to distribute screening tests according to different risk levels and estimate the\ncosts of different strategies. The system enables as well benchmarking of novel screening\ndevices.\nThe preference model incorporated is the one discussed in Section 2.2.2, and assimi-\nlated to that of the policy makers designing or assessing a screening strategy. However,\nthe preference model may be easily modified, and eventually individualised, to promote\na more personalized approach. in line with [30].\nAs illustrated in Section 3.1, the model may be adapted and enhanced when addi-\ntional variables are taken into account. In particular, this may be the case when data\nconcerning diet and genetics is available, which was not the case in our initial dataset.\nThe availability of information on additional variables can be very useful in improving\nthe possibilities of better personalising screening programmes. In any case, the major\nstrength of this work lies in its development of a practical framework and methodology\nwhich is adaptable to more complex scenarios.\nAt least, two future lines emerge at least from this work. The first one refers to\nbenchmarking the new screening devices that are being developed within the ONCO-\nSCREEN project with the methodology specified in Section 3.4. The second one, given\nthe low acceptance of CRC screening programs in many countries, will focus on ampli-\nfying our model with incentive mechanisms to promote screening adoption.\nReferences\n[1] F. Kastrinos, S. S. Kupfer, and S. Gupta. Colorectal cancer risk assessment and\nprecision approaches to screening: Brave new world or worlds apart?\nGastroen-\nterology, 164(5):812–827, 2023. ISSN 0016-5085. doi:10.1053/j.gastro.2023.02.021.\nPersonalizing GI Cancer Risk Assessment and Management: The Future is Now.\n[2] A. Ferrari, I. Neefs, S. Hoeck, M. Peeters, and G. Van Hal. Towards novel non-\ninvasive colorectal cancer screening methods: a comprehensive review. Cancers,\n13(8):1820, 2021. doi:10.3390/cancers13081820.\n[3] I. Ola, R. Cardoso, M. Hoffmeister, and H. Brenner. Utilization of colorectal cancer\nscreening tests across european countries: a cross-sectional analysis of the european\nhealth interview survey 2018–2020. The Lancet Regional Health–Europe, 41, 2024.\ndoi:10.1016/j.lanepe.2024.100920.\n[4] H. Sung, R. L. Siegel, M. Laversanne, C. Jiang, E. Morgan, M. Zahwe, Y. Cao,\nF. Bray, and A. Jemal. Colorectal cancer incidence trends in younger versus older\nadults: an analysis of population-based cancer registry data. The Lancet Oncology,\n2024. doi:10.1016/S1470-2045(24)00600-4.\n[5] S. Barr´e, H. Leleu, R. Benamouzig, J.-C. Saurin, A. Vimont, S. Taleb, and\nF. De Bels. Cost-effectiveness analysis of alternative colon cancer screening strate-\n22\n\n\ngies in the context of the french national screening program. Therapeutic Advances\nin Gastroenterology, 13:1756284820953364, 2020. doi:10.1177/1756284820953364.\n[6] European Colorectal Cancer Screening Guidelines Working Group et al. Euro-\npean guidelines for quality assurance in colorectal cancer screening and diagnosis:\noverview and introduction to the full supplement publication. Endoscopy, 45(01):\n51–59, 2013. doi:10.1055/s-0032-1325997.\n[7] E.\nFerlizza,\nR.\nSolmi,\nM.\nSgarzi,\nL.\nRicciardiello,\nand\nM.\nLauriola.\nThe roadmap of colorectal cancer screening.\nCancers,\n13(5):1101,\n2021.\ndoi:10.3390/cancers13051101.\n[8] A. Fouladi, A. Asadi, E. A. Sherer, and M. Madadi.\nCost-effectiveness\nanalysis of colorectal cancer screening strategies using active learning and\nmonte carlo simulation.\nMedical Decision Making,\n44(5):554–571,\n2024.\ndoi:10.1177/0272989X241258224.\n[9] G. B. Taksler, A. T. Perzynski, and M. W. Kattan.\nModeling individ-\nual patient preferences for colorectal cancer screening based on their toler-\nance for complications risk.\nMedical Decision Making, 37(3):204–215, 2017.\ndoi:10.1177/0272989X16679161.\n[10] F. Jensen and T. Nielsen. Bayesian Networks and Decision Graphs. Springer, New\nYork, second edition, 2007. ISBN 9780387915029. doi:10.1007/978-0-387-68282-2.\n[11] R. D. Shachter. Evaluating influence diagrams. Operations Research, 34(6):871–\n882, 1986. doi:10.1287/opre.34.6.871.\n[12] M. Roberts, L. B. Russell, A. D. Paltiel, M. Chambers, P. McEwan, and\nM. Krahn. Conceptualizing a model: a report of the ispor-smdm modeling good\nresearch practices task force–2. Medical Decision Making, 32(5):678–689, 2012.\ndoi:10.1177/0272989X12454941.\n[13] J. G. Dolan, E. Boohaker, J. Allison, and T. F. Imperiale.\nCan streamlined\nmulticriteria decision analysis be used to implement shared decision making for\ncolorectal cancer screening?\nMedical Decision Making, 34(6):746–755, 2014.\ndoi:10.1177/0272989X13513338.\n[14] D. Corrales, A. Santos-Lozano, S. L´opez-Ortiz, A. Lucia, and D. R. Insua. Col-\norectal cancer risk mapping through bayesian networks. Computer Methods and\nPrograms in Biomedicine, page 108407, 2024. doi:10.1016/j.cmpb.2024.108407.\n[15] BayesFusion, LLC. Genie modeler: Complete modeling freedom, 2024. https:\n//support.bayesfusion.com/docs/GeNIe.pdf, (Accessed on 10 February 2025).\n[16] D. Corrales. Decision Model Screening CRC, May 2024. URL https://github.\ncom/DanielCorralesAlonso/Decision_Model_Screening_CRC.\n[17] S. French and D. Rios Insua. Statistical Decision Theory. Wiley, 2000.\n23\n\n\n[18] EUnetHTA Joint Action 2, Work Package 7, Subgroup 3, E. Heintz, A. Gerber-\nGrote, S. Ghabri, F. F. Hamers, V. P. Rupel, R. Slabe-Erker, and T. Davidson. Is\nthere a European view on health economic evaluations? Results from a synopsis\nof methodological guidelines used in the EUnetHTA partner countries. Pharma-\ncoeconomics, 34:59–76, 2016. doi:10.1007/s40273-015-0328-1.\n[19] R. L. Keeney and R. S. Gregory. Selecting attributes to measure the achievement\nof objectives. Operations Research, 53(1):1–11, 2005. doi:10.1287/opre.1040.0158.\n[20] G. W. Torrance, D. H. Feeny, W. J. Furlong, R. D. Barr, Y. Zhang, and\nQ. Wang. Multiattribute utility function for a comprehensive health status classi-\nfication system: Health utilities index mark 2. Medical care, 34(7):702–722, 1996.\ndoi:10.1097/00005650-199607000-00004.\n[21] T. M. Cover.\nElements of Information Theory.\nJohn Wiley & Sons, 1999.\ndoi:10.1002/047174882X.\n[22] R.\nR.\nLove\nand\nA.\nE.\nCamilli.\nThe\nvalue\nof\nscreening.\nCan-\ncer, 48(S1):489–494, 1981.\ndoi:10.1002/1097-0142(19810715)48:1+<489::AID-\nCNCR2820481309>3.0.CO;2-F.\n[23] J. P. Ioannidis, R. Tarone, and J. K. McLaughlin.\nThe false-positive to false-\nnegative ratio in epidemiologic studies.\nEpidemiology, 22(4):450–456, 2011.\ndoi:10.1097/EDE.0b013e31821b506e.\n[24] J. Gonz´alez-Ortega, V. Radovic, and D. R´ıos Insua.\nUtility elicitation.\nElic-\nitation:\nThe science and art of structuring judgement, pages 241–264, 2018.\ndoi:10.1007/978-3-319-65052-4 10.\n[25] S. French. Decision Theory: an Introduction to the Mathematics of Rationality.\nHalsted Press, 1986. doi:abs/10.5555/27012.\n[26] P. H. Farquhar. State of the art—utility assessment methods. Management Science,\n30(11):1283–1300, 1984. doi:10.1287/mnsc.30.11.1283.\n[27] A. Pellat, J. Deyra, R. Coriat, and S. Chaussade. Results of the national organised\ncolorectal cancer screening program with fit in paris. Scientific reports, 8(1):4162,\n2018. doi:10.1038/s41598-018-22481-9.\n[28] C. J. Van Rijsbergen. Information retrieval. 2nd. newton, ma, 1979.\n[29] E. Altobelli, L. Rapacchietta, C. Marziliano, G. Campagna, V. F. Profeta,\nand R. Fagnano. Differences in colorectal cancer surveillance epidemiology and\nscreening in the who european region. Oncology Letters, 17(2):2531–2542, 2019.\ndoi:10.3892/ol.2018.9851.\n[30] R. J. Volk, V. B. Leal, L. E. Jacobs, A. M. Wolf, D. D. Brooks, R. C. Wender,\nand R. A. Smith. From guideline to practice: new shared decision-making tools for\ncolorectal cancer screening from the american cancer society. CA: a cancer journal\nfor clinicians, 68(4):246–249, 2018. doi:10.3322/caac.21459.\n24\n\n\nA\nProbabilities available from public sources\nTo assess the probabilities in the chance nodes introduced, Table 19 compiles the per-\nformance information of the screening methods as well as their cost with data available\nfrom Barr´e et al. [5], based on French sources.\ngFOBT\nFIT\nBldBsd\nsDNA\nCTC\nCC\nColons.\nSensitivity\n0.45\n0.75\n0.66\n0.923\n0.8\n0.87\n0.97\nSpecificity\n0.978\n0.966\n0.91\n0.866\n0.89\n0.92\n0.99\nCost €\n12.14\n14.34\n123.13\n236.88\n95.41\n510.24\n1000\nTable 19: Specificity, sensitivity, and cost in € of interventions.\nWe also require the probabilities and expected costs of complications as reflected in\nTable 20 based on [5].\ngFOBT\nFIT\nBlbBsd\nsDNA\nCTC\nCC\nColons\nCost\nNone\n1\n1\n1\n1\n0.9996\n0.9997\n0.998\n0 €\nBleed.\n0\n0\n0\n0\n0\n0\n0.0006\n1241€\nReten.\n0\n0\n0\n0\n0\n0.0003\n0\n1241€\nPerfor.\n0\n0\n0\n0\n0.0004\n0\n0.001\n2810€\nOther\n0\n0\n0\n0\n0\n0\n0.0004\n6621€\nTable 20: Probabilities and expected costs of complications for CRC interventions.\n25\n\n\nB\nFull elicitation of comfort parameters\nTable 21 contains full details of the calculations used to assess comfort parameters.\nComfort\nScr. method\nCost\nInfo\nPreference\nIndiff. cost\nˆλk\nλk\n1\nColonos\n1000\n0.530\n–\nλ1 = 4.01\nλ1 = 4.01\nSynth.\n–\n0.4\n×\n300€\n2\nCTC\n95.41\n0.159\n×\n–\nλ2 = 4.17\nλ2 = 4.17\nCC\n510.24\n0.225\n180€\n3\ngFOBT\n12.14\n0.129\n3€\nλ3 = 5.04\n¯λ3 = 6.80\nFIT\n14.34\n0.245\n×\n–\n3\ngFOBT\n12.14\n0.128\n×\n–\nλ3 = 10.57\nBlood test\n125.13\n0.121\n10€\n3\ngFOBT\n12.14\n0.128\n×\n–\nλ3 = 16.28\nsDNA\n236.88\n0.197\n170€\n3\nFIT\n14.34\n0.244\n×\n–\nλ3 = 6.40\nBlood test\n125.13\n0.121\n1.5€\n3\nFIT\n14.34\n0.244\n×\n–\nλ3 = 7.2\nsDNA\n236.88\n0.197\n6€\n3\nBlood test\n125.13\n0.121\n80€\nλ3 = 6.17\nsDNA\n236.88\n0.197\n×\n–\n4\nNo scr.\n0\n0\n–\n–\n–\nλ4 = 7\nTable 21: Eliciting parameter λk. X indicates the preferred alternative in the corre-\nsponding pairwise comparison.\n26\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21210v1.pdf",
    "total_pages": 26,
    "title": "A decision analysis model for colorectal cancer screening",
    "authors": [
      "Daniel Corrales",
      "David Ríos Insua",
      "Marino J. González"
    ],
    "abstract": "Background and Objective. With minor differences, most national colorectal\ncancer (CRC) screening programs in Europe consist of one-size-fits-all\naged-based strategies. This paper provides a decision analysis-based approach\nto personalized CRC screening, supporting decisions concerning whether and\nwhich screening method to consider and/or whether a colonoscopy should be\nadministered.\n  Methods. We use an influence diagram which characterizes CRC risk with\nrespect to different variables of interest and includes comfort, costs,\ncomplications, and information as decision criteria, the last one assessed\nthrough information theory measures. The criteria are integrated with a\nmulti-attribute utility model. Optimal screening policies are then computed.\n  Results. The proposed model is used to support personalized individual\nscreening based on relevant characteristics. It serves to assess existing\nnational screening programs and design new ones. In particular, it suggests\nreplacing current age-based strategies followed in many European countries by\nmore personalized strategies based on the type of model proposed. Additionally,\nthe model facilitates benchmarking of novel screening devices.\n  Conclusions. This work creates a framework supporting personalized CRC\nscreening improving upon current age-based screening strategies.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}