{
  "id": "arxiv_2502.21182v1",
  "text": "Effect of inflow conditions on tip vortex breakdown\nin a high Reynolds number wind turbine wake\nMano Grunwald\nMax Planck Institute for Dynamics and Self-Organization, 37077 G¨ottingen, Germany and\nDepartment of Physics, Georg-August-Universit¨at G¨ottingen, 37077 G¨ottingen, Germany\nClaudia E. Brunner∗\nMax Planck Institute for Dynamics and Self-Organization, 37077 G¨ottingen, Germany\n(Dated: March 3, 2025)\nUnderstanding the re-energization of wind turbine wakes is crucial for the design and control of\nwind farms. Close to the rotor, this process is determined by the dynamics of the tip vortices.\nHere, we experimentally investigate the downstream evolution of the tip vortices for different inflow\nconditions. The experiments were performed in the Variable Density Turbulence Tunnel at the Max\nPlanck Institute for Dynamics and Self-Organization, which uses pressurized SF6 as the working fluid\nto achieve a turbine diameter-based Reynolds number of ReD = 2.9 × 106. An active turbulence\ngrid was used to generate atmospheric inflow conditions with varying levels of mean shear and\nturbulence intensity. Hot wire measurements of the streamwise velocity component were conducted\nin the inflow and the wake of a model wind turbine MoWiTO 0.6 for various tip speed ratios and\nare used to investigate the scaling of tip vortex breakdown in the near wake. While the scaling is\nonly weakly affected by variations in mean velocity shear, both turbulence intensity and tip speed\nratio have a strong effect on vortex breakdown.\nKeywords: tip vortex, wind turbine, high Reynolds number\nI.\nINTRODUCTION\nWind energy is a key technology in the transition to\ngreen energy production. Wind turbines are commonly\norganized in wind farms, where multiple turbines oper-\nate in close proximity. This leads to interactions between\nthe turbines, with downstream turbines experiencing the\nwakes of upstream turbines as their inflow. These inter-\nactions reduce the generated power [1, 2] and increase\nfatigue loads on the blades of the turbines [3]. Therefore,\nwakes play a critical role in the development of wind farm\nlayouts, necessitating a comprehensive understanding of\ntheir dynamics.\nWind turbine wakes are dominated by coherent struc-\ntures: vortices are shed from roots and tips of the rotor\nblades and transported downstream. Due to the circu-\nlar motion of the rotor, helical vortex tubes are formed.\nWhile the root vortices break down close to the rotor,\nthe tip vortices can persist several rotor diameters down-\nstream. It is their evolution that primarily determines\nthe initial dynamics of the wake [4–6]. In the near wake,\nthe velocity is low as the wind turbine removes kinetic\nenergy from the flow. Only once the tip vortices break\ndown, does the wake begin to re-energize [7, 8]. Mech-\nanisms of tip vortex breakdown have been studied ex-\ntensively in the literature and can be grouped into two\ncategories: interactions with adjacent vortices and inter-\nactions with surrounding turbulence. Which mechanisms\ndominate is likely dependent on the exact flow condi-\ntions. As such, understanding what mechanisms induce\n∗claudia.brunner@ds.mpg.de\nvortex breakdown under realistic atmospheric conditions\nand what scaling laws they follow is of great interest to\nthe wind energy community.\nBreakdown due to interactions with adjacent vortices\nis the most widely studied mechanism. Ivanell et al. [9]\nconducted Large Eddy Simulations to investigate the sta-\nbility of the tip vortices by perturbing them in the axial\ndirection. They found that tip vortex breakdown is faster\nif subsequent helices are perturbed in different directions.\nThis brings the vortices closer together, which promotes\ninteractions between them. While the interaction of vor-\ntex pairs has been extensively studied at a fundamen-\ntal level (see e.g. [10]), Posa et al. [11] later described\nthe breakdown mechanism of tip vortices in wind turbine\nwakes due to interaction in detail. After short-wave insta-\nbilities are triggered, long-wave instabilities lead to mu-\ntual induction between subsequent vortices. This even-\ntually results in leapfrogging and the breakdown of the\ntip vortices into smaller eddies.\nThe spacing of adjacent vortices is related to the tip\nspeed ratio TSR:\nTSR = πDfrot\nu\n(1)\nHere, D is the rotor diameter, frot is the rotation fre-\nquency of the rotor and u is the mean velocity of the\nflow. The rotation rate of the rotor determines how of-\nten vortices are created at a given location, while the\nmean velocity determines how quickly they are advected\ndownstream. As such, higher tip speed ratios result in\ncloser vortices. Hu et al. [12] point to a decrease in tip\nvortex strength with increasing tip speed ratio due to the\ndecreasing effective angle of attack of the blades. As a\nresult, they report faster vortex breakdown at higher tip\narXiv:2502.21182v1  [physics.flu-dyn]  28 Feb 2025\n\n\n2\nspeed ratios. Thus, higher tip speed ratios not only en-\nhance the breakdown process by decreasing the distance\nbetween vortices, but also by changing the effective an-\ngle of attack. They also record the maximum vorticity\nof the tip vortices as a function of downstream distance\nfrom the rotor. Interestingly, they find that the decrease\nin vorticity follows a power law.\nIn the presence of turbulence, the interaction of tip vor-\ntices with the surrounding flow is also thought to induce\nvortex breakdown. Ghimire and Bailey [13] found that\nhigher turbulence intensity in the inflow leads to a faster\nbreakdown of the tip vortices.\nIn a subsequent study,\nthey showed that a turbulent inflow led to fluctuations\nin the vortex core circulation, which were absent under\nlaminar inflow conditions [14].\nThey found that these\nfluctuations correspond to the formation of secondary\nvortex structures around the tip vortices. Interactions\nwith these structures then led to breakdown of the tip\nvortices.\nIn the context of wind turbines, the turbulence inten-\nsity (TI) is typically used to characterize the inflow tur-\nbulence:\nTI = u′\nrms\nu\n(2)\nHere, u′\nrms is the root-mean-square value of the velocity\nfluctuations in the streamwise direction u′. Gambuzza\nand Ganapathisubramani [15] showed that higher turbu-\nlence intensities lead to faster wake recovery. Van der\nDeijl et al. [16] found that this effect is stronger than the\neffect of tip speed ratio. Yen et al. [17] explicitly stud-\nied the leapfrogging effect, by shortening one of the rotor\nblades. Although this did lead to enhanced interactions\nbetween the tip vortices at low TI, interactions with the\nsurrounding turbulence dominated vortex breakdown at\nhigher TI.\nThe inflow experienced by real wind turbines is typi-\ncally not only turbulent, but also sheared. However, few\nstudies have investigated the impact of shear on tip vor-\ntex breakdown. Parinam et al. [18] conducted a Large\nEddy Simulation of a wake in a sheared laminar inflow\nand observed a tilting of the helical tip vortex structures\ndue to the shear.\nThis led to differences in the spac-\ning of adjacent vortices: at the bottom of the rotor, tip\nvortices were closer together and thus interacted sooner,\nleading to faster breakdown, while at the top of the ro-\ntor, they were spaced further apart, delaying interactions\nand breakdown.\nBecause vortex breakdown is sensitive to the local flow\nconditions, it is crucial to investigate these effects un-\nder conditions that are as realistic as possible.\nHow-\never, the Reynolds numbers of wind turbine flows are\nexceptionally high and therefore challenging to recreate\nin numerical studies and laboratory experiments.\nThe\nturbine-based Reynolds number ReD = uD/ν is typi-\ncally on the order of 106 ≲ReD ≲108. However, most\nlaboratory experiments of wind turbine wakes have been\nconducted at Reynolds numbers that are more than two\n18.2 m\nActive Grid\nFan\nFlow\nMeshes\nTraverse\nHeat Exchanger\n8.8 m\n5.3 m\n1.18 m\nFIG. 1. Schematic of the Variable Density Turbulence Tun-\nnel at the Max Planck Institute for Dynamics and Self-\nOrganization.\norders of magnitude lower than those of full-scale wind\nturbines.\nAn exception to this is the use of pressur-\nized wind tunnels, which generate high Reynolds number\nflows by lowering the kinematic viscosity. Piqu´e et al. [19]\nconducted hot-wire measurements in such a facility to\nstudy the wake of a model wind turbine and observed\na Reynolds number invariance of the wake velocity field\nover 2.7 × 106 ≤ReD ≤7.2 × 106.\nIn a subsequent\nstudy, they investigated coherent structures in the wake\nby associating them with the presence of distinct peaks in\nthe velocity spectra [20]. The peak corresponding to the\ntip vortices decreased with increasing downstream posi-\ntion. Importantly, these experiments were conducted un-\nder laminar inflow conditions, so that the effect of inflow\nturbulence could not be studied.\nHere, we present an experimental investigation of tip\nvortex breakdown in turbulent, sheared flows at full-scale\nReynolds numbers. These experiments were conducted\nin the Variable Density Turbulence Tunnel (VDTT)\nat the Max Planck Institute for Dynamics and Self-\nOrganization to achieve a Reynolds number of ReD =\n2.9 × 106. An active turbulence grid was used to con-\ntrol mean velocity shear and turbulence intensity in the\ninflow. To the authors’ knowledge, this is the first labo-\nratory study of a wind turbine in a high Reynolds num-\nber (ReD ∼106) turbulent flow. The focus of the present\nstudy is not to identify which specific mechanisms ini-\ntiate vortex breakdown, but rather the scaling of the\nbreakdown process in turbulent shear flows.\nAs such,\nwe present the effects of turbulence intensity, mean shear\nand tip speed ratio on the signatures of the tip vortices\nin the velocity spectra.\nII.\nMETHODOLOGY\nA.\nVariable Density Turbulence Tunnel\nThe experiment was conducted in the Variable Density\nTurbulence Tunnel (VDTT) at the Max Planck Institute\n\n\n3\nvariable name\nsymbol\nmean value\nmean velocity\nutop\n2.87 m s−1 to 2.94 m s−1\npressure\np\n4.00 bar\ntemperature\nT\n20.0 ◦C\ndensity\nρ\n25.2 kg m−3\ndynamic viscosity\nµ\n15.0 µPa s\nTABLE I. Experimental conditions.\nThe mean velocity is\nobtained at the upper edge of the rotor.\nActive Grid\nHot Wires\nInflow\nWind Turbine\nFIG. 2. Experimental setup in the upper measurement section\nof the VDTT.\nfor Dynamics and Self-Organization in G¨ottingen. The\nVDTT, shown in Figure 1, is a closed-loop wind tunnel in\nan upright position. It is 18.2 m long, 5.3 m tall and con-\ntains an upper and a lower measurement section. The\npresent experiments were conducted in the 8.8 m long\nupper measurement section. The VDTT is specifically\ndesigned to investigate high-Reynolds-number flows. To\nthis end, sulfur hexafluoride (SF6) at up to 15 bar is used\nas the working fluid due to its low kinematic viscosity.\nA 210 kW fan located at the downstream end of the lower\nmeasurement section is used to circulate the gas at up\nto 5 m/s.\nThe experimental conditions of the present\nstudy are shown in Table I. Before the working fluid en-\nters the upper measurement section, it passes through a\nheat exchanger to ensure constant temperature through-\nout the experiment. The heat exchanger additionally acts\nas a flow straightener that removes any fan rotation from\nthe flow. Downstream of the heat exchanger three meshes\nwith increasing mesh sizes are installed to laminarize the\nflow. The wind tunnel is described in detail in Boden-\nschatz et al. [21].\nThe experimental setup is shown in Figure 2. An ac-\ntive turbulence grid is located immediately downstream\nof the laminarizing meshes. A customary inflow profile\nis generated with the active grid and the streamwise ve-\nlocity component of the flow is recorded at a variety of\nlocations using a hot wire setup.\nAfter characterizing\nthe inflow, a model wind turbine is installed and the\nstreamwise velocity component at the top of the wake\nis measured at various downstream positions. The fol-\nlowing sections provide detailed information on each of\nthese steps.\nB.\nActive turbulence grid\nTo investigate the impact of shear, turbulence intensity\nand tip speed ratio on tip vortex breakdown, several in-\nflow cases are generated with the active grid. The use of\nactive grids for generating shear flows [22–24] and turbu-\nlence [23, 25–29] is well established in the literature. The\nactive grid in the VDTT consists of 111 flaps, which can\nbe individually controlled at a rate of 10 Hz. Each flap is\nquadratic with a side length of 10 cm. The gap between\ntwo fully closed consecutive flaps is 15 mm, resulting in\na mesh size of M = 11.5 cm. The flaps are arranged in\n9 rows and 13 columns. A flap at row i and column j is\ncharacterized by its opening angle ϕij with ϕij = 0 corre-\nsponding to a fully open flap and ϕij = ±90◦correspond-\ning to a fully closed flap. The grid motion is composed\nof a stationary mean distribution ϕij that is superim-\nposed with a random fluctuating motion ϕ′\nij(t) that is a\nfunction of time t, such that ϕij(t) = ϕij + ϕ′\nij(t). The\ntime series for the random motion is integrated from an\nOrnstein-Uhlenbeck process following Neuhaus et al. [27]:\ndϕ′\nij\ndt (t) = −γouϕ′\nij(t) +\np\nDou Γ(t)\n(3)\nHere, γou determines how strongly the process is at-\ntracted to zero, Dou governs the magnitude of the random\nfluctuations and Γ is noise drawn from a Gaussian dis-\ntribution. Additionally, spatial correlation is introduced\nfollowing the principles described in Griffin et al. [28]:\nϕ′\nij =\n3\nX\nk=1\n3\nX\nl=1\nΩklϕ′\ni+k−2,j+l−2\n(4)\nHere, a 3x3 convolution with a convolution kernel Ωkl =\n1/9 is used.\nAt the boundaries, reflective boundary\nconditions are employed such that ϕ′\n(−1)j = ϕ′\n1j and\nϕ′\ni(−1) = ϕ′\ni1. Using this kernel, the angle of each flap\nis determined by the average of its own angle and the\nangles of its eight neighboring flaps.\nTarget velocity profiles with varying levels of shear and\nturbulence intensity were determined. The parameters of\nthe above grid motion protocol were then iteratively ad-\njusted until satisfactory agreement between the resulting\nflow and the target profiles was achieved. As the target\nmean velocity shear is in the vertical direction, the mean\nflap angles are considered to be the same across each row\nsuch that ϕij = ϕi. The optimization parameters were\nthe mean angle of each row ϕi, Dou and the wind tunnel\nfan speed. The parameters used for the final grid proto-\ncols are presented in Appendix A. More details on the\nactive grid are provided in Bodenschatz et al. [21] and\nGriffin et al. [28].\nC.\nModel wind turbine\nThe wind turbine used in these experiments is a model\nwind turbine MoWiTO 0.6, developed at the Univer-\n\n\n4\nsity of Oldenburg [30, 31]. The turbine is placed 40.7M\ndownstream of the active grid.\nIt has a rotor diame-\nter of D = 0.58 m and a hub height of zhub = 0.52 m.\nThe conditions shown in Fig. Table I result in a turbine\nReynolds number of ReD = 2.9 × 106. The blade design\nis based on the SD 7003 airfoil. The turbine features a\npitching mechanism, allowing for the simultaneous ad-\njustment of the pitch of the rotor blades. The rotor is\nconnected to a DC motor that acts as a generator. The\nturbine rotation rate is controlled by a field effect tran-\nsistor (FET) which dissipates the generated power. The\nvoltage of the FET is adjusted using a PID controller.\nThe increased power density of the flow in SF6 compared\nto air means that at a given rotation rate the rotor ex-\ntracts more power.\nAt high pressures, this power ex-\nceeded the maximum power the generator could convert\nat this rotation rate. As a result, it was not possible to\napply the load necessary to fix the rotation rate and the\nrotor would spin up. A gearbox with a ratio of 1 : 4.8\nwas installed to reduce the rotation rate of the generator\nand thus increase its torque. This shifted the operating\nconditions closer to the optimal range for this generator,\nso that it was able to extract the necessary power.\nD.\nData acquisition and post-processing\nAll velocity information in this study is based on\nstreamwise velocity measurements conducted using Dan-\ntec Dynamics 55P11 hot wire probes.\nThe probes\nare 1.25 mm long with a diameter of 5 µm.\nThe\nhot wires were operated in CTA-mode and controlled\nvia\na\nDantec\nDynamics\nStreamLine\n90N10\nFrame\nwith 90C10 CTA modules using the Dantec Dynamics\nStreamWare Pro v6.00 software. The overheat ratio was\nset to 0.8. For the connection to the modules, 20 m long\nRG223 cables were used.\nThe signal was sampled at\n60.06 kHz, low pass filtered at 30 kHz and read out via\na National Instruments PCI-6123 DAQ card. The hot\nwires were calibrated using pitot tubes connected to a\nSiemens SITRANS P DS III differential pressure trans-\nducer. Turbine data, such as the rotation rate, were sam-\npled at 5 kHz by a National Instruments cRIO-9074 data\nacquisition system.\nThe inflow profiles are characterized at the position\nof the model wind turbine in the lateral center of the\nwind tunnel with a vertical spacing of 24 mm between\nmeasurement points. The measurements extend beyond\nthe swept area of the rotor as shown in Figure 4.\nAt\neach measurement point, the flow is sampled for 5 min to\nensure convergence of second moments. To verify conver-\ngence, 15 min measurements are conducted in the lateral\nand vertical center of the wind tunnel for each grid pro-\ntocol.\nTo observe the tip vortex evolution in the wake,\nmeasurements\nwere\nconducted\nat\nthe\nlateral\ncen-\nter of the tunnel at streamwise positions x/D\n=\n[0.25, 0.50, 0.75, 1.00, 1.25, 1.50, 6.79] downstream of the\n0.1\n0.2\n0.3\n0.4\n0.5\nu′2 [m2s−2]\n0.94\n0.96\n0.98\n1.00\n1.02\n1.04\n1.06\nz/ztop [−]\ndata\nparabolic ﬁt\nposition with maximal variance\nFIG. 3. Streamwise velocity variance profile at the top of the\nwake at x/D = 0.25 downstream of the rotor. The maximum\nof the parabolic fit is taken to be the tip vortex height, at\nwhich a longer measurement is then conducted to determine\nthe streamwise velocity spectrum.\nmodel wind turbine. Due to wake expansion, the vertical\nlocation of the tip vortices is a function of downstream\nposition [32, 33]. To account for this, the vertical pro-\nfile of the velocity variance was measured throughout in\nthe expected region following [19]. An example of such\na variance profile is shown in Figure 3. A parabola is\nfit to this profile and its maximum is taken to be the\ntip vortex height. The flow was sampled at this position\nfor 15 min resulting in the streamwise velocity spectra\npresented in section III. In the two most downstream\npositions, the tip vortices had typically broken down so\nmuch that the variance profiles no longer showed clear\nmaxima.\nIn these cases, the height of the closest up-\nstream measurement point was used.\nThe streamwise velocity spectra are computed using\nWelch’s algorithm [34] and smoothed with a moving av-\nerage filter. This procedure is parameterized by the num-\nber of segments used in Welch’s algorithm and the width\nof the moving average window.\nHere, eight segments\nare used, while the width of the moving average win-\ndow is 0.3 Hz. Details on these parameter choices can\nbe found in Appendix B. Typically, turbulent velocity\nspectra follow a −5/3 scaling in the inertial range. In\nthe inflow, this scaling extends over three decades which\nis indicative of a high Reynolds number flow.\nE.\nInflow characteristics\nIn a vertically-sheared flow, many relevant parameters\ninherently vary as a function of height.\nThis required\nus to select a reference height at which to define target\ninflow characteristics. We decided to focus on the tip vor-\ntices shed from the upper edge of the rotor because these\nare easiest to locate and least affected by the turbine\ntower. As such, the upper edge of the rotor was chosen as\nthe reference location for defining the inflow conditions,\nrather than the hub height. To minimize ReD effects on\nthe tip vortices, the target mean velocity at the top of\nthe rotor is the same for all cases. Due to the presence of\n\n\n5\nboundary layers at the tunnel walls, maintaining a linear\nmean velocity gradient across the entire vertical profile\nis not possible. However, we expect the behavior of the\ntip vortices to be primarily sensitive to the velocity gra-\ndient across the rotor area. As such, the mean shear is\nhere defined as the mean velocity difference ∆uD across\nthe vertical span of the rotor normalized by the mean\nvelocity at the upper edge of the rotor:\n∆uD\nutop\n=\nD\nutopm\n(5)\nHere, m is the slope of a linear fit to the recorded mean\nvelocity profiles over the vertical span of the rotor and\nutop is the mean velocity at the upper edge of the rotor.\nBecause turbulence in the inflow is generated not only by\nthe active grid, but also by the mean velocity shear, it\nis practically impossible to keep the turbulence intensity\nconstant across the vertical profile of the test section.\nHowever, we expect the behavior of the tip vortices at\nthe upper edge of the rotor to be primarily sensitive to\nthe turbulence intensity at their height. As such, the tur-\nbulence intensity is referenced at the height of the upper\nedge of the rotor TItop = (u′\nrms)top/utop. Equivalently,\nthe tip speed ratio is defined based on the velocity at the\ntop of the rotor TSRtop = πDfrot/utop.\nThe resulting mean velocity and turbulence intensity\nprofiles for the five investigated inflow conditions are\nshown in Figure 4 and the relevant parameters are listed\nin Table II.\nThe profiles are smoothed with a moving\naverage filter. The case of medium shear and medium\nturbulence intensity serves as a reference case.\nTwo\ncases differ in their turbulence intensity but have ap-\nproximately the same mean shear across the rotor plane,\nwhile the two remaining cases have varying mean shear\nbut approximately the same turbulence intensity at the\ntop edge of the rotor. As such, these five inflow condi-\ntions allow us to study the effects of shear and turbulence\non tip vortex breakdown independently of one another.\nThe effect of tip speed ratio was investigated using the\nreference case inflow condition and varying the tip speed\nratio over TSRtop = [4.2, 6.3, 8.4]. The parameter space\nstudied here falls within the realistic operating conditions\nof wind turbines with the turbulence intensity being on\nthe higher end of the range.\nTo further characterize the inflow turbulence of the\ndifferent cases, the integral length scale, the Kolmogorov\nlength scale and the Taylor-scale Reynolds number are\nshown.\nFor the computation of the turbulence scales,\nTaylors frozen flow hypothesis is employed to convert\ntemporal scales into length scales.\nIt should be noted\nthat this hypothesis is only valid for small turbulence in-\ntensities and may introduce some error in the derived\nquantities for the highly turbulent flows investigated\nhere. For all following relations see [35]. The integral\nlength scale L11 is obtained by numerically integrating\nthe autocorrelation function of the streamwise velocity\ncomponent until the first zero crossing. The Kolmogorov\nlength scale η is defined as η = (ν3/ε)1/4.\nThe dis-\nsipation rate ε is obtained via the streamwise velocity\nspectrum E11. By compensating the spectrum with the\nKolmogorov scaling E11 ∼ε2/3f −5/3/u, where f is a fre-\nquency, the dissipation rate is computed as an average\nover the inertial subrange [36]:\nε =\n*\n2π\nu\n\u0014 f 5/3E11\n18/55CK\n\u00153/2+\ninertial range\n(6)\nHowever, this method is based on the assumption of ho-\nmogeneous isotropic turbulence which is likely not valid\nfor the flow conditions involving mean velocity shear.\nThe Taylor scale Reynolds number Reλ is defined as\nReλ = u′\nrmsλ/ν, where λ is the Taylor microscale. This\nReynolds number is commonly used to characterize grid\nturbulence. The Taylor scale is obtained by\nλ =\ns\n15νu′2\nrms\nε\n(7)\nThe Reynolds number of grid turbulence is generally\nconsidered to be high if\nReλ ∼103, which is achieved\nfor all cases. It is somewhat surprising that the high-\nturbulence-intensity inflow had approximately the same\nReλ as the reference case and that the high-shear inflow\nhad a lower Reλ than the reference case. In all cases,\nthe integral scale is equal to or larger than the rotor di-\nameter, which is generally also true for full-scale wind\nturbine flows. While a dependence of the integral scale\non mean shear is not observed, it decreases with increas-\ning turbulence intensity. Similarly, the Kolmogorov scale\nη decreases with turbulence intensity.\nF.\nQuantification of tip vortex breakdown\nIn order to investigate the scaling of tip vortex\nbreakdown, a quantitative measure of this breakdown\nis needed.\nMany studies use vorticity-based mea-\nsures derived from flow visualization to quantify vortex\nstrength [8, 12].\nHowever, such approaches are time-\nconsuming and computationally expensive, which makes\nlarge parameter scans challenging. Here, we are primarily\ninterested in the rate of vortex breakdown, rather than\nabsolute vortex strength. As such, the signature of the\ntip vortices in the streamwise velocity spectrum is used\nas a measure of vortex breakdown. By considering only\nthe streamwise velocity component, this method neglects\nthe three-dimensional structure of the tip vortices. How-\never, for the purpose of deriving scaling laws, we consider\nthis approach to be sufficient.\nFigure 5a shows the velocity spectrum of the inflow\nat the rotor position as well as in the wake at differ-\nent downstream positions for the reference case. In the\nwake, the −5/3 scaling in the inertial range is disrupted\nby the signature of the tip vortices. The highest devi-\nation occurs close to the rotor, where the tip vortices\n\n\n6\nID\n∆uD/utop\nTItop [%]\nTSRtop\nL11 [m]\nη [µm]\nReλ\nlow shear\n0.10\n11.3\n6.1\n0.67\n41\n1850\nlow turbulence intensity\n0.33\n8.8\n6.2\n1.01\n51\n1890\nlow tip speed ratio\n0.27\n10.6\n4.2\n0.81\n50\n2510\nreference case\n0.27\n10.6\n6.3\n0.81\n50\n2510\nhigh tip speed ratio\n0.27\n10.6\n8.4\n0.81\n50\n2510\nhigh turbulence intensity\n0.26\n14.6\n6.3\n0.60\n35\n2570\nhigh shear\n0.57\n10.8\n6.2\n0.64\n44\n2030\nTABLE II. Mean shear ∆uD/utop, turbulence intensity TItop, tip speed ratio TSRtop, integral length scale L11, Kolmogorov\nscale η and Taylor scale Reynolds number Reλ for all generated inflow cases. All values are measured at the height of the upper\nedge of the rotor.\n1.50\n1.75\n2.00\n2.25\n2.50\n2.75\n3.00\n3.25\nu [m/s]\n0.0\n0.5\n1.0\n1.5\n2.0\nz/zhub [−]\n(a)\n6\n8\n10\n12\n14\n16\n18\n20\n22\nTI [%]\n(b)\nlow shear\nlow turbulence intensity\nreference\nhigh turbulence intensity\nhigh shear\nFIG. 4. (a) mean velocity and (b) turbulence intensity profiles. Data with the same color in both plots corresponds to the\nsame inflow case. The solid black line marks the hub height of the model wind turbine, while the dashed black lines show the\nrotor swept area.\ncause the spectrum to exhibit a distinct peak at approxi-\nmately the blade pass frequency fbp = 3frot, where frot is\nthe rotational frequency of the wind turbine. This is the\nfrequency at which tip vortices are created at a specific\nazimuthal position along the rotor edge and thus the fre-\nquency at which they pass by a specific measurement lo-\ncation in the wake. Close to the rotor (x/D ≲0.5), peaks\nalso occur at frequencies equal to an integer multiple of\nthe blade pass frequency. These peaks correspond to the\nharmonics of the first peak. The height of the first peak\ndecreases with distance from the rotor. These signatures\nof the tip vortices in the wake velocity spectra have pre-\nviously been observed in the literature [6, 19, 20, 37, 38].\nWe consider the height of the peak at fbp to be re-\nlated to the strength of the tip vortices (see section III B).\nThus, the maximum of the smoothed velocity spectrum\nwithin a 2 Hz interval around the blade pass frequency is\ntaken as a measure for the strength of the vortices. The\nwidth of this interval is chosen such that the slope of\nthe spectra does not significantly affect the determined\npeak height even for small peaks. Details regarding the\nsensitivity of the peak height to the computation of the\nspectra are discussed in Appendix B. The resulting peak\nheights as a function of downstream position for the ref-\nerence case are shown in Figure 5b and further elaborated\nin section III B.\nIII.\nRESULTS AND DISCUSSION\nA.\nEvolution of the wake spectra\nThe streamwise velocity spectra for the reference case\nare shown in Figure 5a.\nThey contain the distribu-\ntion of turbulent kinetic energy in the streamwise ve-\nlocity component E11 across the frequencies f that are\npresent in the flow. The frequencies can be associated\nwith the scales of the turbulence: low frequencies cor-\nrespond to large scales, while high frequencies corre-\nspond to small scales. The inflow spectrum was obtained\nat the streamwise position of the rotor after removing\nthe turbine, while the wake spectra were measured at\n0.25 ≤x/D ≤6.79 downstream of the rotor. The in-\nflow spectrum exhibits an inertial range of almost three\ndecades, as shown by the −5/3 scaling, which is charac-\nteristic of high Reynolds number turbulence.\nThe downstream evolution of the wake spectra can be\ndivided into two regions. In the first region (x/D ≲1.50),\nthe wake spectra are dominated by the presence of the\ntip vortices, which appear to primarily affect the tur-\nbulence at scales equal to and smaller than the vor-\ntices themselves.\nAs such, the spectral energy in the\nrange 101 Hz ≲f ≲103 Hz is higher than in the inflow,\nbut decreases with downstream position. At frequencies\n\n\n7\n10−1\n100\n101\n102\n103\nf [Hz]\n10−10\n10−8\n10−6\n10−4\n10−2\nE11 [m2s−1]\n(a)\nfbp\nfbp harmonics\nx/D\n0.25\n0.50\n0.75\n1.00\n1.25\n1.50\n6.79\ninﬂow\n∼f −5/3\n0.25\n0.5\n0.75\n1.0 1.25 1.5\nx/D [−]\n10−3\n10−2\nE11(fpeak) [m2s−1]\n(b)\nα = −1.3\nexperimental data\nlinear ﬁt: ∼(x/D)α\nFIG. 5. (a) inflow spectrum and wake spectra at the top of the rotor for the reference case at different downstream positions.\nfbp is the blade pass frequency. The interval shown around fbp corresponds to the region, in which the maximum value is taken\nfor the determination of the peaks. (b) local maxima of the wake spectra around the blade pass frequency.\nlower than the blade pass frequency (larger scales), the\nspectral energy is also higher in the wake than in the\ninflow, which might be due to generation of turbulent\nkinetic energy by the shear layer surrounding the wake.\nInterestingly, over 100 Hz ≲f ≲101 Hz, which is within\nthe inertial range of the inflow spectrum but lower than\nthe blade pass frequency, the spectral energy remains\nconstant with downstream position. Only the lowest fre-\nquencies (f ≲100 Hz) show a decrease of spectral energy\nwith downstream position, indicating a decay of these\nvery large scales. This suggests that the turbulence at\nscales larger than the tip vortices is in equilibrium and\nslowly decaying, while the smaller scales are out of equi-\nlibrium due to the turbulence generated by the vortex\nbreakdown.\nAt the highest frequencies (f ≳103 Hz),\nwhich extend into the dissipation range, the measure-\nments closest to the rotor (x/D ≤0.5) show the highest\nspectral energy, but interestingly the spectra of the more\ndownstream positions collapse. However, due to the use\nof SF6 to achieve Kolmogorov length scales ∼10−5 m, the\ndissipation range was not fully resolved in these measure-\nments.\nIn the second region (x/D ≳1.50), the signature of the\ntip vortices is no longer visible in the spectra, which are\nnow similar in shape to the inflow spectrum. Presumably,\nthe tip vortices have entirely broken down. With increas-\ning distance from the rotor, the spectra are shifted down-\nwards indicating an overall decay of turbulent kinetic en-\nergy. Far from the rotor (x/D = 6.79) the spectrum re-\nsembles the inflow spectrum over the entire inertial and\ndissipation ranges, but is still shifted upwards, indicating\nthat the wake turbulence has not fully decayed. This is\nin agreement with previous studies of wake turbulence,\ne.g. [15]. In the remainder of this manuscript, we focus on\nthe first region, in which the tip vortices are still visible\nin the spectra.\nB.\nTip vortex breakdown\nThe inset in Figure 5a shows a close-up of the peaks\naround the blade pass frequency in the streamwise ve-\nlocity spectra. In the absence of flow visualization, it is\nnot possible to directly relate these peaks to specific vor-\ntex behavior or breakdown mechanisms.\nNevertheless,\ntheir gradual decay may serve as a relative measure of\nthe rate of vortex breakdown in various flow conditions.\nThe frequency at which these peaks are located in the\nspectrum is related to the rate at which the vortices ap-\npear at the measurement location, rather than their size.\nAt x/D = 0, a tip vortex is generated every time a blade\npasses by the reference location, so that we expect the\nvortices to appear in the velocity signal as a periodic dis-\nturbance with a frequency of exactly fbp. As they are\nconvected downstream and interact with the surround-\ning flow, we expect them to wobble and gradually break\nup so that the rate at which they appear at a given mea-\nsurement location begins to fluctuate. This would cause\nthe peaks to widen with increasing downstream position,\nwhich is what we observe in Figure 5. As such, we inter-\npret the magnitude of the peak to be a measure of the\ncoherence of the vortex and the regularity of its appear-\nance at the measurement location: a flatter and wider\npeak implies a less coherent vortex or larger fluctuations\nin its location, both of which can be associated with vor-\ntex breakdown.\nTo investigate the rate of tip vortex breakdown, we\nquantify the height of the aforementioned peak in the\nspectrum at each downstream position as described\nin section II F. Figure 5b shows the downstream evolu-\ntion of the peak height for the reference case. It appears\nthat the peak height may follow a linear trend in this\nlogarithmic plot, which would imply a power law scaling.\nIn a previous study of wind turbine tip vortex break-\ndown, Hu et al. similarly observed a power law scaling of\nthe vorticity of the vortex, quantified using particle im-\nage velocimetry [12]. Such a power law scaling indicates\n\n\n8\nID\nα\nc [10−3m2 s−1]\nlow shear\n−1.3 ± 0.2\n2.3 ± 0.2\nlow turbulence intensity\n−1.3 ± 0.3\n3.2 ± 0.5\nlow tip speed ratio\n−0.6 ± 0.2\n4.1 ± 0.4\nreference case\n−1.32 ± 0.09\n2.0 ± 0.2\nhigh tip speed ratio\n−1.6 ± 0.2\n0.96 ± 0.08\nhigh turbulence intensity\n−1.39 ± 0.04\n1.33 ± 0.04\nhigh shear\n−1.18 ± 0.07\n1.52 ± 0.07\nTABLE III. Parameters of the power law fit Epeak\n11\n= c ξα\nfor the downstream evolution of the peak heights in the wake\nspectra.\nthat within the wake region studied here, the underlying\nprocess of tip vortex breakdown is self-similar and gov-\nerned by a consistent physical mechanism. Further study\nis necessary to definitively confirm the linear nature of\nthis relationship. Nevertheless, we here follow Hu et al.\nin the assumption that within the wake region studied\nhere the breakdown process can in fact be described by\na power law scaling of the form Epeak\n11\n(ξ) = c ξα where\nEpeak\n11\n= E11(fpeak) and ξ = x/D. The parameter c is the\npeak height at ξ = 1 and thus describes the vertical offset\nof the data. The parameter α is the slope of the linear\nfit in the logarithmically-scaled graph and thus describes\nthe rate of peak decrease. Since this scaling describes\na decay process, α is negative and Epeak\n11\nis undefined\nat x = 0. Thus, for very small x/D the above scaling\ncannot hold. The parameter c may contain information\nabout this initial stage, though we cannot determine from\nour measurements where exactly the power scaling takes\nover. In the following we investigate how variations in the\nflow conditions affect these scaling parameters, which are\ngiven in Table III.\nC.\nEffects of shear and turbulence intensity\nVariations in mean velocity shear (see Figure 6a) and\nturbulence intensity (see Figure 6b) primarily lead to a\nvertical shift of the fitted curves, reflected in the parame-\nter c in Table III. The vortex breakdown rate α remains\nrelatively constant. As such, the peak heights are already\ndifferent x/D = 0.25 downstream of the rotor. This be-\nhavior is most striking for the variation in turbulence\nintensities and may indicate that within the wake region\nstudied here, the underlying process of the tip vortex\nbreakdown is only weakly affected by the inflow shear\nand turbulence intensity.\nInstead, their impact on tip\nvortex breakdown might occur very close to the rotor,\nduring or immediately after vortex formation, thereby\naffecting the overall time it takes the vortices to break\ndown. Interestingly, there is no notable difference in the\nbreakdown process between the low and medium shear\nconditions, while the high shear condition seems to ac-\ncelerate the breakdown process very close to the rotor.\nBecause mean velocity shear is a relatively large-scale\n10−3\n10−2\n(a)\n∆uD/utop\n0.100\n0.273\n0.566\n10−3\n10−2\nE11(fpeak) [m2s−1]\n(b)\nTItop\n8.78%\n10.6%\n14.6%\n0.25\n0.5\n0.75\n1.0\n1.25\n1.5\nx/D [−]\n10−3\n10−2\n(c)\nTSRtop\n4.18\n6.28\n8.37\nFIG. 6. Spectral peak heights corresponding to tip vortices\nat different downstream positions for varying (a) shear, (b)\nturbulence intensity and (c) tip speed ratio. The dashed lines\ncorrespond to power law fits.\nflow feature compared to the scales of the tip vortices,\nthey may only feel the shear at short time-scales if it is\nsufficiently strong locally.\nThe scales at which the turbulence interacts with the\ntip vortices is best seen in the velocity spectra.\nFig-\nure 7 shows inflow and wake spectra for the conditions\nwith varying turbulence intensity. As expected, the in-\nflow spectra are shifted vertically: higher turbulence in-\ntensity leads to more spectral energy at all scales, but\ninterestingly it also reduces the integral scale (see Ta-\nble II). Nevertheless, the integral scale is always on the\norder of the rotor diameter.\nAt the low frequencies (large scales), the wake spec-\ntra follow the same trend as the inflow spectra, though\nthe spectral energy is higher for all cases, presumably\ndue to turbulence generated by the shear layer. How-\never, at scales close to the integral scales, a crossing\npoint occurs after which the trend is reversed, so that\nat the scales of the tip vortices, higher turbulence in-\n\n\n9\n10−9\n10−7\n10−5\n10−3\n10−1\nE11 [m2s−1]\n(a)\nTItop\n8.78 %\n10.6 %\n14.6 %\n10−1\n100\n101\n102\n103\nf [Hz]\n10−8\n10−7\n10−6\n10−5\n10−4\n10−3\n10−2\n10−1\nE11 [m2s−1]\ncrossing point\n(b)\nFIG. 7. (a) Inflow spectra and (b) wake spectra at x/D = 0.75\nfor different turbulence intensities in the inflow. The dashed\nlines correspond to the integral scales.\ntensity leads to less spectral energy. In the dissipation\nrange, the spectra collapse. This may indicate that it is\nprimarily the large scales of the turbulence that interact\nwith the vortices to facilitate their breakdown and the de-\ncay of the turbulence generated by this breakdown. The\nobserved crossing point and the spectral energy at the\nlarge scales remain relatively constant throughout the\nrange observed here (up to x/D = 1.50), which raises\nthe question whether the turbulence generated by the\nvortex breakdown inhibits the decay of the large-scale\nturbulence generated by the shear layer. This shows the\nimportance of considering which scales are present in the\nturbulence and how they interact with the tip vortices,\nrather than using only the turbulence intensity to char-\nacterize the flow.\nD.\nEffects of tip speed ratio\nThe tip speed ratio appears to have a notable effect on\nthe tip vortex breakdown rate α: higher tip speed ratios\nlead to faster breakdown, as shown in Figure 6c. Inter-\nestingly, at x/D = 0.25 the peak heights are relatively\nsimilar for all three tip speed ratios investigated. This\nis particularly surprising because lower tip speed ratios\nare expected to induce slightly stronger initial tip vor-\ntices [12].\nAs described in the introduction, lower tip\nspeed ratios also result in larger spacing between sub-\nsequent vortices, which may lead to slower breakdown.\nThis is consistent with the present data.\nIV.\nCONCLUSION\nWe conducted the first laboratory study of a wind tur-\nbine wake in a high Reynolds number (ReD ∼106) tur-\nbulent flow. We demonstrate that the combination of a\npressurized wind tunnel and an active turbulence grid al-\nlows for the recreation of realistic atmospheric boundary\nlayer flow characteristics in a controllable and repeatable\nway. This enables us to investigate specific flow parame-\nters like mean shear and turbulence intensity in isolation,\nwhile maintaining dynamic similarity with full-scale wind\nturbine flows.\nWe investigated the effect of various flow conditions\non the scaling of the tip vortex breakdown process. The\ninflow conditions considered here were significantly more\nturbulent than those of most previous investigations of\nthis phenomenon, so that interactions of the turbulence\nwith the tip vortices were expected to be important for\nthe breakdown process. We show that within the wake\nregion investigated here, the breakdown process is de-\nscribed reasonably well by a power law scaling. The tip\nspeed ratio has a significant effect on the breakdown rate\nthroughout the investigated region, while turbulence in-\ntensity appears to primarily affect the breakdown process\nfurther upstream without affecting the breakdown rate in\nthe observed region. The impact of mean velocity shear\nwas overall less pronounced and did not notably affect\nthe breakdown rate in the observed region. This points\nto the importance of the tip speed ratio for the tip vor-\ntex breakdown process even in a highly turbulent envi-\nronment. The chosen tip speed ratio for wind turbines is\ncommonly based solely on considerations regarding the\npower output of the singular turbine. For wind farms,\nin which re-energization of the turbine wakes is crucial,\nthe aggregated power output might benefit from choos-\ning slightly larger tip speed ratios, as these would lead to\na faster tip speed breakdown.\nWe further show that the different length scales in the\nturbulence interact differently with the tip vortices and\nthe largest scales are possibly most important for tip vor-\ntex breakdown. The turbulence intensity as a single pa-\nrameter is unlikely to accurately capture this complex-\nity. Rather the relationship between integral scales and\nvortex scales should be investigated further. Future work\nshould also determine over what range, if at all, the power\nlaw scaling applied here is valid.\nOur results underline the importance of the inflow con-\nditions for the tip vortex breakdown process. Even small\nchanges in turbulence intensity impact how far down-\nstream the signature of the tip vortices persists in the\nwake, so that scalings observed under laminar inflow\nconditions are unlikely to accurately describe the vor-\ntex breakdown process in highly turbulent atmospheric\nconditions. Under highly turbulent conditions, tip vor-\ntex breakdown appears to be initiated very close to the\nrotor. Further study is necessary to investigate the effect\nof the inflow on the initiation of the breakdown close to\nthe rotor.\n\n\n10\nID\nblockage\nDou\nfan speed\nlow shear\n[0.26, 0.26, 0.26, 0.26, 0.26, 0.26, 0.26, 0.26, 0.26]\n45000\n57 %\nlow turbulence intensity\n[0.00, 0.14, 0.32, 0.48, 0.55, 0.62, 0.69, 0.75, 0.81]\n3000\n52 %\nreference case\n[0.00, 0.13, 0.31, 0.47, 0.54, 0.60, 0.66, 0.73, 0.79]\n9000\n51 %\nhigh turbulence intensity\n[0.00, 0.10, 0.30, 0.48, 0.64, 0.72, 0.79, 0.85, 0.91]\n50000\n51 %\nhigh shear\n[0.33, 0.48, 0.62, 0.71, 0.79, 0.87, 0.93, 0.98, 1.00]\n2500\n49 %\nTABLE IV. Parameter values for the active grid protocols. The blockage is given for each row of the active grid, from top to\nbottom. A fan speed of 100% corresponds to 1440 rpm\nDATA AVAILABILITY\nThe data from this study are publicly available at DOI:\nhttps://doi.org/10.17617/3.1EHZS9\nACKNOWLEDGMENTS\nThe authors would like to thank Julian J¨uchter at the\nUniversity of Oldenburg for adapting the model wind tur-\nbine to the experimental conditions of this study and for\nproviding technical support throughout the experiments.\nWe thank Michael H¨olling and ForWind for providing us\nwith the model wind turbine for this study. We thank\nConstantin Schettler for his assistance in designing the\nexperimental setup and Andreas Renner, Andreas Kopp,\nMarcel Meyer and Artur Kubitzek for their support in\nsetting up the experiment. We thank Eberhard Boden-\nschatz for helpful discussions during all stages of this\nstudy.\nAppendix A: Active grid protocols\nThe optimization parameters for the grid protocols are\nthe mean angle ϕi of each row i, the Ornstein-Uhlenbeck\nparameter Dou and the speed of the wind tunnel fan. The\nvalues of these parameters for each inflow case are pre-\nsented in Table IV. Here, instead of the mean angles ϕi,\nthe blockage B defined by Bi = | sin ϕi| is shown.\nA\nblockage of 0 corresponds to a fully opened row, a block-\nage of 1 to a fully closed one. The parameter γou of the\nOrnstein-Uhlenbeck process was set to γou = 2 for all\nprotocols.\nAppendix B: Computation of the velocity spectra\nThe streamwise velocity spectra are computed using\nWelch’s algorithm [34]. The algorithm divides the origi-\nnal time series into overlapping segments and computes\nthe fast Fourier transform on each segment separately.\nThe segments are chosen to have an overlap of 50 %.\nThe number of segments is Nw. The resulting spectra\nare smoothed using a moving average filter with a win-\ndow width of ∆fma. To demonstrate the effect of these\n20\n30\n40\n50\nf [Hz]\n5\n10\n15\n20\n25\nE11 [10−3 m2s−1]\nNw = 1, ∆fma = 0 Hz\nNw = 2, ∆fma = 0.02 Hz\nNw = 8, ∆fma = 0.3 Hz\nfbp\nFIG. 8. Spectrum computed with Welch’s algorithm. On the\nraw spectrum (blue) no smoothing is applied. The other spec-\ntra are smoothed by using different combinations of the num-\nber of segments in Welch’s algorithm and windowing width\nin a moving average filter.\n10−2\n10−1\n100\n101\n∆fma [Hz]\n10−2\n⟨E11(fpeak)⟩wake [m2s−1]\nNw = 8, ∆fma = 0.3 Hz\n100\n101\n102\nNw\nFIG. 9. Streamwise-averaged peak height in the wake spectra\naround the blade pass frequency for different choices of the\nnumber of segments in Welch’s algorithm Nw and the window\nwidth of a moving average filter ∆fma. The yellow cross in-\ndicates the parameter combination used in this manuscript.\nparameters, Figure 8 shows the raw spectrum for the\nreference case at x/D = 0.25 computed using Welch’s\nalgorithm with only one segment, as well as two other\nchoices of Nw and ∆fma.\nOur analysis is based on the peak that arises at the\nblade pass frequency. Since we define the height of this\npeak to be the maximum value within a 2 Hz interval\naround the blade pass frequency, the computed values\ndiffer significantly for the three parameter choices shown.\nTherefore, a parameter combination of Nw and ∆fma is\ndesired, such that the evaluated peak height is relatively\n\n\n11\ninsensitive to the parameters used for its computation.\nFigure 9 shows the peak height of the reference case av-\neraged over the wake positions 0.25 ≤x/D ≤1.5 as a\nfunction of the two smoothing parameters.\nAt 10−1 ≲∆fma ≲100 and Nw ≳4 the peak height is\nsufficiently independent of both parameters. Thus, this\nregime provides robust parameter combinations for the\ncomputation of the spectra. For the analysis presented\nin this manuscript, Nw = 8 and ∆fma = 0.3 Hz were\nused.\n[1] R. J. Barthelmie, S. C. Pryor, S. T. Frandsen, K. S.\nHansen, J. G. Schepers, K. Rados, W. Schlez, A. Neu-\nbert, L. E. Jensen, and S. Neckelmann, Quantifying the\nImpact of Wind Turbine Wakes on Power Output at Off-\nshore Wind Farms, Journal of Atmospheric and Oceanic\nTechnology 27, 1302 (2010).\n[2] K. S. Hansen, R. J. Barthelmie, L. E. Jensen, and\nA. Sommer, The impact of turbulence intensity and at-\nmospheric stability on power deficits due to wind turbine\nwakes at Horns Rev wind farm, Wind Energy 15, 183\n(2012).\n[3] K. Thomsen and P. Sørensen, Fatigue loads for wind tur-\nbines operating in wakes, Journal of Wind Engineering\nand Industrial Aerodynamics 80, 121 (1999).\n[4] L. Vermeer, J. Sørensen, and A. Crespo, Wind turbine\nwake aerodynamics, Progress in Aerospace Sciences 39,\n467 (2003).\n[5] F. Port´e-Agel, M. Bastankhah, and S. Shamsoddin,\nWind-Turbine\nand\nWind-Farm\nFlows:\nA\nReview,\nBoundary-Layer Meteorology 174, 1 (2020).\n[6] I. Neunaber, M. H¨olling, R. J. A. M. Stevens, G. Schep-\ners, and J. Peinke, Distinct Turbulent Regions in the\nWake of a Wind Turbine and Their Inflow-Dependent\nLocations: The Creation of a Wake Map, Energies 13,\n5392 (2020).\n[7] L. E. Lignarolo, D. Ragni, C. Simao Ferreira, and G. G.\nVan Bussel, Experimental quantification of the entrain-\nment of kinetic energy and production of turbulence in\nthe wake of a wind turbine with Particle Image Velocime-\ntry, in 32nd ASME Wind Energy Symposium (American\nInstitute of Aeronautics and Astronautics, National Har-\nbor, Maryland, 2014).\n[8] L. Lignarolo, D. Ragni, C. Krishnaswami, Q. Chen,\nC. Sim˜ao Ferreira, and G. Van Bussel, Experimental\nanalysis of the wake of a horizontal-axis wind-turbine\nmodel, Renewable Energy 70, 31 (2014).\n[9] S. Ivanell, R. Mikkelsen, J. N. Sørensen, and D. Hen-\nningson, Stability analysis of the tip vortices of a wind\nturbine, Wind Energy 13, 705 (2010).\n[10] T. Leweke, S. Le Diz`es, and C. H. Williamson, Dynamics\nand Instabilities of Vortex Pairs, Annual Review of Fluid\nMechanics 48, 507 (2016).\n[11] A. Posa, R. Broglia, and E. Balaras, Instability of the tip\nvortices shed by an axial-flow turbine in uniform flow,\nJournal of Fluid Mechanics 920, A19 (2021).\n[12] H. Hu, Z. Yang, and P. Sarkar, Dynamic wind loads and\nwake characteristics of a wind turbine model in an atmo-\nspheric boundary layer wind, Experiments in Fluids 52,\n1277 (2012).\n[13] H. C. Ghimire and S. C. C. Bailey, An experimen-\ntal investigation of wing-tip vortex decay in turbulence,\nPhysics of Fluids 29, 037108 (2017).\n[14] H. C. Ghimire and S. C. C. Bailey, Experimental exam-\nination of vorticity stripping from a wing-tip vortex in\nfree-stream turbulence, Physical Review Fluids 3, 034702\n(2018).\n[15] S. Gambuzza and B. Ganapathisubramani, The influ-\nence of free stream turbulence on the development of a\nwind turbine wake, Journal of Fluid Mechanics 963, A19\n(2023).\n[16] W. Van Der Deijl, F. Schmitt, C. Sicot, S. Barre,\nM. H¨olling, and M. Obligado, Effect of background tur-\nbulence on the wakes of horizontal-axis and vertical-axis\nwind turbines, Journal of Wind Engineering and Indus-\ntrial Aerodynamics 253, 105877 (2024).\n[17] P. C. Yen, W. Yu, and F. Scarano, Near wake behavior\nof an asymmetric wind turbine rotor, Wind Energ. Sci.\nDiscuss. [preprint] 10.5194/wes-2024-122 (2024).\n[18] A. Parinam, P. Benard, D. V. Terzi, and A. Vir´e, Large-\nEddy Simulations of wind turbine wakes in sheared\ninflows, Journal of Physics:\nConference Series 2505,\n012039 (2023).\n[19] A. Piqu´e, M. A. Miller, and M. Hultmark, Laboratory\ninvestigation of the near and intermediate wake of a wind\nturbine at very high Reynolds numbers, Experiments in\nFluids 63, 106 (2022).\n[20] A. Piqu´e, M. A. Miller, and M. Hultmark, Dominant flow\nfeatures in the wake of a wind turbine at high Reynolds\nnumbers, Journal of Renewable and Sustainable Energy\n14, 033304 (2022).\n[21] E. Bodenschatz, G. P. Bewley, H. Nobach, M. Sinhuber,\nand H. Xu, Variable density turbulence tunnel facility,\nRev. Sci. Instrum. 85, 093908 (2014).\n[22] H. E. Cekli and W. van de Water, Tailoring turbulence\nwith an active grid, Experiments in Fluids 49, 409 (2010).\n[23] R. J. Hearst and B. Ganapathisubramani, Tailoring in-\ncoming shear and turbulence profiles for lab-scale wind\nturbines, Wind Energy 20, 2021 (2017).\n[24] Y. Jooss, R. J. Hearst, and T. Bracchi, Influence of in-\ncoming turbulence and shear on the flow field and per-\nformance of a lab-scale roof-mounted vertical axis wind\nturbine, Journal of Renewable and Sustainable Energy\n15, 063302 (2023).\n[25] H. Makita, Realization of a large-scale turbulence field\nin a small wind tunnel, Fluid Dynamics Research 8, 53\n(1991).\n[26] P. Knebel, A. Kittel, and J. Peinke, Atmospheric wind\nfield conditions generated by active grids, Experiments\nin Fluids 51, 471 (2011).\n[27] L. Neuhaus, M. H¨olling, W. J. T. Bos, and J. Peinke,\nGeneration of Atmospheric Turbulence with Unprece-\ndentedly Large Reynolds Number in a Wind Tunnel,\nPhysical Review Letters 125, 154503 (2020).\n[28] K. P. Griffin, N. J. Wei, E. Bodenschatz, and G. P. Be-\nwley, Control of long-range correlations in turbulence,\nExperiments in Fluids 60, 55 (2019).\n[29] L. Kr¨oger, J. Frederik, J.-W. van Wingerden, J. Peinke,\nand M. H¨olling, Generation of user defined turbulent\n\n\n12\ninflow conditions by an active grid for validation ex-\nperiments, Journal of Physics: Conference Series 1037,\n052002 (2018).\n[30] J. Schottler, A. H¨olling, J. Peinke, and M. H¨olling, Design\nand implementation of a controllable model wind turbine\nfor experimental studies, Journal of Physics: Conference\nSeries 753, 072030 (2016).\n[31] J. J¨uchter, J. Peinke, L. J. Lukassen, and M. H¨olling,\nReduction and analysis of rotor blade misalignments on\na model wind turbine, Journal of Physics: Conference\nSeries 2265, 022071 (2022).\n[32] N. O. Jensen, A note on wind generator interaction,\nTechnical report Ris-M-2411 (Risø National Laboratory,\n1983).\n[33] M. Bastankhah and F. Port´e-Agel, A new analytical\nmodel for wind-turbine wakes, Renewable Energy 70, 116\n(2014).\n[34] P. Welch, The use of fast Fourier transform for the esti-\nmation of power spectra: A method based on time aver-\naging over short, modified periodograms, IEEE Transac-\ntions on Audio and Electroacoustics 15, 70 (1967).\n[35] S. B. Pope, Turbulent Flows, 1st ed. (Cambridge Univer-\nsity Press, 2000).\n[36] M. Schr¨oder, T. B¨atge, E. Bodenschatz, M. Wilczek, and\nG. Bagheri, Estimating the turbulent kinetic energy dissi-\npation rate from one-dimensional velocity measurements\nin time, Atmospheric Measurement Techniques 17, 627\n(2024).\n[37] N. Biswas and O. R. Buxton, Effect of tip speed ratio\non coherent dynamics in the near wake of a model wind\nturbine, Journal of Fluid Mechanics 979, A34 (2024).\n[38] W. Zhang, C. D. Markfort, and F. Port´e-Agel, Near-wake\nflow structure downwind of a wind turbine in a turbulent\nboundary layer, Experiments in Fluids 52, 1219 (2012).\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21182v1.pdf",
    "total_pages": 12,
    "title": "Effect of inflow conditions on tip vortex breakdown in a high Reynolds number wind turbine wake",
    "authors": [
      "Mano Grunwald",
      "Claudia E. Brunner"
    ],
    "abstract": "Understanding the re-energization of wind turbine wakes is crucial for the\ndesign and control of wind farms. Close to the rotor, this process is\ndetermined by the dynamics of the tip vortices. Here, we experimentally\ninvestigate the downstream evolution of the tip vortices for different inflow\nconditions. The experiments were performed in the Variable Density Turbulence\nTunnel at the Max Planck Institute for Dynamics and Self-Organization, which\nuses pressurized $\\mathrm{SF}_6$ as the working fluid to achieve a turbine\ndiameter-based Reynolds number of $\\mathrm{Re}_D=2.9\\times10^6$. An active\nturbulence grid was used to generate atmospheric inflow conditions with varying\nlevels of mean shear and turbulence intensity. Hot wire measurements of the\nstreamwise velocity component were conducted in the inflow and the wake of a\nmodel wind turbine MoWiTO 0.6 for various tip speed ratios and are used to\ninvestigate the scaling of tip vortex breakdown in the near wake. While the\nscaling is only weakly affected by variations in mean velocity shear, both\nturbulence intensity and tip speed ratio have a strong effect on vortex\nbreakdown.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}