{
  "id": "arxiv_2502.21290v1",
  "text": "Published as a conference paper at ICLR 2025\nCONTEXTUALIZING BIOLOGICAL PERTURBATION\nEXPERIMENTS THROUGH LANGUAGE\nMenghua Wu∗†\nMassachusetts Institute of Technology\nCambridge, MA, USA\nRussell Littman, Jacob Levine\nBiology Research & AI Development, Genentech\nSouth San Francisco, CA, USA\nLin Qiu†\nMeta AI\nMenlo Park, CA, USA\nDavid Richmond, Tommaso Biancalani, Jan-Christian Hütter∗\nBiology Research & AI Development, Genentech\nSouth San Francisco, CA, USA\nABSTRACT\nHigh-content perturbation experiments allow scientists to probe biomolecular sys-\ntems at unprecedented resolution, but experimental and analysis costs pose signif-\nicant barriers to widespread adoption. Machine learning has the potential to guide\nefficient exploration of the perturbation space and extract novel insights from these\ndata. However, current approaches neglect the semantic richness of the relevant\nbiology, and their objectives are misaligned with downstream biological analyses.\nIn this paper, we hypothesize that large language models (LLMs) present a nat-\nural medium for representing complex biological relationships and rationalizing\nexperimental outcomes. We propose PERTURBQA, a benchmark for structured\nreasoning over perturbation experiments. Unlike current benchmarks that primar-\nily interrogate existing knowledge, PERTURBQA is inspired by open problems\nin perturbation modeling: prediction of differential expression and change of di-\nrection for unseen perturbations, and gene set enrichment. We evaluate state-of-\nthe-art machine learning and statistical approaches for modeling perturbations, as\nwell as standard LLM reasoning strategies, and we find that current methods per-\nform poorly on PERTURBQA. As a proof of feasibility, we introduce SUMMER\n(SUMMarize, retrievE, and answeR), a simple, domain-informed LLM framework\nthat matches or exceeds the current state-of-the-art.1\n1\nINTRODUCTION\nA fundamental paradigm for discovering causal relationships in molecular biology is intervention\nfollowed by measurement. Recent experimental methods like Perturb-seq allow biologists to ma-\nnipulate the RNA and protein expression levels of each gene, and read out the effects on every other\ngene (Dixit et al., 2016; Datlinger et al., 2017; Replogle et al., 2022). While these experiments\npromise large-scale, unbiased insights, the measurement modality (single-cell sequencing) poses a\nsignificant cost burden and yields datasets of varying statistical power (Nadig et al., 2024). These\nchallenges motivate in-silico approaches for predicting cellular responses to novel perturbations, and\nfor automatically extracting high-level findings from perturbation data.\nCurrent approaches for perturbation response prediction generalize to unseen perturbations by con-\nnecting them to perturbations that have been seen, often via knowledge graphs (Roohani et al.,\n2023). However, these approaches reduce textually-rich biological relationships to adjacency matri-\nces, leading to loss of information. Furthermore, these methods are trained to regress the change in\nlevels of genes upon perturbation: a task that is a precursor, but does not directly translate to down-\nstream analyses like differential gene expression (Love et al., 2014) and gene set enrichment (Subra-\nmanian et al., 2005). Finally, most existing methods are black-box, revealing little about the learned\nbiology without post-hoc probing.\n∗Correspondence to rmwu{at}mit.edu and huetter.janchristian-klaus{at}gene.com.\n†Work completed while employed at Genentech.\n1Our code and data are publicly available at https://github.com/genentech/PerturbQA\n1\narXiv:2502.21290v1  [cs.AI]  28 Feb 2025\n\n\nPublished as a conference paper at ICLR 2025\nBiological relationships\nGenes / pathways\nRelations to other genes / pathways:\n- ABCE1 enables 4 iron, 4 sulfur cluster binding, \nATP binding, ATP hydrolysis activity, CTPase \nactivity, GTPase activity, [...]\n- Based on evidence from experimental evidence \nin humans, ABCE1 may physically interact with \nEIF1AX, EIF3A, EIF3B, EIF3C, EIF3D, [...]\n- In the mitochondrial matrix, ABCE1 enables \nInterferon alpha/beta signaling, ABCE1 binds \nRNASEL, inhibiting it, Interferon alpha [...]\nDescription of gene: \nATP binding cassette \nsubfamily E member 1 \nQuaternary structure: \n(Microbial infection) \nInteracts with HIV-1 \nproteins Vif and Gag\nFunction: [...]\nC) PERTURB QA\nIs a knockdown of ABCE1 in K562 cells \nlikely to result in differential expression \nof GABARAP?\nDifferential expression\nIs a knockdown of ABCE1 in K562 cells \nlikely to result decrease or increase of \nGABARAP?\nHow are the following genes related, and \nwhy do they respond similarly to \nperturbation? CFLAR, VIM, CAPG, …\nDirection of change\nGene set enrichment\nB) BIOLOGICAL KNOWLEDGE GRAPHS\nA) PERTURBATION EXPERIMENTS\nGenes\nUp\nDown\nN/A\nGene sets\nPerturbations\nReal-valued gene expression data\nDifferential gene \nexpression analysis\nControl\nGene set \nenrichment\nInterpretation via discrete outcomes\n2 sets of annotations\n5 single-cell transcriptomics datasets\nFigure 1: A) Perturb-seq experiments result in a matrix of gene expression levels, which are inter-\npreted through discrete outcomes. B) Textually-rich, biological knowledge graphs can help explain\nthese outcomes. C) Based on this premise, PERTURBQA introduces three tasks: predicting differen-\ntial expression and direction of change for unseen perturbations, and summarizing data-driven gene\nclusters into cohesive sets.\nWe posit that language is a natural medium for traversing the structured, biological knowledge rele-\nvant to perturbation experiments. Based on this hypothesis, we propose PERTURBQA, a set of bio-\nlogical tasks that query discrete outcomes of perturbation experiments through question-answering.\nFor example, rather than predicting the real-valued change in gene, we might ask, “does perturbation\np cause differential expression of g?” These tasks are inspired by the standard analysis pipeline for\ninterpreting perturbation experiments, and compared to most biological reasoning benchmarks (Rein\net al., 2023), they are predictive in nature. Ground truth labels are derived from five high quality\nsingle-cell RNA sequencing datasets with CRISPR interference (CRISPRi) perturbations (Replogle\net al., 2022; Nadig et al., 2024), based on strict statistical considerations. Evaluation of state-of-the-\nart statistical, graph, and language-based methods reveal that these tasks are still far from solved.\nTo demonstrate that language-based reasoning can be effective on these tasks, we develop a sim-\nple LLM-based framework that matches or exceeds the current state-of-the-art on PERTURBQA.\nSUMMER (SUMMarize, retrievE, and answeR) is an inference-time strategy that incorporates stan-\ndard LLM techniques alongside experimental data and biological knowledge graphs. An LLM is\nfirst asked to summarize textual descriptions associated with genes – as well as their impacts on\nand influences from other biological entities. In addition to “featurizing” genes, this step can be\napplied iteratively to characterize clusters of genes that exhibit similar responses or effects. Next,\ninspired by retrieval-augmented generation (Gao et al., 2023), we retrieve perturbation-gene pairs\nfrom existing experimental data based on knowledge graph proximity. While perturbation exper-\niments are not textual in nature, their discretized outcomes can ground the LLM’s reasoning and\nprevent hallucinations. Finally, inspired by chain-of-thought (Wei et al., 2022), the LLM answers\nthe biological question via guided prompting, incorporating the knowledge graph summaries and\nretrieved experimental outcomes. To summarize, our contributions are three-fold.\n1. We propose that biological perturbations should be modeled on the level of discrete out-\ncomes that reflect downstream analyses, and that language models are suitable for capturing\nthe relevant biology.\n2. PERTURBQA is a set of real and currently unsolved tasks that evaluate how models reason\nover textually-rich, structured knowledge to discover new biology. We find that the cur-\nrent state-of-the-art performs poorly on this benchmark, which we hope will increase the\naccessibility and interest in machine learning modeling for biological perturbations.\n3. We introduce SUMMER, a domain-informed LLM baseline, which matches or exceeds the\nstate-of-the-art without any finetuning. SUMMER is implemented using a lightweight 8B\nmodel and operates natively in biologist-interpretable language.\n2\n\n\nPublished as a conference paper at ICLR 2025\n2\nRELATED WORK\nPredicting perturbation responses Since experimental costs scale with the number of experi-\nmental contexts (cell lines) and perturbations, a number of works have been proposed to infer the\npost-intervention distribution of cells. Their goal is to generalize to unseen perturbations (Roohani\net al., 2023; Bai et al., 2024; Märtens et al., 2024), or unseen contexts (Bunne et al., 2023; Lotfollahi\net al., 2019). This paper focuses on the former setting, as we aim to optimize, not replace, experi-\nments. An orthogonal direction is to predict the combined effects of multiple perturbations (Roohani\net al., 2023; Gaudelet et al., 2024; Lotfollahi et al., 2023). While these models could be particularly\nhelpful for alleviating experimental burden and rationally designing drug combinations, there are\nlimited evaluation data for combinatorial perturbations (< 150 pairs in Norman et al. (2019)). Since\nour goal is to create a trustworthy benchmark for perturbation modeling, we choose to focus on\nsingle gene perturbations, and leave this as an opportunity for when better datasets are available.\nLanguage modeling and biology LLMs have been applied to many biology-adjacent tasks, with\nseveral relevant directions included here. Biological question-answering (Hendrycks et al., 2021;\nHao et al., 2024a) and scientific coding (Laurent et al., 2024; Hou & Ji, 2023) are common bench-\nmarks to assess LLM reasoning, but these works primarily focus on tasks that human specialists are\nalready able to do. Hsu et al. (2024) uses LLMs to predict Gene Ontology terms (Ashburner et al.,\n2000) associated with known gene sets. In contrast, the focus of our gene set enrichment task is\nto characterize data-driven gene clusters, which may not be significantly enriched for any known\ngene set, but are of biological interest to understand. Finally, LLMs have been used towards active\nexperimental design (Roohani et al., 2024; Qu et al., 2024).\nMore broadly, there are a number of single-cell (Rosen et al., 2024; Hao et al., 2024b; Kalfon et al.,\n2024; Cui et al., 2024) and biological sequence (Lin et al., 2023; Nguyen et al., 2024; Schiff et al.,\n2024) foundation models, trained over raw biological data (gene count matrices, protein/DNA se-\nquences). In this paper, we approach biological knowledge through natural language, but multimodal\nintegration of foundation models could be a promising future direction (Wang et al., 2024b).\nLanguage-based reasoning and structured knowledge Significant research efforts have focused\non improving LLM reasoning and reliability. Chain of thought (Wei et al., 2022) first demonstrated\nthat explicitly instructing LLMs to reason enables them to solve much more complex tasks, com-\npared to directly asking for answers. Subsequent works have explored how to navigate the space of\n“thoughts,” or in-progress generations (Yao et al., 2024; Zhang et al., 2024). Orthogonally, retrieval\naugmented generation (RAG) Lewis et al. (2020) was developed to increase LLM reliability. Rele-\nvant documents are first identified from a corpus, typically based on an embedding index, to act as\nsource material for reasoning. Instead of querying an index, Graph RAG (Edge et al., 2024) sum-\nmarizes corpuses into hierarchical graph structures, for richer language-based comparisons. While\nthese methods have seen significant success in natural language applications (Gao et al., 2023; Jiang\net al., 2023), they are less straightforward to implement in biology, where the vast majority of pa-\npers are inaccessible behind paywalls, and only abstracts are available (Wang et al., 2024a). As a\nresult, document retrieval-based methods are difficult to evaluate in this paper’s setting. Our method\nprimarily retrieves experimental outcomes (binary labels), rather than relevant literature.\nTextually-rich knowledge graphs have been probed through language, both in the classical natural\nlanguage processing literature (Guu et al., 2015) and in modern LLM literature (Jin et al., 2024;\nBesta et al., 2024). Language can provide embeddings to be processed by downstream graph models,\nor directly serve as the medium for prediction (Chen et al., 2024; Kau et al., 2024). In this work, we\ntake the latter approach, which opens several design choices. Graphs can be embedded alongside\ntext via parameter-efficient finetuning (He et al., 2024; Perozzi et al., 2024), directly serialized into\nlanguage (Zhao et al., 2023), inform retrieval (Mavromatis & Karypis, 2024), or any combination of\nthese options. To minimize the computational cost of our proof of concept, we serialize graph-based\nknowledge into text and use graph structure to inform retrieval.\n3\nBACKGROUND\nModeling perturbations A perturbation experiment can be represented by a matrix X ∈RN×D,\nwhere N is the number of perturbations, D is the number of measured entities, and entries xp,g ∈X\nrepresent the change in levels of entity g under perturbation p, relative to a control p0 (Figure 1A).\n3\n\n\nPublished as a conference paper at ICLR 2025\nFor example, in a CRISPRi Perturb-seq experiment (Replogle et al., 2022), the level of gene p is\ndecreased, and the resultant change xp,g in gene g is measured, for all genes g ∈G.\nRoohani et al. (2023) (GEARS) first proposed the task of predicting unseen perturbation outcomes\nin Perturb-seq data. Given Xtrain ⊊X, whose rows correspond to perturbations Ptrain, their goal\nwas to complete the rows Xtest, corresponding to unseen perturbations Ptest. To generalize to Ptest,\nGEARS and subsequent works leverage knowledge graphs that relate the two sets of perturbations\n(Figure 1B). Specifically, they address a node-level regression task, over the graph G = (V, E),\nwhere V is a set of biological entities (e.g., genes and pathways) and E is a set of relationships.\nThere are several aspects of the prevailing formulation that diverge from the findings biologists\nderive from these experiments. First, when converting knowledge graphs into adjacency matrices,\nthe semantics of each edge are discarded, as they are typically annotated in free text (Ashburner\net al., 2000). This loss of information may negatively impact model performance, especially in finite\ndata regimes, as biological knowledge graphs often contain hierarchical relationships of conflicting\nsemantics. Second, a common objective (and metric) is the real-valued error between the predicted\nand true responses, computed over genes that actually do respond (Roohani et al., 2023; Bai et al.,\n2024). However, these genes are not known prior to actual experimentation, and their identity is\nof high biological interest. Log-fold change is also known to be noisy, and it can be inconsistent\nacross biological replicates (Nadig et al., 2024). Finally, the goal of perturbation experiments is\nto understand the underlying biology, but current methods focus solely on recapitulating the data\ndistribution, errors in which may propagate to downstream analyses. These considerations motivate\nthe creation of PERTURBQA, which is centered around higher level outcomes, whose significance\ncan be statistically quantified.\nStatistical conclusions Biologists draw conclusions of the form “p impacts gene or pathway g”\nthrough statistical techniques like differential expression (Love et al., 2014) and gene set (Subrama-\nnian et al., 2005) analyses. In differential expression analysis, one assumes that x ∼Px, where Px\nis often taken to be approximately normal (Cui & Churchill, 2003) or negative binomial (Love et al.,\n2014; Ahlmann-Eltze & Huber, 2020). The goal is to test between\nH0 : xp,g = 0\nand\nH1 : xp,g ̸= 0,\n(1)\nwhere rejection of H0 translates to “g is differentially expressed under perturbation p compared to\nthe control perturbation p0.” Differentially expressed genes may also be assessed by their direction\nof change, i.e. xp,g ≶0.\nDue to biological and technical noise, the measurement of individual genes may be unreliable, moti-\nvating statistical analyses at the level of gene sets. A data-driven approach for identifying gene sets\nis to cluster the rows and/or columns of the expression matrix X and test whether more members of\nwell-characterized sets are present in these clusters than expected by chance (Huang et al., 2008).\nWhile these “enriched” gene sets serve as the basis for annotating data-driven clusters, they do not\nconsider the context of each experiment, e.g., the profiled cell line. Furthermore, significance cutoffs\nare difficult to assess, as the inclusion or exclusion of genes in gene sets was determined manually.\nAs a result, data-driven clusters may exhibit consistent behavior in the experiment but fail to be\nenriched for known biological phenomena, thus eluding annotation (Replogle et al., 2022).\n4\nCONTEXTUALIZING BIOLOGICAL PERTURBATIONS\nOur hypothesis is that traversing biological knowledge through language not only enables us to pre-\ndict perturbation effects, but also to rationalize perturbation outcomes. We develop PERTURBQA, a\nbenchmark to assess structured reasoning over semantically-rich graphs, in the context of molecular\nbiology (Section 4.1). These tasks are non-trivial, both for graph-based methods and naive large lan-\nguage model (LLM) applications (Section 6). To validate our hypothesis, we introduce SUMMER, a\nsimple LLM-based approach that matches or exceeds the current state-of-the-art on PERTURBQA,\nby considering experimental outcomes in the context of domain knowledge (Section 4.2).\n4.1\nPERTURBQA\nPERTURBQA is composed of three primary tasks evaluated over five real datasets (Figure 1C). These\ntasks reflect the experimental and computational workflow associated with perturbation experiments.\n4\n\n\nPublished as a conference paper at ICLR 2025\n0\n10000 20000 30000\nDifferential expression\nK562\nRPE1\nHepG2\nJurkat\nK562-Set\n0\n1\n0\n1000 2000 3000\nDirection of change\n0\n1\nA) Label distribution for DE and Dir\n0\n40\n80\n# Genes in cluster\nPerturb.\nGene\nm6A mRNA methylation,\nnonsense-mediated decay,\nhistone acetylation, ...\nmitochondrial respiratory\nchain, targets of\nnonsense-mediated decay,\nunfolded protein response, ...\nHuman annotations\nB) Gene set cluster sizes and examples\n0\n20000\nNodes\nGO\nCORUM\nSTRING\nReactome\nBioPlex\n0\n500000\nEdges\nC) Knowledge graph size\nD) Proportion of (p, g) with known interaction\n(physical or network effects), stratified by yde.\nyde\nK562\nRPE1\nHepG2\nJurkat\nphysical\n1\n0.094\n0.063\n0.075\n0.106\n0\n0.032\n0.025\n0.027\n0.029\nnetwork\n1\n0.214\n0.204\n0.218\n0.253\n0\n0.222\n0.209\n0.220\n0.208\nFigure 2: PERTURBQA dataset statistics. A) Differential expression and direction of change. B)\nDistribution of genes per cluster (gene set enrichment), with sample annotations. C) Knowledge\ngraph sizes. D) DE genes are more likely to interact physically, but presence of interaction is mini-\nmally predictive (Table 1). There is little difference in network connectivity.\n1. Differential expression: Given a pair of entities (p, g), the goal is to predict yde\np,g ∈{0, 1},\nwhere 0 indicates that perturbing p results in no change to g, and 1 indicates that perturbing\np results in differential expression of g.\n2. Direction of change: Given a pair of entities (p, g), the goal is to predict ydir\np,g ∈{0, 1},\nwhere 0 indicates that levels of g decrease under perturbation p, and 1 indicates that levels\nof g increase. This task is only evaluated on pairs for which yde = 1.\n3. Gene set enrichment: Given a set of genes P, the goal is to identify a description s that\ncharacterizes why members of P exert a consistent effect when perturbed (“perturbation\ncluster”), or respond similarly to perturbation (“gene cluster”). As ground truth, we lever-\nage expert gene set annotations, published by the authors of Replogle et al. (2022).\nPerturb-seq datasets We constructed our benchmark based on five Perturb-seq datasets, derived\nfrom Replogle et al. (2022) and Nadig et al. (2024). For each dataset, we identified differentially-\nexpressed genes (DEGs) per perturbation using the Wilcoxon signed-rank test (Wilcoxon, 1945),\nresulting in pairs (p, g) with associated labels yde\np,g and ydir\np,g. Datasets are split 75:25 into train and test\nalong the perturbation axis, with similar distributions of number of DEGs. To ensure label quality,\nwe set a rigorous cut-off for DEGs and non-DEGs based on consistency across biological replicates\nand/or adjusted p-value (details and statistical analyses in Appendix A.2). The label distribution on\nthe test set is depicted in Figure 2A.\nDifferential expression and direction of change are assessed at the granularity of single genes (K562,\nRPE1, HepG2, Jurkat) and gene sets (K562-Set), where the gene set is represented as single entities,\nwith the mean expression of their constituents. Gene set enrichment is evaluated over K562-Set,\nwhere human annotations are taken as the ground truth. Figure 2B illustrates the distribution of the\ncluster sizes and example annotations.\nDomain knowledge PERTURBQA tests whether models can effectively leverage structured domain\nknowledge and contextual information. Thus, in addition to test examples, we provide:\n1. Harmonized and parsed knowledge graphs, with identifiers aligned to the perturbation data\n(Figure 2C). These provide high-quality, biological insights to aid reasoning.\n2. Train examples (observation outcomes), to be used as a retrieval corpus or for model train-\ning. These may be useful for conditioning the predictions on each dataset, as perturbation\nresponses may differ by cell line (Nadig et al., 2024).\n5\n\n\nPublished as a conference paper at ICLR 2025\nC) ANSWER\nB) RETRIEVE\nA) SUMMARIZE\nP\nNeighborhood of \nperturbation\nPerturbation \nsummary\nLLM\nLlama3 (70B)\nG\nNeighborhood of \ndownstream gene\nDownstream \nGene summary\nP\nG\nG'2\nP'2\nP\nG'1\nG\nP'1\nInput (from step A):\nPerturbed gene: ABCE1 is …\nGene of interest: GABARAP is …\nExamples (from step B):\nExample 1:\nPerturbed gene: RPS14 is …\nGene of interest: FAM83A is …\nKnockdown of RPS14 does not impact FAM83A.\nExample 2: …\nChain-of-thought (CoT) prompts:\n1) Which perturbed genes are most similar to ABCE1?\n2) What are the downstream effects of perturbing ABCE1 or similar?\n3) Which downstream genes are most similar to GABARAP?\n4) What are the upstream perturbations that affect GABARAP?\nFinal query:\nIs a knockdown of ABCE1 in K562 cells likely to result in differential \nexpression of GABARAP?\nP\nG\nP'1\nG'1\nLLM\nLlama3 (8B)\nRetrieve summaries and experimental \noutcomes for neighboring nodes in \ntraining set.\nGenerate summaries for\nevery node in the graph.\nGenerate prompts containing \nsummaries and retrieved outcomes \nfrom A & B, then query LLM.\nP\n \nABCE1\nis …\nG\n \nGABARAP\nis …\nLLM\nLlama3 (70B)\nP'1\n \nP'2\nG'1 G'2\nP'1\n \nRPS14\nis …\nG'1\n \nFAM83A\nis …\nP'1 has no impact on G'1 \nP'2 downregulates G'2 \nP'2\n \nG'2\n \nAnswer\nFigure 3: Overview of SUMMER. A) Knowledge graph entries are summarized per gene as both\na perturbation p and as a downstream gene g. B) Given a new pair (p, g), sample related pairs\n(p′, g′) with associated experimental outcomes. C) Concatenate summaries, examples, and guiding\nquestions as prompt for LLM. Depicted prompt edited for concision. Full prompts in Appendix C.\nIn contrast to scientific literature, knowledge graphs densely distill key findings, either through hu-\nman curation, or from individual (i.e. internally consistent) large-scale experiments. To ensure cov-\nerage of poorly characterized genes, we took the union of multiple sources, maintaining attribution.\nThese include UniProt (Consortium, 2022), Ensembl (Martin et al., 2023), Gene Ontology (Ash-\nburner et al., 2000; Aleksander et al., 2023), CORUM (Tsitsiridis et al., 2022), STRING (Szklarczyk\net al., 2022), Reactome (Milacic et al., 2023), and BioPlex (Huttlin et al., 2021).\nA benchmark for discovery PERTURBQA draws upon experimental assays and knowledge graphs\nto “connect the dots” between known biology and unanswered questions. A key concern is whether\nthese questions are indeed unanswered, within the broader literature and by extension, current LLM\nweights. To quantify this, we compare the connectivity of pairs (p, q), stratified by the differential\nexpression label (Figure 2D). Only ∼3% of gene pairs in our test sets physically interact in any con-\ntext, including other animals, and only ∼20% share any annotation, including at the coarsest levels.\nThere is little difference between positive and negative pairs in terms of higher-level connectivity.\nPhysically interacting genes are more likely to result in differential expression in our dataset, but\npresence of a physical interaction is minimally predictive of differential expression (Table 1). Fi-\nnally, Nadig et al. (2024) was published strictly after we downloaded the knowledge graphs (June\n2024). While the cell lines in question have been studied in other contexts, Nadig et al. (2024) re-\nleased the first large-scale Perturb-seq screens in these two cell lines. Therefore, we conclude that\nthese are indeed predictive tasks, rather than knowledge recall.\n4.2\nOVERVIEW OF SUMMER\nSUMMER is an inference-time framework that consists of three steps, which draw inspiration from\ndifferent aspects of message-passing neural networks and large language model reasoning strategies\n(Figure 3). First, we “featurize” each gene by summarizing database descriptions of their known\nfunction, and their relationships to other entities. To capture directionality, we generate two sum-\nmaries for each gene: as a perturbation, and as a downstream gene. Next, we use the “training”\nset of seen perturbations as a retrieval corpus, where relevant perturbation-gene pairs are selected\nbased on knowledge graph proximity. These pairs contribute both gene summaries and discretized\nexperimental outcomes. Finally, we formulate a set of questions to guide the LLM’s reasoning via\nchain-of-thought style prompting. Full prompts may be found in Appendix C.\nNeighborhood aggregation as summarization Inspired by message-passing on graphs (Kipf &\nWelling, 2017), we characterize genes and their relationships to other biological entities by summa-\nrizing their graph neighborhoods. Given a gene v, we convert to natural language: knowledge graph\nentries {tv}, describing node v, and {tv→v′}, describing its relationships with neighbors v′. As il-\nlustrated in Figure 3A, we concatenate all entries t to generate two versions of each gene summary\nsv. One asks for the downstream pathways that may be affected by the gene (v as perturbation p),\nand the other focuses on the upstream pathways that may affect the gene (v as downstream gene g).\n6\n\n\nPublished as a conference paper at ICLR 2025\nWe can apply this step hierarchically to characterize gene sets. Specifically, to summarize cluster\nP, we concatenate single gene summaries [sv]v∈P as input to the LLM, with an emphasis on down-\nstream/upstream effects, as appropriate. A variant of this is used to address the gene-set enrichment\ntask, asking the LLM for both a short description and a name for the gene set (example in D.1).\nGraph-based retrieval of relevant training samples Let N(v) represent the top k = 10 nodes v′\nthat share the most neighbors with v in G. For each pair (p, g), we sample up to 15 examples (p′, g′)\nfrom Xtrain that match the following criteria.2\n1. Up to 5 pairs where both the perturbation and the downstream gene are related to p and g\nrespectively, i.e. p′ ∈N(p) and g′ ∈N(g).\n2. Up to 5 pairs with any g′ and where the perturbation is related to p, i.e. p′ ∈N(p).\n3. Up to 5 pairs with any p′ and where the downstream gene is related to g, i.e. g′ ∈N(g).\nThese pairs are inserted into the prompt through their respective summaries (sp′, sg′) and the dis-\ncretized experimental outcome yp′,g′ (Figure 3B).\nPerturbation outcome prediction as question-answering To avoid hallucinations, we found it\nnecessary to dictate that the LLM should consider both the textual summaries and experimental\noutcomes. Specifically, for both p and g, we ask the LLM to identify the most similar p′ and g′\namong those sampled, and to summarize their observed effects. For example, the prompt notes\nthat the LLM should consider compensatory mechanisms, in addition to upstream or downstream\npathways. Finally, we ask the LLM to answer the overall question, while citing specific retrieved\nexamples. Figure 3C depicts a sketch of the process (example in D.2).\nImplementation details We ran all experiments with Llama3 (Dubey et al., 2024) with default\nparameters of top p 0.9 and temperature 0.6, using the LMDeploy framework (Contributors, 2023).\nDue to computational limitations, the gene summaries were generated by the 70B model, while all\nother inference utilized the 8B model. To quantify uncertainty, we ran the retrieval step three times\nand report the average prediction over these three inference runs.\n5\nEXPERIMENTAL SETUP\n5.1\nBASELINES\nDifferential expression and direction of change We benchmark a variety of baselines for unseen\nperturbation response prediction. All baselines were run with their published code and best reported\nhyperparameters, where applicable. PHYSICAL is a naive baseline that predicts 1 if (p, q) are known\nto physically interact in any animal (Figure 2D, STRINGDB (Szklarczyk et al., 2022)) and 0 other-\nwise (DE only). GAT (Veliˇckovi´c et al., 2017) is a graph attention network trained with a ternary\n(up, down, no change) classification objective over the same knowledge graphs used to generate the\nprompts for SUMMER. This setup quantifies the information content contained in graph adjacencies\nalone. GEARS (Roohani et al., 2023) is a state-of-the-art graph attention network trained over the\nGene Ontology (Ashburner et al., 2000) and gene co-expression graphs with a regression objective\nthat focuses on differentially expresses genes. We use absolute predicted log-fold change for differ-\nential expression, and signed log-fold change for direction of change. SCGPT (Cui et al., 2024) is a\nTransformer-based, single-cell foundation model, which is finetuned for perturbation effect predic-\ntion with the GEARS regression objective.\nWe also consider language-centric baselines and ablations for SUMMER. GENEPT (Chen & Zou,\n2024) encodes textual descriptions of genes (-GENE) and their protein (-PROT) products using com-\nmercial OpenAI embedding models, trained on natural language. These embeddings are input to a\nlogistic regression classifier, trained separately for differential expression and direction of change.\nRecent work has reported that this baseline achieves the state-of-the-art on the regression formu-\nlation (Märtens et al., 2024). LLM (No CoT) provides the LLM with two examples (one of each\nlabel) and directly asks for the final answer without explanation. LLM (No retrieval) emulates our\nchain-of-thought style questioning, but does not retrieve any experimental outcomes. Instead, we\n2The number of examples was chosen heuristically, so that all input prompts and potential outputs fit within\nthe Llama3 8k token context window.\n7\n\n\nPublished as a conference paper at ICLR 2025\nprovide the LLM with a hypothesis (each answer option is sampled twice) and ask the LLM to extract\nsupporting and refuting evidence from the gene summaries, before answering the question. Finally,\nto understand the information content in our retrieved samples, Retrieval (No LLM) takes the mean\nlabel over (p′, g′) without appealing to the LLM for further processing.\nGene set enrichment We compare to gene set over-expression analysis (Fang et al., 2022), run over\nthe gene clusters with a variety of gene set libraries – Gene Ontology, Reactome, CORUM – as well\nas their union (Combined). We take the concatenation of the top k gene set names as the predicted\nsummary, where gene sets are ordered by the size of their intersection with each cluster.\n5.2\nMETRICS\nDifferential expression and direction of change It has been reported that gene responses tend\nto be correlated across perturbations (Kernfeld et al., 2023), e.g., stress response genes respond\npromiscuously. In addition, methods like GEARS and SCGPT predict real-valued change in genes,\nwhich yield rankings rather than strict probabilities. Thus, we compute binary AUROC over the\npredictions associated with each downstream gene, and take the average over downstream genes,\ncorresponding to a macro AUROC score over downstream genes.\nGene set enrichment We consider both automated and human evaluation. Our ground truth consists\nof short textual descriptions (under 10 words), while our predictions and baseline outputs are long\nand vary in style. Standard text generation metrics like BLEU (Papineni et al., 2002) or ROUGE\nF1 (Lin, 2004) do not account for this difference in length as they were designed for machine trans-\nlation. To assess whether the predictions adequately cover the ground truth annotation without pe-\nnalizing for longer lengths, we report ROUGE-1 recall and BERT Score (Zhang et al., 2020), using\nBioBERT 1.2 (Lee et al., 2020), which was finetuned on 1M biological texts (18B words).\nDue to the open-ended nature of the gene set task, automated evaluation methods are limited in\ntheir ability to reflect practical utility. Since this paper focuses on providing value to biologists, we\nrecruited a domain specialist (molecular biologist, not the original annotator). We asked them to\ndecide whether the top gene sets or LLM summaries were more informative, and whether the LLM\nsummaries captured the same biology as the manual annotation (Section B.1). For future works, we\nshare all LLM summaries in the data distribution for independent evaluation. If access to human\nexperts is challenging, we also encourage LLM assessment of these questions.\n6\nRESULTS\n6.1\nDIFFERENTIAL EXPRESSION AND DIRECTION OF CHANGE\nWe evaluated a number of state-of-the-art baselines on the differential expression and direction of\nchange tasks (Table 1), and the results indicate that PERTURBQA tasks are largely unsolved. GEARS\nand SCGPT performances are close to random on differential expression, often exceeded by the naive\nPHYSICAL baseline. This may be due to the focus on change in differentially-expressed genes in\ntheir objective, instead of distinguishing between DEGs and non-differentially expressed genes. On\nother hand, GEARS is decent at direction of change in 3 of 5 cases, reflecting that its directionality\nloss may be more effective here.\nGENEPT is a strong baseline, demonstrating the benefits of textual information towards these tasks.\nIn terms of language-based reasoning, however, we observe that LLM (No CoT) and LLM (No\nretrieval) both perform no better than random guessing – highlighting that retrieving experimental\noutcomes and guiding LLM reasoning are both essential to completing this task. This is also reflected\nin the strong performance of Retrieval (No LLM). SUMMER is able to extract more value than “sum\nof its parts” in 7 of 10 cases, achieving the highest AUC in 8 of 10 cases.\nCompared to methods that exclusively model knowledge graph connectivity, LLM outputs are di-\nrectly interpretable by domain experts (Appendix D), to understand the model’s shortcomings and\nprovide context for the observed experimental outcomes. We studied 300 generations (3 trials of 100\nDE examples) to identify primary failure modes (Appendix B.3). Incorrect causal directionality is a\ncommon error. For example, if A is related to C, which is upstream of B, A should not be affected\nwhen we perturb B. However, the LLM is unaware that C is upstream of B, so it predicts that A\n8\n\n\nPublished as a conference paper at ICLR 2025\nTable 1: Results on differential expression and direction of change as binary prediction. AUROC is\ncomputed over the predictions associated with each gene, and averaged over perturbations. Standard\ndeviation is reported over 3 runs (where applicable) or 3 rounds of sub-sampling. For more details,\nsee Appendix A.4.\nTask\nModel\nK562\nRPE1\nHepG2\nJurkat\nK562-Set\nDifferential\nexpression\nPHYSICAL\n0.53\n0.52\n0.52\n0.54\n0.55\nGAT\n0.55±.02\n0.57±.02\n0.57±.02\n0.55±.03\n0.54±.01\nGEARS\n0.54±.01\n0.50±.01\n0.48±.02\n0.51±.01\n0.49±.01\nSCGPT\n0.52±.00\n0.52±.00\n0.48±.00\n0.51±.00\n0.52±.00\nGENEPT-GENE\n0.57±.02\n0.54±.00\n0.55±.02\n0.55±.01\n0.58±.01\nGENEPT-PROT\n0.57±.01\n0.56±.00\n0.54±.01\n0.55±.01\n0.58±.01\nLLM (No CoT)\n0.52±.01\n0.51±.00\n0.51±.01\n0.52±.00\n0.50±.00\nLLM (No retrieval)\n0.51±.01\n0.48±.00\n0.49±.01\n0.49±.01\n0.50±.01\nRetrieval (No LLM)\n0.58±.02\n0.58±.01\n0.55±.00\n0.55±.01\n0.64±.00\nSUMMER\n0.60±.00\n0.58±.00\n0.61±.00\n0.58±.00\n0.61±.00\nDirection\nof change\nGAT\n0.58±.06\n0.60±.04\n0.64±.05\n0.59±.04\n0.53±.03\nGEARS\n0.64±.01\n0.60±.01\n0.52±.01\n0.51±.01\n0.59±.02\nSCGPT\n0.48±.00\n0.53±.00\n0.51±.00\n0.51±.00\n0.54±.00\nGENEPT-GENE\n0.53±.05\n0.57±.03\n0.58±.03\n0.57±.02\n0.56±.02\nGENEPT-PROT\n0.57±.01\n0.57±.02\n0.55±.01\n0.58±.03\n0.57±.02\nLLM (No CoT)\n0.50±.01\n0.49±.00\n0.49±.00\n0.50±.01\n0.50±.01\nLLM (No retrieval)\n0.49±.04\n0.52±.03\n0.51±.06\n0.53±.05\n0.45±.18\nRetrieval (No LLM)\n0.50±.00\n0.50±.00\n0.50±.00\n0.50±.00\n0.50±.00\nSUMMER\n0.62±.01\n0.64±.01\n0.65±.00\n0.66±.01\n0.69±.01\nTable 2: Gene set enrichment on K562 genome-wide clusters. Metrics reported are ROUGE-1 recall,\nas well as BERT Score precision, recall, and F1, computed with BioBERT-1.2. Since the baselines\nare statistical methods, they are not subject to stochasticity.\nGene clusters\nPerturbation clusters\nEnrichment\nTop\nRROUGE1↑\nPBERT↑\nRBERT↑\nFBERT↑\nRROUGE1↑\nPBERT↑\nRBERT↑\nFBERT↑\nGene Ontology\n5\n0.17\n0.64\n0.66\n0.62\n0.38\n0.66\n0.72\n0.68\nGene Ontology\n10\n0.32\n0.60\n0.65\n0.60\n0.60\n0.62\n0.71\n0.65\nReactome\n5\n0.18\n0.60\n0.65\n0.60\n0.49\n0.60\n0.68\n0.62\nReactome\n10\n0.27\n0.54\n0.64\n0.56\n0.59\n0.56\n0.67\n0.60\nCORUM\n5\n0.07\n0.63\n0.45\n0.42\n0.45\n0.64\n0.63\n0.60\nCORUM\n10\n0.07\n0.61\n0.44\n0.41\n0.47\n0.61\n0.62\n0.58\nCombined\n5\n0.14\n0.62\n0.65\n0.61\n0.41\n0.63\n0.71\n0.66\nCombined\n10\n0.27\n0.59\n0.65\n0.59\n0.63\n0.57\n0.69\n0.62\nSUMMER (8b)\ndesc\n0.57\n0.63\n0.76\n0.69\n0.26\n0.63\n0.75\n0.68\nSUMMER (8b)\nname\n0.20\n0.74\n0.76\n0.75\n0.12\n0.75\n0.76\n0.75\nSUMMER (70b)\ndesc\n0.45\n0.63\n0.77\n0.69\n0.59\n0.65\n0.80\n0.72\nSUMMER (70b)\nname\n0.15\n0.73\n0.76\n0.74\n0.37\n0.77\n0.82\n0.79\nchanges when B is changed. This suggests that additional domain knowledge or more structured\nreasoning strategies may be necessary.\n6.2\nGENE SET ENRICHMENT\nSUMMER is able to recapitulate human cluster annotations, exceeding over-representation analysis\nacross automated metrics (Table 2). In particular, SUMMER performs much better than the baselines\non gene clusters, which are larger than the perturbation clusters (Figure 2B) and more enriched for\ngeneric gene sets (Table 3, row 1). Based on independent human evaluation, the LLM-generated\nsummary was similar or more informative than the classical gene set enrichment results in 92%\nof cases, and agrees with the independent annotator in 72% of cases (Appendix B.1). In the 28%\nthat disagreed with the independent annotator, many clusters contain niche information, not found\n9\n\n\nPublished as a conference paper at ICLR 2025\nTable 3: Gene set enrichment on K562, example outputs. Left: Human annotation. Middle: Top\nover-represented gene sets (combined). Right: Proposed gene set name in bold, followed by de-\nscription. Row 1 is a gene cluster. Rows 2-3 are perturbation clusters.\nGenes\nAnnotation Gene sets\n(combined)\nSUMMER (8b)\nSLC25A5,\nEIF4B,\nSLC25A3,\nRPL3, ...,\nRPL41\ntranslation cytosol, RNA\nbinding, cytoplasm,\nmembrane, GTP\nhydrolysis\nRibosomal and Translation Regulation Gene Set The\ngene set is comprised of genes involved in protein syn-\nthesis, translation, and ribosomal function, with a focus\non the regulation of protein synthesis and the assembly\nof ribosomal subunits.\nZC3H13,\nCBLL1,\nMETTL14,\nMETTL3,\nPSMG1,\nRBM15\nm6A mRNA\nmethylation\nnucleus, nucleo\nplasm, RNA N6-\nmethyladenosine\nmethyltransferase\ncomplex, mRNA\nprocessing\nM6A Methylation Complex-Associated Genes. The\ngene set is composed of genes involved in the regulation\nof N6-methyladenosine (m6A) methylation of RNAs, in-\nfluencing mRNA splicing and RNA processing. These\ngenes are associated with the WMM complex and inter-\nact with each other to modulate gene expression.\nCMTR2,\nRBM14-\nRBM4,\nRBM4,\nUNCX,\nWDFY3\nunknown no significant sets\nRNA Processing and Regulation Gene Set. The gene\nset is composed of genes involved in RNA processing\nand regulation, including mRNA cap modification, alter-\nnative splicing, and RNA-binding activities. These genes\nconverge on pathways related to mRNA stability, trans-\nlation, and cellular differentiation.\nin typical databases (Table 7). We also observe that in difficult cases, gene set over-representation\nanalysis tends to focus on highly specific gene sets, which cover subsets of these clusters. The\nLLM takes the opposite approach, and its summaries tend to “lift” the description to higher levels of\nhierarchy (Table 8). While the two strategies provide orthogonal information, the LLM’s outputs are\nmore coherent. Finally, SUMMER also characterizes clusters for which no gene sets were enriched,\nand thus could not be annotated manually (Table 3, row 3). These clusters tend to be smaller, or\nexhibit lower agreement.\n7\nCONCLUSION\nIn this work, we proposed PERTURBQA, a benchmark for language-based reasoning over structured\ndata that arise from real biological problems. We evaluated a variety of state-of-the-art methods and\nshowed that while these problems are feasible, they are far from solved. To address these tasks,\nwe also introduced SUMMER, a LLM-based framework that draws upon both biological knowl-\nedge graphs and existing experimental data. SUMMER outperforms baselines on PERTURBQA, but\nleaves ample room for future study. We hope that this work will lower the barrier of entry into com-\nputational modeling of biological perturbation experiments and enable richer, more interpretable\nmethods for these applications.\nETHICS STATEMENT\nWhile this work focuses broadly on discovering causal relationships in molecular biology, the\nmethods described do not involve the design of potentially harmful chemical agents or other\nbiomolecules. Our work uses publicly available datasets, which were generated in in-vitro labo-\nratory settings.\nREPRODUCIBILITY STATEMENT\nAll datasets and code can be found at our repository: https://github.com/genentech/\nPerturbQA. Our data processing pipeline is described in detail in Appendix A.2. Templates of all\nprompts used for LLM experiments can be found in the code distribution and in Appendix C.\n10\n\n\nPublished as a conference paper at ICLR 2025\nACKNOWLEDGMENTS\nWe would like to thank Sandra Melo-Carlos and Jack Kamm for an introduction to Perturb-seq and\nguidance on data analysis; Aviv Regev for inspiring the gene set enrichment task; Umesh Padia\nfor evaluating and providing feedback on our model outputs; and Romain Lopez, Alexander Wu,\nHeming Yao, Patrick Skillman-Lawrence, Xiaotian Ma, Taro Makino, Martin Rohbeck for continual\nfeedback on this project.\nThis work was funded by Genentech. M.W., R.L., J.L., L.Q., T.B., D.R., and J.-C. H. were employ-\nees of Genentech while working on this project. J.L., L.Q., T.B., D.R., and J.-C. H. have equity in\nRoche.\n11\n\n\nPublished as a conference paper at ICLR 2025\nREFERENCES\nConstantin Ahlmann-Eltze and Wolfgang Huber. glmGamPoi: fitting Gamma-Poisson generalized\nlinear models on single cell count data. Bioinformatics, 36(24):5701–5702, 12 2020. ISSN 1367-\n4803. doi: 10.1093/bioinformatics/btaa1009.\nSuzi A Aleksander, James Balhoff, Seth Carbon, J Michael Cherry, Harold J Drabkin, Dustin Ebert,\nMarc Feuermann, Pascale Gaudet, Nomi L Harris, et al. The Gene Ontology knowledgebase in\n2023. Genetics, 224(1):iyad031, 2023.\nM Ashburner, C A Ball, J A Blake, D Botstein, H Butler, J M Cherry, A P Davis, K Dolinski, S S\nDwight, J T Eppig, M A Harris, D P Hill, L Issel-Tarver, A Kasarskis, S Lewis, J C Matese, J E\nRichardson, M Ringwald, G M Rubin, and G Sherlock. Gene Ontology: tool for the unification\nof biology. Nat Genet, 25(1):25–29, May 2000. doi: 10.1038/75556.\nDing Bai, Caleb N Ellington, Shentong Mo, Le Song, and Eric P Xing. AttentionPert: accurately\nmodeling multiplexed genetic perturbations with multi-scale effects. Bioinformatics, 40:i453–\ni461, 06 2024. ISSN 1367-4811. doi: 10.1093/bioinformatics/btae244.\nYoav Benjamini and Yosef Hochberg. On the adaptive control of the false discovery rate in multiple\ntesting with independent statistics. Journal of Educational and Behavioral Statistics, 25(1):60–\n83, 2000. ISSN 10769986, 19351054.\nMaciej Besta, Nils Blach, Ales Kubicek, Robert Gerstenberger, Lukas Gianinazzi, Joanna Gajda,\nTomasz Lehmann, Michał Podstawski, Hubert Niewiadomski, Piotr Nyczyk, and Torsten Hoefler.\nGraph of Thoughts: solving elaborate problems with large language models. Proceedings of the\nAAAI Conference on Artificial Intelligence, 38(16):17682–17690, Mar 2024. doi: 10.1609/aaai.\nv38i16.29720.\nCharlotte Bunne, Stefan G Stark, Gabriele Gut, Jacobo Sarabia Del Castillo, Mitch Levesque,\nKjong-Van Lehmann, Lucas Pelkmans, Andreas Krause, and Gunnar Rätsch. Learning single-\ncell perturbation responses using neural optimal transport. Nature Methods, 20(11):1759–1768,\n2023.\nYiqun Chen and James Zou. GenePT: A simple but effective foundation model for genes and cells\nbuilt from ChatGPT. bioRxiv, 2024. doi: 10.1101/2023.10.16.562533.\nZhikai Chen, Haitao Mao, Hang Li, Wei Jin, Hongzhi Wen, Xiaochi Wei, Shuaiqiang Wang, Dawei\nYin, Wenqi Fan, Hui Liu, and Jiliang Tang. Exploring the potential of large language models\n(LLMs) in learning on graphs. SIGKDD Explor. Newsl., 25(2):42–61, March 2024. ISSN 1931-\n0145. doi: 10.1145/3655103.3655110.\nThe UniProt Consortium. UniProt: the Universal Protein Knowledgebase in 2023. Nucleic Acids\nResearch, 51(D1):D523–D531, 11 2022. ISSN 0305-1048. doi: 10.1093/nar/gkac1052.\nLMDeploy Contributors. LMDeploy: A toolkit for compressing, deploying, and serving LLMs.\nhttps://github.com/InternLM/lmdeploy, 2023.\nHaotian Cui, Chloe Wang, Hassaan Maan, Kuan Pang, Fengning Luo, Nan Duan, and Bo Wang.\nscGPT: toward building a foundation model for single-cell multi-omics using generative AI. Na-\nture Methods, pp. 1–11, 2024.\nXiangqin Cui and Gary Churchill. Statistical tests for differential expression in cDNA microarray\nexperiments. Genome Biology, 4:210, 02 2003. doi: 10.1186/gb-2003-4-4-210.\nPaul Datlinger, André F Rendeiro, Christian Schmidl, Thomas Krausgruber, Peter Traxler, Johanna\nKlughammer, Linda C Schuster, Amelie Kuchler, Donat Alpar, and Christoph Bock. Pooled\nCRISPR screening with single-cell transcriptome readout. Nature Methods, 14(3):297–301, 2017.\nAtray Dixit, Oren Parnas, Biyu Li, Jenny Chen, Charles P Fulco, Livnat Jerby-Arnon, Nemanja D\nMarjanovic, Danielle Dionne, Tyler Burks, Raktima Raychowdhury, et al. Perturb-seq: dissecting\nmolecular circuits with scalable single-cell RNA profiling of pooled genetic screens. Cell, 167\n(7):1853–1866, 2016.\n12\n\n\nPublished as a conference paper at ICLR 2025\nAbhimanyu Dubey, Abhinav Jauhri, Abhinav Pandey, Abhishek Kadian, Ahmad Al-Dahle, Aiesha\nLetman, Akhil Mathur, Alan Schelten, Amy Yang, Angela Fan, et al. The Llama 3 herd of models.\narXiv preprint arXiv:2407.21783, 2024.\nDarren Edge, Ha Trinh, Newman Cheng, Joshua Bradley, Alex Chao, Apurva Mody, Steven Truitt,\nand Jonathan Larson. From local to global: A graph RAG approach to query-focused summariza-\ntion. arXiv preprint arXiv:2404.16130, 2024.\nZhuoqing Fang, Xinyuan Liu, and Gary Peltz. GSEApy: a comprehensive package for performing\ngene set enrichment analysis in Python. Bioinformatics, 39(1):btac757, 11 2022. ISSN 1367-\n4811. doi: 10.1093/bioinformatics/btac757.\nYunfan Gao, Yun Xiong, Xinyu Gao, Kangxiang Jia, Jinliu Pan, Yuxi Bi, Yi Dai, Jiawei Sun, and\nHaofen Wang.\nRetrieval-augmented generation for large language models: A survey.\narXiv\npreprint arXiv:2312.10997, 2023.\nThomas Gaudelet, Alice Del Vecchio, Eli M Carrami, Juliana Cudini, Chantriolnt-Andreas\nKapourani, Caroline Uhler, and Lindsay Edwards. Season combinatorial intervention predictions\nwith Salt & Peper. In ICLR 2024 Workshop on Machine Learning for Genomics Explorations,\n2024.\nK. Guu, J. Miller, and P. Liang. Traversing knowledge graphs in vector space. In Empirical Methods\nin Natural Language Processing (EMNLP), 2015.\nMinsheng Hao, Jing Gong, Xin Zeng, Chiming Liu, Yucheng Guo, Xingyi Cheng, Taifeng Wang,\nJianzhu Ma, Le Song, and Xuegong Zhang.\nLAB-Bench measuring capabilities of language\nmodels for biology research. Nature Methods, 2024a. doi: 10.1038/s41592-024-02305-7.\nMinsheng Hao, Jing Gong, Xin Zeng, Chiming Liu, Yucheng Guo, Xingyi Cheng, Taifeng Wang,\nJianzhu Ma, Le Song, and Xuegong Zhang. Large-scale foundation model on single-cell tran-\nscriptomics. Nature Methods, 2024b. doi: 10.1038/s41592-024-02305-7.\nXiaoxin He, Yijun Tian, Yifei Sun, Nitesh V Chawla, Thomas Laurent, Yann LeCun, Xavier Bres-\nson, and Bryan Hooi. G-retriever: Retrieval-augmented generation for textual graph understand-\ning and question answering. arXiv preprint arXiv:2402.07630, 2024.\nDan Hendrycks, Collin Burns, Steven Basart, Andy Zou, Mantas Mazeika, Dawn Song, and Jacob\nSteinhardt. Measuring massive multitask language understanding. Proceedings of the Interna-\ntional Conference on Learning Representations (ICLR), 2021.\nWenpin Hou and Zhicheng Ji. GeneTuring tests GPT models in genomics. BioRxiv, 2023.\nChi-Yang Hsu, Kyle Cox, Jiawei Xu, Zhen Tan, Tianhua Zhai, Mengzhou Hu, Dexter Pratt, Tianlong\nChen, Ziniu Hu, and Ying Ding.\nThought graph: Generating thought process for biological\nreasoning. In Companion Proceedings of the ACM on Web Conference 2024, WWW ’24. ACM,\nMay 2024. doi: 10.1145/3589335.3651572.\nDa Wei Huang, Brad T. Sherman, and Richard A. Lempicki. Bioinformatics enrichment tools: paths\ntoward the comprehensive functional analysis of large gene lists. Nucleic Acids Research, 37:1 –\n13, 2008.\nEdward L. Huttlin, Raphael J. Bruckner, Jose Navarrete-Perea, Joe R. Cannon, Kurt Baltier, Fana\nGebreab, Melanie P. Gygi, Alexandra Thornock, Gabriela Zarraga, Stanley Tam, John Szpyt,\nBrandon M. Gassaway, Alexandra Panov, Hannah Parzen, Sipei Fu, Arvene Golbazi, Eila Maen-\npaa, Keegan Stricker, Sanjukta Guha Thakurta, Tian Zhang, Ramin Rad, Joshua Pan, David P.\nNusinow, Joao A. Paulo, Devin K. Schweppe, Laura Pontano Vaites, J. Wade Harper, and\nSteven P. Gygi. Dual proteome-scale networks reveal cell-specific remodeling of the human in-\nteractome. Cell, 184(11):3022–3040.e28, 2021. ISSN 0092-8674. doi: https://doi.org/10.1016/j.\ncell.2021.04.011.\nZhengbao Jiang, Frank F Xu, Luyu Gao, Zhiqing Sun, Qian Liu, Jane Dwivedi-Yu, Yiming Yang,\nJamie Callan, and Graham Neubig. Active retrieval augmented generation. In Proceedings of the\n2023 Conference on Empirical Methods in Natural Language Processing, pp. 7969–7992, 2023.\n13\n\n\nPublished as a conference paper at ICLR 2025\nBowen Jin, Gang Liu, Chi Han, Meng Jiang, Heng Ji, and Jiawei Han. Large language models on\ngraphs: A comprehensive survey. IEEE Transactions on Knowledge and Data Engineering, 2024.\nJérémie Kalfon, Jules Samaran, Gabriel Peyré, and Laura Cantini. scPRINT: pre-training on 50\nmillion cells allows robust gene network predictions. bioRxiv, 2024. doi: 10.1101/2024.07.29.\n605556.\nAmanda Kau, Xuzeng He, Aishwarya Nambissan, Aland Astudillo, Hui Yin, and Amir Aryani.\nCombining knowledge graphs and large language models.\narXiv preprint arXiv:2407.06564,\n2024.\nEric Kernfeld, Yunxiao Yang, Joshua S. Weinstock, Alexis Battle, and Patrick Cahan. A systematic\ncomparison of computational methods for expression forecasting. bioRxiv, 2023. doi: 10.1101/\n2023.07.28.551039.\nThomas N. Kipf and Max Welling. Semi-supervised classification with graph convolutional net-\nworks. In International Conference on Learning Representations, 2017.\nJon M. Laurent, Joseph D. Janizek, Michael Ruzo, Michaela M. Hinks, Michael J. Hammerling,\nSiddharth Narayanan, Manvitha Ponnapati, Andrew D. White, and Samuel G. Rodriques. LAB-\nBench: Measuring capabilities of language models for biology research, 2024.\nJinhyuk Lee, Wonjin Yoon, Sungdong Kim, Donghyeon Kim, Sunkyu Kim, Chan Ho So, and Jae-\nwoo Kang. BioBERT: a pre-trained biomedical language representation model for biomedical\ntext mining. Bioinformatics, 36(4):1234–1240, 2020.\nPatrick Lewis, Ethan Perez, Aleksandra Piktus, Fabio Petroni, Vladimir Karpukhin, Naman Goyal,\nHeinrich Küttler, Mike Lewis, Wen-tau Yih, Tim Rocktäschel, et al. Retrieval-augmented gener-\nation for knowledge-intensive NLP tasks. Advances in Neural Information Processing Systems,\n33:9459–9474, 2020.\nChin-Yew Lin. ROUGE: A package for automatic evaluation of summaries. In Text Summarization\nBranches Out, pp. 74–81, Barcelona, Spain, July 2004. Association for Computational Linguis-\ntics.\nZeming Lin, Halil Akin, Roshan Rao, Brian Hie, Zhongkai Zhu, Wenting Lu, Nikita Smetanin,\nRobert Verkuil, Ori Kabeli, Yaniv Shmueli, Allan dos Santos Costa, Maryam Fazel-Zarandi, Tom\nSercu, Salvatore Candido, and Alexander Rives. Evolutionary-scale prediction of atomic-level\nprotein structure with a language model. Science, 379(6637):1123–1130, 2023. doi: 10.1126/\nscience.ade2574.\nMohammad Lotfollahi, F. Alexander Wolf, and Fabian J Theis. scGen predicts single-cell perturba-\ntion responses. Nature Methods, 16:715 – 721, 2019.\nMohammad Lotfollahi, Anna Klimovskaia Susmelj, Carlo De Donno, Leon Hetzel, Yuge Ji, Igna-\ncio L Ibarra, Sanjay R Srivatsan, Mohsen Naghipourfar, Riza M Daza, Beth Martin, Jay Shendure,\nJose L McFaline-Figueroa, Pierre Boyeau, F Alexander Wolf, Nafissa Yakubova, Stephan Gün-\nnemann, Cole Trapnell, David Lopez-Paz, and Fabian J Theis. Predicting cellular responses to\ncomplex perturbations in high-throughput screens. Molecular Systems Biology, 19(6):e11517,\n2023. doi: https://doi.org/10.15252/msb.202211517.\nM I Love, W Huber, and S Anders. Moderated estimation of fold change and dispersion for RNA-seq\ndata with DESeq2. Genome Biol, 15(12):550–550, 2014. doi: 10.1186/s13059-014-0550-8.\nKaspar Märtens, Rory Donovan-Maiye, and Jesper Ferkinghoff-Borg. Enhancing generative per-\nturbation models with LLM-informed gene embeddings. In ICLR 2024 Workshop on Machine\nLearning for Genomics Explorations, 2024.\nFergal J Martin, M Ridwan Amode, Alisha Aneja, Olanrewaju Austine-Orimoloye, Andrey G Azov,\nIf Barnes, Arne Becker, Ruth Bennett, Andrew Berry, Jyothish Bhai, et al. Ensembl 2023. Nucleic\nAcids Research, 51(D1):D933–D941, 2023.\nCostas Mavromatis and George Karypis. GNN-RAG: Graph neural retrieval for large language\nmodel reasoning. arXiv preprint arXiv:2405.20139, 2024.\n14\n\n\nPublished as a conference paper at ICLR 2025\nMarija Milacic, Deidre Beavers, Patrick Conley, Chuqiao Gong, Marc Gillespie, Johannes Griss,\nRobin Haw, Bijay Jassal, Lisa Matthews, Bruce May, Robert Petryszak, Eliot Ragueneau, Karen\nRothfels, Cristoffer Sevilla, Veronica Shamovsky, Ralf Stephan, Krishna Tiwari, Thawfeek Varu-\nsai, Joel Weiser, Adam Wright, Guanming Wu, Lincoln Stein, Henning Hermjakob, and Peter\nD’Eustachio. The Reactome Pathway Knowledgebase 2024. Nucleic Acids Research, 52(D1):\nD672–D678, 11 2023. ISSN 0305-1048. doi: 10.1093/nar/gkad1025.\nAjay Nadig, Joseph Replogle, Angela Pogson, Steven Mccarroll, Jonathan Weissman, Elise Robin-\nson, and Luke O’Connor. Transcriptome-wide characterization of genetic perturbations. bioRxiv,\n07 2024. doi: 10.1101/2024.07.03.601903.\nEric Nguyen, Michael Poli, Matthew G Durrant, Brian Kang, Dhruva Katrekar, David B Li, Liam J\nBartie, Armin W Thomas, Samuel H King, Garyk Brixi, et al. Sequence modeling and design\nfrom molecular to genome scale with Evo. Science, 386(6723):eado9336, 2024.\nThomas M. Norman, Max A. Horlbeck, Joseph M. Replogle, Alex Y. Ge, Albert Xu, Marco Jost,\nLuke A. Gilbert, and Jonathan S. Weissman. Exploring genetic interaction manifolds constructed\nfrom rich single-cell phenotypes.\nScience, 365(6455):786–793, 2019.\ndoi: 10.1126/science.\naax4438.\nKishore Papineni, Salim Roukos, Todd Ward, and Wei-Jing Zhu. Bleu: a method for automatic\nevaluation of machine translation. In Pierre Isabelle, Eugene Charniak, and Dekang Lin (eds.),\nProceedings of the 40th Annual Meeting of the Association for Computational Linguistics, pp.\n311–318, Philadelphia, Pennsylvania, USA, July 2002. Association for Computational Linguis-\ntics. doi: 10.3115/1073083.1073135.\nBryan Perozzi, Bahare Fatemi, Dustin Zelle, Anton Tsitsulin, Mehran Kazemi, Rami Al-Rfou, and\nJonathan Halcrow. Let your graph do the talking: Encoding structured data for LLMs. arXiv\npreprint arXiv:2402.05862, 2024.\nYuanhao Qu, Kaixuan Huang, Henry Cousins, William A Johnson, Di Yin, Mihir Shah, Denny\nZhou, Russ Altman, Mengdi Wang, and Le Cong. CRISPR-GPT: An LLM agent for automated\ndesign of gene-editing experiments. bioRxiv, pp. 2024–04, 2024.\nDavid Rein, Betty Li Hou, Asa Cooper Stickland, Jackson Petty, Richard Yuanzhe Pang, Julien\nDirani, Julian Michael, and Samuel R Bowman. GPQA: A graduate-level Google-proof Q&A\nbenchmark. arXiv preprint arXiv:2311.12022, 2023.\nJoseph M. Replogle, Reuben A. Saunders, Angela N. Pogson, Jeffrey A. Hussmann, Alexander\nLenail, Alina Guna, Lauren Mascibroda, Eric J. Wagner, Karen Adelman, Gila Lithwick-Yanai,\nNika Iremadze, Florian Oberstrass, Doron Lipson, Jessica L. Bonnar, Marco Jost, Thomas M.\nNorman, and Jonathan S. Weissman. Mapping information-rich genotype-phenotype landscapes\nwith genome-scale Perturb-seq. Cell, 185(14):2559–2575.e28, 2022. ISSN 0092-8674. doi:\nhttps://doi.org/10.1016/j.cell.2022.05.013.\nYusuf Roohani, Kexin Huang, and Jure Leskovec. Predicting transcriptional outcomes of novel\nmultigene perturbations with GEARS. Nature Biotechnology, 2023.\nYusuf H Roohani, Jian Vora, Qian Huang, Percy Liang, and Jure Leskovec. BioDiscoveryAgent:\nAn AI agent for designing genetic perturbation experiments. In ICLR 2024 Workshop on Machine\nLearning for Genomics Explorations, 2024.\nYanay Rosen, Maria Brbi´c, Yusuf Roohani, Kyle Swanson, Li Ziang, and Jure Leskovec. Towards\nuniversal cell embeddings: Integrating single-cell RNA-seq datasets across species with SAT-\nURN. Nature Methods, 2024. doi: 10.1101/2023.02.03.526939.\nYair Schiff, Chia Hsiang Kao, Aaron Gokaslan, Tri Dao, Albert Gu, and Volodymyr Kuleshov.\nCaduceus: Bi-directional equivariant long-range DNA sequence modeling. In Forty-first Interna-\ntional Conference on Machine Learning, 2024.\nAravind Subramanian, Pablo Tamayo, Vamsi K. Mootha, Sayan Mukherjee, Benjamin L. Ebert,\nMichael A. Gillette, Amanda Paulovich, Scott L. Pomeroy, Todd R. Golub, Eric S. Lander, and\nJill P. Mesirov.\nGene set enrichment analysis: A knowledge-based approach for interpreting\n15\n\n\nPublished as a conference paper at ICLR 2025\ngenome-wide expression profiles. Proceedings of the National Academy of Sciences, 102(43):\n15545–15550, 2005. doi: 10.1073/pnas.0506580102.\nDamian Szklarczyk, Rebecca Kirsch, Mikaela Koutrouli, Katerina Nastou, Farrokh Mehryary, Radja\nHachilif, Annika L Gable, Tao Fang, Nadezhda T Doncheva, Sampo Pyysalo, Peer Bork, Lars J\nJensen, and Christian von Mering. The STRING database in 2023: protein–protein association\nnetworks and functional enrichment analyses for any sequenced genome of interest. Nucleic Acids\nResearch, 51(D1):D638–D646, 11 2022. ISSN 0305-1048. doi: 10.1093/nar/gkac1000.\nGeorge Tsitsiridis, Ralph Steinkamp, Madalina Giurgiu, Barbara Brauner, Gisela Fobo, Goar Frish-\nman, Corinna Montrone, and Andreas Ruepp. CORUM: the comprehensive resource of mam-\nmalian protein complexes–2022. Nucleic Acids Research, 51(D1):D539–D545, 11 2022. ISSN\n0305-1048. doi: 10.1093/nar/gkac1015.\nPetar Veliˇckovi´c, Guillem Cucurull, Arantxa Casanova, Adriana Romero, Pietro Lio, and Yoshua\nBengio. Graph attention networks. arXiv preprint arXiv:1710.10903, 2017.\nMarie-Claire Wagle, Daniel Kirouac, Christiaan Klijn, Bonnie Liu, Shilpi Mahajan, Melissa Junttila,\nJohn Moffat, Ling Huw, Matthew Wongchenko, Kwame Okrah, Shrividhya Srinivasan, Zineb\nMounir, Teiko Sumiyoshi, Peter Haverty, Robert Yauch, Yibing Yan, Omar Kabbarah, Garret\nHampton, and Shih-Min Huang. A transcriptional MAPK pathway activity score (MPAS) is a\nclinically relevant biomarker in multiple cancer types. npj Precision Oncology, 2, 12 2018. doi:\n10.1038/s41698-018-0051-4.\nChengrui Wang, Qingqing Long, Meng Xiao, Xunxin Cai, Chengjun Wu, Zhen Meng, Xuezhi Wang,\nand Yuanchun Zhou. BioRAG: A RAG-LLM framework for biological question reasoning. arXiv\npreprint arXiv:2408.01107, 2024a.\nZifeng Wang, Zichen Wang, Balasubramaniam Srinivasan, Vassilis N Ioannidis, Huzefa Rangwala,\nand Rishita Anubhai. BioBridge: Bridging biomedical foundation models via knowledge graphs.\nIn International Conference on Learning Representations, 2024b.\nJason Wei, Xuezhi Wang, Dale Schuurmans, Maarten Bosma, Brian Ichter, Fei Xia, Ed Chi, Quoc\nLe, and Denny Zhou. Chain-of-thought prompting elicits reasoning in large language models.\n36th Conference on Neural Information Processing Systems, 2022.\nFrank Wilcoxon. Individual comparisons by ranking methods. Biometrics Bulletin, 1(6):80–83,\n1945. ISSN 00994987.\nShunyu Yao, Dian Yu, Jeffrey Zhao, Izhak Shafran, Tom Griffiths, Yuan Cao, and Karthik\nNarasimhan. Tree of thoughts: Deliberate problem solving with large language models. Ad-\nvances in Neural Information Processing Systems, 36, 2024.\nDi Zhang, Xiaoshui Huang, Dongzhan Zhou, Yuqiang Li, and Wanli Ouyang. Accessing GPT-4\nlevel mathematical olympiad solutions via Monte Carlo tree self-refine with LLaMa-3 8B, 2024.\nTianyi Zhang, Varsha Kishore, Felix Wu, Kilian Q. Weinberger, and Yoav Artzi. BERTScore: Eval-\nuating text generation with BERT. In International Conference on Learning Representations,\n2020.\nJianan Zhao, Le Zhuo, Yikang Shen, Meng Qu, Kai Liu, Michael Bronstein, Zhaocheng Zhu, and\nJian Tang. GraphText: Graph reasoning in text space. arXiv preprint arXiv:2310.01089, 2023.\n16\n\n\nPublished as a conference paper at ICLR 2025\nA\nEXPERIMENTAL DETAILS\nA.1\nK562 GENE SETS\nWe downloaded K562 genome-wide gene sets from the supplementary data associated with Figure\n4B of Replogle et al. (2022). These gene sets were obtained by “cluster[ing] genes into expres-\nsion programs based on their co-regulation.” We evaluated gene set enrichment over clusters that\nwere manually annotated, though we provide predictions over all gene sets (regardless of annotation\nstatus).\nFor differential expression analysis, we took the average of the Log(TP10k+1) values over each gene\nset, for each cell, similar to a pathway activity score (Wagle et al., 2018).\nA.2\nDATA PROCESSING\nWe normalized all gene counts to Log(TP10k+1) values (log-transformed UMI count per 10k),\nwhere the count cij of gene j in cell i is mapped to\nlog\n \ncij\nP\nj cij\n· 10, 000 + 1\n!\n.\n(2)\nTo determine differentially expressed genes (DEGs),\nwe ran the Wilcoxon signed-rank\ntest (Wilcoxon, 1945) with Benjamini-Hochberg correction (Benjamini & Hochberg, 2000) between\nnon-targeting control (NTC) cells and perturbed cells, for each perturbation.\nTo focus on perturbations with phenotypic effect, we excluded all perturbations that resulted in ≤5\nDEGs (p < 0.05), with the exception of 100 negative control perturbations (0 DEGs), sampled\nuniformly at random per dataset.\nWe selected thresholds based on statistical consistency (Section A.5). For the two K562 datasets,\nwe defined “DE” perturbation - gene pairs as those shared between the datasets at p < 0.05. Non\ndifferentially-expressed pairs were sampled from those that were not differentially-expressed in ei-\nther dataset. Since the remaining datasets lacked biological replicates, we defined “DE” pairs as\nthose with p < 0.01, and sampled “non-DE” pairs from those with p > 0.1. We selected the top 20\nDEGs per perturbation ranked by adjusted p-value as “positives.” We sampled 100 non-DEGs per\nperturbation as “negatives.”\nTo ensure similar distributions between our training and testing splits, we sorted both selected pertur-\nbations and DEGs based on prevalence. We split perturbations 75:25 between training and testing.\nValidation data were sampled at random during training (10% of training). Further details regarding\ndataset and data split statistics may be found in Tables 4 and 5.\nTable 4: Data statistics. K562∗non-targeting control cells were subsampled due to the size of the\ngenome-wide dataset. K562-es⋆(essential) was only used to filter K562 DE and non-DE genes.\nDataset\nCells\nPerturbations\nControl\nPerturbed\nTotal\nTrain\nTest\nFeatures\nK562∗\n5,000\n919,124\n9851\n1564\n267\n4136\nK562-es⋆\n10,691\n299,645\n2049\n—\n—\n—\nRPE1\n11,485\n236,164\n2354\n1596\n406\n4760\nHepG2\n4,976\n140,497\n2393\n1086\n278\n7435\nJurkat\n12,013\n250,943\n2392\n1227\n313\n6842\nK562-Set\n5,000\n919,124\n9851\n1401\n357\n20\nA.3\nLLM DETAILS\nDue to the stochastic nature of LLM generations, we noticed that the LLM would occasionally\nabstain from selecting one of the intended labels, due to insufficient evidence for either. To account\n17\n\n\nPublished as a conference paper at ICLR 2025\nTable 5: Differential gene expression data split statistics. Number of perturbation - gene (set) pairs.\nDataset\nSplit\nTotal\nnon-DE\nDifferentially expressed\nTotal\nUp\nDown\nK562\nTrain\n134,467\n117,606\n16,861\n11,041\n5,820\nTest\n23,212\n20,093\n3,119\n2,530\n589\nRPE1\nTrain\n149,147\n127,860\n21,287\n8,381\n12,906\nTest\n37,942\n32,577\n5,365\n2,121\n3,244\nHepG2\nTrain\n101,140\n86,883\n14,257\n6,249\n8,008\nTest\n25,749\n22,146\n3,603\n1,599\n2,004\nJurkat\nTrain\n113,684\n97,747\n15,937\n5,119\n10,818\nTest\n29,138\n25,017\n4,121\n1,379\n2,742\nK562-Set\nTrain\n20,606\n9,367\n11,239\n3,953\n7,286\nTest\n5,235\n2,403\n2,832\n995\n1,837\nTable 6: Abstain rate on differential expression (DE) and direction of change (Dir) across all\ndatasets.\nModel\nDE\nDir\nLLM (No Retrieval)\n0.02\n0.36\nLLM (No CoT)\n3.3 × 10−6\n0\nSUMMER\n8.9 × 10−4\n0.03\nfor this, we intentionally added “insufficient information” as a third answer option. We ran inference\non each input sample at least 3 times and took the mean predicted label, after removing all abstaining\noutputs.\nA small fraction of inputs (p, g) resulted in no predictions after this filtering, or were unable to be\nparsed by our rule-based parsing. The latter is due to the insufficient capacity of Llama3 8B (rela-\ntively small LLM) to follow instructions. Since these examples differed by model, we substituted the\nprediction with an uninformed baseline (the mean label of g over the training set) for evaluation. The\nfinal abstain rate varied based on LLM prompting strategy (Table 6). LLM (No Retrieval) abstained\nnearly a third of the time on direction of change. In contrast, LLM (No CoT) only abstained a single\ntime, over all datasets. The improved instruction following may be due to the concise nature of the\nexpected output (only a single answer). Finally, SUMMER nearly always produced a prediction over\n3 runs (e.g. 0.08% abstain on DE).\nA.4\nBASELINES\nFor GAT, we grid searched over the number of layers (1, 2, 4, 8) and hidden dimension (64, 128,\n256). We used FFN dimension 1024 (memory constraint), GELU activation, dropout of 0.1, weight\ndecay 1e-6, learning rate 1e-4, and residual connections. We selected the top models based on\nvalidation performance (arbitrary 10% of train). In addition to node features, GAT also learned edge\nattributes, which indicated the source knowledge graph of each edge.\nFor K562-Set, we pooled the mean embedding of each gene set’s genes before the prediction head\nin GAT. On GEARS and SCGPT, we used the mean predicted log-fold change over each gene set’s\ngenes (mirrors data pre-processing). A small number of genes (97 out of 11,234) did not map to\nGENEPT embeddings. We set the embeddings for these genes to the mean perturbation / gene\nembedding in their respective training sets.\nFor uncertainty quantification, we used the top 3 runs for GAT. For GENEPT, since logistic regres-\nsion does not inherently introduce randomness (unless it fails to converge; it always converges here),\nwe subsampled 80% of the training set for each of 3 runs. Since GEARS and SCGPT operate over\n18\n\n\nPublished as a conference paper at ICLR 2025\nsingle cells, rather than pseudo-bulk estimates, we subsampled 80% of the single cells before taking\nthe average for each of 3 evaluations.\nA.5\nSTATISTICAL ANALYSIS\nWe provide empirical analyses on the quality of our datasets and labels. Figure 4 shows that the\nWilcoxon rank sum test is relatively well-calibrated on our data, though the test tends to be conser-\nvative, erring on the side of identifying fewer DEGs. Thus, we selected a relative higher p-value\nthreshold for negative examples. Figures 5 and 6 illustrate that K562 gene clusters and top DEGs\nare consistent across near-biological replicates (two experiments in the same cell line, by the same\nlab). This motivates both the K562-set setting, as well as our selection of the top DEGs as positives.\n0.0\n0.5\n1.0\nP-values\n0.00\n0.02\n0.04\n0.06\nProbability\nK562\n0.0\n0.5\n1.0\nP-values\n0.00\n0.02\n0.04\n0.06\nK562-es\n0.0\n0.5\n1.0\nP-values\n0.00\n0.02\n0.04\n0.06\nRPE1\n0.0\n0.5\n1.0\nP-values\n0.00\n0.02\n0.04\n0.06\nHepG2\n0.0\n0.5\n1.0\nP-values\n0.00\n0.02\n0.04\n0.06\nJurkat\nFigure 4: Assessing p-value calibration over single-cell datasets. We split the non-targeting controls\n(NTCs) randomly in half, and run the Wilcoxon test to compare the two halves. We would expect to\nsee that the (non-adjusted) p-values are uniformly distributed between 0 and 1. Here, we see that the\nWilcoxon test is slightly conservative, i.e. it leans towards reporting “non-differentially expressed.”\n0.00\n0.25\n0.50\n0.75\n1.00\n% es in gw\n0\n200\n400\n600\n800\nCount\nOverlap of top 5 sets\n0.00\n0.25\n0.50\n0.75\n1.00\n% gw in es\n0\n200\n400\n600\n800\nCount\nOverlap of top 5 sets\n0.00\n0.25\n0.50\n0.75\n1.00\n% es in gw\n0\n200\n400\n600\nCount\nOverlap of top 10 sets\n0.00\n0.25\n0.50\n0.75\n1.00\n% gw in es\n0\n200\n400\n600\nCount\nOverlap of top 10 sets\nFigure 5: K562 gene clusters show consistent response between biological replicates. We compute\nthe top k = 5, 10 significant gene clusters, sorted by adjusted p-value, for both K562 genome-\nwide and K562 essential. For each perturbation, we compute the percentage of shared gene clusters\n(normalizing by genome-wide and essential, respectively). We see that the clusters are relatively\nconsistent across both datasets, with a high fraction of perfect overlaps.\nB\nQUALITATIVE ANALYSIS\nB.1\nHUMAN EVALUATION OF SUMMARIZATION RESULTS\nDue to the open-ended nature of the gene set task, automated evaluation methods are limited in\ntheir ability to reflect practical utility. Since this paper focuses on providing value to biologists, we\nrecruited a domain specialist (molecular biologist, trained in wet lab and computational biology) for\nthis task. We presented them with a document formatted as follows and asked two questions.\n1) Is A or B more informative, or about the same? Options: A, B, same\n2) Does B capture the same biology as the bolded annotation? Options: yes, no\n{ground truth label}: {list of genes}\nA: {top 10 gene sets (all databases)}\nB: {LLM-generated name}: {LLM-generated descriptions}\nOverall, the LLM-generated summary is equal or better to the classical gene set enrichment results\nin 92% of cases, and agrees with the independent annotator in 72% of cases.\n19\n\n\nPublished as a conference paper at ICLR 2025\n0.0\n0.5\n1.0\n0\n500\n1000\n1500\nCount\n% Top 5 es DEGs in gw\n0.0\n0.5\n1.0\n0\n200\n400\n600\n800\n1000\nCount\n% Top 5 gw DEGs in es\n0.00\n0.25\n0.50\n0.75\n1.00\n% es in gw\n0\n200\n400\n600\nCount\nOverlap of top 10 sets\n0.00\n0.25\n0.50\n0.75\n1.00\n% gw in es\n0\n200\n400\n600\nCount\nOverlap of top 10 sets\n0.0\n0.5\n1.0\n0\n500\n1000\n1500\n2000\nCount\n% Top 20 es DEGs in gw\n0.0\n0.5\n1.0\n0\n200\n400\n600\nCount\n% Top 20 gw DEGs in es\n0.0\n0.5\n1.0\n0\n500\n1000\n1500\nCount\n% Top 100 es DEGs in gw\n0.0\n0.5\n1.0\n0\n100\n200\n300\n400\nCount\n% Top 100 gw DEGs in es\nFigure 6: K562 DEGs are reasonably consistent at the top (ranked by p-value). For each perturba-\ntion, we plot the percentage of shared top = 5, 10, 20, 100 DEGs (normalizing by genome-wide and\nessential, respectively). In our final dataset, we took the intersection of the top 20 DEGs as “DE”\nand the intersection of the negatives as “non-DE.”\n1. In 21/25 cases, the biologist reported that the LLM-generated summary was more informa-\ntive. In 2/25 cases, they contained the same amount of information; and in 2/25 cases, the\ngene set contained more information.\n2. In 18/25 cases, the biologist reported that the LLM summary captured the same biology as\nthe original human annotation (our ground truth labels).\nWe analyze the cases in which the LLM provides less information, or fails to capture the independent\nhuman annotation.\n1. In the 2 cases where the gene sets contained more information, a list of specific protein\ncomplexes were discovered, e.g. below.\nEukaryotic Translation Termination,\nEIF2AK4 (GCN2) dimer autophosphorylates,\nEIF2AK4 (GCN2)\nbinds tRNA, Aminoacyl-tRNA binds to the ribosome at the A-site, 80S:Met-tRNAi:mRNA:SECISBP2:Sec-\ntRNA(Sec):EEFSEC:GTP is hydrolysed to 80S:Met-tRNAi:mRNA:SECISBP2:Sec and EEFSEC:GDP by\nEEFSEC, UPF1 binds an mRNP with a termination codon preceding an Exon Junction Complex, Transloca-\ntion of ribosome by 3 bases in the 3’ direction, Translation of ROBO3.2 mRNA initiates NMD, Translation of\nROBO3.2 mRNA is negatively regulated by NMD, The SRP receptor binds the SRP:nascent peptide:ribosome\ncomplex\nHowever, this output is difficult to parse, compared to the LLM-generated output, which\nfaithfully and concisely represents the original annotation of “translation.”\nRibosomal Protein Components Involved in Translation: This gene set is comprised of components of the\nlarge and small ribosomal subunits, which are essential for protein synthesis and translation. These genes\nare involved in the assembly and function of the ribosome, facilitating the translation of messenger RNA into\nprotein.\n2. In the 7/25 cases where the LLM summary differed from the human annotation (Table 7),\nthe LLM annotation tended to miss some highly specific terms, e.g. “targets of nonsense-\nmediated decay” was generalized to “stress response,” and “dysregulated lncRNA antisense\ntranscripts” was generalized to “nuclear gene regulation.” Related terms tend to be sparsely\nannotated in Gene Ontology, so this indicates that it would be useful to tune the granularity\nof generations in the future, or to generate multiple candidates for specific descriptions.\nB.2\nCAPTURING THE GREATEST COMMON DENOMINATOR\nBy construction, clusters of genes may vary in their degree of specificity and agreement. For ex-\nample, “translation” contains over 20 million annotations in the Gene Ontology, while variants of\n20\n\n\nPublished as a conference paper at ICLR 2025\nTable 7: Error analysis of gene set summaries that differed from the manual annotation, based\non independent human evaluation. These summaries tend to be more generic than the original\nannotation.\nAnnotation\nSUMMER (8b) gene set name\ntargets of nonsense-mediated decay\nRNA Processing and Stress Response Regulators\ndysregulated lncRNA antisense transcripts\nMitochondrial & Nuclear Gene Regulation and Metabolism\nunfolded protein response mTORC1 signaling\nAmino Acid Metabolism and Protein Synthesis Regulators\nNFkB signaling\nRegulators of Cellular Homeostasis and Signaling\nmyeloid differentiation\nActin Cytoskeleton and Immune Response Regulators\ngrowth signaling\nProtein Trafficking and Transcriptional Regulation\ngrowth targets of Myc\nRNA Processing and Translation Regulation\nTable 8: Unannotated gene clusters are typically less specific and coherent. Compared to gene set\nenrichment, which tends to focus on highly-specific subsets of each clusters, SUMMER tends to\nidentify the “greatest common denominator” among the genes.\nGenes Gene sets (combined)\nSUMMER (8b)\nHCCS,\nAGPS,\nFAM136A,\nMTREX,\nPITHD1,\nKIF2A,\nREXO2,\n. .., EIF6\n2Fe-2S is inserted in\nUQCRFS1; 39S ribosomal\nsubunit; 3’ incision by\nERCC5 (XPG) in\nTC-NER; 55S ribosome;\n1-palmitoylglycerone\nphosphate + hexadecanol\n=> O-hexadecylglycerone\nphosphate + palmitate, ...\nRibosomal and Mitochondrial Gene Set. The gene set is com-\nposed of genes involved in various cellular processes, including\nprotein synthesis, translation, and regulation of gene expression.\nMany of these genes are involved in the assembly and function\nof ribosomes, the translation of mitochondrial DNA-encoded\ngenes, and the regulation of protein synthesis in response to cel-\nlular signals.\nATP6AP1,\nITM2A,\nNPC2,\nCREG1,\nUQCRB,\n. . . , HEXA\nkeratan sulfate catabolic\nprocess; transcription\ncorepressor activity;\ntranscription regulator\ncomplex; dermatan sulfate\ncatabolic process, ...\nProtein Processing and Trafficking Gene Set. The gene set\nis comprised of genes involved in various cellular processes, in-\ncluding protein transport, immune response, and cellular differ-\nentiation. Common pathways among these genes include protein\nprocessing and modification, as well as cellular trafficking and\nsignaling.\nRALA,\nSTARD3NL,\nAKAP8L,\nATP2B1,\n...,\nYTHDF2\nExpression of Perilipin\n(PLIN); Dephosphorylation\nof inactive SRC by PTPB1;\nExpression of\nPhosphoenolpyruvate\ncarboxykinase 1\n(PEPCK-C), ...\nRegulatory Genes in Cellular Processes and Signaling. The\ngene set is comprised of genes involved in various cellular pro-\ncesses, including protein synthesis and degradation, gene ex-\npression, transcription regulation, and cellular signaling. These\ngenes are also involved in maintaining proper calcium home-\nostasis, regulating mitochondrial function, and facilitating pro-\ntein trafficking and targeting.\n“nonsense-mediated decay” vary from 27 to 74,097 annotations (as of November 2024) (Ashburner\net al., 2000).\nClusters that are smaller, or exhibit lower agreement, tend to elude manual annotation. In these\ncases, gene set over-representation analysis tends to focus on highly specific gene sets, which cover\nsubsets of these clusters. The LLM takes the opposite approach, and its summaries tend to “lift” the\ndescription to higher levels of hierarchy (Table 8).\nB.3\nERROR AND INCONSISTENCY ANALYSIS\nWe analyzed 300 generations (3 trials of 100 DE examples) to understand the failure modes of\nSUMMER. Errors and inconsistencies primarily resulted from deductions backed by overly-generic\ninformation. For example, the LLM may list an excessively broad set of factors that may influence\nexpression.\n21\n\n\nPublished as a conference paper at ICLR 2025\nPerturbations of genes involved in mitochondrial function, protein synthesis, or transcriptional regulation may potentially\naffect CC2D1A expression.\nIn several instances, the LLM may be confused between concepts which are loosely connected, but\nnot in the same context.\nThe genes of interest in the examples are QKI, MT-CYB, ADA, MT-ND1, and RPL12. Among these, MT-CYB and\nMT-ND1 are similar to TXNIP as they are both involved in mitochondrial function and electron transport, which is a\nrelated process to TXNIP’s role in oxidative stress and mitochondrial function.\nHere, “oxidative stress” is related to the mitochondria, but TXNIP is upstream of a number of stress\nresponse genes and is unrelated to healthy mitochondrial function. Thus, it should not respond\nsimilarly to MT-CYB. This aspect might be resolved with a higher-capacity model, but the 8b LLM\ncannot distinguish.\nFinally, we observe that there is a fine line between abstaining and predicting “no effect” due to lack\nof information.\nBased on the analysis above, we can see that perturbing ABCE1 or similar genes did not result in differential expression of\nany genes, including CDK11A. Additionally, perturbing EIF3J resulted in differential expression of HSP90AA1, which is\nsimilar to CDK11A. However, the relationship between ABCE1 and CDK11A is not well-represented in these examples.\nTherefore, it is unlikely that a CRISPRi knockdown of ABCE1 in K562 cells will result in differential expression of\nCDK11A.\nFinal answer: There is insufficient evidence to determine how knockdown of ABCE1 affects CDK11A.\nC\nPROMPTS\nWe share the prompts used by each stage of SUMMER, as well as the LLM baselines. All text\nsurrounded by {...} are replaced with example-specific inputs (Appendix D).\nC.1\nSUMMARIZATION TEMPLATES\nWe generate gene summaries at two levels: single node and 1-hop knowledge graph neighborhoods.\nFor both levels, we use two prompts per gene (as a perturbation, and as a downstream gene). Wher-\never gene sets are the downstream entities, we replace “gene” with “gene set.”\nThe following is an example of a single-node summary of a perturbed gene.\nYou are an expert molecular biologist who studies how genes are related using Perturb-seq.\nTask: You are writing a brief overview of the human gene {gene}, with a focus on its molecular and cellular functions.\nYou will be provided a set of database entries about the gene. Ensure that your overview remains faithful to this domain\nknowledge.\nFormat:\n- Write one to two sentences describing the primary molecular and cellular function of gene {gene}.\n- Write one sentence describing the potential downstream impact of perturbing gene {gene} via gene knockdown.\nConstraints:\n- Maintain a professional tone throughout.\n- Do not comment on your own writing.\n- Do not add any notes or references. Do not make up additional information.\n- Do not discuss the importance or impact of the gene. Focus only on its function.\nDomain knowledge: {description}\nBrief overview of gene {gene}:\nTo generate downstream gene descriptions, we replace the second formatting instruction with the\nfollowing.\nWrite one sentence describing what types of perturbations might impact the expression of gene {gene}. For example,\nyou might consider pathways that are upstream of the gene or compensatory mechanisms.\nSingle-node summaries are input alongside additional knowledge graph relationships for 1-hop\nneighborhood summaries.\nYou are an expert molecular biologist who studies how genes are related using Perturb-seq.\nTask: You are writing a brief overview of the human gene {gene}, with a focus on the downstream effects of perturbing\n{gene} via gene knockdown (loss of function).\nInputs: You are provided\n- Description of perturbed gene {gene}\n22\n\n\nPublished as a conference paper at ICLR 2025\n- Database entries relating {gene} to other genes or pathways\nFormat: Write up to five sentences describing the molecular and cellular impact of perturbing gene {gene} via gene\nknockdown.\nConstraints:\n- Remain faithful to all domain knowledge. Do not make up additional information.\n- Summarize all common aspects succinctly, but point out notable differences within these sets of genes.\n- Maintain a professional tone throughout. Do not comment on your own writing. Do not add any notes or references.\n- Omit the importance or impact of the gene. Focus only on its function.\n- Omit all non-specific information and obvious statements, e.g. “this gene is involved in cellular processes.”\nDescription of gene {gene}: {single-node summary}\nRelations to other genes: {relationships}\nDownstream effects of perturbing {gene} via gene knockdown:\nTo generate downstream gene descriptions, we replace the “Task” instruction with the following.\nTask: You are writing a brief overview of the human gene {gene}, with a focus on molecular and cellular perturbations\nthat may affect the levels of gene {gene}. For example, you might consider pathways that are upstream of the gene or\ncompensatory mechanisms.\nTo generate gene set summaries (for differential expression and direction of change), we used the\nfollowing prompt, where the manual annotation is provided as input.\nYou are an expert molecular biologist who studies how genes and pathways are related using Perturb-seq.\nTask: You are writing a brief overview of a gene set associated with {manual annotation} in human cells. You will be\nprovided descriptions of the constituent genes. Ensure that your overview remains faithful to this domain knowledge.\nFormat:\n- Write one to two sentences summarizing how the given genes are related. Be sure to characterize how they are associated\nwith {manual annotation}.\n- Write one to two sentences describing what types of perturbations might impact the expression of the genes in this\ngene set. For example, you might consider pathways that are upstream of these genes or compensatory mechanisms.\nConstraints:\n- Maintain a professional tone throughout.\n- Do not comment on your own writing.\n- Do not add any notes or references. Do not make up additional information.\n- Do not discuss the importance or impact of the gene set. Focus only on its function.\nDescriptions of the constituent genes: {list of gene summaries}\nBrief overview of gene set ({manual annotation}):\nFinally, for the gene set enrichment task, we use the following prompt for hierarchical summariza-\ntion of gene sets. Note that the manual annotations are not provided here. We parse the outputs of\n“Brief overview of gene set” and “Name of gene set” as the description and name in our evaluation.\n[Start of Prompt]\nYou are an expert molecular biologist who studies how genes and pathways are related using Perturb-seq.\nTask: You are writing a brief overview of a gene set observed to have a similar transcriptional response when upstream\ngenes are perturbed.\nInput: You will be provided descriptions of the constituent genes. Ensure that your overview remains faithful to this\ndomain knowledge.\nOutput format: Fill in each of these three sections.\n1) Brief overview of gene set: Write one to two sentences summarizing how the given genes are related. Focus on the\nmost specific pathways that are common among these genes.\n2) Upstream pathways may affect this gene set: Write one to two sentences describing what types of perturbations might\nimpact the expression of the genes in this gene set. For example, you might consider pathways that are upstream of\nthese genes or compensatory mechanisms.\n3) Name of gene set: Summarize the gene set within ten words.\nConstraints:\n- Maintain a professional tone throughout.\n- Do not comment on your own writing.\n- Do not add any notes or references. Do not make up additional information.\n- Do not discuss the importance or impact of the gene set. Focus only on its function.\n[End of Prompt]\n[Start of Input] {list of gene summaries} [End of Input]\nC.2\nQUESTION-ANSWERING TEMPLATES\nFor differential expression and direction of change, we used the following template for SUMMER.\n23\n\n\nPublished as a conference paper at ICLR 2025\n[Start of Prompt]\nYou are an expert molecular biologist who studies how genes are related using Perturb-seq. Your goal is to determine:\nDoes a CRISPRi knockdown of {perturbation} in {cell line} result in differential expression of {gene}?\nYou are given as input:\n- Description of perturbed gene ({perturbation}): description of gene that is perturbed via CRISPRi knockdown\n- Description of gene of interest ({gene}): description of gene, the impact on which you wish to infer\n- Context: description of cell line in which the genes are expressed\n- Examples: set of experimental observations that describe the impact of CRISPRi perturbations on related genes\nOutput: Please extract the most relevant parts of the examples that address these five questions. Be specific.\n1) Which of the observed perturbed genes are most similar to {perturbation} (if any, including {perturbation} itself)?\n2) When perturbing {perturbation} or similar genes, what downstream pathways or genes are differentially expressed?\nJustify your answer with the observed outcomes.\n3) Which of the observed genes of interest are most similar to {gene} (if any, including {gene} itself)?\n4) What perturbations of upstream pathways or genes result in differential expression of {gene} or similar genes (if any)?\nJustify your answer with the observed outcomes.\n5) Is a CRISPRi knockdown of {perturbation} in {cell line} likely to result in differential expression of {gene}? For\nexample, if 2) and 4) are unrelated or only indirectly related, it is unlikely we will observe differential expression. On\nthe other hand, if 2) and 4) significantly overlap in specific genes or pathways, we may observe differential expression.\nYour final answer should end with one of these three options and nothing else.\n- No. Knockdown of {perturbation} does not impact {gene}.\n- Yes. Knockdown of {perturbation} results in differential expression of {gene}.\n- There is insufficient evidence to determine how knockdown of {perturbation} affects {gene}.\n[End of Prompt]\n[Start of Input]\n- Description of perturbed gene ({perturbation}): {summary of perturbation}\n- Description of gene of interest ({gene}): {summary of downstream gene}\n- Context: {sentence describing cell line}\n- Examples: {list of examples}\n[End of Input]\nFor direction of change, we change the answer options to the following.\nA) Knockdown of {perturbation} results in a decrease in expression of {gene}.\nB) Knockdown of {perturbation} results in an increase in expression of {gene}.\nThe following template was used for the LLM (No CoT) baseline on differential expression.\nYou are an expert molecular biologist who studies how genes are related using Perturb-seq.\nYou are given as Input:\n- Perturbed gene: description of gene that is perturbed via CRISPRi knockdown\n- Gene of interest: description of gene, the impact on which you wish to infer\nContext: {sentence describing cell line}\nQuestion: If you knockdown the perturbed gene using CRISPRi, how does the gene of interest’s expression change?\nAnswer: Your answer must end with one of these two choices and nothing else.\nA) Knockdown of the perturbed gene does not impact the gene of interest.\nB) Knockdown of the perturbed gene results in differential expression of the gene of interest.\nFormat: Follow the same format as Examples 1 and 2, and complete Example 3.\nExample 1.\nInput:\n- Perturbed gene: {summary of perturbation}\n- Gene of interest: {summary of downstream gene}\nAnswer: {either A) ... or B) ...}\nExample 2. {same format as Example 1, opposite Answer}\nExample 3. {same format as Example 1, empty Answer}\nThe following template was used for the LLM (No retrieval) baseline on differential expression.\nBoth answer options are provided twice each as hypotheses, regardless of the ground truth answer.\nYou are an expert molecular biologist who studies how genes are related using Perturb-seq.\nYou are given as Input:\n- Perturbed gene: description of gene that is perturbed via CRISPRi knockdown\n- Gene of interest: description of gene, the impact on which you wish to infer\n- Hypothesis: hypothesis regarding how the specified perturbation affects the gene of interest\nContext: {sentence describing cell line}\nQuestion: If you knockdown the perturbed gene using CRISPRi, how does the gene of interest’s expression change?\n24\n\n\nPublished as a conference paper at ICLR 2025\nTask: Your goal is to identify evidence in the input that supports or refutes the hypothesis, and explain whether the\nhypothesis is likely to be true.\nOutput format: Please fill in the following four sections. Preserve the formatting and add the corresponding content.\n1) Supporting evidence: Identify all relevant parts of the input that support the hypothesis.\n2) Refuting evidence: Identify all relevant parts of the input that refute the hypothesis.\n3) Explanation: Based on the evidence, explain how to answer the question, step by step. In particular,\n- if there is a causal relationship from the perturbed gene to the gene of interest, explain how biological mechanisms\nrelate the perturbed gene to the gene of interest.\n- if there is no causal relationship from the perturbed gene to the gene of interest, explain why.\nFor example, the\nperturbed gene may be downstream of the gene of interest, or there may be no relationship between the two genes.\n- if there is insufficient evidence to answer the question, say so.\n4) Answer: Your answer must end with one of these three choices and nothing else.\nA) Knockdown of the perturbed gene does not impact the gene of interest.\nB) Knockdown of the perturbed gene results in differential expression of the gene of interest.\nC) There is insufficient evidence to determine how knockdown of the perturbed gene affects the gene of interest.\nInput:\n- Perturbed gene: {summary of perturbation}\n- Gene of interest: {summary of downstream gene}\n- Hypothesis: {either A) ... or B) ...}\nFor direction of change, we change the answer options to the following.\nA) Knockdown of the perturbed gene results in down-regulation of the gene of interest.\nB) Knockdown of the perturbed gene results in up-regulation of the gene of interest.\nD\nEXAMPLES\nFull LLM outputs are available in our data distribution. We sample real inputs/outputs for illustrative\npurposes.\nD.1\nSUMMARIZATION EXAMPLES\nHere is an example of the knowledge-base description for ABCE1, used as the {description} in\nthe single-node summary.\nDescription of gene: ATP binding cassette subfamily E member 1\nGene products: ATP-binding cassette sub-family E member 1\nFunctions: (Microbial infection) May act as a chaperone for post-translational events during HIV-1 capsid assembly.,\n(Microbial infection) Plays a role in the down-regulation of the 2-5A/RNASEL pathway during encephalomyocarditis\nvirus (EMCV) and HIV-1 infections., Nucleoside-triphosphatase (NTPase) involved in ribosome recycling by mediating\nribosome disassembly.\nQuaternary structure: (Microbial infection) Interacts with HIV-1 proteins Vif and Gag. (Microbial infection) Interacts\nwith HIV-2 protein Gag. Interacts with PINK1.\nInteracts with: ABCE1, EIF3J, GAG_HV1B1, MATRX_CHAV, PHOSP_RABVE\nBiological process: enables endoribonuclease inhibitor activity (Binds to and stops, prevents or reduces the activity of\nendoribonuclease.)\nHere is the unedited output for the single-node summary, which is used as input to the 1-hop neigh-\nborhood summary.\nThe primary molecular and cellular function of gene ABCE1 is to facilitate ribosome recycling by mediating ribosome\ndisassembly through its nucleoside-triphosphatase (NTPase) activity, and to act as a chaperone for post-translational\nevents during HIV-1 capsid assembly. Additionally, ABCE1 plays a role in the down-regulation of the 2-5A/RNASEL\npathway during viral infections. Perturbing gene ABCE1 via gene knockdown may disrupt ribosome recycling and viral\ncapsid assembly, potentially leading to aberrant protein synthesis and altered viral replication dynamics.\nHere is an example of the knowledge graph relationships for ABCE1.\nRelations to other genes:\n- ABCE1 enables 4 iron, 4 sulfur cluster binding, ATP binding, ATP hydrolysis activity, CTPase activity, GTPase activity,\nendoribonuclease inhibitor activity, iron ion binding, ribonucleoside triphosphate phosphatase activity, ribosomal small\nsubunit binding.\n- ABCE1 is active in cytosolic ribosome\n- ABCE1 is involved in negative regulation of endoribonuclease activity, regulation of translation, rescue of stalled ribo-\nsome, ribosomal subunit export from nucleus, ribosome disassembly, translational initiation, translational termination,\ncytoplasm, cytosol, membrane, mitochondrial matrix, mitochondrion.\n25\n\n\nPublished as a conference paper at ICLR 2025\n- Based on evidence from experimental evidence in humans, database evidence in humans, ABCE1 may physically interact\nwith RNASEL.\n- Based on evidence from experimental evidence in humans, experimental evidence in other animals, ABCE1 may physi-\ncally interact with EIF1AX, EIF3A, EIF3B, EIF3C, EIF3D, EIF3E, EIF3F, EIF3G, EIF3H, EIF3I, EIF3K, EIF3L, EIF3M,\nG3BP2, LTO1, MFGE8, PSMD14, RACK1, RPL12, RPL23, RPL4, RPL7A, RPL9, RPL9P7, RPL9P8, RPL9P9, RPS10,\nRPS10-NUDT3, RPS11, RPS12, RPS13, RPS14, RPS15, RPS15A, RPS16, RPS17, RPS18, RPS19, RPS2, RPS20, RPS21,\nRPS24, RPS25, RPS26, RPS27, RPS27A, RPS28, RPS29, RPS3, RPS3A, RPS4X, RPS5, RPS6, RPS7, RPS8, RPS9,\nRPSA, YAE1.\n- Based on evidence from experimental evidence in humans, experimental evidence in other animals, literature evidence\nin humans, ABCE1 may physically interact with EIF5, RPS23.\n- Based on evidence from experimental evidence in humans, experimental evidence in other animals, literature evidence\nin humans, literature evidence in other animals, ABCE1 may physically interact with EIF1, ETF1.\n- Based on evidence from experimental evidence in humans, experimental evidence in other animals, literature evidence\nin other animals, ABCE1 may physically interact with EIF3J, RPLP0.\n- Based on evidence from experimental evidence in humans, literature evidence in humans, ABCE1 may physically\ninteract with DCP2, EIF2S3, FDPS, PSMD1, PSMD4.\n- Based on evidence from experimental evidence in humans, literature evidence in humans, literature evidence in other\nanimals, ABCE1 may physically interact with EIF2S1, EIF2S2.\n- Based on evidence from experimental evidence in other animals, literature evidence in humans, ABCE1 may physically\ninteract with UBL4A.\n- Based on evidence from experimental evidence in other animals, literature evidence in other animals, ABCE1 may\nphysically interact with DENR, EIF1B, MRTO4.\n- In 293T cells, ABCE1 may form a complex with IGF2R\n- In the cytosol, ABCE1 enables OAS antiviral response, RNASEL binds 2’-5’ oligoadenylate, ABCE1 binds RNASEL,\nOAS antiviral response, RNASEL binds 2’-5’ oligoadenylate, ABCE1 binds RNASEL\n- In the mitochondrial matrix, ABCE1 enables Interferon alpha/beta signaling, ABCE1 binds RNASEL, inhibiting it,\nInterferon alpha/beta signaling, ABCE1 binds RNASEL, inhibiting it\nHere is the unedited output for the 1-hop neighborhood summary.\nPerturbations that may impact the levels of ABCE1 include alterations in the 2-5A/RNASEL pathway, HIV-1 capsid\nassembly, or ribosome recycling, as well as changes in the interactions with its binding partners, such as HIV-1 proteins\nVif and Gag, HIV-2 protein Gag, PINK1, EIF3J, and MATRX_CHAV. Additionally, perturbations in the regulation of\ntranslation, translational initiation, and translational termination may also affect ABCE1 levels. Furthermore, changes\nin the activity of its binding partners, such as EIF1AX, EIF3A, EIF3B, and RPL12, may also impact ABCE1 expression.\nD.2\nQUESTION-ANSWERING EXAMPLES\nHere is an example of the {list of examples} used in the QA template (C.2), retrieved to predict\nthe impact of AARS2 knockdown on AAK1.\nExample 1: Impact of knocking down MTIF2 on SPHK1\nDescription of perturbed gene (MTIF2): The primary molecular and cellular function of gene MTIF2 is to facilitate the\ninitiation of protein synthesis in mitochondria by protecting formylmethionyl-tRNA from spontaneous hydrolysis and\npromoting its binding to the 30S ribosomal subunits, ultimately leading to the formation of the 70S ribosomal complex.\nThis process is crucial for the translation of mitochondrial DNA into functional proteins. Perturbing gene MTIF2 via\ngene knockdown would likely disrupt the initiation of protein synthesis in mitochondria, potentially leading to impaired\nmitochondrial function and protein synthesis.\nDescription of gene of interest (SPHK1): The primary molecular and cellular function of gene SPHK1 is to catalyze\nthe phosphorylation of sphingosine to form sphingosine 1-phosphate, a lipid mediator with both intra- and extracellular\nfunctions, and to interact with various proteins to regulate downstream cellular processes. Additionally, SPHK1 plays\na role in the sphingosine-1-phosphate receptor signaling pathway, which regulates transcription and other cellular pro-\ncesses. Perturbations that might impact the expression of gene SPHK1 include alterations in the sphingosine-1-phosphate\nreceptor signaling pathway, changes in calmodulin binding, or disruptions to its interactions with other proteins such as\nACY1, CATB, EF1A1, FHL2, LAMP2, SHLB1, SPHKAP, or TRAF6.\nOutcome: A) Knockdown of MTIF2 does not impact SPHK1.\nExample 2: Impact of knocking down CLPX on PTCD1\nDescription of perturbed gene (CLPX): The primary molecular and cellular function of gene CLPX is to act as an\nATP-dependent specificity component of the Clp protease complex, hydrolyzing ATP and forming a homohexamer ring\nstructure that assembles with CLPP rings to form the Clp complex. This complex is involved in protein degradation\nand quality control in the mitochondrial matrix. Perturbing gene CLPX via gene knockdown may disrupt the proper\nfunctioning of the Clp protease complex, leading to impaired protein degradation and potential accumulation of misfolded\nor damaged proteins in the mitochondrial matrix.\nDescription of gene of interest (PTCD1): The primary molecular and cellular function of gene PTCD1 is to negatively\nregulate leucine tRNA levels, mitochondria-encoded proteins, and COX activity, while also affecting the 3’-processing\nof mitochondrial tRNAs, thereby influencing mitochondrial protein synthesis.\nAs a mitochondrial protein, PTCD1\nassociates with mitochondrial leucine tRNAs and interacts with various proteins, including ELAC2, to modulate its\nfunctions. Perturbations that might impact the expression of gene PTCD1 include disruptions to mitochondrial tRNA\nmetabolism, alterations in COX activity, or changes in the levels of interacting proteins, such as ELAC2, which could in\nturn affect PTCD1’s regulatory roles in mitochondrial protein synthesis.\nOutcome: A) Knockdown of CLPX does not impact PTCD1.\n{...}\n26\n\n\nPublished as a conference paper at ICLR 2025\nExample 12: Impact of knocking down NARS2 on REPS1\nDescription of perturbed gene (NARS2): The primary molecular and cellular function of gene NARS2 is to encode\na mitochondrial aminoacyl-tRNA synthetase that catalyzes the attachment of asparagine to its cognate tRNA, thereby\nparticipating in protein synthesis. This enzyme enables asparagine-tRNA ligase activity, facilitating the formation of Asn-\ntRNA(Asn) from L-asparagine and tRNA(Asn). Perturbing gene NARS2 via gene knockdown may disrupt the proper\ncharging of tRNA with asparagine, potentially leading to aberrant protein synthesis and mitochondrial dysfunction.\nDescription of gene of interest (REPS1): The primary molecular and cellular function of gene REPS1 is to coordinate the\ncellular actions of activated EGF receptors and Ral-GTPases, potentially linking them to an EGF-responsive tyrosine\nkinase through its interactions with CRK and GRB2. Additionally, REPS1 may be involved in clathrin-mediated endocy-\ntosis through its interactions with AMPH, ITSN1, and SGIP1. Perturbations to the EGF signaling pathway, Ral-GTPase\nactivity, or clathrin-mediated endocytosis may impact the expression of gene REPS1.\nOutcome: A) Knockdown of NARS2 does not impact REPS1.\nHere is the unedited output for the above prompt.\n[Start of Output]\nBased on the provided examples, I will extract the most relevant parts to address the five questions.\n1. Which of the observed perturbed genes are most similar to AARS2 (if any, including AARS2 itself)?\nFrom the examples, we can see that AARS2 is a mitochondrial aminoacyl-tRNA synthetase, specifically responsible for\nattaching alanine to tRNA(Ala). The most similar genes to AARS2 are likely to be other mitochondrial aminoacyl-tRNA\nsynthetases, such as TARS2 (threonine-tRNA ligase), RARS2 (arginine-tRNA ligase), and NARS2 (asparagine-tRNA\nligase). These genes share similar functions and are also involved in protein synthesis.\n2. When perturbing AARS2 or similar genes, what downstream pathways or genes are differentially expressed? Justify\nyour answer with the observed outcomes.\nFrom the examples, we can see that perturbing AARS2 or similar genes does not impact the expression of downstream\ngenes. For instance, knocking down AARS2 does not affect the expression of SPHK1, PTCD1, SLC35G2, LYRM7, RTN2,\nAAK1, or NECAP2. Similarly, knocking down TARS2, RARS2, or NARS2 does not impact the expression of SLC35G2,\nREPS1, or NECAP2, respectively. This suggests that the perturbation of AARS2 or similar genes does not significantly\naffect downstream pathways or genes.\n3. Which of the observed genes of interest are most similar to AAK1 (if any, including AAK1 itself)?\nFrom the examples, we can see that AAK1 is a gene involved in regulating clathrin-mediated endocytosis and interacts\nwith clathrin and other proteins. The most similar genes to AAK1 are likely to be other genes involved in clathrin-\nmediated endocytosis, such as NECAP2, which facilitates endocytosis through its interactions with adapter protein\ncomplexes AP-1 and AP-2. Other genes that interact with clathrin, such as RTN2, may also be similar to AAK1.\n4. What perturbations of upstream pathways or genes result in differential expression of AAK1 or similar genes (if any)?\nJustify your answer with the observed outcomes.\nFrom the examples, we can see that perturbing genes involved in clathrin-mediated endocytosis, such as NECAP2, does\nnot impact the expression of AAK1. Similarly, perturbing genes involved in protein synthesis, such as RPL10, does not\naffect the expression of AAK1. This suggests that the perturbation of upstream pathways or genes does not significantly\naffect the expression of AAK1 or similar genes.\n5. Is a CRISPRi knockdown of AARS2 in K562 cells likely to result in differential expression of AAK1?\nBased on the observed outcomes, it is unlikely that a CRISPRi knockdown of AARS2 in K562 cells will result in differential\nexpression of AAK1. The perturbation of AARS2 or similar genes does not impact the expression of downstream genes,\nincluding AAK1. Therefore, the answer is:\nNo. Knockdown of AARS2 does not impact AAK1.\n[End of Output]\nD.3\nOTHER EXAMPLES\nWe use the following for {sentence describing cell line}, derived from Wikipedia.\nK562 cells are immortalised myelogenous leukemia cells of the erythroleukemia type.\nRPE1 cells are a non-cancerous, hTERT-immortalized, near-euploid, adherent, and p53-positive cell line.\nJurkat cells are an immortalized line of human T lymphocyte cells.\nHepG2 cells are a human liver cancer cell line, derived from a patient with a well-differentiated hepatocellular carcinoma.\n27\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21290v1.pdf",
    "total_pages": 27,
    "title": "Contextualizing biological perturbation experiments through language",
    "authors": [
      "Menghua Wu",
      "Russell Littman",
      "Jacob Levine",
      "Lin Qiu",
      "Tommaso Biancalani",
      "David Richmond",
      "Jan-Christian Huetter"
    ],
    "abstract": "High-content perturbation experiments allow scientists to probe biomolecular\nsystems at unprecedented resolution, but experimental and analysis costs pose\nsignificant barriers to widespread adoption. Machine learning has the potential\nto guide efficient exploration of the perturbation space and extract novel\ninsights from these data. However, current approaches neglect the semantic\nrichness of the relevant biology, and their objectives are misaligned with\ndownstream biological analyses. In this paper, we hypothesize that large\nlanguage models (LLMs) present a natural medium for representing complex\nbiological relationships and rationalizing experimental outcomes. We propose\nPerturbQA, a benchmark for structured reasoning over perturbation experiments.\nUnlike current benchmarks that primarily interrogate existing knowledge,\nPerturbQA is inspired by open problems in perturbation modeling: prediction of\ndifferential expression and change of direction for unseen perturbations, and\ngene set enrichment. We evaluate state-of-the-art machine learning and\nstatistical approaches for modeling perturbations, as well as standard LLM\nreasoning strategies, and we find that current methods perform poorly on\nPerturbQA. As a proof of feasibility, we introduce Summer (SUMMarize, retrievE,\nand answeR, a simple, domain-informed LLM framework that matches or exceeds the\ncurrent state-of-the-art. Our code and data are publicly available at\nhttps://github.com/genentech/PerturbQA.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}