{
  "id": "arxiv_2502.21131v1",
  "text": " \n1 \nMüller, Vincent C. (1993), ‘Einleitung [Introduction]’, in Vincent C. \nMüller (ed.), Hilary Putnam: Von einem realistischen Standpunkt, \nSchriften zu Sprache und Wirklichkeit [From a realist point of view: \nWritings on language and reality] (rowohlts enzyklopädie; Reinbek: \nRowohlt), 9-26. \n \nEinleitung \nHilary Putnams Biographie und philosophische Entwicklung spiegeln die \nGeschichte der angelsächsischen Philosophie in den letzten 40 Jahren. \nBeinahe ebenso lange hat Putnam diese Geschichte wesentlich beeinflußt \nund so kann John Passmore über Putnam schreiben: «Er ist die Geschichte \nder gegenwärtigen Philosophie im Umriß»1. \n \nIn der vorliegenden Einleitung soll vor allem der Kontext dargestellt \nwerden, in dem Putnam steht und aus dem heraus verständlich wird, was \ner philosophisch zu sagen hat. Dieser Kontext ist sicherlich ein Grund \ndafür, daß Putnam hierzulande noch relativ wenig bekannt ist, während er \nin den USA häufig für den bedeutendsten aktiven Philosophen gehalten \nwird. Im Rahmen einer Skizze von Putnams philosophischer Entwicklung \nsoll zudem eine vorläufige philosophiehistorische Einordnung versucht \nwerden, auch wenn hier nicht der Ort für eine umfassende Kritik oder \nDarstellung sein kann: Die Einleitung muß auf recht elementarem Niveau \nbleiben und kann eine Lektüre der Texte natürlich nicht ersetzen. Da \nPutnams Werk sicherlich Teil einer Annäherung von ‹analytischer› und \n‹kontinentaler› Philosophie ist, soll bei der Einführung in die hier \nübersetzten Texte schließlich deutlich werden, was Putnam nicht \nanalytisch orientierten Lesern zu bieten hat. (Diesen sei empfohlen, mit \nder Lektüre bei Text 8 zu beginnen, sofern keine speziellen thematischen \nPräferenzen vorhanden sind.) \n \n\n\nEinleitung \n2 \n1 \nZunächst zur Vorgeschichte der hier übersetzten Texte: Die Philosophie \nim Amerika der Nachkriegszeit wurde nicht unwesentlich von Denkern \ngeprägt, die vor dem Nationalsozialismus geflüchtet und nicht wieder in \nihre Heimatländer zurückgekehrt waren. Zu diesen gehörte auch Hans \nReichenbach, der in Berlin eine dem Wiener Kreis nahestehende Gruppe \ngeleitet hatte und 1938 nach einigen Jahren in Istanbul an die University of \nCalifornia, Los Angeles (UCLA) wechselte. Reichenbach befaßte sich mit \nGrundlagenproblemen der Naturwissenschaften, insbesondere mit der \nphilosophischen Bedeutung der neuen Quantenphysik. Putnam wurde sein \nSchüler und verfaßte 1951 eine Dissertation über The Meaning od the \nConcept of Probability in Application to Finite Sequences (1990, I-132). \nDamit hatte er sich in die beiden zentralen Themen der analytischen \nPhilosophie jener Zeit eingearbeitet: Mathematische Logik und das \nProblem der Bestätigung wissenschaftlicher Theorien, welches eng mit \ndem Begriff der Wahrscheinlichkeit verbunden ist. \n \nSchon 1953 konnte Putnam eine Stelle als Assistant Professor an der \nrenommierten Universität Princeton antreten. Dort traf er einen weiteren \nwichtigen Mentor: Rudolf Carnap. Dieser Philosoph lehrte seit 1936 in \nden USA und galt inzwischen als einer der führenden Köpfe im Lande. In \nden folgenden beiden Jahren führte Putnam zahlreiche Gespräche mit \nCarnap in dessen Haus. Neben den Klassikern des Pragmatismus (Peirce, \nDewey, James) hat Putnam später immer wieder auf die Bedeutung seiner \nbeiden \nLehrer \nhingewiesen. \nIn \nPrinceton \nbegann \ner \nseine \nPublikationstätigkeit (wie in der Bibliographie in diesem Band \nnachzulesen) mit Aufsätzen zu sprachphilosophischen Themen, zum \nProblem der Analytizität und zur Philosophie der Mathematik; außerdem \ngriff er mit der Frage, ob die Quantenmechanik eine neue, nicht-klassische \nLogik erfordert (eine ‹Quantenlogik›), ein Thema Reichenbachs auf. \n\n\nEinleitung \n3 \n \nMit dieser Fragestellung reihte sich Putnam bereits in eine \nEntwicklung gegen den beherrschenden Logischen Empirismus ein; denn \ndem Positivismus zufolge war Logik ja analytisch, und also konnte kein \nErgebnis irgendeiner empirischen Wissenschaft für Logik relevant sein. \nNach dem Logischen Empirismus war alle Erkenntnis auf Empfindungen \nder Sinne (‹Sinnesdaten) zurückzuführen, und was darauf nicht \nzurückzuführen war, mußte entweder analytisch sein (Mathematik und \nLogik) oder als sinnlos gelten (‹Metaphysik›). Putnam hingegen meint \ninzwischen, es gebe auch in der Mathematik empirische Elemente. Damit \nbeginnt er, einen ‹realistischen› Standpunkt einzunehmen, was hier \nzunächst einmal bedeutet, die Wissenschaften nicht als bloße Instrumente \nfür erfolgreiche Voraussagen anzusehen. \n \nVon Princeton ging Putnam 1961 an das Massachusetts Institute of \nTechnology (MIT) in Boston. Sein wesentlicher praktischer Beitrag \nbestand in jener Zeit darin, den philosophischen Fachbereich am MIT um \neinen Graduiertenstudiengang zu erweitern, aus dem im Laufe der Jahre \neinige der bedeutendsten amerikanischen Philosophen hervorgegangen \nsind. Das MIT hat sich seitdem zu einem der führenden philosophischen \nInstitute in den USA entwickelt. Putnams Interesse galt dort neben der \nMathematik der allgemeinen Wissenschaftstheorie und vor allem der \nPhilosophie des Geistes. Auch letztere stellte ja eine Schwachstelle im \npositivistischen System dar, insofern man sich gezwungen sah, Aussagen \nüber den Verstand, die Psyche, den Geist (engl. the mind) anderer \nMenschen auf beobachtbares Verhalten zurückzuführen. Nur so schienen \nsie auf ‹öffentlich› zugängliche Anhaltspunkte reduzierbar und damit \nverifizierbar. \n \n1966 verlegte Putnam seinen Schreibtisch einige Meilen flußaufwärts: \nEr erhielt einen Ruf auf den Lehrstuhl des Walter Beverly Pearson \nProfessor of Modern Mathematics and Mathematical Logic an der Harvard \nUniversität, wo er bis heute lehrt. In Harvard hat vor allem der um etwa 20 \n\n\nEinleitung \n4 \nJahre ältere Kollege Willard van Orman Quine wesentlichen Einfluß auf \ndie Entwicklung der angelsächsischen Philosophie ausgeübt. Auch seine \nPhilosophie kann als Reaktion auf den ‹importierten› Positivismus \ngedeutet werden, allerdings weniger als Abwendung, sondern eher als eine \nFortentwicklung (bis zum bitteren Ende). In Harvard hat Putnam einen \nstetigen \nStrom \nvon \nAufsätzen \npubliziert, \ndie \ngemeinsam \neinen \nfortwährenden Angriff auf den Positivismus bilden. Erst 1975 allerdings \nwurden die ersten beiden Bände Philosophical Papers zusammengestellt \n(1975, I-3 & 4). \n \nPutnams selbst sieht sich als einen der ‹Überwinder› des \nPositivismus. Worin diese Überwindung besteht, sollte aus den hier \nübersetzten Texten deutlich werden. Es zeigt sich aber bereits an dieser \nStelle ein wesentlicher Grund für die relative Unbekanntheit Putnams in \nDeutschland: Er hat sich mit der Kritik einer Philosophie befaßt, die \nhierzulande nie so recht Fuß fassen konnte (wohlgemerkt des \nPositivismus, nicht der ‹analytischen Philosophie› allgemein). Bestünde \ndarin seine einzige Leistung, dann könnte man seine Schriften beruhigt \nunübersetzt lassen. Es werden in dieser Kritik aber beileibe nicht nur \nDinge entwickelt, die für (Ex-)Positivisten von Interesse sind. Es wird eine \nganze Bedeutungstheorie entfaltet, und die Kritik ist wesentlich \nkonstruktiv, sie baut eine alternative philosophische Richtung auf: \nRealismus. Die Verteidigung und Weiterentwicklung dieser Alternative \nnimmt den wesentlichen Teil des vorliegenden Bandes ein (und in dieser \nAusarbeitung wird eine Reihe von ‹großen Fragen› behandelt). Eine \nweitere, eher praktische Schwierigkeit, ist das Fehlen eines ‹Hauptwerks› \noder überhaupt einer Darstellung in Buchlänge. Das gesamte Schaffen \nbesteht aus kürzeren Texten, auch wenn sich diese gelegentlich zu einem \nkohärenten Buch fügen.3 Putnam übt seinen Einfluß vor allem durch \nAufsatzpublikationen aus. \n\n\nEinleitung \n5 \n \nEs mußte also eine Auswahl getroffen werden, die einen Zugang \ngestattet und nichts Wesentliches ausläßt, was auch machbar erschien. In \neinem Band von zehn Texten (d. h. weniger als fünf Prozent der \nVeröffentlichungen) \nwar \nallerdings \neine \ngewisse \nthematische \nEinschränkung nicht zu vermeiden, und hier soll zumindest kurz erwähnt \nwerden, welche Themen im vorliegenden Band nicht repräsentiert sind: \n \nDa wären zunächst die zum Großteil in Band I der Philosophical \nPapers (1975, I-3) abgedruckten Arbeiten zur Philosophie der Mathematik, \nzur Quantenlogik und Wissenschaftstheorie im engeren Sinn.4 Hiervon \nwäre die Quantenlogik (nicht Quantorenlogik!) als Vorschlag zur \nBehandlung der Quantenphysik noch am ehesten von Interesse; sie eignet \nsich aber wenig zur Einführung in Putnams Denken auch wenn sich in ihr, \nwie oben angedeutet, bereits ein realistischer Zug findet.5 Gedanken zur \nDeutung der Quantenphysik allgemein ziehen sich durch das gesamte \nWerk Putnams und sind auch hier in Text 9, ‹Realismus mit menschlichem \nAntlitz›, Abschnitt ‹Realismus›, sowie in Text 10, ‹Irrealismus und \nDekonstruktion›, Abschnitt ‹Die Bedeutung der begrifflichen Relativität›, \nzu finden. Die Schriften aus Band I der Philosophical Papers seien aber \ndenjenigen ans Herz gelegt, die sich für die Rolle von Konvention und \nLogik in der Wissenschaft und umgekehrt für die Rolle von Konvention \nund Wissenschaft in der Logik interessieren. \n \nBis heute spielt die Philosophie des Geistes eine Rolle in Putnams \nDenken. Er hatte in den 60er Jahren an Gedanken von Alan Turing \nangeknüpft und vorgeschlagen, das Gehirn als ‹Turingmaschine› zu \nbetrachten, als einen Gegenstand, der weder durch physikalische noch \ndurch \n‹seelische› \nZustandsbeschreibungen \nnoch \ndurch \nVerhaltensbeschreibungen \nrichtig \nzu \nerfassen \nist \n(Materialismus, \nDualismus bzw. Behaviourismus). Es kann nur abstrakt durch seine \nfunktionalen Zustände charakterisiert werden. Ganz verschieden gebaute \nApparate können funktional identisch sein (die gleiche ‹Turingmaschine› \n\n\nEinleitung \n6 \nsein). So könnte auch ein Computer mit einem Gehirn funktional identisch \nsein, selbst wenn ihre ‹Hardware› ganz verschieden ist. Es ergibt sich dann \ndie Frage, ob funktionale Zustände mit physikalischen Zuständen \nidentifiziert werden können — eine Frage, die Putnam zunächst bejaht \nund später verneint hat. Thesen wie diese haben sich unter dem Namen \n(abstrakter) \n‹Funktionalismus› \nzur \nzeitgenössischen \nOrthodoxie \nentwickelt und wurden auch von ‹materialistischen› Philosophen des \nGeistes in Beschlag genommen (insbesondere von Jerry Fodor, einem \nSchüler Putnams). Putnam selbst lehnt den Funktionalismus inzwischen ab \n(1988, I-11). Die Texte zu diesem Themenkreis wurden für einen in \nVorbereitung befindlichen Band mit Putnams Philosophie des Geistes \nreserviert. Für die Zwischenzeit sei auf bereits vorhandene Übersetzungen \nverwiesen (III-2, 4 und 9). \n \nAlle Schriften zu diesen Themen und zu einer ganzen Reihe von \nweiteren Fragen finden sich in der Bibliographie. \n \n2 \nWie im Inhaltsverzeichnis angedeutet, lassen sich die Texte dieses Bandes \ngrob in drei Teile gliedern, wobei die inhaltliche mit der chronologischen \nOrdnung zusammenfällt. Der erste Teil befaßt sich mit der Kritik des \nPositivismus und der Kritik anderer Reaktionen auf den Positivismus, wie \nsie etwa mit den Namen Thomas Kuhn und Paul Feyerabend verbunden \nsind. Es handelt sich um Schriften aus den 70er Jahren, vor Putnams \n‹Wende› vom Realismus zum ‹internen› Realismus, die sich allerdings in \nText 3, «Was ist ‹Realismus›?» bereits andeutet. \n \nEine Schwierigkeit beim Zugang zu Putnams Texten von einer \n‹kontinentaleuropäischen› Perspektive bereitet die ungewohnte Methodik. \nEs soll etwa um erkenntnistheoretische Problemen gehen, die Rede ist aber \nnur von ‹Bedeutung› oder ‹Referenz›. Das hängt zunächst mit einer \nSichtweise zusammen, die in der angelsächsischen Philosophie seit langem \n\n\nEinleitung \n7 \nso gängig ist, daß es im allgemeinen müßig erscheint, sie zu thematisieren: \nPhilosophische Auffassungen werden als Theorien der Bedeutung \ncharakterisiert. \nWenn \nwir \nalso \nzum \nBeispiel \nannehmen, \ndie \nerkenntnistheoretische Position des Positivismus laute, daß alle Erkenntnis \nnur auf sinnlicher Wahrnehmung beruhen müsse, dann wird das auf \n‹Angelsächsisch› so formuliert, daß ein Satz über einen physikalischen \nGegenstand auf einen Satz über Sinneseindrücke reduziert werden muß. \n«Dort ist ein Apfel» bedeutet dann eigentlich «Wenn Du dort hinsiehst \nund die Bedingungen normal sind, dann wirst Du den-und-den \nSinneseindruck haben» (oder etwas ähnliches; über die Details kann man \nsich danach trefflich streiten). Ein klassischer Idealist wird also unsere \ngewöhnlichen Sätze irgendwie auf Sätze über Ideen im Geist reduzieren \nwollen — dem steht in der englischen Terminologie üblicherweise der \nRealist gegenüber, der meint, die Welt besteht unabhängig von einem \nwahrnehmenden Geist und der unsere Sätze (über Äpfel und dergleichen) \n‹für bare Münze› nimmt. Der Realist will ohne Reduktion auskommen. \nWer also die ‹verifikationistische Theorie der Bedeutung› des Positivismus \nkritisiert wie Putnam in den Texten 1 bis 3, versucht damit, der ganzen \nLehre den Boden zu entziehen. (Das heißt jedoch nicht, daß sich \nRealismus in einer Theorie der Bedeutung erschöpfen würde.) \n \nAls \nweitere \nSchwierigkeit \nerweist \nsich, \ndaß \nklassisch \nerkenntnistheoretische Probleme häufig über eine Diskussion von (Natur-\n) Wissenschaft behandelt werden. Es handelt sich dann nicht im \nWissenschaftstheorie (‹philosophy of science›) im eigentlichen Sinne, \nsondern um eine Betrachtung von Wissen (Erkenntnis), wo es systematisch \ngewonnen wird. Diese als ‹Epistemologie› bezeichnete Fragestellung setzt \nlediglich einen anderen Akzent als Erkenntnistheorie, indem sie sich \nweniger mit dem Problem der Wahrnehmung befaßt. \n \nNach einigen früheren Anläufen6 gelingt Putnam in ‹Erklärung und \nReferenz› (1973), Text 1, eine handfeste Kritik und alternative These. Er \n\n\nEinleitung \n8 \nstellt realistische und ‹idealistische› (verifikationistische) Theorien der \nBedeutung gegenüber und vergleicht ihre Antworten angesichts eines \nneuen Problems. Anhand verschiedener Beispiele aus der Geschichte der \nWissenschaften zeigt er eine Schwierigkeit für solche (‹idealistischen›) \nBedeutungstheorien auf, bei denen die Bedeutung unserer Ausdrücke \ndavon abhängt, was wir wissen können. Um sein Lieblingsbeispiel \nanzuführen: Wenn die Bedeutung des Ausdruckes ‹Elektron› in einer Liste \nvon Merkmalen bestünde, dann müßte diese Liste von uns anhand des \nvorhandenen Wissens über diese Teilchen erstellt worden sein. Nach der \nüblicherweise Russell (etwa 1912) und Frege (1892) zugeschriebenen \nTheorie der Bedeutung würde diese Liste den Sinn von ‹Elektron› \ndarstellen und bestimmen, worauf der Ausdruck zutrifft, worauf er \n‹referiert› — nämlich auf die Gegenstände, welche die dort aufgelisteten \nBedingungen erfüllen. Das führt aber zu einer Schwierigkeit: Wenn Niels \nBohr nun 1911 eine bestimmte Theorie jener Teilchen hatte (eine \nbestimmte Liste) und sich später herausstellt, daß diese Vorstellung \nfehlerhaft war (was ja wahrscheinlich ist), dann hat Bohr mit ‹Elektron› \nnicht referiert, denn kein Teilchen erfüllt die Bedingungen auf seiner Liste! \nEr hatte gar keine Theorie von Elektronen! Jede Kontinuität von \nWissenschaft oder irgendeiner Erkenntnis scheint unmöglich geworden zu \nsein. \nDas \nist \neine \nschwere \nHypothek \nfür \ndie \npositivistische \nWissenschaftstheorie: Es scheint, sie könne den Erfolg der Wissenschaften \nnicht erklären — dieser wird zu einem Wunder. Eine weitere Schwierigkeit \nbesteht darin, daß die Einträge auf der ‹Liste› jener Bedeutungstheorie \nzufolge Teil des Sinns von ‹Elektron› und also bloße Erläuterungen der \nBedeutung von ‹Elektron› sind. «Elektronen haben negative Ladung» wäre \ndieser Ansicht zufolge keine empirische Erkenntnis, sondern ein analytisch \nwahrer Satz! \n \nDiese Konsequenzen erscheinen unannehmbar, und Putnam \nversucht, eine ‹realistische› Theorie der Bedeutung zu formulieren, in der \n\n\nEinleitung \n9 \ngewissermaßen die Elektronen selbst einen Einfluß auf die Bedeutung \nunseres Ausdrucks ausüben und Referenzkonstanz gewährleisten. \n«Anstatt Bedeutungen als Entitäten zu sehen, die Referenz bestimmen, \nsehen sie [die Realisten] Bedeutungen nun als weitgehend von Referenz, \nund Referenz als weitgehend von kausalen Verbindungen bestimmt.»7 Er \nist nicht bereit, Feyerabend zu folgen, der den Zusammenhang von Wissen \nverschiedener Zeiten und Kulturen aufgibt. Feyerabend bleibt bei einer \nextremen empiristischen Position und kommt im Endeffekt zu einem \nvollständigen Relativismus (er überwindet den Positivismus also nicht, \nsondern führt ihn intern fort — und ad absurdum, wie man sagen könnte). \nPutnam meint nun, zeigen zu können, daß die Bedeutungstheorie nicht \nvon dieser mageren Kost leben muß und also nicht jede Theorie (oder \n‹Kultur›) auf ihre eigenen Gegenstände referiert. Hilfreich in diesem \nZusammenhang sind die Überlegungen von Saul Kripke (1972), der bei der \nUntersuchung von Eigennamen auf ähnliche Schwierigkeiten gestoßen ist \nund vorgeschlagen hat, die Referenz von Eigennamen müsse mit Hilfe \neiner kausalen Verbindung zwischen Träger und Namen erklärt werden. \nSo hoffen die Realisten auf in der Welt schon vorhandene Arten und \nGegenstände, die bei der Bestimmung von Referenz und Bedeutung \nhelfen. Wie Putnam in Text 5 zusammenfaßt: «Multiple Sklerose, Gold, \nPferde oder Elektrizität unterliegen objektiven Gesetzen, und was \nvernünftigerweise zu diesen Klassen zu zählen ist, wird davon abhängen, \nwie diese Gesetze sein werden.» \n \nIn ‹Sprache und Wirklichkeit› (1975), Text 2, formuliert Putnam zwei \nMaximen, denen eine Theorie der Bedeutung genügen soll. Diese sind \ninsofern interessant, als sie weitgehend zum Gemeingut geworden sind \nund auch implizit schon in ‹Erklärung und Referenz› eine Rolle gespielt \nhatten. Es handelt sich um das Prinzip Vertrauensvorschuß und das \nPrinzip der sprachlichen Arbeitsteilung. Man sollte Sprechern einen \nVertrauensvorschuß gewähren, das heißt annehmen, daß sie selbst dann \n\n\nEinleitung \n10 \nauf Gegenstände referieren, wenn ihre Beschreibung derselben nicht ganz \nzutreffend ist. Wenn Bohr im Jahre 1911 also eine nicht ganz richtige \nTheorie von Elektronen hatte, dann sollte man dennoch annehmen, er \nreferierte auf Elektronen — und nicht auf nichts. Wie kann dieser \nVertrauensvorschuß aber gerechtfertigt werden? Die Grundlage hierfür ist, \ndaß Bohrs Gebrauch des Wortes ‹Elektron› kausal mit Situationen \nverbunden \nist, \nin \ndenen \ndas \nWort \neingeführt \nwurde. \nDiese \nEinführungssituationen stiften eine Verbindung zwischen Elektronen und \n‹Elektron›, die zur Erklärung der Referenz genutzt werden kann. \n \nSprachliche Arbeitsteilung meint, daß die Referenz eines Ausdrucks \nnicht allein durch das Wissen eines einzelnen Sprechers bestimmt wird. \nMan gesteht bestimmten Experten aus der Sprachgemeinschaft eine \nAutorität zu und läßt sie entscheiden, was etwa als Elektron oder \nGoldstück zählen soll. Es sind dies nicht Linguisten, sondern Physiker \noder Juweliere, Experten in der Sache. Wenn das richtig ist, kann die \nBedeutung meiner Worte nicht allein durch meine Sinnesdaten bestimmt \nsein, sie kann keine Sache von Kriterien sein, über die ich allein die \nAutorität habe. Bedeutung kann nicht in meinem Kopf sein. \n \nIm verbleibenden Teil des Textes versucht Putnam dann, die \nphilosophische Fruchtbarkeit dieser Maximen zu zeigen, und baut sie zu \neiner Theorie der Referenz aus.8 \n \nIm Frühjahr 1976 hielt sich Putnam in England auf, um die John \nLocke Lectures in Oxford zu halten. Auch bei der Londoner Aristotelian \nSociety hielt er bei dieser Gelegenheit einen Vortrag, der, wie dort üblich, \nschon vorher in deren Proceedings veröffentlicht worden war. Sein Titel \nlautete «Was ist ‹Realismus›?» Dieser dritte Text im vorliegenden Band \nstellte sich der Frage, was denn eigentlich aus den bedeutungstheoretischen \nErwägungen folgen sollte. Hatten sie wirklich den Kern der Debatte \n‹Realismus — Idealismus› getroffen? Und ihre Relevanz für den Begriff \nder Wahrheit? War dieser von Tarski ein-für-allemal definiert worden, \n\n\nEinleitung \n11 \noder hatte Tarskis Arbeit9 das eigentliche Problem nur gestreift, wie \nHartry Field (1972) meinte? \n \nZunächst wehrt Putnam sich gegen die Annahme, Realismus sei \ndurch \ndie \nAkzeptanz \nvon \nTarskischen \nSchemata \nausreichend \ncharakterisiert. Wenn eine Korrespondenztheorie der Wahrheit bloß Sätze \nwie «‹Schnee ist weiß› ist wahr dann und nur dann, wenn Schnee weiß ist» \nhervorbringt, kann sie allein Realismus nicht unterstützen. Zur Definition \nmuß ein bestimmtes substantielles Verständnis der Referenz und Wahrheit \nkommen, in dem beide nicht von menschlichen Erkenntnismöglichkeiten \nabhängig gemacht werden. Das wäre etwa der Fall, wenn ein Idealist oder \nInstrumentalist (der Theorien nur als nützliche Instrumente für \nVoraussagen ansieht) meint, ein Satz muß wahr sein, wenn bestimmte uns \nzugängliche Kriterien erfüllt sind (‹die-und-die Sinneseindrücke sind \nvorhanden›, etwa) — seine Wahrheit besteht schließlich im Bestehen dieser \nKriterien. Diesen Wahrheitsbegriff lehnt der Realist als bloßes \nempiristisches Surrogat ab. Seiner Ansicht nach geht Wahrheit über \nprinzipielle Erkennbarkeit hinaus. \n \nWeiter muß ein Realist die oben angedeuteten Konsequenzen \nidealistisch-positivistischer \nBedeutungstheorien \n— \nradikaler \nReferenzwechsel bei aufeinander folgenden Theorien, keine Konvergenz \ndes wissenschaftlichen Wissens — als unannehmbar ansehen, was etwa \nKuhn oder Feyerabend nicht ohne weiteres tun würden.10 \n \n3 \nDie Lehre des Realismus schien zu diesem Zeitpunkt ausreichend \ncharakterisiert zu sein, und so wurde auch ihre dezidierte Kritik erst \nmöglich. Die Textes dieses Bandes können als Einführung in die Debatte \n‹Realistmus — Antirealismus› gelesen werden. Michael Dummett hatte bis \nMitte der 70er Jahre eine Unterscheidung von Realismus und \nAntirealismus präzisiert, die auf semantischen Charakteristika beruhte. \n\n\nEinleitung \n12 \nDer Antirealist für einen bestimmten Bereich des Diskurses (etwa über \nphysikalische Gegenstände) behauptet, daß die Sätze dieses Bereichs auf \nSätze reduziert werden müssen, die verifizierbare Bedingungen ergeben \n(etwa das Vorliegen bestimmter Sinnesdaten), welche die Behauptung des \nSatzes rechtfertigen. Putnam wurde in diesen Jahren deutlich von \nDummett beeinflußt und begann, seinen ursprünglichen Realismus zu \nmodifizieren, was schließlich zu einer ‹Wende› führte. Seine Versuche in \ndieser Richtung werden hier nur in ihrer reiferen Form berücksichtigt.11 Es \nsei noch betont, daß eine Reihe von Anhängern des frühen Putnam dieser \nWende nicht gefolgt sind und ihn für einen Abtrünnigen halten — ganz \nwie es ja auch bei anderen Philosophen der Fall gewesen ist. \n \nWichtig ist hier zunächst das modelltheoretische Argument aus \n‹Modelle und Wirklichkeit› (1980), Text 4. Putnam prüft die Frage, ob \nRealismus tatsächlich in der Lage ist, eine bestimmte Referenzrelation für \neinen Ausdruck als die richtige auszuzeichnen — und er kommt zu einem \nnegativen Ergebnis. Wie kann man sicherstellen, daß ‹Gold› nur auf einen \nbestimmten Stoff in der Welt referiert, wie kann man zwischen dem Wort \nund dem Stoff jene scheinbar magische Verbindung der ‹Referenz› \nherstellen? Putnam bietet den ganzen Apparat der Modelltheorie auf, um \nzu zeigen, daß immer viele Interpretationen möglich sind. Ob dieser \nApparat wesentlich zum Argument beiträgt, ist in der Literatur strittig und \nkann hier nicht diskutiert werden.12 Die Schwierigkeit für den Realisten \nbesteht darin, daß es mehrere ‹wahre› Theorien über die Welt geben kann \nund keine Entscheidung zwischen diesen möglich oder nötig ist. \n \nEr zeigt, daß es zu jeder Theorie eine andere gibt, die gegenüber der \nersten keinen epistemischen Unterschied macht (beide Theorien führen \nunter allen Umständen zu genau denselben Voraussagen), aber etwas \nanderes sagt. Man könnte die zweite Theorie auch bloß als eine andere \n‹Interpretation› der ersten ansehen. Nun, wäre es nicht möglich, eine \nTheorie aufstellen, welche festlegt, welche Interpretation ‹gemeint› war? \n\n\nEinleitung \n13 \nPutnam behauptet, das ist nicht möglich, denn auch diese Theorie hätte \nwiederum mehrere ‹Interpretationen› und so fort, ad infinitum. Man \nwürde so lediglich mehr Theorie produzieren, aber das Problem nicht \nlösen. Der Realist kann nur noch einen ‹metaphysischen Klebstoff› \npostulieren, der Referenz auf magische Weise festlegt. \n \nPutnam allerdings will sich nicht einfach auf die Seite der \nAntirealisten schlagen, denn er hält Realismus innerhalb einer Theorie \nnach wie vor für angemessen. Innerhalb der Theorie sind Gebrauch und \nReferenz verknüpft; es ist festgelegt, was als Gegenstand gelten kann und \nwas nicht, und also kann das modelltheoretische Argument nicht \nangewendet werden. Putnams neue Position heißt interner Realismus, und \ndie verworfene Variante des Realismus wird als metaphysischer Realismus \ngebrandmarkt. In der Literatur wird der ‹neue› Putnam allerdings sehr \nhäufig als Antirealist bezeichnet, denn er wendet sich ja gegen die \nursprüngliche Orthodoxie des Realismus. Außerdem bestreitet er, daß eine \nepistemisch ideale Theorie noch sinnvoll als falsch bezeichnet werden kann \n— und das wird häufig als Kennzeichen des Antirealisten gesehen. \n \nIn ‹Referenz und Wahrheit› (Text 5), einem Artikel für eine \nitalienische Enzyklopädie, hat Putnam die Entwicklung seines Denkens bis \n1980 noch einmal zusammengefaßt. Er beschreibt sowohl die frühere \nReferenztheorie und ihre Bedeutung als auch die Wende und sein \nVerhältnis zu Tarski, Davidson und Dummett. Dieser Text ist trotz seiner \nthematischen Dichte sicherlich zugänglicher als die vorhergehenden vier \nund \ner \nbietet \nzudem \neine \nkonzise \nDarstellung \nvon \nTarskis \nWahrheitstheorie. Er könnte als Einleitung zu den Texten 1 bis 4 gelesen \nwerden und widerlegt zugleich die Auffassung, mit der Wende zum \ninternen Realismus habe Putnam auch die Einsichten seiner früheren \n‹kausalen› Referenztheorie aufgegeben. \n \nPutnam distanziert sich hier von Dummett und betont, daß er \nBedeutung nicht mit einer Liste von verifizierbaren Bedingungen \n\n\nEinleitung \n14 \nidentifiziert wissen will, welche die Behauptung eines Satzes rechtfertigen \nwürden. Wahrheit würde dann zu Berechtigung, sie sollte aber idealisierte \nBerechtigung sein.13 Bedeutung (und damit Wahrheit) kann nicht \nvollkommen unabhängig von menschlichen epistemischen Möglichkeiten \nsein, sollte aber nicht auf gegenwärtig für uns verfügbare Anhaltspunkte \neingeschränkt werden. Ohnehin will Putnam nicht wieder von einem \nReduktionismus eingefangen werden, wie er eigentlich für Non-Realisten \ntypisch ist. \n \nDer interne Realismus bedarf zu diesem Zeitpunkt noch einiger \nPräzisierungen, und zu diesem Zweck greift Putnam auf klassische \nLiteratur der Erkenntnistheorie zurück (Locke, Berkeley, Kant). In ‹Wie \nman zugleich interner Realist und transzendentaler Realist sein kann› \n(1980, Text 6) versucht er, die Ähnlichkeit von internem Realismus und \nKants transzendentalem Idealismus zu ergründen. Dazu formuliert er \nnoch einmal die Thesen, die für metaphysischen Realismus charakteristisch \nsein sollen, um sich von ihm abzugrenzen: «Die Welt besteht aus einer \nfeststehenden Gesamtheit geistunabhängiger Gegenstände. Es gibt genau \neine wahre und vollständige Beschreibung davon, ‹wie die Welt ist›; \nWahrheit beinhaltet eine Art von Entsprechungsbeziehung zwischen \nWörtern oder Gedankenzeichen und äußeren Dingen sowie Mengen von \nDingen.» (Man könnte hinzufügen: Die Gegenstände, die wahre \nBeschreibung und die Entsprechungsbeziehung sind unabhängig von den \nmenschlichen Erkenntnismöglichkeiten zu rekonstruieren). Dem so \ndefinierten metaphysischen Realisten ist vor allem vorzuwerfen, daß er \nseine eigene epistemische Position ignoriert und so tut, als könne er die \nWelt und das Erkennen der Welt quasi von außen, aus der Perspektive \neines Gottes betrachten. Der interne Realist hält mit Kant dagegen, daß wir \nnur von einer Welt für uns reden können, nicht von den Dingen an sich — \nauf die Dinge an sich können wir nicht referieren. In diesem Text (der auf \neinem Kongreß in Österreich vorgetragen wurde) wird der Versuch sehr \n\n\nEinleitung \n15 \ndeutlich, an ‹kontinentale› Traditionen anzuknüpfen und internen \nRealismus \nals \neine \nklassisch \nerkenntnistheoretische \nPosition \nzu \nformulieren.  \n \nIn ‹Warum es keine Fertigwelt gibt› (1982, Text 7) holt Putnam zum \ngroßen Schlag gegen die beherrschende metaphysische Auffassung aus, die \nzum Teil ein Kind seiner eigenen früheren Philosophie ist: den \nMaterialismus. Man hatte die ‹kausale Theorie der Referenz› des frühen \nPutnam \nund \nKripke \n(1972) \nzu \neiner \n‹physikalistischen› \noder \n‹naturalistischen› \nTheorie \n(so \ndie \nmodernen, \n‹wissenschaftlichen› \nBezeichnungen \nfür \nMaterialismus) \nausgebaut \nund \nmeinte, \ndie \nKausalbeziehung zwischen Gegenstand und Ausdruck werde eine \nReferenzbeziehung auf quasi natürliche Weise auszeichnen. Der Ausdruck \nreferiere auf das, wozu er in einer Kausalbeziehung der richtigen Art steht. \nReferenz wird auf Kausalität reduziert. Diese ‹Metaphysik innerhalb der \nGrenzen der bloßen Wissenschaft› versucht, ganz ohne intentionale \nBegriffe auszukommen. \n \nPutnam will vor allem zeigen, daß der Begriff der Kausalität selbst \nkein physikalischer Begriff ist — zumindest gelte das für jenen Begriff der \n‹erklärenden› Kausalität, den der Materialist benötigt. Kausalität kann also \nnicht das leisten, was ihr von kausalen Referenztheoretikern aufgebürdet \nwird. Allgemein verwirft er den metaphysischen Versuch, von den ‹in der \nWelt da draußen› vorhandenen Gegenständen zu sprechen, von der Welt, \ndie schon fertig vorliegt, bevor wir sie erkennen. Der Materialismus ist der \nletzte große Entwurf dieser Art, der noch eine nennenswerte Zahl von \nAnhängern besitzt. \n \n4 \nDer interne Realismus scheint nun genügend vom metaphysischen \nRealismus abgegrenzt zu sein, und Putnam hat sich ‹kontinentalen› \nAuffassungen genähert, welche die Frage, «Was kann ich wissen?»14 mit \n\n\nEinleitung \n16 \ndem Hinweis auf die Grenzen von Erkenntnis beantworten. Ist Putnam \ndamit aber nicht einem Relativismus verfallen? Gestattet interner \nRealismus nicht beliebige Wahrheiten, je intern zu einem begrifflichen \nSchema, das ich mir aussuche? Fällt nicht so alles der Beliebigkeit anheim? \nPutnam will aus dem Scheitern des metaphysischen Realismus keineswegs \ndiese relativistische Konsequenz ziehen, sondern versucht, auf des Messers \nSchneide zu wandeln: interner Realismus, aber nicht Relativismus. \n \nDer für eine französische Enzyklopädie geschriebene Text 8 ‹Wozu \ndie Philosophen?› (1986) bietet vor allem eine philosophiehistorische \nEinordnung von Putnams durch Putnam und eine Rekapitulation der \nArgumente gegen metaphysischen Realismus. Putnam betont, daß er den \nPositivismus als eine Spielart des Idealismus ansieht, die im Endeffekt auf \nRelativismus hinausläuft (seine alten Gegner sind also auch nicht ohne \ndiese Schwierigkeit), was sich an Quines Lehre von der ontologischen \nRelativität (1969) illustrieren läßt. Er lehnt weiterhin die mißliche \nAlternative zwischen Reduktionismus (wie dem Positivismus) und \nmetaphysischen Positionen (wie dem Materialismus) ab, sieht aber keinen \nGrund, daraus zu schließen, es gebe keine besseren und schlechteren \nKontexte, innerhalb derer dann Realismus ‹intern› sein kann. Es gibt da \nvernünftige und weniger vernünftige Entscheidungen. \n \nAußerdem findet sich eine konzise Darstellung seiner berühmten \nWiderlegung des skeptischen Arguments, daß wir alle uns ständig irren \nkönnten, weil wir etwa ‹Gehirne im Tank› sind. Putnam meint, ein Gehirn \nim Tank kann nicht auf ein Gehirn im Tank referieren. Bedeutungen sind \nnicht im Kopf. \n \nDie Frage von verschiedenen gleich guten Beschreibungen, wird in \nder zentralen Lehre von der ‹begrifflichen Relativität› deutlicher, wie sie \nvor allem in Text 9 ‹Realismus mit menschlichem Antlitz› (1987/90) \nentfaltet wird. Es kann durchaus mehrere Arten und Weisen geben, über \neinen Sachverhalt zu reden, zwischen denen es nichts zu wählen gibt (man \n\n\nEinleitung \n17 \nerinnere sich an ‹Modelle und Wirklichkeit›). Hierfür werden mehrere \nBeispiele gegeben, wobei Putnam auf seinen reichen Fundus an \nwissenschaftlichen Kenntnissen zurückgreift. Er diskutiert die Deutung \nder Quantenmechanik sowie die Lügnerparadoxie und interpretiert diese \nals Hinweise auf die Vergeblichkeit der Suche nach der einen wahren \nWissenschaft, zu der alles Wissen konvergiert. Es wird immer mehrere \nTheorien geben, aber das schadet auch gar nichts, solange diese mit \nverschiedenen Begriffen arbeiten. Solange man sich vor Augen hält, daß \nWissenschaft nicht von den Kantischen Dingen an sich handelt, sondern \nvon Dingen für uns, wird man sich nicht wundern, daß wir verschiedene \nTheorien haben können, die empirisch äquivalent sind, für uns keinen \nUnterschied machen — und das heißt eben, es gibt keinen relevanten \nUnterschied zwischen ihnen (was ein metaphysischer Realist bestreiten \nwürde). \n \nIm zweiten Teil des Essays setzt Putnam sich mit Richard Rorty \nauseinander, einem Philosophen, der aus der analytischen Schule stammt, \naber inzwischen das Ende der analytischen Philosophie verkündet (1979) \nund das ganze Problem der ‹Repräsentation› oder ‹Darstellung› von Welt \nfür fehlgeleitet hält — was bedeutet, er betrachtet den Streit zwischen \nAntirealisten und Realisten als Scheindebatte. Genau das hält Putnam aber \nfür den Versuch, vom Standpunkt eines Gottes aus zu sagen, es gebe \nkeinen Standpunkt eines Gottes; für den Versuch, metaphysisch zu sagen, \nes gebe keine Metaphysik. Das Scheitern des Projekts ‹Metaphysik› hat \nallerdings nach Putnam nicht die große kulturelle Bedeutung, welche \nRorty ihr im Anschluß an französische Philosophen zuschreibt. \n \nAuffällig ist, daß sich Putnam in den letzten drei Texten dieses \nBandes mit französischer Philosophie beschäftigt. Zumindest wenn er an \nRelativismus denkt, fallen ihm offensichtlich Namen wie Derrida oder \nFoucault ein. Die französische Gegenwartsphilosophie gibt noch am \n\n\nEinleitung \n18 \nehesten einen Widerpart zur analytischen Philosophie ab, an dem zu \nreiben sich lohnt. \n \nEin weiterer Versuch der Näherung stellt Text 10 dar, ‹Irrealismus \nund Dekonstruktion› (1992). Putnam befaßt sich hier mit der Philosophie \nseines älteren Kollegen in Harvard, Nelson Goodman, und zugleich mit \nJaques Derrida. Als Reaktionen auf Physikalismus und Szientismus sind \nihm diese Positionen sympathisch, er meint jedoch, sie schütten das Kind \nmit dem Bade aus. Zur Bewertung von Goodmans Philosophie diskutiert \nPutnam die Fragen «Haben wir die Sterne gemacht?» und «Haben wir den \nGroßen Wagen gemacht?», wobei noch einmal das Problem der \nbegrifflichen Relativität verdeutlicht wird. Putnam bleibt Realist, insofern \ner weiterhin einen wesentlichen Unterschied zwischen Fragen der \nKonvention (Was gehört zum Großen Wagen?) und Fragen der Fakten in \nder Welt (Ist das ein Stern?) sieht, der sich wiederum als Unterschied in \nder jeweils angemessenen Theorie der Bedeutung formulieren läßt. Die \nBedeutung von ‹Stern› muß anders rekonstruiert werden als die von \n‹Großer Wagen›. \n \nDie Näherung an Derridas ‹Dekonstruktion› fällt sichtlich schwer, \naber allein die ernsthafte Auseinandersetzung bezeugt eine für einen \nführenden analytischen Philosophen noch vor kurzem schwer vorstellbare \nWertschätzung. Derrida wird allerdings gleich eines alten Fehlers \nbezichtigt: Relativisten definieren ‹Wissen› typischerweise mit extrem \nhohen Standards um dann zu dem Schluß zu kommen, diese könnten nicht \nerreicht werden. Auch Derridas Kritik am ‹Logozentrismus› hält Putnam \nnicht nur für verfehlt, sondern sogar für gefährlich; denn sie laufe Gefahr \nethisch verwerfliche Handlungsweisen unkritisiert zu lassen. Sein Resumee \nlautet: «Dekonstruktion ohne Rekonstruktion ist Unverantwortlichkeit.» \n \nIn Putnams Denken zeigt sich die allgemeine Annäherung der \nanalytischen Philosophie an ‹kontinentale›, traditionelle Fragestellungen \nund Autoren. Die führenden Namen in den angloamerikanischen Ländern \n\n\nEinleitung \n19 \nsind nicht mehr dieselben wie noch von 20 Jahren. Leute wie Putnam und \nRorty, Williams, Dennett, Nagel, Kripke und Davidson oder auch Kuhn \nund Feyerabend haben je auf ihre Weise Annäherung versucht. Der \nvorliegende Band soll dazu beitragen, daß die Annäherung eine \ngegenseitige bleibt. \n \n5 \nWie viele andere angelsächsische Autoren schreibt Putnam (vor allem in \nseinen früheren Schriften) für ein Publikum, das ‹schon weiß, was gemeint \nist›, wenn er einen Namen erwähnt. Die lästige Pflicht, genauere \nLiteraturhinweise zu machen, wurde hier vom Herausgeber nachgeholt. \nAlles, was nicht von Putnam stammt, ist zur Warnung in eckige Klammern \neingeschlossen. Es finden sich dort auch einige Verweise auf andere Stellen \nbei Putnam, innerhalb und außerhalb dieses Bandes. Erklärende \nAusführungen und Erläuterungen zur Übersetzung wird man allerdings \nvergeblich suchen. \n \nWie in den jeweiligen Fußnoten mit Sternchen* zu erkennen, geben \ndie Übersetzungen den jeweils letzten autorisierten Text wieder. Das führt \nteilweise dazu, daß anachronistisch erscheinende, von Putnam später \nhinzugefügte Verweise auf später erschienene Texte auftauchen. Es wurde \nversucht, einen deutschen Text so zu schreiben, wie er wohl lauten würde, \nwenn Putnam zum betreffenden Zeitpunkt als Muttersprachler auf \nDeutsch geschrieben hätte. Das heißt, weder auf Deutsch so zu schreiben, \nwie Putnam auf Englisch geschrieben hat, noch das, was er sagen wollte, so \nzu schreiben, wie es der Übersetzer auf Deutsch geschrieben hätte. Im \nRegister findet sich bei einer Reihe von Einträgen der englische Ausdruck \nin Klammern. Man kann dort also nachsehen, wie ein deutscher Ausdruck \nim Englischen lautete.15 \n \nHilary Putnam bin ich für Hilfe bei der Bibliographie ab 1992 und \nvor allem für die Beantwortung zahlreicher Fragen zur Übersetzung \n\n\nEinleitung \n20 \nverpflichtet. Der vorliegende Text enthält eine Reihe von daraus \nresultierenden Korrekturen gegenüber den Originalen. Für vielfältige \nUnterstützung danke ich besonders Sophia Voulgari, Mark Sainsbury, \nDavid Papineau und Stathis Psillos, King’s College London; Rom Harré \nund Peter M. S. Hacker, Oxford; Burghard König und Wolfgang Künne, \nHamburg sowie Frank Mathwig, Marburg. \n \nHamburg, im August 1993 \nV. C. M. \n \n \n \nAnmerkungen \n1 \nJohn Passmore, Recent Philosophers. A Supplement to A Hundred Years of \nPhilosophy, Duckworth, London 1985, 97. Passmores sehr lesenswerte Darstellung \nbehandelt die analytische Philosophie zwischen 1965 und 1985. \n2 \nBezüge auf Putnams Schriften stets durch den Titel (auf Deutsch, falls \nÜbersetzungen vorhanden sind) und einen Verweis auf die Stelle in der Bibliographie: \nJahreszahl der Erstpublikation (1990), Art des Textes (I) und laufende Nummer (13). Auf \nLiteratur anderer Autoren mit Nachname, Jahreszahl. Die relevante Literatur wurde bei \nden jeweiligen Texten in Anmerkungen nachgeliefert, also bleiben die Verweise in dieser \nEinleitung spärlich. Echte Sekundärliteratur gibt es ohnehin kaum; man konsultiere aber \ndie Zeitschriftenbände mit Repliken Putnams (Erkenntnis 34, 1991 und Philosophical \nTopics 20, 1992) sowie den Band: George Boolos (Hg.): Meaning and Method: Essays in \nHonor of Hilary Putnam, Cambridge University Press, Cambridge 1990. Im Erscheinen \nsind: Bob Hale/ Peter Clarke (Hg.): Reading Putnam. Proceedings of the 1990 Gifford \nConference at St. Andrews, Basil Blackwell, Oxford 1993; und auch John \nHaldane/Crispin Wright (Hg.): Reality: Representation and Projection, Oxford \nUniversity Press, Oxford 1993. \n3 \nWie etwa bei Vernunft, Wahrheit und Geschichte (1981, I-6) und Realität und \nRepräsentation (1988, I-11). \n4 \nDer nicht dort abgedruckte Aufsatz von Putnam und Paul Oppenheim über die \nEinheit der Wissenschaft (1958, II-11) ist 1970 in deutscher Übersetzung erschienen (III-\n1). \n5 \nPutnams Schriften zu diesem Thema sind in Anmerkung 21 zu Text 3 aufgelistet. \n6 \nSiehe etwa ‹The Analytic and the Synthetic› (1962, II-23), ‹How Not to Talk about \nMeaning. Comments on J. C. C. Smart› (1965, II-38) oder ‹Is Semantics Possible?› (1970, \nII-57). \n7 \nPutnam, ‹Introduction: Philosophy of Language and the Rest of Philosophy› (1975, \nII-77), X. \n8 \nEine ausführlichere Fassung der früheren realistischen Theorie der Bedeutung \neinschließlich einer Auseinandersetzung mit zeitgenössischen Alternativen findet sich in \n\n\nEinleitung \n21 \n                                                                                                                            \n«Die Bedeutung von ‹Bedeutung›?» (1975, II-86), dessen deutsche Übersetzung als \nMonographie erschienen ist. \n9 \nTarski hatte vor allem ein Adäquatheitskriterium für eine Wahrheitsdefinition \naufgestellt: Sie sollte alle Äquivalenzen der Form «‹p› ist wahr dann und nur dann, wenn \np» \nimplizieren. \nGenaueres \nund \nLiteratur, \nsiehe \nText \n5, \nAbschnitt \n‹Tarskis \nWahrheitstheorie›. \n10 \nEine ausführliche Darstellung von Putnams Philosophie zur Bedeutung und \nErkenntnis bis 1978 (dem Erscheinen von Meaning and the Moral Sciences, 1978, I-5) \nbietet \nWolfgang \nStegmüller \nin \nBand \nII, \nseiner \nHauptströmungen \nder \nGegenwartsphilosophie, Kröner, Stuttgart, 7. erw. Aufl. 1987, 345–467. \n11 \nInsbesondere wird die zeitlich frühere und darum bekanntere Präsentation in \n‹Realism and Reason› (1977, II-92) ignoriert, weil sich deren Argumente in späteren \nTexten prägnanter ausgedrückt finden. \n12 \nSiehe etwa Peirce/Rantala: ‹Realism and Reference›, in: Synthese 52 (1982), 439–448 \nund David Lewis: ‹Putnam’s Paradox›, in: Australasian Journal of Philosophy 62, 1984, \n221–236. \n13 \nPutnams Auffassung sollte also nicht ohne weiteres mit Konsensustheorien à la \nHabermas verwechselt werden. Dennoch fällt die Nähe von Habermas zu Diskussionen \nzwischen \nDummett, \nPutnam \nund \nvielen \nanderen \nins \nAuge. \n(J. \nHabermas: \n‹Wahrheitstheorien›, in: H. Fahrenbach (Hg.): Wirklichkeit und Reflexion, Pfullingen, \nNeske 1978.) \n14 \nKant in der Logik (Jäsche), A 26 bringt die Philosophie auf die Fragen: «Was kann \nich wissen? Was soll ich tun? Was darf ich hoffen? Was ist der Mensch?» (Werke, Bd. VI, \nhg. v. W. Weischedel, Suhrkamp, Frankfurt/Main 1968.) \n15 \nEine gewisse Kontinuität zu den Übersetzungen von W. Spohn und J. Schulte ist \ndabei gewahrt. Allerdings wurde ‹reference› hier mit dem üblichen Fachausdruck \n‹Referenz› übersetzt, während Schulte von ‹Bezug› spricht. ‹Referenz› scheint sich im \nDeutschen fest etabliert zu haben und es gibt keinen zwingenden Grund, hier \nsprachpädagogisch tätig zu werden, auch wenn ‹Bezug› sicher glatter klingt. Der \nAusdruck ‹Bezug› hat daneben den Nachteil, die Handlung des Sich-Beziehens zu \nbetonen — was dann manche Referenztheorien merkwürdiger aussehen läßt, als sie sind. \nEs steht zu hoffen, daß Putnam-Lektüre dabei hilft, folgenden Fehlschluß zu vermeiden: \n«Wäre ‹reference› ein Terminus technicus, könnte ihn jeder nach Belieben und gemäß \ndem zu erwartenden Nutzen definieren, ohne daß eine inhaltliche Auseinandersetzung \nüber den Begriff möglich wäre. Es gäbe also gar keine philosophische Problematik der \nBezugnahme!» (J. Schulte: ‹Peter Frederick Strawson›, in: A. Hügli/P. Lübke (Hg.): \nPhilosophie im 20. Jahrhundert, Band 2, Wissenschaftstheorie und Analytische Philosophie, \nRowohlt, Reinbek 1993, S. 446, Anm. 1.) \n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21131v1.pdf",
    "total_pages": 21,
    "title": "Einleitung [Introduction]",
    "authors": [
      "Vincent C. Müller"
    ],
    "abstract": "Hilary Putnam's biography and philosophical development reflect the history\nof Anglo-Saxon philosophy over the last 40 years. Putnam has influenced this\nhistory significantly for almost as long. In this introduction, the main aim is\nto present the context in which Putnam stands and from which his philosophical\ncontributions can be understood. In the context of a sketch of Putnam's\nphilosophical development, a preliminary historical classification of his work\nwill also be attempted, even if this is not the place for a comprehensive\ncritique or presentation: The introduction must remain at a fairly elementary\nlevel and of course cannot replace a reading of the texts. Since Putnam's work\nis certainly part of a rapprochement between 'analytic' and 'continental'\nphilosophy, the introduction to the texts translated here should finally make\nclear what Putnam has to offer non-analytically oriented readers.\n  Hilary Putnams Biographie und philosophische Entwicklung spiegeln die\nGeschichte der angels\\\"achsischen Philosophie in den letzten 40 Jahren. Beinahe\nebenso lange hat Putnam diese Geschichte wesentlich beeinflu{\\ss}t. In der\nvorliegenden Einleitung soll vor allem der Kontext dargestellt werden, in dem\nPutnam steht und aus dem heraus verst\\\"andlich wird, was er philosophisch zu\nsagen hat. Im Rahmen einer Skizze von Putnams philosophischer Entwicklung soll\nzudem eine vorl\\\"aufige philosophiehistorische Einordnung versucht werden, auch\nwenn hier nicht der Ort f\\\"ur eine umfassende Kritik oder Darstellung sein\nkann: Die Einleitung mu{\\ss} auf recht elementarem Niveau bleiben und kann eine\nLekt\\\"ure der Texte nat\\\"urlich nicht ersetzen. Da Putnams Werk sicherlich Teil\neiner Ann\\\"aherung von 'analytischer' und 'kontinentaler' Philosophie ist, soll\nbei der Einf\\\"uhrung in die hier \\\"ubersetzten Texte schlie{\\ss}lich deutlich\nwerden, was Putnam nicht analytisch orientierten Lesern zu bieten hat.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}