{
  "id": "arxiv_2502.20737v1",
  "text": "arXiv:2502.20737v1  [math.CV]  28 Feb 2025\nIntegral formulas and Teodorescu transform\nfor generalized partial-slice monogenic func-\ntions\nManjie Hu, Chao Ding, Yifei Shen and Jiani Wang\nAbstract. The theory of generalized partial-slice monogenic functions is\nconsidered as a syhthesis of the classical Cliﬀord analysis and the theory\nof slice monogenic functions. In this paper, we investigate the Cauchy\nintegral formula and the Plemelj formula for generalized partial-slice\nmonogenic functions. Further, we study some properties of the Teodor-\nescu transform in this context. A norm estimation for the Teodorescu\ntransform is discussed as well.\nMathematics Subject Classiﬁcation (2010). 30G35 , 32A30 , 44A05.\nKeywords. Generalized partial-slice monogenic functions, Teodorescu\ntransform, Cauchy-Pompeiu integral formula, Plemelj-Sokhotski formu-\nla.\n1. Introduction\nClassical Cliﬀord analysis is a mathematical ﬁeld that extends the concepts\nof complex analysis to higher-dimensional spaces through the use of Cliﬀord\nalgebras. It centers around the study of monogenic functions (null solutions\nto the Dirac operator), which has been fully developed in the last decades.\nMore details can be found, for instance, in [3,11,14,17,25].\nA signiﬁcant diﬀerence between classical Cliﬀord analysis and complex\nanalysis is that polynomials formulated with vectors in higher dimensions\nare no longer monogenic anymore due to the non-commutativity of multi-\nplication of Cliﬀord numbers. A consequence of this is that theory of series\nexpansion is not as simple as in complex analysis. In 2010, Colombo, Saba-\ndini, and Struppa [9] extended this concept to the broader context of Cliﬀord\nalgebras, introducing the notion of slice monogenic functions. These func-\ntions were initially deﬁned as those that are holomorphic on each slice within\nEuclidean space, serving as a localized deﬁnition for slice regular functions.\nMore importantly, polynomials given in terms of vectors are monogenic in\n\n\n2\nManjie Hu, Chao Ding, Yifei Shen and Jiani Wang\nthis context, and consequently, numerous ﬁndings pertaining to slice mono-\ngenic functions are formulated in terms of slices, including nicely formulated\nTaylor and Laurent series expansions. For instance, in [16], the authors estab-\nlish an identity principle for slice regular functions in slice topology domains,\ngeneralize slice function deﬁnitions to arbitrary H subsets. In [2], the au-\nthor constructed three second-order diﬀerential operators with slice regular\nfunctions in their kernels, conﬁrming that slice regular functions over H are\nharmonic in a sense. In [13], the authors present the construction of a regular\nand non-commutative Cauchy kernel for slice regular quaternionic functions,\nalong with its formula yielding a novel Cauchy formula. [8] introduces a new\nmonogenicity concept for Cliﬀord algebra-valued functions from Rn+1 to Rn,\ninspired by [19] and [20], and derives a corresponding Cauchy integral for-\nmula.\nIn 2013, Colombo et al. [12] presented a global diﬀerential operator G\nwith non-constant coeﬃcients, whose zero solutions exhibit a strong connec-\ntion to slice monogenic functions under suitable domain conditions. Conse-\nquently, a theoretical framework centered around the diﬀerential operator\nG has emerged, analogous to the important role of the Cauchy-Riemann\noperator in single-variable complex analysis. Subsequently, this global diﬀer-\nential operator for slice regularity has gained signiﬁcant research attention.\nFor example, [24] establish a framework of global diﬀerential equations for\nslice regular functions over real alternative algebras, reﬁning quaternionic\nand slice monogenic results and generalizing them. They introduce diﬀer-\nential operators ϑ and ¯ϑ extending ∂/∂x and ∂/∂xc to ΩD\\R, elucidating\ntheir expressions in quaternions, octonions, and Cliﬀord algebras, and the\nconnection to slice regularity.\nThe theory of slice monogenic functions also has deep motivations in\nquantum mechanics. Back to 1930s, Birkhoﬀand von Neumann showed that\nquantum mechanics can be formulated over the real, the complex, and the\nquaternionic numbers. However, the spectral theory of quaternion linear op-\nerators has not been eﬀectively developed for a long time. This is mainly\nbecause the understanding of the spectral concept of quaternion linear op-\nerators is not deep enough, resulting in the inability to eﬀectively construct\nquaternion spectral theory. In 2006 , using techniques based solely on slice\nhyperholomorphic functions, the precise notion of spectrum of a quaternionic\nlinear operator, also known as S-spectrum, was identiﬁed by F. Colombo and\nI. Sabadini. The proposal of this concept laid a solid foundation for the devel-\nopment of quaternion spectrum theory. Since then the literature in quater-\nnionic spectral theory has rapidly grown, and much work has contributed to\nthis topic, see e.g. [1,4–7,21,22].\nIn [27, 28], the authors introduce a novel class of functions and oper-\nators, notably incorporating classical monogenic functions and slice mono-\ngenic functions as two particular instances. The main goal of this article\nis to develop integral formulas and Teodorescu transform in theory of gen-\neralized partial-slice monogenic functions. This provides important tools to\n\n\nTeodorescu transform for generalized partial slice monogenic functions 3\nstudy some diﬀerential equations (such as Beltrami equations) and Dirichlet\nproblems related to partial-slice monogenic functions.\nThis paper is organized as follows. In Section 2, we comprehensively\nreview the fundamental principles of Cliﬀord algebras and delve into the\nbasic deﬁnitions of monogenic and slice monogenic functions. Section 3 is\ndevoted to an introduction to the operator notations and pivotal theorems\npertaining to Generalized slice monogenic functions, which are central to\nour investigation. Extensions for the newly deﬁned Teodorescu operator to\nvarious important theorems and corollaries are given in Section 4.\n2. Preliminaries\nIn this section, we review some deﬁnitions and notations in Cliﬀord algebras,\nas well as the theories of monogenic functions and slice monogenic functions.\nMore details can be found in [3,10,14,18].\n2.1. Cliﬀord algebras\nLet {e1, e2, · · · , en} be the standard orthonormal basis for the n-dimensional\nreal Euclidean space Rn. The real Cliﬀord algebra, denoted by Rn, is con-\nstructed from these basis elements with the relations eiej +ejei = −2δij, 1 ⩽\ni, j ⩽n, where δij is the Kronecker symbol. Consequently, any element\na ∈Rn can be expressed in the form a = P\nA aAeA, aA ∈R, where\neA = ej1ej2 · · · ejr, A = {j1, j2, · · · , jr} ⊆{1, 2, · · · , n} and 1 ⩽j1 < j2 <\n· · · < jr ⩽n, e∅= e0 = 1.\nFor each integer k = 0, 1, · · · , n, the real linear subspace of Rn, denoted\nby Rk\nn and referred to as k-vectors, is generated by the binomial coeﬃcient\n\u0000 n\nk\n\u0001\nelements of the form eA = ei1ei2 · · · eik, 1 ⩽i1 < i2 < · · · < ik ⩽n.\nIn particular, the element [a]0 = a∅is called the scalar part of a. Further,\nthe so-called paravectors, which is a crucial subset of Cliﬀord numbers Rn,\nare elements in R0\nn ⊕R1\nn. This subset is subsequently associated with Rn+1\nthrough the following mapping\nRn+1 −→R0\nn ⊕R1\nn,\n(x0, x1, · · · , xn) 7−→x = x0 + x =\nn\nX\ni=0\neixi.\nNow, we introduce some involutions in Rn as follows.\n• Cliﬀord conjugation: The Cliﬀord conjugation of a = P\nA aAeA ∈Rn is\ndeﬁned as\na =\nX\nA\naAeA,\nwhere ej1 · · · ejr = ej1 · · · ejr, ej = −ej, 1 ⩽j ⩽n, e0 = e0 = 1.\n\n\n4\nManjie Hu, Chao Ding, Yifei Shen and Jiani Wang\n• Cliﬀord reversion: The Cliﬀord reversion of a = P\nA aAeA ∈Rn is\ndeﬁned as\n˜a =\nX\nA\naAf\neA,\nwhere\n^\nej1 · · · ejr = ejr · · · ej1 and eab = ˜b˜a for a, b ∈Rn.\nThe norm of a ∈Rn is formally deﬁned as |a| = [aa]0 =\n\u0010P\nA |aA|2\u0011 1\n2 .\nIn particular, the norm of a nonzero paravector x is given by |x| = (x¯x)\n1\n2 ,\nand so its inverse is given by x−1 =\n¯x\n|x|2 .\n2.2. Monogenic and slice monogenic functions\nNow, we review some deﬁnitions and preliminaries in the theory of monogenic\nfunctions as well as those in the theory of slice monogenic functions. One can\nﬁnd more details in [3,10,14,18].\nDeﬁnition 2.1 (Monogenic functions). Let Ω⊂Rn+1 be a domain and f :\nΩ−→R be a real-valued diﬀerentiable function. A function f = P\nA eAfA is\nleft monogenic in Ωif it satisﬁes the generalized Cauchy-Riemann equation\nDf (x) = Pn\ni=0 ei ∂\n∂xi f(x) = 0, x ∈Ω, where D is called the generalized\nCauchy-Riemann operator. Since multiplications of Cliﬀord numbers are not\ncommutative in general, there is a similar deﬁnition for right monogenic.\nRemark. Comparing with the generalized Cauchy-Riemann operator, the op-\nerator ∂x = Pn\ni=1 ei ∂\n∂xi is known as the classical Dirac operator in Rn. In\nCliﬀord analysis, both the null-solutions of the generalized Cauchy-Riemann\noperator and those of the Dirac operator are known as monogenic functions.\nOne can observe that every non-real paravector in the space Rn+1 can\nbe expressed in the form of\nx = x0 +\nn\nX\ni=1\nxiei =: x0 + x = x0 + rω,\nwhere r = |x| =\n\u0000Pn\ni=1 x2\ni\n\u0001 1\n2 and ω = x\n|x|, which is uniquely speciﬁed with\nproperties similar to a classical imaginary unit. In other words,\nω ∈Sn−1 =\n\b\nx ∈Rn+1 : x2 = −1\n\t\n.\nWhen x is real, then r = 0 and for every ω ∈Sn−1 one can write x = x+ω·0.\nDeﬁnition 2.2 (Slice monogenic functions). Let Ω⊂Rn+1 be a domain and\na function f : Ω−→Rn is (left) slice monogenic if, for every direction\nω ∈Sn−1, the function fω restricted to the subset Ωω = Ω∩(R ⊕ωR) ⊆R2\nexhibits holomorphicity, meaning it possesses continuous partial derivatives\nand fulﬁlls the condition\n(∂x0 + ω∂r) fω (x0 + rω) = 0\nfor all points x0 + rω ∈Ωω.\n\n\nTeodorescu transform for generalized partial slice monogenic functions 5\nThere is also an alternative approach to deﬁne slice monogenic functions\ngiven by Ghiloni and Perotti [23] in 2011 with the concept of stem functions.\nMany works in the theory of slice monogenic functions have been done with\nthis approach, for instance, [15,24,26]. We will review this in a more general\nsetting in the following section.\n3. Generalized partial-slice monogenic functions\nIn [27,28], the authors generalized slice monogenic functions to the so-called\ngeneralized partial-slice monogenic functions. In particular, they pointed out\nthat the theory of generalized partial-slice monogenic functions is a synthesis\nof classical Cliﬀord analysis and the theory of slice monogenic functions. Here,\nwe review some deﬁnitions and properties needed for the rest of this article.\nFor more systematic details, we refer the reader to [27,28].\nLet p and q be non-negative and positive integers, respectively. We con-\nsider functions f : Ω−→Rp+q, where Ω⊂Rp+q+1 is a domain. An element\nx ∈Rp+q+1 = Rp+1 ⊕Rq, can be identiﬁed with a paravector in Rp+q in the\nfollowing manner\nx = xp + xq ∈Rp+1 ⊕Rq, xp =\np\nX\ni=0\nxiei, xq =\np+q\nX\ni=p+1\nxiei.\nIn this context, we deﬁne the generalized Cauchy-Riemann operator and the\nEuler operator as\nDx =\np+q\nX\ni=0\nei∂xi =\np\nX\ni=0\nei∂xi +\np+q\nX\ni=p+1\nei∂xi =: Dxp + Dxq,\nEx =\np+q\nX\ni=0\nxi∂xi =\np\nX\ni=0\nxi∂xi +\np+q\nX\ni=p+1\nxi∂xi =: Exp + Exq.\nNote that in these deﬁnitions, we have utilized the notation Dxp and Dxq\nto represent the operators acting on the components xp and xq respectively,\nand similarly for the Euler operators.\nWe use S to represent the unit sphere in Rq, where its elements is de-\nnoted by xq = Pp+q\ni=p+1 xiei, fulﬁlling the condition\nS =\n\b\nxq : xq\n2 = −1\n\t\n=\n\n\nxq =\np+q\nX\ni=p+1\nxiei :\np+q\nX\ni=p+1\nxi2 = 1\n\n\n.\nIt is noteworthy that for any non-zero xq, there exists a unique positive real\nnumber r ∈R+ and a unique unit vector ω ∈S, which represents the direction\nof xq, such that xq = rω, where\nr =\n\f\fxq\n\f\f , ω = xq\n\f\fxq\n\f\f.\n\n\n6\nManjie Hu, Chao Ding, Yifei Shen and Jiani Wang\nIf xq = 0, we set r = 0, and ω is not uniquely determined, in other words,\nxq = 0 = xp + ω · 0 for arbitrary ω ∈S.\nFor an open set Ω⊂Rp+q+1, we introduce the notation\nΩω := Ω∩\n\u0000Rp+1 ⊕ωR\n\u0001\n⊆Rp+2,\nwhich deﬁnes a subset of Rp+2 by intersecting Ωwith the subspace spanned\nby Rp+1 and the line through the origin determined by ω. In order to develop\na theory of generalized partial-slice monogenic functions, we also need some\nrestrictions on the domains considered.\nDeﬁnition 3.1. Let Ωbe a domain in Rp+q+1, and Ωis called partially sym-\nmetric with respect to Rp+1 (or p-symmetric for short) if, for xp ∈Rp+1,\nr ∈R+, and ω ∈S,\nx = xp + rω ∈Ω=⇒[x] := xp + rS = {xp + rω, ω ∈S} ⊆Ω.\nNow, we review the approach to study the theory of generalized partial-\nslice functions with the concept of stem functions as follows.\nDeﬁnition 3.2. A function F : D −→Rp+q ⊗R C in an open set D ⊆Rp+2,\nwhich is invariant under the reﬂection of the (p + 2)-th variable, is called\na stem function provided its Rp+q-valued components, F1 and F2, where\nF = F1 + iF2, fulﬁll the conditions\nF1 (xp, −r) = F1 (xp, r) ,\nF2 (xp, −r) = −F2 (xp, r) ,\n(xp, r) ∈D. (3.1)\nEach stem function F induces a (left) generalized partial-slice function f =\nI(F) from ΩD to Rp+q, deﬁned as\nf (x) := F1 (x′) + ωF2 (x′) ,\nx′ = (xp, r) , x = xp + rω ∈Rp+q+1, ω ∈S.\nDeﬁnition 3.3. Let D ⊆Rp+2 be a domain, which is invariant under the\nreﬂection of the (p + 2)-th variable. The p-symmetric completion ΩD ⊂Rp+q\nof D is deﬁned by\nΩD =\n[\nω∈S\n\b\nxp + rω : ∃xp ∈Rp+1, r ≥0, (xp, r) ∈D\n\t\n.\nNote that a domain Ω⊂Rp+q+1 is p-symmetric if and only if there\nexists a domain D ⊂Rp+2 such that Ω= ΩD. In the rest of the article, we\nuse ΩD to stand for a p-symmetric domain in Rp+q+1.\nNow, we denote the set of all induced generalized partial-slice functions\non ΩD by\nGS (ΩD) := {f = I (F) : F is a stem function on D} .\nDeﬁnition 3.4. Let f ∈GS(ΩD). The function f is called generalized partial-\nslice monogenic of type (p, q) if its stem function F = F1 + iF2 satisﬁes the\nfollowing generalized Cauchy-Riemann equations\n(\nDxpF1 −∂rF2 = 0,\nDxpF2 −∂rF1 = 0.\n\n\nTeodorescu transform for generalized partial slice monogenic functions 7\nSimilar as the case of slice functions, there is also a representation for-\nmula for generalized partial-slice functions of type (p, q) as follows.\nTheorem 3.5 (Representation Formula). [27] Let f ∈GS (ΩD). Then it holds\nthat, for every x = xp + rω ∈ΩD with ω ∈S,\nf (x) = (ω −ω2) (ω1 −ω2)−1 f (xp + rω1)\n−(ω −ω1) (ω1 −ω2)−1 f (xp + rω2) ,\n(3.2)\nfor all ω1 ̸= ω2 ∈S. In particular, if ω1 = −ω2 = η ∈S, we have\nf (x) = 1\n2\n\u00001 −ωη\n\u0001\nf\n\u0000xp + rη\n\u0001\n+ 1\n2\n\u00001 + ωη\n\u0001\nf\n\u0000xp −rη\n\u0001\n= 1\n2\n\u0000f\n\u0000xp + rη\n\u0001\n+ f\n\u0000xp −rη\n\u0001\u0001\n+ 1\n2ωη\n\u0000f\n\u0000xp −rη\n\u0001\n−f\n\u0000xp + rη\n\u0001\u0001\n.\nRecall that the Cauchy kernel to monogenic functions over Rp+2 is given\nby\nE (x) =\n1\nσp+1\nx\n|x|p+2 , x ∈Rp+2 \\ {0},\nwhere σp+1 = 2\nΓp+2( 1\n2)\nΓ( p+2\n2 ) is the surface area of the unit sphere in Rp+2. With\nthe representation formula for generalized partial-slice monogenic functions\ngiven in Theorem 3.5, it is natural to deﬁne the generalized partial-slice\nCauchy kernel as follows.\nDeﬁnition 3.6. Given y ∈Rp+q+1, we call the function Ey (·) left generalized\npartial-slice Cauchy kernel deﬁned by\nEy (x) = 1\n2\n\u00001 −ωη\n\u0001\nEy\n\u0000xp + rη\n\u0001\n+ 1\n2\n\u00001 + ωη\n\u0001\nEy\n\u0000xp −rη\n\u0001\n,\n(3.3)\nwhere ω, η are deﬁned as in Theorem 3.5.\nWith the Cauchy-Pompeiu formula in the theory of monogenic functions\nand the representation formula given in Theorem 3.5, a Cauchy-Pompeiu for-\nmula in the context of partial-slice monogenic functions has been discovered\nin [27] for the case when x ∈U. There is also a Cauchy integral formula for\nthe case when x ∈Rp+q+1\\U, which is stated as follows.\nTheorem 3.7 (Cauchy integral formula for the exterior domain). Let Γ denote\na Jordan surface, partitioning the space into an exterior domain denoted as\nUη\n−and an interior domain Uη\n+, for some ﬁxed η ∈S. The orientation\nof Γ is chosen such that its normal vector points towards Uη\n−. Consider the\nfunction f that is left generalized partial-slice monogenic in Uη\n−, continuously\ndiﬀerentiable in Uη\n−∪Γ, and possesses a limit value f(∞) at x = ∞. Then,\nthe following equation holds\nZ\nΓ\nEy (x) n (y) f (y)dSη (y) =\n(\n−f (x) + f (∞)\n, x ∈Uη\n−,\nf (∞)\n, x ∈Uη\n+,\n\n\n8\nManjie Hu, Chao Ding, Yifei Shen and Jiani Wang\nwhere n(y) = Pp\ni=0 ni(y)ei + np+1(y)η represents the unit exterior normal\nvector to ∂Uη at y.\nProof. We choose a sphere Γρ = {x : |x| = ρ} with suﬃciently large radius ρ\nwhich contains Γ and Uη\n+, and consider the domain Uηρ := Uη\n−∩{|x| < ρ}.\nIts boundary is ∂Uηρ := Γρ ∪(−Γ) taking into account the orientation of Γ.\nThen the Cauchy integral formula for x ∈Uηρ yields\nf (x) = −\nZ\nΓ\nEy (x) n (y) f (y) dSη (y) + f (∞)\nZ\n|y|=ρ\nEy (x) n (y) dSη (y)\n+\nZ\n|y|=ρ\nEy (x) n (y) (f (y) −f (∞)) dSη (y)\n= −\nZ\nΓ\nEy (x) n (y) f (y) dSη (y) + f (∞) + R,\nR :=\nZ\n|y|=ρ\nEy (x) n (y) (f (y) −f (∞)) dSη (y).\nFrom our assumption the inequality |f (y) −f (∞)| < ε follows for suﬃciently\nlarge ρ. If we assume moreover ρ > 2 |x| we get\n|Ey (x)| =\n1\nσp+1\n1\n|y −x|p+1 ⩽\n1\nσp+1\n2p+1\nρp+1 ,\nbecause of |y −x| ⩾|y| −|x| > ρ\n2. Then, we have\n|Ey (x)| =\n\f\f\f\f\n1\n2\n\u00001 −ωη\n\u0001\nEy\n\u0000xp + rη\n\u0001\n+ 1\n2\n\u00001 + ωη\n\u0001\nEy\n\u0000xp −rη\n\u0001\f\f\f\f\n⩽1\n2\n\f\f\u00001 −ωη\n\u0001\nEy\n\u0000xp + rη\n\u0001\f\f + 1\n2\n\f\f\u00001 + ωη\n\u0001\nEy\n\u0000xp −rη\n\u0001\f\f\n⩽1\n2\n\f\f1 −ωη\n\f\f\n1\nσp+1\n2p+1\nρp+1 + 1\n2\n\f\f1 + ωη\n\f\f\n1\nσp+1\n2p+1\nρp+1 ⩽\n2\nσp+1\n2p+1\nρp+1 .\nHence, we can obtain that\n|R| ⩽\nZ\n|y|=ρ\n|Ey (x)| |n (y)| |f (y) −f (∞)| dSη (y)\n⩽ε · 2p+2\nσp+1\nZ\n|t|=1\ndst = ε · 2p+2.\nFor ρ →∞the value ε can be chosen arbitrarily small, and the claim for\nx ∈Uη\n−is proved.\nOur proof is also valid in the inner domain Uη\n+ as then the right-hand\nside contains the value 0 instead of f (x) in the formulas above.\n□\nThe integral\nZ\nΓ\nEy (x) n (y) f (y)dSη (y)\n\n\nTeodorescu transform for generalized partial slice monogenic functions 9\nin the previous theorem is the Cauchy-type integral in the context of general-\nized partial-slice monogenic functions. The boundary behavior of this integral\nis described by a Plemelj-Sokhotski formula given below.\nTheorem 3.8 (Plemelj-Sokhotski formula). Let the function f = I (F) ∈\nGS (ΩD) with its stem function F being H¨older continuous. Suppose U is a\np-symmetric domain in Rp+q+1 such that Uη ⊂Ωη for some η ∈S. Then, at\nany regular point x ∈∂Uη, we have\nn.t. lim\nt→x\nZ\n∂Uη\nEy (t) n (y) f (y) dSη (y)\n=1\n2\n\"\n±f (x) + 2\nZ\n∂Uη\nEy (x) n (y) f (y) dSη (y)\n#\n,\nwhere the limit is taken non-tangentially (denoted as n.t. lim) with t ∈Uη\n±,\nU +\nη = Uη, and U −\nη = Ωη\\Uη. The unit exterior normal vector to ∂Uη at y is\ngiven by\nn (y) =\np\nX\ni=0\nni (y) ei + np+1 (y) η.\nProof. Let t = tp + r′ω ∈Uη\n±, x = xp + rω ∈∂Uη, x′ = (xp, r) ∈D and\nη ∈S. Let\nf (x) = F1 (x′) + ωF2 (x′) ,\nwhere the stem function F = F1+iF2 is H¨older continuous. Indeed, According\nto the Splitting Lemma in [27], there exist H¨older continuous functions F j\nA :\nD −→Rp+1 (j = 1, 2) such that\nFj =\nX\nA={i1,··· ,is}⊂{p+2,··· ,p+q}\nF j\nAeA, j = 1, 2.\nwhere eA = ei1 · · · eis, A = {i1, · · · , is} ⊂{p + 2, · · · , p + q} with i1 < · · · <\nis, and I∅= 1 when A = ∅.\nThe Plemelj-Sokhotski formula for H¨older continuous functions in [17]\ngives that\nn.t. lim\nt→x\nZ\n∂Uη\nEy\n\u0000tp + r′η\n\u0001\nn (y) F j\nA (y) dSη (y)\n= 1\n2\n\"\n±F j\nA\n\u0000xp + rη\n\u0001\n+ 2\nZ\n∂Uη\nEy\n\u0000xp + rη\n\u0001\nn (y) F j\nA (y) dSη (y)\n#\n,\nwhere the variable y = yp+˜rη ∈∂Uη should be interpreted as\n\u0000yp, ˜r\n\u0001\n∈Rp+2.\nHence, we have\nn.t. lim\nt→x\nZ\n∂Uη\nEy\n\u0000tp + r′η\n\u0001\nn (y) F (y) dSη (y)\n= 1\n2\n\"\n±F\n\u0000xp + rη\n\u0001\n+ 2\nZ\n∂Uη\nEy\n\u0000xp + rη\n\u0001\nn (y) F (y) dSη (y)\n#\n.\n\n\n10\nManjie Hu, Chao Ding, Yifei Shen and Jiani Wang\nSubstituting η for i in the stem function F within the aforementioned formula,\nwe obtain\nn.t. lim\nt→x\nZ\n∂Uη\nEy\n\u0000tp + r′η\n\u0001\nn (y) f (y) dSη (y)\n= 1\n2\n\"\n±f\n\u0000xp + rη\n\u0001\n+ 2\nZ\n∂Uη\nEy\n\u0000xp + rη\n\u0001\nn (y) f (y) dSη (y)\n#\n,\nin other words,\nf\n\u0000xp + rη\n\u0001\n= ± 2\n\u0014\nn.t. lim\nt→x\nZ\n∂Uη\nEy\n\u0000tp + r′η\n\u0001\nn (y) f (y) dSη (y)\n−\nZ\n∂Uη\nEy\n\u0000xp + rη\n\u0001\nn (y) f (y) dSη (y)\n\u0015\n.\nMoreover, the formula remains valid when the variable xp +rη is substituted\nwith xp −rη. Applying the Representation formula stated in Theorem 3.5,\nwe then deduce that\nf (xp + rω) = 1\n2\n\u00001 −ωη\n\u0001\nf\n\u0000xp + rη\n\u0001\n+ 1\n2\n\u00001 + ωη\n\u0001\nf\n\u0000xp −rη\n\u0001\n,\nfrom which we obtain the conclusion\nf (x) = ± 2\n\u0014\nn.t. lim\nt→x\nZ\n∂Uη\nEy (t)n (y) f (y) dSη (y)\n−\nZ\n∂Uη\nEy (x)n (y) f (y) dSη (y)\n\u0015\n.\nHence, we immediately have\nn.t. lim\nt→x\nZ\n∂Uη\nEy (t) n (y) f (y) dSη (y)\n=1\n2\n\"\n±f (x) + 2\nZ\n∂Uη\nEy (x) n (y) f (y) dSη (y)\n#\n,\nwhich completes the proof.\n□\n4. Norm estimates of the Teodorescu transform\nIn [27], a global non-constant coeﬃcients diﬀerential operator for C1 function\nf : Ω−→Rp+q is given by\n¯ϑf (x) = Dxpf (x) +\nxq\n\f\fxq\n\f\f2 Exqf (x) .\nThe diﬀerential operator necessitates a more cautious approach due to the\nsingularities it introduces for the\n\f\fxq\n\f\f2 term within the operator. Therefore,\nwe will adopt the notation Rp+q+1\n∗\n:= Rp+q+1\\Rp+1 for the remainder of this\narticle.\n\n\nTeodorescu transform for generalized partial slice monogenic functions 11\nThe Cauchy kernel for generalized partial-slice monogenic functions is\ndeﬁned as follows\nKy (x) =\nEy (x)\nσq−1|yq|q−1\nwhere σq−1 is the area of the (q −1) -sphere S.\nThe Cauchy-Pompeiu formula we mentioned earlier is only applicable\nto Ωη. However, by the approach applied in [15, Theorem 3.5, 3.6], we can\neasily derive the Cauchy-Pompeiu formula and the Cauchy integral formula\non the domain ΩD as follows.\nTheorem 4.1 (Cauchy-Pompeiu formula). Let ΩD ⊂Rp+q+1\n∗\nbe a bounded\ndomain as previously deﬁned, and generalized partial-slice function f ∈ker ¯ϑ.\nIf U is a domain in Rp+q+1 such that UD ⊂ΩD is a bounded domain in Rp+2\nwith smooth boundary ∂UD ⊂ΩD, then for any x ∈U, we have\nf (x) =\nZ\n∂UD\nKy (x) n (y) f (y) dS (y) −\nZ\nUD\nKy (x)\n\u0000¯ϑf\n\u0001\n(y) dσ (y),\nwhere n (y) is the unit exterior normal vector to ∂UD at y, dS and dσ stand\nfor the classical Lebesgue surface element and volume element in Rp+2, re-\nspectively.\nTheorem 4.2 (Cauchy integral formula). Let ΩD ⊂Rp+q+1\n∗\nbe a bounded\ndomain as previously deﬁned, and slice function f ∈ker ¯ϑ. Then, for any\nx ∈ΩD, we have Z\n∂ΩD\nKy (x) n (y) f (y) dσ (y) = f (x) ,\n(4.1)\nwhere n (y) represents the unit normal vector pointing outwards from the\nboundary ∂ΩD at each point y.\nIf we denote\nTΩDf (x) = −\nZ\nΩD\nKy (x) f (y) dσ (y),\nF∂ΩDf (x) =\nZ\n∂ΩD\nKy (x) n (y) f (y) dS (y),\nthen the equation in Cauchy-Pompeiu formula in Theorem 4.1 can be rewrit-\nten as\nF∂ΩDf (x) + TΩD\n\u0000¯ϑf\n\u0001\n(x) = f (x) ,\nfor x ∈ΩD. Here, TΩD is usually called the Teodorescu transform. In par-\nticular, for functions with compact support in ΩD, we get F∂ΩDf (x) = 0.\nHence, we have that\nTΩD\n\u0000¯ϑf\n\u0001\n(x) = f (x) ,\nwhich suggests that TΩD is a left inverse of ¯ϑ when acts on functions with\ncompact support. Now, we introduce the existence for TΩDf and a norm\nestimate for TΩD as follows.\n\n\n12\nManjie Hu, Chao Ding, Yifei Shen and Jiani Wang\nProposition 4.3. Suppose that ΩD ⊂Rp+q+1\n∗\nis a bounded p-symmetric do-\nmain and f ∈Lt (ΩD). Then,\n1. The integral TΩDf (x) exists everywhere in Rp+q+1\n∗\nwhen t > q;\n2. ¯ϑTΩDf = 0 in Rp+q+1\n∗\n\\ΩD;\n3. Further, when t > max{2p −1, 2q −1} and q > 1, we have\n∥TΩDf∥Lt ⩽C (t, q, ΩD) ∥f∥Lt .\nProof. In the proof below, we consistently use the letter C to represent vari-\nous ﬁnite constants. Firstly, we observe that\n|TΩDf (x)| =\n\f\f\f\f−\nZ\nΩD\nKy (x) f (y) dσ (y)\n\f\f\f\f\n⩽\nZ\nΩD\n|Ky (x) f (y)| dσ (y)\n⩽\n\u0012Z\nΩD\n|Ky (x)|s dσ (y)\n\u0013 1\ns\n∥f∥Lt ,\nwhere 1\ns + 1\nt = 1, s, t > 1. Now, we consider\nZ\nΩD\n|Ky (x)|s dσ (y)\n=C\nZ\nS+\nZ\nΩη\n\f\f\f\f\f\nEy (x)\n|yq|q−1\n\f\f\f\f\f\ns\n· |yq|q−1dση (y) dS(η)\n=C\nZ\nS+\nZ\nΩη\n\f\fαEy\n\u0000xp + ηr\n\u0001\n+ βEy\n\u0000xp −ηr\n\u0001\f\fs\n· |yq|−(s−1)(q−1)dση (y) dS(η)\n⩽C\nZ\nS+\nZ\nΩη\n\u0010\f\fy −\n\u0000xp + ηr\n\u0001\f\f−s(p+1) +\n\f\fy −\n\u0000xp −ηr\n\u0001\f\f−s(p+1)\u0011\n· |yq|−(s−1)(q−1)dση (y) dS(η),\nwhere α =\n1−ωη\n2\n, β =\n1+ωη\n2\n, S+ is the half unit sphere of S.\nNext, we only need to verify that the integral\nZ\nS+\nZ\nΩη\n\f\fy −\n\u0000xp + ηr\n\u0001\f\f−s(p+1) · |yq|−(s−1)(q−1)dση (y) dS(η)\n(4.2)\nis ﬁnite, the argument for the other one is similar.\nWe notice that ΩD ⊂Rp+q+1\n∗\nis bounded, let up = (u0, · · · , up), and\nE =\n\b\nx = up + ηv : r0 < u0, · · · , up < R, 0 < v < M, η ∈S\n\t\n,\nthen, there exist r, R, M > 0 such that ΩD ⊂E. Hence, we have\nZ\nS+\nZ\nΩη\n\f\fy −\n\u0000xp + ηr\n\u0001\f\f−s(p+1) · |yq|−(s−1)(q−1)dση (y) dS(η)\n\n\nTeodorescu transform for generalized partial slice monogenic functions 13\n⩽\nZ\nS+\nZ\nEη\n\f\fy −\n\u0000xp + ηr\n\u0001\f\f−s(p+1) · |yq|−(s−1)(q−1)dση (y) dS(η).\nWe can easily ﬁnd that all Eη are the same with η ∈S up to a rotation.\nHence, we only need to show that\nZ\nEη\n\f\fy −\n\u0000xp + ηr\n\u0001\f\f−s(p+1) · |yq|−(s−1)(q−1)dση (y)\n(4.3)\nis ﬁnite uniformly with respect to η. The singularities of the integral above\noccur in the following two cases.\n1. The singular point y = xp + ηr,\n2. Points x with xq = 0.\nLet B\n\u0000xp + ηr, ǫ0\n\u0001\n⊂Eη be a neighborhood of xp + ηr with a suﬃciently\nsmall ǫ0 and\nEǫ1 =\n\b\nup + ηv : r0 < u0, · · · , up < R, −ǫ1 < v < ǫ1\n\t\n.\nThe ﬁniteness of the integral (4.3) is equivalent the ﬁniteness of\nZ\nB(xp+ηr,ǫ0)∪Eǫ1\n\f\fy −\n\u0000xp + ηr\n\u0001\f\f−s(p+1) · |yq|−(s−1)(q−1)dση (y).\nOn the one hand, let y = sζ , ζ ∈S, then we have\nZ\nB(xp+ηr,ǫ0)\n\f\fy −\n\u0000xp + ηr\n\u0001\f\f−s(p+1) · |yq|−(s−1)(q−1)dση (y)\n⩽C (x, t, q, ΩD)\nZ ǫ0\n0\nZ\nS\nrp+1−s(p+1)dsdS (ζ) < ∞,\nwith t > q. On the other hand, recall that y = up +ηv ∈Eǫ1, then we obtain\nZ\nEǫ1\n\f\fy −\n\u0000xp + ηr\n\u0001\f\f−s(p+1) · |yq|−(s−1)(q−1)dση (y)\n⩽C (x, t, q, ΩD)\nZ R\nr0\n· · ·\nZ R\nr0\nZ ǫ1\n0\nv−(q−1)(s−1)du0 · · · dupdv < ∞.\nTherefore, we obtain T f(x) is ﬁnite for all x ∈ΩD, which can lead to the fact\nthat TΩDf (x) exists everywhere in Rp+q+1\n∗\n. Further, as TΩDf has no singular\npoints in Rp+q+1\n∗\n\\ΩD and ¯ϑEy (x) = 0 is trivial, it follows that ¯ϑTΩDf = 0\nin Rp+q+1\n∗\n\\ΩD.\nIt is worth pointing out that we can not obtain the third statement by\nthe estimate for |TΩDf(x)| obtained above, since the constant C depends on\nx. Here, we need a more subtle argument to deal with the singularities in\n(4.2).\nWe denote xη = xp + rη, and let r1 > 0 be suﬃciently large such that\nΩD ⊂B(x, r1) for all x ∈ΩD. Let y = xη + lγ = xp + rη + lγ with γ ∈S,\nBη(xη, r1) := B(xη, r1) ∩Cη. Then, we can see that |yq| = |r + l cos θ| =\n\n\n14\nManjie Hu, Chao Ding, Yifei Shen and Jiani Wang\n|r + l⟨η, γ⟩|, where θ = arccos⟨η, γ⟩is the angle between η and γ. Now, we\nhave\nZ\nS+\nZ\nΩη\n|y −xη|−s(p+1) · |yq|−(s−1)(q−1)dση (y) dS(η)\n≤\nZ\nS+\nZ\nBη(xη,r1)\n|y −xη|−s(p+1) · |yq|−(s−1)(q−1)dση (y) dS(η)\n≤\nZ\nS+\nZ\nS+\nZ r1\n0\nl−s(p+1)|r + l⟨η, γ⟩|−(s−1)(q−1)lp+1dldS(ω)dS(η)\n≤C\nZ r1\n0\nl(1−s)(p+1)|r −l|(1−s)(q−1)dl.\nTo estimate the Lt norm of TΩD, we only need to show that the Lt norm of\n(4.2) is ﬁnite. Recall that r = |xq|, and with the argument above, we calculate\nZ\nΩD\n\f\f\f\f\nZ r1\n0\nl(1−s)(p+1)|r −l|(1−s)(q−1)dl\n\f\f\f\f\nt\ndV (x)\n≤\nZ\nS+\nZ\nΩω\n\f\f\f\f\nZ r1\n0\nl(1−s)(p+1)|r −l|(1−s)(q−1)dl\n\f\f\f\f\nt\nrq−1dVω(x)dS(ω).\nLet a, b > 0 such that\nΩω ⊂{x =\np\nX\ni=0\neixi + rω ∈Rp+q+1 : −a < x1, . . . , xp < a, 0 < r < b}\nfor all ω ∈S. Therefore, the last integral above becomes\n≤\nZ\nS+\nZ a\n−a\n· · ·\nZ a\n−a\nZ b\n0\n\f\f\f\f\nZ r1\n0\nl(1−s)(p+1)|r −l|(1−s)(q−1)dl\n\f\f\f\f\nt\nrq−1\n· dx0 · · · dxpdrdS(ω)\n≤C\nZ b\n0\n\f\f\f\f\nZ r1\n0\nl(1−s)(p+1)|r −l|(1−s)(q−1)dl\n\f\f\f\f\nt\nrq−1dr,\n(4.4)\nwhere the last equation comes from the fact that r = |xq| and l are indepen-\ndent to x0, . . . , xp. Now, let r −l = σ, we calculate\nZ r1\n0\nl(1−s)(p+1)|r −l|(1−s)(q−1)dl\n≤1\n2\nZ r1\n0\nl2(1−s)(p+1) + |r −l|2(1−s)(q−1)dl\n≤C\n\u0014 Z r1\n0\nl2(1−s)(p+1)dl +\nZ r\nr−r1\n|σ|2(1−s)(q−1)dl\n\u0015\n≤C\n\u0014 Z r1\n0\nl2(1−s)(p+1)dl +\nZ r\n0\nσ2(1−s)(q−1)dl −\nZ 0\nr−r1\nσ2(1−s)(q−1)dl\n≤C(r1, t, p) +\n1\n2(1 −s)(q −1) + 1\n\u0000r2(1−s)(q−1)+1 + (r −r1)2(1−s)(q−1)+1\u0001\n,\n\n\nTeodorescu transform for generalized partial slice monogenic functions 15\nwhere the last inequality requires 2(1−s)(p+1) > −1 and 2(1−s)(q−1) > −1,\nwhich is t > max{2p −1, 2q −1}. Plugging back to (4.4) to obtain\nZ\nΩD\n\f\f\f\f\nZ r1\n0\nl(1−s)(p+1)|r −l|(1−s)(q−1)dl\n\f\f\f\f\nt\ndV (x)\n≤C\nZ b\n0\n\f\f\f\fC(r1, t, p) + r2(1−s)(q−1)+1 + (r −r1)2(1−s)(q−1)+1\n2(1 −s)(q −1) + 1\n\f\f\f\f\nt\nrq−1dr\n≤C(r1, t, p) + C1(r1, t, p)\n\u0014 Z b\n0\nr2(1−s)(q−1)t+t+q−1dr\n+\nZ b\n0\n(r −r1)2(1−s)(q−1)t+trq−1dr\n\u0015\n,\nwhere the last integral is ﬁnite when 2(1 −s)(q −1)t + t > −1, which also\nimplies that 2(1 −s)(q −1)t + t + q −1 > −1. A straightforward calculation\nshows that this can be satisﬁed when t > max{2p −1, 2q −1} and q > 1,\nwhich completes the proof.\n□\nFurther, we claim that TΩalso maps slice functions to slice functions as\nfollows.\nProposition 4.4. Let ΩD ⊂Rp+q+1\n∗\nbe a bounded domain and t > q, then we\nhave that\nTΩD : Lt (ΩD) −→Lt (ΩD)\nis continuous.\nProof. It is easy to know that TΩD maps Lt (ΩD) to Lt (ΩD) can be ob-\ntained immediately from Proposition 4.3. Here, we only prove TΩD also maps\nLt (ΩD) to GS (ΩD). Recall that [y] =\n\b\nyp + rω, ω ∈S\n\t\nand observe that\nEy (x) is left generalized partial-slice monogenic in Rp+q+1\\ [y]. We assume\nthat Ey (x) = I (F), x′ = (xp, r) ∈D. Set\nEy (x) = F1 (x′) + ωF2 (x′) ,\nwhere F = F1 + iF2 is the stem function which induces the generalized\npartial-slice monogenic function Ey (x) as in the deﬁnition. Therefore, we\nhave\nTΩDf (x) = −\nZ\nΩD\nKy (x) f (y) dσ (y)\n= −\nZ\nΩD\nEy (x)\nσq−1|yq|q−1 f (y) dσ (y)\n= −\n1\nσq−1\n\"Z\nΩD\nF1 (x′)\n|yq|q−1 f (y) dσ (y) + ω\nZ\nΩD\nF2 (x′)\n|yq|q−1 f (y) dσ (y)\n#\n.\nIf we let\nH (x′) = H1 (x′) + iH2 (x′)\n\n\n16\nManjie Hu, Chao Ding, Yifei Shen and Jiani Wang\n=\n\"\n−\n1\nσq−1\nZ\nΩD\nF1 (x′)\n|yq|q−1 f (y) dσ (y)\n#\n+ i\n\"\n−\n1\nσq−1\nZ\nΩD\nF2 (x′)\n|yq|q−1 f (y) dσ (y)\n#\n,\nthen since F1 (x′), F2 (x′), f (x) are all Rp+q-valued, we know that H1 (x′),\nH2 (x′) are both real Rp+q-valued. Further, since F is the stem function, we\nhave\nF1 (xp, −r) = F1 (xp, r) and F2 (xp, −r) = −F2 (xp, r) .\nSo we get\nH1 (xp, −r) = H1 (xp, r) and H2 (xp, −r) = −H2 (xp, r) ,\nand H (x′) is the stem function. Hence, the function TΩDf induced by H (x′)\nis a generalized partial-slice function, which completes the proof.\n□\nConclusion\nIn this article, we present some integral formulas, such as the Cauchy inte-\ngral formula for the exterior domain and the Plemelj-Sokhotski formula in\nthe theory of generalized partial-slice monogenic functions. Further, we start\nan investigation to the Teodorescu transform in this context and a norm es-\ntimation for the Teodorescu transform is introduced as well. This leads to a\nfurther study to some questions related to the Teodorescu transform. More\nspeciﬁcally, for instance, a Hodge decomposition, a generalized Π operator\nand a Vekua system can be investigated in the framework of generalized\npartial-slice monogenic functions.\nAcknowledgments\nThis article is dedicated to the memory of Professor Yuri Grigoriev. The\nwork of Chao Ding is supported by National Natural Science Foundation of\nChina (No. 12271001), Natural Science Foundation of Anhui Province (No.\n2308085MA03) and Excellent University Research and Innovation Team in\nAnhui Province (No. 2024AH010002).\nData Availability\nNo new data were created or analysed during this study. Data sharing is not\napplicable to this article.\nReferences\n[1] D. Alpay, F. Colombo, I. Sabadini, Quaternionic de Branges spaces\nand characteristic operator function, SpringerBriefs in Mathematics, Springer,\nCham, 2020.\n[2] C. Bisi, J. Winkelmann, The harmonicity of slice regular functions, J. Geom.\nAnal. 31(2021), 7773–7811.\n[3] F. Brackx, R. Delanghe, F. Sommen, Cliﬀord analysis, Research Notes in\nMathematics, Vol. 76, Pitman, Boston, 1982.\n\n\nTeodorescu transform for generalized partial slice monogenic functions 17\n[4] F. Colombo, J. Gantner, Quaternionic closed operators, fractional powers\nand fractional diﬀusion processes, Operator Theory: Advances and Applications,\n274. Birkh¨auser/Springer, Cham, 2019.\n[5] F. Colombo, J. Gantner, D. P. Kimsey, Spectral theory on the S-spectrum\nfor quaternionic operators. Operator Theory: Advances and Applications, 270.\nBirkh¨auser/Springer, Cham, 2018.\n[6] F. Colombo, I. Sabadini, On some properties of the quaternionic functional\ncalculus, J. Geom. Anal., 19(3)(2009),601–627.\n[7] F. Colombo, I. Sabadini, On the formulations of the quaternionic functional\ncalculus, J. Geom. Phys., 60(10)(2010), 1490–1508.\n[8] F. Colombo, I. Sabadini, D. C. Struppa, Slice monogenic functions, Israel\nJ.Math. 171(2009), 385–403.\n[9] F. Colombo, I. Sabadini, D.C. Struppa, An extension theorem for slice\nmonogenic functions and some of its consequences, Israel J. Math. 177(2010),\n369–489.\n[10] F. Colombo, I. Sabadini, D.C. Struppa, Noncommutative Functional Cal-\nculus, Theory and Applications of Slice Hyperholomorphic Functions, Progress\nin Mathematics 289, Birkh¨auser , 2011.\n[11] F. Colombo, I. Sabadini, F. Sommen, D. C. Struppa, Analysis of Dirac\nsystems and computational algebra, Progress in Mathematical Physics, 39.\nBirkh¨auser Boston, 2004.\n[12] F. Colombo, J. O. Gonz´alez-Cervantes, I. Sabadini, A nonconstant co-\neﬃcients diﬀerential operator associated to slice monogenic functions, Trans.\nAmer. Math. Soc. 365 (2013), no. 1, 303-318.\n[13] F. Colombo, J.O. Gonz´alez-Cervantes, I. Sabadini, A Cauchy kernel for\nslice regular functions, Ann. Glob. Anal. Geom. 37(2010), 361–378.\n[14] R. Delanghe, F. Sommen, V. Souˇcek, Cliﬀord Analysis and Spinor Valued\nFunctions, Kluwer Academic Dordrecht, 1992.\n[15] C. Ding, X.Q. Cheng, Integral formulas for slice Cauchy-Riemann operator\nand applications, Adv. Appl. Cliﬀord Algebras, 34(2024), article number 32.\n[16] X.Y. Dou, G. Ren, and I. Sabadini, Extension theorem and representation\nformula in non-axially-symmetric domains for slice regular functions, J. Lond.\nMath. Soc.,25(2023), 3665–3694.\n[17] K. G¨urlebeck, K. Habetha, and W. Spr¨oßig, Holomorphic functions in\nthe plane and n-dimensional space, Birkh¨auser Verlag, Basel, 2008.\n[18] G. Gentili, C. Stoppato, D. Struppa, Regular Functions of a Quaternionic\nVariable, Springer Berlin, Heidelberg, 2013.\n[19] G. Gentili and D. C. Struppa, A new approach to Cullen-regular func-\ntions of a quaternionic variable, Comptes Rendus Math´ematique Acad´emie des\nSciences, 342(2006), 741–744.\n[20] G. Gentili and D. C. Struppa, A new theory of regular functions of a\nquaternionic variable, Adv. Math. 216(2007), 279–301.\n[21] R. Ghiloni, V. Moretti, A. Perotti, Continuous slice functional calculus\nin quaternionic Hilbert spaces, Rev. Math. Phys., 25(2013), 1350006, 83 pp.\n\n\n18\nManjie Hu, Chao Ding, Yifei Shen and Jiani Wang\n[22] R. Ghiloni, V. Moretti, A. Perotti, Spectral representations of normal\noperators in quaternionic Hilbert spaces via intertwining quaternionic PVMs,\nRev. Math. Phys., 29(2017), 1750034, 73 pp.\n[23] R. Ghilnoi, A. Perotti, Slice regular functions on real alternative algebras,\nAdv. Math., 226(2011), 1662–1691.\n[24] R. Ghiloni, A. Perotti, Global diﬀerential equations for slice regular func-\ntions, Math. Nachr. 287(2014), 561–573.\n[25] J.E. Gilbert, M. A. M. Murray, Cliﬀord algebras and Dirac operators in\nharmonic analysis, Cambridge Studies in Advanced Mathematics, Vol. 26, Cam-\nbridge University Press, Cambridge, 1991.\n[26] A. Perotti, Almansi Theorem and Mean Value Formula for Quaternionic\nSlice regular Functions, Adv. Appl. Cliﬀord Algebras, 30(2020), article number\n61.\n[27] Z.\nXu,\nI.Sabadini,\nGeneralized\npartial-slice\nmonogenic\nfunctions,\narXiv:2309.03698.\n[28] Z. Xu, I. Sabadini, Generalized Partial-Slice Monogenic Functions: A Syn-\nthesis of Two Function Theories, Adv. Appl. Cliﬀord Algebras 34(2024), article\nnumber 10.\nManjie Hu\nSchool of Mathematical Sciences,\nAnhui University, Hefei, Anhui, China\ne-mail: A23201033@stu.ahu.edu.cn\nChao Ding\nCenter for Pure Mathematics,\nSchool of Mathematical Sciences,\nAnhui University, Hefei, Anhui, China\ne-mail: cding@ahu.edu.cn\nYifei Shen\nStony Brook Institute at Anhui University, Hefei, Anhui, China\ne-mail: R22314014@stu.ahu.edu.cn\nJiani Wang\nStony Brook Institute at Anhui University, Hefei, Anhui, China\ne-mail: R22314085@stu.ahu.edu.cn\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20737v1.pdf",
    "total_pages": 18,
    "title": "Integral formulas and Teodorescu transform for generalized partial-slice monogenic functions",
    "authors": [
      "Manjie Hu",
      "Chao Ding",
      "Yifei Shen",
      "Jiani Wang"
    ],
    "abstract": "The theory of generalized partial-slice monogenic functions is considered as\na syhthesis of the classical Clifford analysis and the theory of slice\nmonogenic functions. In this paper, we investigate the Cauchy integral formula\nand the Plemelj formula for generalized partial-slice monogenic functions.\nFurther, we study some properties of the Teodorescu transform in this context.\nA norm estimation for the Teodorescu transform is discussed as well.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}