{
  "id": "arxiv_2502.21283v1",
  "text": "Astronomy & Astrophysics manuscript no. ms\n©ESO 2025\nMarch 3, 2025\nReconstruction of spider system’s observables from orbital period\nmodulations via the Applegate mechanism\nVittorio De Falco1, 2⋆, Amodio Carleo3⋆⋆, Alessandro Ridolfi3 ⋆⋆⋆, Alessandro Corongiu3⋆⋆⋆⋆\n1 Scuola Superiore Meridionale, Largo San Marcellino 10, 80138 Napoli, Italy,\n2 Istituto Nazionale di Fisica Nucleare (INFN), sez. di Napoli, Via Cinthia 9, I-80126 Napoli, Italy\n3 INAF – Osservatorio Astronomico di Cagliari, Via della Scienza 5, I-09047 Selargius (CA), Italy\nReceived March 3, 2025; accepted XXX\nABSTRACT\nRedback and black widow pulsars are two classes of peculiar binary systems characterized by very short orbital periods, very low\nmass companions, and, in several cases, regular eclipses in their pulsed radio signal. Long-term timing revealed systematic but\nunpredictable variations in the orbital period, which can most likely be explained by the so-called Applegate mechanism. This relies\non the magnetic dynamo activity generated inside the companion star and triggered by the pulsar wind, which induces a modification\nof the star’s oblateness (or quadrupole variation). This, in turn, couples with the orbit by gravity, causing a consequent change\nin the orbital period. The Applegate description limits to provide estimates of physical quantities by highlighting their orders of\nmagnitude. Therefore, we derive the time-evolution differential equations underlying the Applegate model, that is, we track such\nphysical quantities in terms of time. Our strategy is to employ the orbital period modulations, measured by fitting the observational\ndata, and implementing a highly accurate approximation scheme to finally reconstruct the dynamics of the spider system under study\nand the relative observables. Among the latter is the magnetic field activity inside the companion star, which is still a matter of debate\nfor its complex theoretical modeling and the ensuing expensive numerical simulations. As an application, we exploit our methodology\nto examine two spider sources: 47 Tuc W (redback) and 47 Tuc O (black widow). The results obtained are analyzed and then discussed\nwith the literature.\nKey words. Stars: binaries: eclipsing, Stars: magnetic field, Binary Systems\n1. Introduction\n1\nAmong the more than ∼3600 radio pulsars currently known1,\n2\nabout 14% are millisecond pulsars (MSPs). These are old neu-\n3\ntron stars (NSs) endowed with relatively weak magnetic fields\n4\n(B ≃107 −109 G) and very short rotational periods (∼1 −\n5\n10 ms). MSPs represent the progeny of low-mass X-ray binaries\n6\n(LMXBs), where the NS gets spun up by the accreted matter\n7\n(coming from the secondary star via Roche lobe overflow) and\n8\nfinally attains extreme rotation rates. This is known and widely\n9\naccepted in the literature as the recycling scenario (Bisnovatyi-\n10\nKogan & Komberg 1974; Alpar et al. 1982; Radhakrishnan &\n11\nSrinivasan 1982; Bhattacharya & van den Heuvel 1991; Papitto\n12\net al. 2013).\n13\nAlthough MSPs are formed in binary systems, about 20%\n14\nof them are isolated (Belczynski et al. 2010). The reason for\n15\nthis is still unclear and is matter of debate (van den Heuvel &\n16\nvan Paradijs 1988; Rasio et al. 1989; Bhattacharya & van den\n17\nHeuvel 1991). A possible explanation arose after the discovery\n18\nof the first eclipsing binary pulsar, PSR B1957+20 (Fruchter\n19\net al. 1988), in which the companion star is constantly ablated\n20\n⋆e-mail: v.defalco@ssmeridionale.it\n⋆⋆e-mail: amodio.carleo@inaf.it\n⋆⋆⋆e-mail: alessandro.ridolfi@inaf.it\n⋆⋆⋆⋆e-mail: alessandro.corongiu@inaf.it\n1 See https://www.atnf.csiro.au/research/pulsar/psrcat,\nfor more details. However, the situation is as follows: within the galac-\ntic plane, 135 are isolated and 209 are binaries; whereas in globular\nclusters, 87 are isolated and 91 are binaries.\nby energetic particles and/or γ-rays produced by the pulsar wind\n21\n(Kluzniak et al. 1988; van den Heuvel & van Paradijs 1988;\n22\nRuderman et al. 1989). This led astronomers to propose the so-\n23\ncalled evaporation scenario, accordong to which the secondary\n24\nstar gets ablated until it fully disappears, thus leaving an iso-\n25\nlated MSP. However, successive estimates of the mass-loss rate\n26\nshowed that the evaporation time scale is likely much longer than\n27\nthe Hubble time, casting doubts on the effective occurrence of\n28\nthis phenomenon (Stappers et al. 1996a,b, 2001).\n29\nNotwithstanding, eclipsing binary pulsars became increas-\n30\ningly important for stellar and binary evolution studies. The re-\n31\ncycling model, initially supported by the observation of accret-\n32\ning millisecond X-ray pulsars (AMXPs; see e.g., Wijnands &\n33\nvan der Klis 1998; Falanga et al. 2005), was ultimately con-\n34\nfirmed by the discovery of three “transitional” pulsars, (PSR\n35\nJ1023−0038, J1824−2452I, and J1227−4853), i.e. systems that\n36\nhave been observed swinging between radio-MSP and X-ray bi-\n37\nnary states (e.g. Papitto et al. 2013; Stappers et al. 2014).\n38\nSpider pulsars are a subclass of binary MSPs, character-\n39\nized by tight (orbital period ≲1 d) and circular (eccentricities\n40\n≃10−3−10−4) orbits (see e.g., Romani et al. 2012; Pallanca et al.\n41\n2012; Kaplan et al. 2013), and a light-weight companion. Most\n42\n(but not all) of them are also eclipsing binary pulsars. Depend-\n43\ning on the mass mc of the companion, they can be further divided\n44\ninto two distinct classes (Roberts 2013): black widows have de-\n45\ngenerate companions with mc ≲0.1M⊙, whereas redbacks have\n46\nsemi-degenerate companions with mc ≃0.1 −0.4M⊙. The evo-\n47\nlutionary scenario of these two types of binary systems has long\n48\nbeen discussed, and it is now widely accepted to occur through\n49\nArticle number, page 1 of 13\narXiv:2502.21283v1  [astro-ph.HE]  28 Feb 2025\n\n\nA&A proofs: manuscript no. ms\nirradiation processes (Podsiadlowski 1991; D’Antona & Ergma\n50\n1993; Bogovalov et al. 2008, 2012; Chen et al. 2013; Smedley\n51\net al. 2015, and references therein).\n52\nThe long-term timing of several spiders has revealed that\n53\nthey often show significant modulations of their orbital periods,\n54\nand sometimes also of their projected semi-major axis (see e.g.,\n55\nShaifullah et al. 2016; Ng et al. 2018). These variations generally\n56\nmanifest themselves as recurrent, but not strictly periodic, cy-\n57\ncles. These observational clues lead to the exclusion, as dynami-\n58\ncal explanations, of apsidal motions (Sterne 1939) and presence\n59\nof third bodies (van Buren 1986). Instead, a plausible reason can\n60\nbe the magnetic activity inside the companion star (Hall 1990),\n61\nclosely linked to the dynamo action due to the presence of dif-\n62\nferential rotation and convective zones.\n63\nSpider systems are usually found in quasi-tidally-locked con-\n64\nfigurations, occurring when there is no relevant angular momen-\n65\ntum transfer between the companion star and its orbit around\n66\nthe pulsar. This is due to the tidal force acting between the co-\n67\norbiting bodies through the pulsar irradiation-driven winds (see\n68\ne.g., Applegate & Shaham 1994; Bogdanov et al. 2005), entail-\n69\ning tidal dissipation of the pulsar on the companion (known\n70\nas tidally-powered star; see e.g., Balbus & Brecher 1976;\n71\nKochanek 1992; Zahn 2008) and synchronous rotation (one\n72\nhemisphere of a revolving body constantly faces its partner).\n73\nA possible explanation for the orbital period variations re-\n74\nlies on the Applegate mechanism (Applegate & Patterson 1987;\n75\nApplegate 1992b,a), where magnetic cycles induce deformations\n76\non the companion star shape, thus altering its quadrupole mo-\n77\nment, consequentially causing gravitational acceleration and or-\n78\nbital period modulations. This phenomenon is triggered by the\n79\nirradiation-driven winds from the pulsar, which generates a spin\n80\ntorque on the companion. This in turn induces tidal dissipation\n81\nand energy flow, which powers the magnetic dynamo (Applegate\n82\n& Shaham 1994).\n83\nThe observed orbital period and projected semi-major axis\n84\nmodulations can be influenced by other effects that are intrinsic\n85\nto the system or caused by kinematic reactions relative to the\n86\nobserver motion (e.g., emission of gravitational waves, Doppler\n87\ncorrections, mass-loss of the binary, and tidal bulge forces),\n88\nwhich Lazaridis et al. (2011) estimated to be orders of magni-\n89\ntudes smaller than those caused by the gravitational quadrupole\n90\nmoment activity. On the other hand, Lanza et al. (1998); Lanza\n91\n& Rodonò (1999) proposed an alternative explanation to the\n92\ngravitational quadrupole moment variations. Their model ap-\n93\nplies the tensor virial theorem (Chandrasekhar 1961) to a gen-\n94\neral magnetic field geometry to formalize, through an integral\n95\napproach, the variations in oblateness. This implies a distributed\n96\nnon-linear dynamo in the convective envelopes of the compan-\n97\nion star, which affects not only the quadrupole moment, but also\n98\nthe differential rotation.\n99\nThe Applegate mechanism is still the most quoted explana-\n100\ntion for its good agreement with the observations, whose mea-\n101\nsured amplitudes of period modulations are ∆P/P ∼10−5 (over\n102\ntimescales of decades or longer), companion star’s variable lu-\n103\nminosity over the ∆L/L ∼0.1 level, and differential rotations\n104\nat the ∆Ω/Ω∼0.01 order. These values are common in spider\n105\nsystems (see, e.g. Ridolfi et al. 2016; Freire et al. 2017).\n106\nMore recently, Voisin et al. (2020a,b) improved the Apple-\n107\ngate picture, also taking into account relativistic corrections.\n108\nThey proposed a detailed model for describing the motion of\n109\nspider binary systems that allows us to accurately estimate the\n110\nobserved ∆P variations with the final objective of improving the\n111\ntiming solution of these gravitational sources.\n112\nThe necessity in having solid theoretical assessments to de- 113\nscribe spider systems represents a powerful means to: (i) bet- 114\nter understand the stellar magnetic activity, (ii) get insights into 115\nthe dynamo processes, (iii) obtain more information on the com- 116\npanion stars’ equation of state. In particular, the structure and 117\ngeneration of the magnetic field in low-mass stars are still not 118\nclear and need to be investigated. The surface magnetic field is 119\nthought to be of the order of several kG and can be directly ob- 120\nserved (see Fig. 1 in Han et al. 2023). Instead, the interior fields 121\nare based on contrasting theoretical analyses strongly depending 122\non the considered model (see e.g., Yadav et al. 2015; Feiden & 123\nChaboyer 2014; MacDonald & Mullan 2017).\n124\nIn this work, we employ the Applegate mechanism, which 125\nbesides describing the phenomenology behind the spider pulsar, 126\nit also provides an estimate of the order of magnitude of some 127\nrelated physical variables (e.g., luminosity, differential rotations, 128\nquadrupole moment etc.). We propose a dynamical formulation 129\nof the Applegate model, where the gravitational source and phys- 130\nical quantities’ dynamics are tracked point by point during their 131\ntime evolution. In addition, we exploit an inverse approach, be- 132\ning counter-current with respect to the strategies followed in the 133\nlatest papers (see e.g., Voisin et al. 2020a,b). Indeed, rather than 134\nfinding a physical justification for the ∆P variations, we take its 135\nprofile from the long-term observations to reconstruct the gravi- 136\ntational source and related observables’ dynamics. The approach 137\nwe adopt in this paper follows the BTX phenomenological model 138\n(extension of Blandford & Teukolsky (BT) model, Blandford & 139\nTeukolsky 1976; Bochenek et al. 2015), which allows one to 140\nfit the observational data within a precise timing baseline. This 141\nscheme gives rise to a set of coupled ordinary differential equa- 142\ntions with respect to time, involving the orbital separation and 143\nquadrupole moment. However, the ensuing dynamical system is 144\nstill difficult to solve analytically. Therefore, we also develop a 145\nmathematical procedure that provides highly accurate approxi- 146\nmate analytical solutions. This methodology allows for an easy 147\naccomplishment of the proposed goals.\n148\nThe paper is structured as follows: in Sec. 2, we describe 149\nthe features of our dynamical model and derive the equations 150\nof motion; in Sec. 3, we propose a reasonable approximation 151\npattern to infer an analytical solution; in Sec. 4 our achievements 152\nare applied to black widow and redback systems; finally, in Sec. 153\n5 we conclude with some discussions and future perspectives.\n154\n2. The model\n155\nWe present the dynamical version of the Applegate mechanism, 156\nwhich reports the order of magnitude of the physical observables 157\nunderlying the dynamics of black widow and redback binary sys- 158\ntems. This model is further enhanced by incorporating orbital pe- 159\nriod modulations’ profile, derived from observations. This gives 160\nrise to a set of coupled and non-trivial ordinary differential equa- 161\ntions. We also introduce the explicit formulae of some physical 162\nvariables, whose plotted profiles are the goals of our work.\n163\nWe deal with binary sources composed of a pulsar of mass 164\nmp and a companion star of mass mc and radius Rc. The two 165\nbodies are both treated as test particles, even if the companion 166\nstar should be considered as extended to account for changes in 167\nshape. However, to simplify the mathematical treatment, we still 168\nregard this object as a test body and we entrust the quadrupole 169\nvariable to characterize the variations of matter distribution 170\nwithin the star. In Fig. 1 we report a cartoon sketching the ge- 171\nometry of the problem under investigation.\n172\nThe definitions of some of the above parameters require ad- 173\nditional clarifications. The companion star’s mass, mc, is not 174\nArticle number, page 2 of 13\n\n\nDe Falco et al. (2024): Reconstruction of spider system’s observables\nstrictly constant over time, as it gradually decreases due to the\n175\nmass loss driven by the pulsar wind. However, the fraction of\n176\nmatter lost over the observational period is so small (around\n177\n10−10M⊙/yr)2 that it is reasonable to approximate mc through\n178\na constant value. Similarly, the radius of the companion star,\n179\nRc, is not fixed; it varies as the shape of the star changes due\n180\nto quadrupole variations. Therefore, the definition of Rc refers\n181\nto the companion star’s radius at rest. These fluctuations in the\n182\nsize dimension can be quantified, and their relative magnitude\n183\nis estimated to be about 5 −7% with respect to Rc (Applegate\n184\n1992a)3.\n185\nThis section opens by briefly recalling the Applegate mech-\n186\nanism in Sec. 2.1, representing the core of our work. In the con-\n187\nstruction of the model, we will make use of two reference frames\n188\n(RFs) in Sec. 2.2, which allow us to conveniently deal with the\n189\nensuing dynamics. The equations of motion are presented in Sec.\n190\n2.3. We conclude by deriving the formulae of some fundamental\n191\nphysical observables involved in this scenario in Sec. 2.4.\n192\n2.1. Applegate mechanism and dynamo action\n193\nApplegate (1992a) proposed a mechanism to explain the orbital\n194\nperiod modulations in eclipsing binary systems as a consequence\n195\nof the magnetic activity inside the secondary star, triggered by\n196\nthe pulsar wind. For spider binary systems (i.e., black widows\n197\nand redbacks) the lighter body plays the role of the active star.\n198\nThe main idea underlying this approach is based on the magnetic\n199\nactivity cycle, which represents the engine that causes a redistri-\n200\nbution of the angular momentum inside the star, thus modifying\n201\nits oblateness (see e.g., Warner 1988; Lanza & Rodonò 2002;\n202\nDonati et al. 2003; Lanza 2006; Bours et al. 2016). This induces\n203\na variation in the radial component of the gravitational accelera-\n204\ntion via the gravitational quadrupole-orbit coupling, thus entail-\n205\ning the orbital period modulations, which we eventually detect.\n206\nThis magnetic activity seems to be powered by a dynamo ac-\n207\ntion, i.e., a process of magnetic field generation through the in-\n208\nductive response of a highly-conductive fluid. Indeed, there is a\n209\nconversion of mechanical energy into a magnetic one by stretch-\n210\ning and twisting the magnetic field lines (Parker 1955). All of\n211\nthe aforementioned effects are driven by the subsurface magnetic\n212\nfield, located within the star’s convective zones.\n213\nThe dynamo action is the alternation of two phenomena in-\n214\nside the star: (1) the sheared differential rotation at different lat-\n215\nitudes contributes to the trasformation of an initially poloidal\n216\nmagnetic field into an enhanced toroidal one through the Alfvén\n217\ntheorem (also known as Ω-effect; see e.g., Parker 1955, 1979;\n218\nBrowning et al. 2006); (2) the combined action of cyclonic con-\n219\nvection, buoyancy, and Coriolis forces turns the toroidal mag-\n220\nnetic field back to the poloidal one, completing thus the cycle\n221\n(also known as α-effect; see e.g., Parker 1955, 1979; Choudhuri\n222\net al. 1995; Charbonneau & Dikpati 2000; Browning et al. 2006).\n223\nThe dynamo model is usually gauged on the solar magnetic\n224\nactivity, as it shares profound similarities with the problem under\n225\ninvestigation. We know from Sun’s observations that the period\n226\n2 In this investigation, three aspects must be considered: (1) the mass\nloss from the companion amounting to 10−10M⊙/yr (Pan et al. 2023);\n(2) if the Roche lobe is less than the radius of the companion star, there\nis mass transfer; (3) the pulsar wind entails a mass loss of 10−12M⊙/yr\n(Guerra et al. 2024). We conclude that we can consider constant mass.\n3 The companion star’s variation are due to the combination of two\neffects: quadrupole changes amounting to 1 −5% (Applegate 1992a;\nHarvey et al. 1995) and magnetic field dynamo activity causing fluctu-\nations of 2 −6% (Rappaport et al. 1983; MacDonald & Mullan 2009).\nThe combined effects can thus range in the interval 5 −7%.\nof the sunspot cycles (connected to the solar subsurface mag- 227\nnetic activity) is about 11 yr (Baliunas & Vaughan 1985), but 228\nthis value can be of much longer duration in spider systems. 229\nFrom this consideration and since various cycles can have differ- 230\nent durations, we can conclude that the magnetic activity leads 231\nto systematic, but not strictly periodic, changes in the active star, 232\nsubsequently causing the observed orbital period variations.\n233\n2.2. Reference frames\n234\nSpider systems are fairly tight, implying highly-circular orbits. 235\nFurthermore, the tidal friction predominately acts, entailing a 236\nsynchronization of spin and orbit of the binary system, i.e., ro- 237\ntational and orbital angular momentum vectors are aligned and 238\nalso have the same module. The dynamics occurs in the plane 239\nP orthogonal to the direction of the orbital angular momentum. 240\nWe neglect any additional perturbing effects that could poten- 241\ntially lead to three-dimensional motions outside the P plane.\n242\nThe dynamics can be described in two RFs, having both the 243\norigin in the binary system’s center of mass (CM; see Fig. 2):\n244\n– orthonormal corotating RF, RCO = {x, y, z}: the z-axis is or- 245\nthogonal to P, where the x- and y-axes are placed. The x-axis 246\nis always directed along the line connecting the two bodies 247\nand pointing towards the companion star. This RF co-rotates 248\nwith the binary system, so the motion in it results to be al- 249\nways static. The only variations occur along the x-axis, re- 250\nducing thus the whole dynamics to just one dimension;\n251\n– orthonormal static RF, RS = {xS, yS, zS}: zS ≡z, where the 252\nxS-axis is directed towards the position of a static and non- 253\nrotating observer at infinity O∞, namely from CM to O′\n∞(be- 254\ning the projection of O∞on P). This RF is fixed in space and 255\nall quantities measured in it are labelled by a subscript S.\n256\nThese RFs are related by the map T : RCO →RS. It is deter- 257\nmined by employing polar coordinates, the radius rS(t) (coinci- 258\ndent with the coordinate x) and polar angle θS(t), where t is the 259\ntime. More explicitly, this transformation reads as\n260\n(xS(t) = rS(t) cos θS(t),\nyS(t) = rS(t) sin θS(t),\n⇔\nrS(t) = x.\n(1)\n2.3. Equations of motion\n261\nOur model is governed by the gravitational quadrupole-orbit dy- 262\nnamics (see Sec. 2.3.1) and the time-variation of the quadrupole 263\nmoment (see Sec. 2.3.2). This differential problem can be solved 264\nif it is accompanied by the appropriate initial conditions (see Sec. 265\n2.3.3). We stress again that, even though our model is fully based 266\non the Applegate mechanism, the related dynamical equations of 267\nmotion have never been written in the literature.\n268\n2.3.1. Gravitational quadrupole-orbit coupling dynamics\n269\nThe two bodies are influenced by their mutual gravitational at- 270\ntraction and the companion star’s gravitational quadrupole-orbit 271\ncoupling. The problem is first framed in RCO, where the pulsar 272\nhas coordinates (−xp, 0, 0), while the companion star (xc, 0, 0).\n273\nThe force acting on the pulsar is Fp, being the sum of 274\nthe gravitational force and the quadrupole moment contribution 275\nArticle number, page 3 of 13\n\n\nA&A proofs: manuscript no. ms\nFig. 1. Illustration of a typical spider binary system. A MSP and a companion star are in a tidally locked configuration, moving in synchronous\nrotations on quasi-circular and tight orbits. They are separated by a distance rs(t), in a plane orthogonal to the orbital angular momentum vector L,\nwhich is conserved during the binary system’s motion. The irradiation-driven wind from the MSP heats through a tidal dissipation the companion\nstar, which starts to evaporate, loosing thus mass. This is the eclipsing material, which obstacles the radio signal detected by a telescope located far\nfrom the binary system. In the dashed red box we sketch the companion star interior. This zone is characterized by a convective envelope, where\nthe fluid in it is highly conductive. Furthermore, the pulsar wind triggers the differential rotation of the companion star, which induces a magnetic\nactivity through a dynamo action. The subsurface magnetic field is responsible to break the hydrosthatic equilibrium inside the star, inducing\nquadrupole moment changes. Notice that the external magnetic field is expected to be locally poloidal, while the subsurface field is toroidal.\nFig. 2. We display the two RFs: RCO (black) and RS (red).\nQ(t)4 from the companion star, namely (Applegate 1992a):\n276\nmp ¨xp = Fp ≡−∂x\n Gmpmc\nx\n+ 3\n2\nGQ(t)mp\nx3\n!\n.\n(2)\nInstead, the force acting on the companion star is Fc, simply\n277\ngiven by the gravitational force from the pulsar:\n278\nmc ¨xc = Fc ≡∂x\n Gmpmc\nx\n!\n.\n(3)\nWe define the relative coordinate system x = xc −xp and\n279\nthe relative acceleration ¨x = ¨xc −¨xp (the over dot stands for\n280\n4 The quadrupole moment is a tensor written in terms of the companion\nstar’s inertial tensor. In our hypotheses, we have Q = Qxx (see discus-\nsion under Eq. (3) in Applegate 1992a, for details).\nthe derivative with respect to the time t), together with the total 281\nMTOT = mp + mc and reduced µ = mpmc/MTOT masses. After 282\nappropriately manipulating Eqs. (2) and (3), we obtain\n283\n¨x = −GMTOT\nx2\n−9\n2\nGQ(t)\nx4\n.\n(4)\nChanging RF through the transformation T, we rewrite the 284\nabove dynamics in polar coordinates in RS. Considering the an- 285\ngular component, we obtain the following equation of motion 286\n287\n1\nrS(t)\nd\ndt\nh\nµ rS(t)2 ˙θS(t)\ni\n= 0,\n(5)\nwhich immediately entails µrS(t)2 ˙θS(t) = L, where L is the mod- 288\nule of the conserved angular momentum L of the system along 289\nthe zS-axis, which can be calculated using the initial conditions. 290\nThe problem is defined in the timeframe [t0, t1]. However, 291\nsince the setting is invariant under time shifts, we can con- 292\nsider, without loss of generality, the following normalized in- 293\nterval [0, 1]5. The map connecting [t0, t1] with [0, 1] is given by 294\n295\nt ∈[t0, t1] →t −t0\nt1 −t0\n∈[0, 1].\n(6)\nWe stress that T0 is the reference time, usually coincident with 296\nthe transition to the orbit periastron6. This is the moment where 297\nwe extract the parameters and would correspond to the initial 298\ntime T ∗\n0 = (T0 −t0)/(t1 −t0). However, the observations begin at 299\n5 We prefer to work in normalized units for developing the calcula-\ntions, since this is advantageous during the fitting procedure.\n6 For circular orbits, T0 is the ascending node’s epoch passage.\nArticle number, page 4 of 13\n\n\nDe Falco et al. (2024): Reconstruction of spider system’s observables\nt0 < T0. Therefore, it is reasonable to set the initial conditions at\n300\nT0 and extend our solutions back to the earlier time, t0.\n301\nThe angle θS(t) can be calculated through the formula θS(t) =\n302\nω(t)(t −T ∗\n0), where ω(t) is the angular frequency. Since the sys-\n303\ntem is very tight, the bodies move on quasi-circular orbits with\n304\nrelative angular velocity (see Eq. (5) in Applegate 1992a)\n305\nvθ(t) =\ns\nGMTOT\nrS(t)\n1 + 9\n2\nQ(t)\nmcr2\nS(t)\n.\n(7)\nTherefore, the angular frequency ω(t) can be estimated applying\n306\nthe formula for (quasi-)circular motion (Applegate 1992a)\n307\nω(t) = vθ(t)\nrS(t).\n(8)\nIt is important to note that ˙θS(t) , ω(t), since\n308\n˙θS(t) = ω(t) + (t −T ∗\n0) ˙ω(t).\n(9)\nHowever, at the beginning (i.e., for t = T ∗\n0) we have ˙θS(T ∗\n0) =\n309\nω(T ∗\n0).\n310\nInstead, for the radial component, we obtain\n311\nµ¨rS(t) =\nL2\nµr3\nS(t) −Gmpmc\nr2\nS(t)\n−9\n2\nGQ(t)mp\nr4\nS(t)\n,\n(10)\nwhere the change of RF can be seen by the appearance of the\n312\ncentrifugal force (first term on the right hand side). This dynam-\n313\nical system is composed by a second-order ordinary differential\n314\nequation (10), which should be complemented by the dynamics\n315\nof Q(t)7, which is disclosed in the next section.\n316\n2.3.2. Quadrupole dynamics\n317\nThe Applegate mechanism foresees that there are two kinds of\n318\ndeformations due to the magnetic activity, which can be classi-\n319\nfied into: (1) distortions, which modify the hydrostatic equilib-\n320\nrium in the deformed configuration; (2) transitions, which cause\n321\nchanges from one fluid hydrostatic configuration to another.\n322\nApplegate (1992a) explains that distortions are not astro-\n323\nphysically relevant, because the weak magnetic fields (∼105 −\n324\n106 G) cannot supply enough energy for the star deformations\n325\nto reproduce the orbital period modulation timescales (see after\n326\nEq. (23), for a more detailed discussion). Therefore, we consider\n327\nmodifications due to the transitions, where the dynamics of a ro-\n328\ntating star strongly depends on the matter distribution within it\n329\nand its angular momentum J, which influences the quadrupole\n330\nmoment variations in agreement with the observed timescales.\n331\nA fundamental role is played by its external layers, which\n332\ncontribute to spin-up the star, making it more oblate (i.e., en-\n333\nhancing its quadrupole moment; Applegate 1992a). Therefore,\n334\nthe magnetic activity permits to arise and develop a torque,\n335\nwhich acts on the spin of the companion star to extract angu-\n336\nlar momentum (Applegate 1992a; Applegate & Shaham 1994).\n337\nFrom Eq. (26) in Applegate (1992a), the companion star’s\n338\nquadrupole moment changes according to the following formula:\n339\n340\n˙Q = 1\n3\n ΩR3\nc\nGmc\n!\n˙J,\n(11)\n7 It is important to note that being Q directed along the x-axis, thanks\nto the transformation (1), we have that Q(t) points along rS(t).\nwhere Ωis the angular velocity of the outer layers, which can be 341\nreasonably calculated through the Keplerian angular velocity\n342\nΩ=\ns\nGmc\nRc3 .\n(12)\nThe variation of J is caused by the spin torque, because the ir- 343\nradiation driven wind from the pulsar generates a ram pressure 344\ncontributing to the spin-up of the companion star. Employing Eq. 345\n(27) in Applegate (1992a), the time-variation of J is8\n346\n˙J = −Gm2\nc\n6πRc\n rS(t)\nRc\n!2 d∆P\ndt ,\n(13)\nwhere ∆P(t) is also known as orbital period modulations. There- 347\nfore, the resulting differential equation ruling the dynamics of 348\nQ(t) is obtained by substituting Eq. (13) into Eq. (11), namely\n349\n˙Q(t) = −mcΩr2\nS(t)\n18π\nd∆P\ndt .\n(14)\n2.3.3. Initial conditions\n350\nOur model is governed by a system of ordinary differential equa- 351\ntions (10) and (14). It must be complemented by the initial con- 352\nditions at the time t = T ∗\n0 to find a unique solution, which are 353\n354\n˙rS(T ∗\n0) = 2\n3\n˙P(T ∗\n0)\nP(T ∗\n0)a, rS(T ∗\n0) = a, θS(T ∗\n0) = 0, Q(T ∗\n0) = Q0, (15)\nwhere a is the initial separation between pulsar and companion 355\nstar and Q0 = 0.1mcR2\nc/3 the initial quadrupole (cf. Eq. (25) in 356\nApplegate 1992a). The radial velocity is determined employing 357\nKepler’s third law in its differential form, as the two bodies’ or- 358\nbits are Keplerian at every moment in time. The conditions (15) 359\nimply (cf. Eqs. (7) and (8))\n360\nvθ(T ∗\n0) =\ns\nGMTOT\na\n \n1 + 9\n2\nQ0\nmca2\n!\n,\nω(T ∗\n0) = vθ(T ∗\n0)\na\n.\n(16)\n2.4. Physical observables\n361\nThis section provides some physical observables related to spi- 362\nder systems. To achieve this objective, we must first solve Eqs. 363\n(10) – (14), as we need rS(t) and Q(t), which are already funda- 364\nmental physical quantities. We focus on the following quantities: 365\norbits pertaining to the two bodies (see Sec. 2.4.1), orbital period 366\n(see Sec. 2.4.2), magnetic field intensity (see Sec. 2.4.3), lumi- 367\nnosity variability (see Sec. 2.4.4).\n368\n2.4.1. Two body orbits\n369\nAn important feature of a binary system is to understand the evo- 370\nlution of the orbit. Since the two bodies are tidally locked and 371\nsynchronized, we need to determine the separation rS(t) and the 372\nquadrupole moment Q(t) to calculate ω(t) (cf. Eq. (8)), which in 373\nturn provides the evolution of the polar angle θS(t). Therefore, 374\npassing in cartesian coordinates, the orbit is obtained by plotting 375\n376\n(rS(t) cos θS(t), rS(t) sin θS(t)),\nt ∈[0, 1]\n(17)\nwhere t is given by Eq. (6).\n377\n8 It is important to note that ∆P(t) = P(t)−P0 with P0 being a constant.\nTherefore, d∆P/dt = ˙P(t). We use both notations in the paper.\nArticle number, page 5 of 13\n\n\nA&A proofs: manuscript no. ms\n2.4.2. Orbital period\n378\nThe orbital period P(t) can be estimated in two ways: (1) once we\n379\nsolve the system, we determine the orbit and we then calculate it\n380\n; (2) it can be obtained a-priori by fitting the observational data.\n381\nIn this work, we use the latter approach, as we aim to reconstruct\n382\nthe dynamics of the physical observables.\n383\nIn the a-priori approach we first calculate ∆P(t) = P(t)−P0,\n384\nwhere P0 is estimated via Kepler’s third law, namely\n385\nP0 =\ns\n4π2a3\nGMTOT\n.\n(18)\nThe formula used to fit ∆P(t) (generally expressed in seconds) is\n386\n387\n∆P(t) =\n1\ng(t) −1\nf0\n,\n(19)\nwhere f0 = 1/P0 and\n388\ng(t) ≃f0 + f1(t −T0) + 1\n2 f2(t −T0)2 + ... + 1\nn! fn(t −T0)n\n=\nn\nX\ni=0\n1\ni! fi(t −T0)i.\n(20)\nThe fitting procedure is performed in the interval [t0, t1], ex-\n389\npressed in MJD. Furthermore, the coefficients {fi}n\ni=0 represent\n390\nthe higher-order frequency derivatives and n is the order of terms\n391\ninvolved in the fit. The parameters {fi}n\ni=0 and T0 are obtained as\n392\na timing solution of a BTX model provided by the TEMPO or\n393\nTEMPO2 software. The value of n changes from a pulsar to an-\n394\nother, since it is the number of the reliably-measured time deriva-\n395\ntives of the orbital period, and depends on various aspects, such\n396\nas: the time interval covered by the radio observations, the typi-\n397\ncal uncertainty on the measured pulses’ time of arrival, the r.m.s\n398\nof the timing residuals, and more (see e.g., Ridolfi et al. 2016;\n399\nFreire et al. 2017). We also note that ˙P(T ∗\n0) = −f1/ f 2\n0 , useful for\n400\ncomputing ˙r(T ∗\n0) in Eq. (15).\n401\nFor what follows, it is useful to define the constant quantity\n402\nA = ⟨∆P(t)\nP(t) ⟩[t0,t1],\n(21)\nwhere ⟨·⟩[t0,t1] is the time-average in the interval [t0, t1].\n403\n2.4.3. Magnetic field intensity\n404\nIn the Applegate mechanism, the magnetic energy is the main\n405\nsource of support to provide the necessary torque for the ex-\n406\nchange of angular momentum between the shells of the compan-\n407\nion star (and consequently changes in the quadrupole moment).\n408\nIn this scenario, the magnetic field does not decay in rapid times,\n409\nbecause the so far observations have not detected orbital period\n410\nvariations over short timescales. This phenomenon represents an\n411\nindirect probe for the internal magnetic field dynamics within ac-\n412\ntive stars. Therefore, spider pulsars are natural laboratories and\n413\nprivileged systems to investigate the magnetic dynamics in low-\n414\nmass stars, since this topic is still matter of discussion.\n415\nThe variation of the subsurface (toroidal) magnetic field in-\n416\ntensity with respect to that of the unperturbed (i.e., Q(t) = 0)\n417\nconfiguration can be estimated through the following formula\n418\n(see Eq. (33) in Applegate 1992a, for further details)\n419\n∆B(t) ∼sgn(∆P(t))\ns\n10Gm2c\nR4c\n rS(t)\nRc\n!2 |∆P(t)|\nPma\n,\n(22)\nwhere Pma is the magnetic period, being specific for each spider 420\nsystem. It is computed by searching for the maxima (or min- 421\nima) in the ∆P(t) profile, whose average distances allows us to 422\nextract a mean value. We stress that Eq. (22), as derived by Ap- 423\nplegate (1992a), provides just an estimate of the magnetic field 424\nintensity. In the original formula, ∆P is interpreted as a (con- 425\nstant) positive quantity. Since in our case ∆P(t) assumes both 426\npositive and negative values, as well as zero, it is more appro- 427\npriate to insert the absolute value to derive a realistic result. In 428\naddition, inspired by the ∆P(t) profile, it is more opportune to 429\ncalculate (through Eq. (22)) the variations ∆B(t), rather than B(t). 430\nWe stress ∆B(t) = B(t) −B0, where B(t) is due to the quadrupole 431\nvariations, whereas B0 stays for the unperturbed case. In order to 432\nguarantee regular behaviours and attain negative values, we have 433\nadded the function sign of the ∆P(t) outside the square root. We 434\nmake the function continuous, but it is not differentiable in the 435\npoints crossing the zero line. This is the best we can achieve, as 436\nwe are ignorant about the magnetic activity occurring inside the 437\ncompanion star.\n438\nWe consider a rough estimate of the magnetic field B0 pro- 439\nposed by Applegate, which is obtained by substituting in Eq. 440\n(22), rS(t) with its initial value a and ∆P(t) with the trend AP0 441\n(cf. Eq. (21)). Therefore, performing these calculations, we have 442\n443\nB0 ∼sgn(A)\ns\n10Gm2c\nR4c\n a\nRc\n!2 AP0\nPma\n.\n(23)\n2.4.4. Luminosity variability\n444\nAnother non-uniform periodic mechanism is related to the 445\nphysics of the luminous variability inside the active star. This 446\ncycle is divided into two phases (Applegate & Patterson 1987; 447\nApplegate 1992a; Applegate & Shaham 1994):\n448\n(i) the angular momentum transfer leads to an enhancement of 449\nthe kinetic energy, because it is spent to power the differ- 450\nential rotation between the inner part and the outer layer of 451\nthe active star. This activity leads the star to spin-up at the 452\nexpenses to lower the luminosity;\n453\n(ii) when the angular momentum transfer decreases, the active 454\nstar rotates as a solid body. This causes the star to spin-down, 455\nwith a consequent increment in its luminous intensity.\n456\nThe alternation of the two cycles gives rise to the observed lumi- 457\nnous modulations. In addition, in the entire process there is also 458\na weak dissipation, because the orbital period tends to weakly 459\ndecrease with time. However, this dissipative effect will be not 460\ntaken into account in this model due to its negligible contribu- 461\ntions.\n462\nThe energy emitted by the companion star can be estimated 463\nthrough (see Eq. (28) in Applegate 1992a, for details)\n464\n∆E = Ωdr ˙J +\n˙J2\nIs\n∆t,\n(24)\nwhere Ωdr = Ω(1 −η) with efficiency η = 0.66 (see Fig. 1 in 465\nYoshida 2019) and Is represents the moment of inertia of the 466\nouter layer considered as a shell, given by (Applegate 1992a)\n467\nIs = 2\n3 MsR2\nc,\n(25)\nwhere Ms ≈0.1mc is the outer layer mass (Applegate 1992a). 468\nTherefore, the luminosity modulation can be easily calculated as 469\nArticle number, page 6 of 13\n\n\nDe Falco et al. (2024): Reconstruction of spider system’s observables\n470\n∆L (t) = π ∆E\nPma\n,\n(26)\nwhere ∆L (t) represents the difference between the luminosity\n471\ndue to the quadrupole variations and the constant luminosity of\n472\nthe star without altering its shape. This formula permits to track\n473\nthe companion star’s luminosity with respect to the unperturbed\n474\nconfiguration during the time evolution, and to monitor how it\n475\nchanges in terms of the orbital period modulations.\n476\nFinally, we provide an estimate of the unperturbed luminos-\n477\nity, expressed by the following formula (using Eq. (26), where\n478\nwe substitute rS(t) with a and ∆P(t) with AP0)\n479\nL0 = 1\n9ΩGm2\nc\nRc\n a\nRc\n!2 AP0\nPmod\n.\n(27)\n3. Methodology\n480\nThe spider system dynamics is described by two coupled non-\n481\nlinear differential equations (10) – (14), where the analytical so-\n482\nlution is too difficult to be determined and therefore, numeri-\n483\ncal routines must be exploited. We note that if we follow the\n484\na-posteriori approach (see Sec. 2.4.2), we must have a precise\n485\ntemporal trend for d∆P/dt, which is related to the subsurface\n486\nmagnetic field of the active star. This is a very demanding task\n487\nfor several reasons (see Dobler et al. 2006; Browning 2008, and\n488\nreferences therein): (1) theoretical uncertainties about the mi-\n489\ncrophysics inside low-mass stars; (2) high computational cost\n490\ntoperform magnetohydrodynamic (MHD) simulations; (3) exis-\n491\ntence of several models, based on different simplifications and\n492\nhypotheses.\n493\nIn order to avoid the aforementioned issues, we reckon on the\n494\na-priori approach (see Sec. 2.4.2), founded on having the func-\n495\ntion ∆P(t) by fitting the observational data. However, even after\n496\nsubstituting the orbital period modulations (19) in the equations\n497\nof motion, the ensuing dynamics is still too cumbersome to be\n498\nanalytically integrated. Therefore, if we want to avoid numerical\n499\nintegrations, some approximation schemes must be employed.\n500\nWe present a methodology to derive an approximate analyt-\n501\nical solution of Eqs. (10) and (14) in Sec. 3.1, about which we\n502\ncomment on the approximation accuracy with respect to the orig-\n503\ninal (unaffected) equations in Sec. 3.2. We conclude by specify-\n504\ning the inputs and outputs of our model in Sec. 3.3.\n505\n3.1. Approximation strategy\n506\nAnalysing better the problem, we should bare in mind that the\n507\nmotion is quasi-circular. Therefore, we can assume the validity\n508\nof Kepler’s third law in each point. Differentiating it, we obtain,\n509\nat the first order in ∆P and ∆rS:\n510\n∆P\nP = 3\n2\n∆rS\nrS\n.\n(28)\nSubstituting the following relations:\n511\nP(t) = P0 + ∆P(t),\nrS(t) = a + ∆rS(t)\n(29)\ninto Eq. (28) and neglecting second order terms, we have\n512\n∆rS(t) = 2\n3\na∆P(t)\n2P0\n,\n(30)\nwhich completely determines the function rS(t) in terms of the\n513\norbital period modulations ∆P(t), taken from the observations.\n514\nEquation (14) is the only differential relation left, which must 515\nbe solved numerically. However, we can avoid this last inte- 516\ngration by sampling rS(t) and ∆P(t) functions at several points. 517\nThen, we fit them with high-accurate polynomials with n + 1 518\ncoefficients, using the same n of the TEMPO coefficients {fi}n\ni=0, 519\nbecause this allows a drastic reduction of the approximation er- 520\nrors. The fitting procedure occurs in the interval [0, 1], since this 521\ngives more accurate results. Using the transformation (6) we can 522\nthen map the ensuing polynomial in the interval [t0, t1].\n523\nIn this case, Eq. (11) can be analytically written as\n524\nQ(t) = −mcΩ\n18π\nm\nX\ni=0\nai\nti+1\ni + 1 + Q0,\n(31)\nwhere the coefficients ai are real numbers, which can be explic- 525\nitly calculated when we have the polynomials of rS(t) and ∆P(t). 526\nThe integer m depends on the final polynomial order obtained by 527\nmultiplying the two aforementioned polynomials.\n528\n3.2. Approximation accuracy\n529\nTo check the reliability of the result we have found, we need to 530\ncompare our approximation with the numerical solution of Eqs. 531\n(10) and (14). To this purpose, we use Mathematica 13.1 and 532\nPython 3 to confidently validate our calculations.\n533\nIn Mathematica 13.1, we employ the function NDSolve 534\nand\nexploiting\nthe\nmethods\nStiffnessSwitching\nand 535\nExplicitRungeKutta, selecting a precision and accuracy of 536\n10, and a maximum step size of 10−6 in the interval [0, 1]. 537\nThen, we plot rS with several points (∼800), while Q(t) can be 538\ndisplayed by employing much fewer points (∼100).\n539\nIn Python 3, we use the integration routine dop853, being 540\nthe Dormand-Prince algorithm implemented within the class of 541\nexplicit Runge-Kutta methods of eight order Dormand & Prince 542\n(1980); Press et al. (2002). We select absolute 10−20 and relative 543\n10−10 tolerances within [0, 1] with a step-size of 10−7. The two 544\napproaches are in agreement, since they give the same results.\n545\nThe approximate radius differs from the numerical one, be- 546\ncause the latter contains mild oscillations (since the orbit is 547\nquasi-circular) and an overall modulation on the time span [0, 1]; 548\nwhereas the former features only the modulation on [0, 1] (since 549\nthe orbit is considered circular). Instead, the quadrupole moment 550\nbetween the two approaches coincides with mean relative errors 551\n(MREs) < 10−5%. Therefore, our solution is consistent.\n552\n3.3. Inputs and outputs of the model\n553\nOur approach relies on the analytical (high-accurate approxi- 554\nmate) formulae of rS(t) and Q(t). This permits to fast compute 555\nthe evolution of the associated physical observables reported in 556\nSec. 2.4. Our methodology is also flexible, because it can be used 557\nin an opposite manner. Indeed, knowing the trend of some phys- 558\nical variables (e.g., the luminosity), we could extract the orbital 559\nperiod modulations and then determine all the other quantities.\n560\nThe input values of our model are:\n561\nn\nmp, mc, Rc, Pma, f0, . . . , fn, T0\no\n,\n(32)\nwhere mp can be set equal to the value of a standard NS (i.e., 562\nmp = 1.4M⊙) and if we know the spider class, we can assign an 563\naverage value of mc and Rc. The initial orbital separation a can 564\nbe calculated via the third Kepler’s law (cf. Eq. (18)), knowing 565\nP0 = 1/ f0, mp, mc. Depending on the goal, we generally have 566\nn+6 input parameters, which can eventually be lowered to n+3. 567\nArticle number, page 7 of 13\n\n\nA&A proofs: manuscript no. ms\nThe output parameters of our model are:\n568\nn\nrS(t), θS(t), Q(t), ∆B(t), ∆L (t)\no\n.\n(33)\n4. Results\n569\nAs an application of our model, we consider the spider systems:\n570\n47 Tuc W (redback) and 47 Tuc O (black widow). The input\n571\nparameters and the TEMPO coefficients of these two physical sys-\n572\ntems are reported in Table A.1. In Fig. 3 we display the orbital\n573\nperiod modulations of these two sources (see Ridolfi et al. 2016;\n574\nFreire et al. 2017, for more details). The polynomial approxi-\n575\nmations described in Sec. 3.1 are reported in Appendix A. In\n576\nthis section, we first compare the results from the two sources in\n577\nSec. 4.1 and then in Sec. 4.2 we analyse how we determine the\n578\nassociated parameters, once we detect a spider source.\n579\n4.1. Comparison between 47 Tuc W and 47 Tuc O\n580\nWe analyse 47 Tuc W and 47 Tuc O’s dynamics via our model\n581\nthrough the related physical variables’ profiles (33), highlighting\n582\ncommon features (see Sec. 4.1.1) and diversities (see Sec. 4.1.2).\n583\n4.1.1. Analogies\n584\nThe radius follows the same trend of the orbital period modula-\n585\ntions (cf. Eq. (29) and (30)), but with very mild oscillations, see\n586\nFig. 4. This feature transmits also to the orbits, which, besides to\n587\nbe quasi-circular, admit a very narrow advancement with respect\n588\nto the long time baseline. Instead, the quadrupole moment be-\n589\nhaves in the opposite way (see Fig. 5), because the orbit shrinks\n590\n(enlarges) as the quadrupole increases (decreases).\n591\nThe magnetic field variability, compared to other observ-\n592\nables, features a very oscillating trend scanned by the magnetic\n593\nactivity period Pma, see Fig. 6. The variable magnetic field B(t)\n594\ncrosses the zero line at the points where ∆P(t) nullifies, corre-\n595\nsponding to moments when the magnetic field matches the initial\n596\nstar’s intensity. Since the provided formula is a rough estimate of\n597\nthe subsurface magnetic field strength (with an offset value B0),\n598\nwe anticipate that MHD simulations could offer a similar but\n599\nmore detailed and accurate representation.\n600\nFinally, the luminosity is ruled by the quadrupole moment\n601\n(cf. Eq. (26)), where the zero points coincide with the luminosity\n602\nof the star initially observed, see Fig. 7. For the calculation of\n603\nthe magnetic field and luminosity we use their original formulae\n604\n(cf. Eqs. (22) and (26)) without any approximation for the radius\n605\nrS(t). We express the luminosity variability in solar luminosity\n606\nunits, corresponding to L⊙= 3.83 × 1033 erg/s. We note that\n607\nthe results we have found are in agreement with the estimates\n608\nreported in Applegate (1992a), namely ⟨∆L (t)⟩[t0,t1]/L0 ∼0.3.\n609\n4.1.2. Differences\n610\nThe described similarities are mainly due to the underlying equal\n611\nmathematical structure, while the discrepancies arise from the\n612\ndifferent physical nature of the two spider classes.\n613\nObservationally, the orbits associated with 47 Tuc W appear\n614\nto be tighter than those of 47 Tuc O (see Fig. 4). This trend\n615\nis consistent with theoretical models of spider pulsars, which\n616\nsuggest that the pulsar wind significantly impacts the compan-\n617\nion’s structure and mass-loss process (Chen et al. 2013; Wang\n618\net al. 2021; Conrad-Burton et al. 2023). The high-energy photons\n619\nemitted by the pulsar deposit energy in the companion’s outer\n620\nlayers, altering its convection properties and potentially leading 621\nto enhanced material loss. While mass-loss rates in black widows 622\nand redbacks depend on multiple factors, including the intensity 623\nof irradiation and orbital evolution, models indicate that redback 624\ncompanions, being more massive, may sustain a stronger mag- 625\nnetic field, which provides greater resistance to ablation-driven 626\nmass loss (Conrad-Burton et al. 2023).\n627\nThe magnetic fields of redbacks exhibit larger fluctuations, 628\nwith shifts of up to 150 kG, compared to the more stable 20 629\nkG variations in black widows. However, the magnetic activity 630\nin redbacks is observed to persist for shorter timescales than in 631\nblack widows (see Table A.1). This behaviour fits within the 632\nirradiation-driven evolution scenario, where the pulsar’s rela- 633\ntivistic wind and high-energy radiation interact with the compan- 634\nion’s magnetosphere (Conrad-Burton et al. 2023). In redbacks, 635\nthe stronger magnetic field can counteract the pulsar wind for 636\nlonger durations, delaying the complete stripping of the com- 637\npanion. In contrast, the weaker fields of black widow compan- 638\nions result in a more effective removal of material, leading to 639\nmore rapid and extreme ablation (Podsiadlowski 1991; Chen 640\net al. 2013; Conrad-Burton et al. 2023). Interestingly, while abla- 641\ntion is commonly associated with more severe mass loss in black 642\nwidows, it is expected that redbacks’ companions can intercept 643\na larger fraction of the pulsar’s spin-down luminosity, possibly 644\nas a result of a different geometric configuration (Chen et al. 645\n2013; Conrad-Burton et al. 2023). This effect likely stems from 646\nthe more substantial convective envelope and deeper energy de- 647\nposition in redback companions, which alters their thermal and 648\nmagnetic structures.\n649\nFrom a modeling perspective, a convincing explanation of 650\nthe connection between the directly observed surface and bulk 651\nmagnetic field properties of these systems is still missing. The 652\nstate of the art on the most relevant studies on this topic follows 653\ntwo distinct approaches, mainly based on three-dimensional 654\nMHD simulations (Browning 2008; Yadav et al. 2015; MacDon- 655\nald & Mullan 2017) and one-dimensional stellar evolution analy- 656\nses (Feiden & Chaboyer 2014). We can see that in the aforemen- 657\ntioned works there is an ongoing disagreement about the order 658\nof magnitude of the field intensity in fully convective stars: some 659\nauthors require ∼MG fields, while others insist on possible upper 660\nlimits of ∼10 kG. Given this lack of consensus, our 20-100 kG 661\nsubsurface field variation (see Fig. 6) at a depth ∼0.1Rc (Apple- 662\ngate 1992a) seems to be reasonable. Currently, there are no simu- 663\nlations specifically focused on this aspect and up to now there are 664\nonly some indications that the subsurface magnetic field could be 665\nlarger than the surface one by a factor of ∼2 (see Fig. 4 in Yadav 666\net al. 2015, for details).\n667\nOne of the novel aspects of our model with respect to the 668\nliterature relies on the temporal dynamics of the ∆B(t) plot. The 669\nlong-term evolution of the surface fields is sometimes observed, 670\nwhile the suggested drastic variation of the field intensity by a 671\nfactor of ∼10 with a characteristic oscillatory shape seems to 672\nbe not seen in any other observations or theoretical modeling of 673\nfully-convective stars outside spider systems. It is true that our 674\nprofile is based on a naive formula of the magnetic field, but 675\nthe conventional dynamo models interplay with the quadrupole 676\nvariations in these stars, possibly generating new behaviours.\n677\nRegarding luminosity, redback companions generally exhibit 678\nhigher optical luminosities than black widows, as shown in Fig. 679\n7. This trend arises from a combination of factors (Roberts 680\n2012; Gentile et al. 2014; Roberts et al. 2018; Strader et al. 681\n2019; Sullivan & Romani 2024): (i) the intrinsic luminosity of 682\nthe star, which is modulated by pulsar heating; (ii) the pulsar 683\nwind interaction with the companion and the surrounding ma- 684\nArticle number, page 8 of 13\n\n\nDe Falco et al. (2024): Reconstruction of spider system’s observables\n51500\n52000\n52500\n53000\n53500\n54000\n54500\n55000\n-2\n-1\n0\n1\n2\n3\n4\n5\nt (MJD)\nΔP (ms)\n47 TUC W\n48000\n50000\n52000\n54000\n56000\n-2\n0\n2\n4\n6\n8\n10\nt (MJD)\nΔP (ms)\n47 TUC O\nFig. 3. Orbital period modulations of 47 Tuc W and 47 Tuc O, obtained from the fitting of the observational data (cf. Table A.1). The vertical\ndashed line marks the position of T0.\n51500\n52000\n52500\n53000\n53500\n54000\n54500\n55000\n-1.×10-6\n0\n1.×10-6\n2.×10-6\nt (MJD)\nrS(t)-a (1010cm)\n48000\n50000\n52000\n54000\n56000\n-1.×10-6\n0\n1.×10-6\n2.×10-6\n3.×10-6\n4.×10-6\n5.×10-6\nt (MJD)\nrS(t)-a (1010cm)\nFig. 4. Discrepancy of the actual separation among the bodies with respect to the initial datum. The vertical dashed line marks T0. The order of\nthe sources is placed as in Fig. 3.\n51500\n52000\n52500\n53000\n53500\n54000\n54500\n55000\n0.9992\n0.9994\n0.9996\n0.9998\n1.0000\n1.0002\n1.0004\nt (MJD)\nQ/Q0\n48000\n50000\n52000\n54000\n56000\n0.990\n0.995\n1.000\nt (MJD)\nQ/Q0\nFig. 5. Evolution of the quadrupole moment Q(t)/Q0, where the horizontal dashed line is set at 1 and the vertical dashed line marks T0. The order\nof the sources is placed as in Fig. 3.\n51500\n52000\n52500\n53000\n53500\n54000\n54500\n55000\n-40\n-20\n0\n20\n40\nt (MJD)\nΔB(t) (kG)\n48000\n50000\n52000\n54000\n56000\n-50\n0\n50\n100\nt (MJD)\nΔB(t) (kG)\nFig. 6. Variation of magnetic field intensity ∆B(t). The horizontal dashed line is B0 (cf. Eq. (23)), whereas the vertical dashed line marks T0. The\norder of the sources is placed as in Fig. 3.\n51500\n52000\n52500\n53000\n53500\n54000\n54500\n55000\n-20\n-15\n-10\n-5\n0\n5\n10\nt (MJD)\nΔ𝓛(L⦿)\n48000\n50000\n52000\n54000\n56000\n-10\n-8\n-6\n-4\n-2\n0\n2\nt (MJD)\nΔ𝓛(L⦿)\nFig. 7. Variation of luminosity ∆L (t). The horizontal dashed line is L0 (cf. Eq. (27)), whereas the vertical dashed line marks T0. The order of the\nsources is placed as in Fig. 3.\nterial, particularly in X-ray bands; (iii) the gamma-ray emission\n685\nfrom pulsar magnetospheric processes such as curvature radia-\n686\ntion and inverse Compton scattering; (iv) occasional mass trans-\n687\nfer episodes, where infalling matter is energized by the pulsar’s\n688\nmagnetic field; and (v) non-thermal radiation from the intra- 689\nbinary shock formed between the pulsar wind and the ablated 690\nmaterial.\n691\nArticle number, page 9 of 13\n\n\nA&A proofs: manuscript no. ms\nIn our case, redbacks reach total luminosities of L0 ∼1035\n692\nerg/s, while black widows are typically a few orders of mag-\n693\nnitude dimmer (L0 ∼1031 erg/s). The larger companion star\n694\nand stronger irradiation in redbacks contribute to a higher op-\n695\ntical luminosity. However, in the X-ray and gamma-ray bands,\n696\nblack widows can still exhibit comparable or even greater lu-\n697\nminosities due to the more efficient formation of intra-binary\n698\nshocks (Conrad-Burton et al. 2023). These findings suggest that\n699\nspider systems provide a unique laboratory for studying the ef-\n700\nfects of extreme irradiation on stellar magnetism, convection,\n701\nand mass-loss processes. Future observational constraints and\n702\ndetailed simulations will be crucial in further refining our un-\n703\nderstanding of the evolution of these exotic binary systems.\n704\n4.2. Parameters’ determination\n705\nIn the current study, it is of essential importance to understand\n706\nhow to determine the parameters associated with a spider system\n707\nusing our model, which is fully based on the Applegate mech-\n708\nanism. This process is critical for extracting detailed informa-\n709\ntion about the gravitational source under investigation. Broadly\n710\nspeaking, two main approaches can be identified.\n711\nThe first route relies on the fact that when a new spider\n712\nsource is discovered, we can generally fit the orbital period mod-\n713\nulations, thus obtaining the parameters T0, the TEMPO coeffi-\n714\ncients {fi}n\nI=0, and Pma. Now, assuming that the NS has a canon-\n715\nical mass of mp = 1.4M⊙and that the system is observed nearly\n716\nedge-on, the mass of the companion star, mc, can then be esti-\n717\nmated (see e.g., Ridolfi et al. 2016; Freire et al. 2017, for more\n718\ndetails). This step is crucial to determine the spider system na-\n719\nture, namely whether it is a redback or a black widow. Sub-\n720\nsequently, we can estimate the companion star’s radius, Rc, by\n721\nadopting the same argument detailed in Appendix A. Using Ke-\n722\npler’s third law, the initial orbital separation, a, can then be cal-\n723\nculated. By applying these criteria, we obtain a comprehensive\n724\nmeasurement of all the independent parameters.\n725\nAn alternative strategy shares with the above procedure\n726\nthe determination of the parameters T0, {fi}n\ni=0, and Pma from\n727\nthe observations, while leaving the remaining four parameters\n728\nmp, mc, Rc, a to be inferred. They could be potentially deter-\n729\nmined if we have experimental data pertaining to a physical ob-\n730\nservable, such as for example the luminosity profile (26), which\n731\nencapsulates a combination of all these unknowns. By fitting\n732\nsuch data and extracting the best-fit parameters, with the annex\n733\nconstraints on the variation ranges and the Kepler’s third law va-\n734\nlidity, a consistent set of values can be extracted. Depending on\n735\nthe available data, one or the other strategy could be used. Obvi-\n736\nously, the available data varies from system to system.\n737\n5. Conclusions\n738\nThis article deals with spider binary systems, formed by a pul-\n739\nsar and a low-mass companion star, classified in redbacks (mc ∼\n740\n0.1−0.4M⊙) and black widows (mc ≪0.1M⊙). One of their dis-\n741\ntinctive features on which we concentrate is the long-term un-\n742\npredictable variations in the orbital period and its first deriva-\n743\ntive (Roberts et al. 2014). Among the different contributions,\n744\nwhich can account for orbital period modulations, it has been\n745\nclearly shown that the most reasonable explanation is due to the\n746\nApplegate mechanism (Applegate & Patterson 1987; Applegate\n747\n1992a,b). This description accounts for orbital timing variations\n748\nvia the companion star’s quadrupole moment changes induced\n749\nby the magnetic dynamo action, which in turn is communicated\n750\nto the orbital motion through quadrupole-gravity coupling.\n751\nThis paper constitutes the first attempt to make the Applegate 752\nmechanism dynamical. To the best of our knowledge, we provide 753\nfor the first time the spider observables’ evolution. Combining 754\ninformation derived by pulsar timing observations and assuming 755\nthe Applegate mechanism as true, we are able to track the evo- 756\nlution in time (within a determined timeframe) of some physical 757\nquantities (cf. Eq. (33)).\n758\nVoisin et al. (2020a,b) considerably improved the treatment 759\nof the quadrupole deformations while also adding relativis- 760\ntic effects, but they only provided the dynamical evolution of 761\nthe quadrupole moment. Another important difference between 762\nVoisin et al. (2020a,b) and our approach relies on the final goals. 763\nVoisin et al. (2020a,b) proposed a detailed model for describing 764\nthe motion of spider binary systems to accurately estimate the 765\nobserved ∆P variations with the ultimate objective of improving 766\nthe timing solution pertaining to these gravitational sources.\n767\nOn the other side, our work employs a reverse approach: 768\nrather than finding a physical justification for the ∆P variations, 769\nwe take them from the long-term observations and, by relying 770\non the validity of the Applegate mechanism, we reconstruct the 771\ndynamics of the related physical variables. Therefore, we follow 772\nan observational and deductive analysis instead of a theoretical 773\nand inductive one. Even though our model is very simple, we 774\nemphasize that it could also be applied to more refined frame- 775\nworks.\n776\nTo achieve our goal, we have first derived the equations of 777\nmotion (10) – (14) pertaining to the dynamics of spider binaries, 778\nbased on the Applegate works. Then, we have considered the 779\nfunction ∆P(t), reconstructed by fitting the observational data on 780\nthe orbital period modulations. However, the resolution of this 781\nproblem can be accomplished most likely only numerically and 782\nthis can be excessively time consuming. To this end, we have de- 783\nveloped a mathematical procedure (see Sec. 3), based on approx- 784\nimating the quasi-circular orbit with a circular one, even though 785\nit presents mild oscillations on small timescales. This strategy 786\nhas allowed us to obtain rS(t) without solving Eq. (10). Substitut- 787\ning this function and ∆P(t) into Eq. (14) we have that the ensuing 788\ndifferential equation is still difficult to solve analytically.\n789\nTherefore, to avoid any kind of numerical integration, we 790\nhave approximated rS(t) and ∆P(t) with high-accurate polyno- 791\nmials. This has allowed us to have an analytical expression of 792\nQ(t), whose functional formula has been reported in Eq. (31). 793\nThis result is in good agreement with the corresponding func- 794\ntion computed by numerically integrating together Eqs. (10) – 795\n(14) without making any simplifying hypothesis. Through these 796\nformulae, it has been possible to easily obtain the evolution of 797\nthe related physical observables, which are (see Sec. 2.4): orbits, 798\nquadrupole moment, magnetic field, and luminosity.\n799\nIn Fig. 3, we have displayed the orbital period modulations 800\nof the redback 47 Tuc W and black widow 47 Tuc O, whereas in 801\nFigs. 4, 5, 6, and 7 we have shown the evolution of the related 802\nphysical observables via our model. We have discussed analo- 803\ngies and differences among the two sources (see Sec. 4.1), being 804\nrepresentatives of the redbacks and black widows. We have con- 805\ntextualized these results in a more general physical picture.\n806\nThe advantages of our approach are: (1) making use of sim- 807\nple formulae; (2) having the evolution of the above described 808\nphysical variables, which allow to be better modeled through fu- 809\nture upgraded descriptions; (3) having insight into the subsurface 810\nmagnetic activity inside the companion star, which is still not 811\na clear topic; (4) employing our analytical formulae to tightly 812\nconstraint the model parameters by using not only the orbital pe- 813\nriod modulations, but also the profile of other observables (e.g., 814\nZhao & Heinke 2023, use the luminosity profile as further in- 815\nArticle number, page 10 of 13\n\n\nDe Falco et al. (2024): Reconstruction of spider system’s observables\nformaion); (5) the vast application of our developments to more\n816\nupdated or different descriptions of spider binary systems.\n817\nHowever, our treatment possesses also some evident limits:\n818\n(1) the model is very simple and must be improved under dif-\n819\nferent naive aspects; (2) the magnetic field necessitates to be\n820\nmodeled through more realistic formulae, based on MHD simu-\n821\nlations (Dobler et al. 2006; Browning 2008), to clarify the link\n822\nbetween surface and subsurface magnetic fields, still not fully\n823\ntreated (Morin 2012); (3) it is not adequate to reproduce dissipa-\n824\ntive phenomena (Lanza 2006), as well as new effects as the gen-\n825\neral relativistic corrections and the three-dimensional motion of\n826\nthe two-bodies (Voisin et al. 2020a,b); (4) the model prediction\n827\npower is limited only within the observational period [t0, t1].\n828\nThe future perspectives can branch out into several routes.\n829\nFirst, the methodology and results of this article could be ap-\n830\nplied to catalog all the available spider systems and to perform\n831\nmore accurate analyses, in order to extract relevant information\n832\non stellar evolution, and to classifyi the pulsar population in a\n833\nmore methodical fashion. Another possible development is to\n834\nderive a more handy equation from actual MHD simulations to\n835\nbetter model the magnetic activity inside the companion star.\n836\nAcknowledgments\n837\nThe authors greatly thank Oleg Kochukhov for valuable com-\n838\nments on our results. V.D.F. is grateful to Gruppo Nazionale di\n839\nFisica Matematica of Istituto Nazionale di Alta Matematica (IN-\n840\nDAM) for support. V.D.F. acknowledges the support of INFN\n841\nsez. di Napoli, iniziativa specifica TEONGRAV. V.D.F. is grate-\n842\nful to both the SRT – Sardinia Radio Telescope and the Max\n843\nPlanck Institute für Radioastronomie in Bonn for the hospitality.\n844\nA.Ca. is grateful to Scuola Superiore Meridionale for hospital-\n845\nity. A.R. is supported by the Italian National Institute for Astro-\n846\nphysics (INAF) through an ‘IAF - Astrophysics Fellowship in\n847\nItaly’ fellowship (Codice Unico di Progetto: C59J21034720001;\n848\nProject ‘MINERS’). AR also acknowledges continuing valuable\n849\nsupport from the Max-Planck Society.\n850\nArticle number, page 11 of 13\n\n\nA&A proofs: manuscript no. ms\nAppendix A: Polynomial approximations\n851\nWe provide the polynomial approximations of ∆P(t), rS(t), Q(t)\n852\nwith the related MRE for the spider systems 47 Tuc W (see Eq.\n853\n(A.1)) and 47 Tuc O (see Eq. (A.2)). The input parameters of\n854\nthese two physical systems are reported in Table A.1.\n855\nWe assume that the pulsar mass is the standard value mp =\n856\n1.4M⊙. The companion star’s mass, mc is taken from works cited\n857\nin the caption of Table A.1, assuming that the binary system is\n858\nseen by the observer almost edge on, namely sin i = 1 with i\n859\ninclination of the observer with respect to the z-axis. Instead, the\n860\ninitial binary separation a is calculated via the Kepler’s third law\n861\n(cf. Eq. (18)), employing f0 = 1/P0, mp, mc.\n862\nRegarding the companion star’s radius (at rest), Rc, there is\n863\nno guidance on its calculation in the referenced papers on the\n864\ntwo sources. To estimate it, we follow this strategy. In black wid-\n865\nows, the companion can reach extremely low masses, as seen\n866\nin 47 Tuc O, suggesting it may be a brown dwarf, whose ra-\n867\ndius typically falls within the range 0.064 −0.113R⊙(Sorahana\n868\net al. 2013). For our purposes, we adopt an average radius of\n869\nRc = 0.08R⊙. In contrast, for redbacks, the companion is a main-\n870\nsequence star, allowing us to estimate its radius using the follow-\n871\ning formula (see Table A.1 and Demory et al. 2009):\n872\nRc =\n mc\nM⊙\n!0.8\nR⊙= 0.20R⊙.\n(A.1)\nThe radii we have selected are in agreement with the Roche lobe\n873\nsize RL of the two sources (Frank et al. 2002), as for 47 TUC W\n874\nwe have Rc/RL = 0.78, while for 47 TUC O it is Rc/RL = 0.63.\n875\nA.1. Redback: 47 Tuc W\n876\nWe approximate ∆P(t) with the polynomial\n877\nP1(t) = −1.24 × 105t9 + 5.67 × 105t8 −1.10 × 106t7\n+ 1.16 × 106t6 −7.31 × 105t5 + 2.80 × 105t4\n−6.30 × 104t3 + 7.62 × 103t2 −3.97 × 102t + 4.74,\n(A.2)\nwhere t ∈[0, 1], which can be cast in [t0, t1] via Eq. (6), and\n878\nP1(t) has the dimension of ms. The related MRE is ∼10−5%,\n879\nwhich is extremely accurate, since we have used a ninth-order\n880\npolynomial (see discussion of Sec. 3.1, for details).\n881\nWe use the approximation (A.2) for calculating the radius\n882\nrS(t) (cf. Eqs. (29) and (30)), committing a MRE of ∼10−13%,\n883\nwhich is still very accurate. For the quadrupole moment, we em-\n884\nploy Eq. (11) and this polynomial approximation for rS(t)\n885\nR1(t) = −6.31 × 108t9 + 2.89 × 109t8 −5.58 × 109t7\n+ 5.91 × 109t6 −3.73 × 109t5 + 1.43 × 109t4 −3.21 × 108t3\n+ 3.89 × 107t2 −2.02 × 106t + 8.79 × 1010,\n(A.3)\nwhere t ∈[0, 1] and R1(t) is expressed in cm. The MRE for\n886\nrS(t) is of ∼10−13%. Using this approach, the MRE on Q(t)\n887\nis ∼×10−3%, which is still in good agreement. We conclude\n888\nthat the quadrupole moment is approximated with respect to the\n889\noriginal solution with a MRE of 0.004%.\n890\nA.2. Black widow: 47 Tuc O\n891\nWe approximate ∆P(t) with the polynomial (in ms unit)\n892\nP2(t) = 2.98 × 106t12 −1.78 × 107t11 + 4.66 × 107t10\n−7.07 × 107t9 + 6.88 × 107t8 −4.48 × 107t7\n+ 1.98 × 107t6 −5.89 × 106t5 + 1.15 × 106t4\n−1.40 × 105t3 + 9.72 × 103t2 −3.42 × 102t + 4.59,\n(A.4)\nwhere t ∈[0, 1], whose related MRE is ∼×10−3%, being very 893\naccurate, as P2(t) is of twelfth order (see Sec. 3.1, for details).\n894\nThe approximation (A.4) is exploited for computing the ra- 895\ndius rS(t) with a MRE of ∼10−14%. The estimation of the 896\nquadrupole moment (11) is performed by approximating the ra- 897\ndius rS(t) via the following polynomial (in cm unit and t ∈[0, 1]) 898\nR2(t) = 1.48 × 1010t12 −8.79 × 1010t11 + 2.30 × 1011t10\n−3.50 × 1011t9 + 3.41 × 1011t8 −2.22 × 1011t7\n+ 9.81 × 1010t6 −2.92 × 1010t5 + 5.69 × 109t4 −6.91 × 108t3\n+ 4.81 × 107t2 −1.69 × 106t + 7.74 × 1010.\n(A.5)\nThe associated MRE is of ∼10−12%. Therefore, the MRE on 899\nQ(t) is ∼10−4%, being in perfect agreement with the original 900\nformula. Finally, the quadrupole moment is approximated with 901\nrespect to the original solution with a MRE of 0.03%.\n902\nReferences\n903\nAlpar, M. A., Cheng, A. F., Ruderman, M. A., & Shaham, J. 1982, Nature, 300,\n904\n728\n905\nApplegate, J. H. 1992a, ApJ, 385, 621\n906\nApplegate, J. H. 1992b, in Astronomical Society of the Pacific Conference Se-\n907\nries, Vol. 26, Cool Stars, Stellar Systems, and the Sun, ed. M. S. Giampapa &\n908\nJ. A. Bookbinder, 343\n909\nApplegate, J. H. & Patterson, J. 1987, ApJ, 322, L99\n910\nApplegate, J. H. & Shaham, J. 1994, ApJ, 436, 312\n911\nBalbus, S. A. & Brecher, K. 1976, ApJ, 203, 202\n912\nBaliunas, S. L. & Vaughan, A. H. 1985, Ann. Rev. Astron. Astrophys., 23, 379\n913\nBelczynski, K., Lorimer, D. R., Ridley, J. P., & Curran, S. J. 2010, MNRAS,\n914\n407, 1245\n915\nBhattacharya, D. & van den Heuvel, E. P. J. 1991, Phys. Rep., 203, 1\n916\nBisnovatyi-Kogan, G. S. & Komberg, B. V. 1974, Soviet Ast., 18, 217\n917\nBlandford, R. & Teukolsky, S. A. 1976, ApJ, 205, 580\n918\nBochenek, C., Ransom, S., & Demorest, P. 2015, ApJ, 813, L4\n919\nBogdanov, S., Grindlay, J. E., & van den Berg, M. 2005, ApJ, 630, 1029\n920\nBogovalov, S. V., Khangulyan, D., Koldoba, A. V., Ustyugova, G. V., & Aharo-\n921\nnian, F. A. 2012, MNRAS, 419, 3426\n922\nBogovalov, S. V., Khangulyan, D. V., Koldoba, A. V., Ustyugova, G. V., & Aha-\n923\nronian, F. A. 2008, MNRAS, 387, 63\n924\nBours, M. C. P., Marsh, T. R., Parsons, S. G., et al. 2016, MNRAS, 460, 3873\n925\nBrowning, M. K. 2008, ApJ, 676, 1262\n926\nBrowning, M. K., Miesch, M. S., Brun, A. S., & Toomre, J. 2006, ApJ, 648,\n927\nL157\n928\nChandrasekhar, S. 1961, Hydrodynamic and hydromagnetic stability\n929\nCharbonneau, P. & Dikpati, M. 2000, ApJ, 543, 1027\n930\nChen, H.-L., Chen, X., Tauris, T. M., & Han, Z. 2013, ApJ, 775, 27\n931\nChoudhuri, A. R., Schussler, M., & Dikpati, M. 1995, A&A, 303, L29\n932\nConrad-Burton, J., Shabi, A., & Ginzburg, S. 2023, Monthly Notices of the Royal\n933\nAstronomical Society, 525, 2708\n934\nD’Antona, F. & Ergma, E. 1993, A&A, 269, 219\n935\nDemory, B. O., Ségransan, D., Forveille, T., et al. 2009, A&A, 505, 205\n936\nDobler, W., Stix, M., & Brandenburg, A. 2006, ApJ, 638, 336\n937\nDonati, J.-F., Collier Cameron, A., Semel, M., et al. 2003, MNRAS, 345, 1145\n938\nDormand, J. & Prince, P. 1980, Journal of Computational and Applied Mathe-\n939\nmatics, 6, 19\n940\nFalanga, M., Kuiper, L., Poutanen, J., et al. 2005, A&A, 444, 15\n941\nFeiden, G. A. & Chaboyer, B. 2014, ApJ, 789, 53\n942\nFrank, J., King, A., & Raine, D. J. 2002, Accretion Power in Astrophysics: Third\n943\nEdition, 398\n944\nFreire, P. C. C., Ridolfi, A., Kramer, M., et al. 2017, MNRAS, 471, 857\n945\nFruchter, A. S., Stinebring, D. R., & Taylor, J. H. 1988, Nature, 333, 237\n946\nArticle number, page 12 of 13\n\n\nDe Falco et al. (2024): Reconstruction of spider system’s observables\nTable A.1. We show the input parameters (32) pertaining to 47 Tuc W and 47 Tuc O, as well as the quantities Q0 (cf. Eq. (15)), B0 (cf. Eq. (23)),\nand L0 (cf. Eq. (27)). We express all masses and distances in terms of the solar mass M⊙= 2 × 1033g and the solar radius R⊙= 6.96 × 1010cm,\nrespectively. The input parameters and TEMPO coefficients t0, t1, T0, { fi}n\ni=0 are both taken from Ridolfi et al. (2016); Freire et al. (2017). For more\ndetails on how a and Rc have been calculated/chosen, we refer to the beginning of Appendix A.\nParameter\nUnit\n47 Tuc W\n47 Tuc O\nmp\nM⊙\n1.40\n1.40\nmc\nM⊙\n0.13\n0.022\nRc\nR⊙\n0.20\n0.08\na\nR⊙\n1.26\n1.11\nPma\nyr\n2.70\n5.00\nQ0\nM⊙R2\n⊙\n3.61 × 10−5\n6.25 × 10−6\nB0\nkG\n48.79\n0.92\nL0\nL⊙\n34.78\n4.81 × 10−3\nTEMPO coefficients\nt0\nMJD\n51214.216\n47717.894\nt1\nMJD\n54934.047\n56388.106\nT0\nMJD\n51585.3327\n51600.1084\nf0\ns−1\n8.71 × 10−5\n9.59 × 10−5\nf1\ns−2\n−1.27 × 10−18\n−2.09 × 10−21\nf2\ns−3\n4.06 × 10−26\n−1.89 × 10−28\nf3\ns−4\n6.30 × 10−33\n3.94 × 10−35\nf4\ns−5\n−9.18 × 10−40\n−1.49 × 10−43\nf5\ns−6\n6.27 × 10−47\n−5.49 × 10−50\nf6\ns−7\n−2.68 × 10−54\n5.76 × 10−58\nf7\ns−8\n7.41 × 10−62\n5.478 × 10−65\nf8\ns−9\n−1.22 × 10−69\n−8.91 × 10−73\nf9\ns−10\n9.30 × 10−78\n−3.90 × 10−80\nf10\ns−11\n–\n8.57 × 10−88\nf11\ns−12\n–\n1.52 × 10−95\nf12\ns−13\n–\n−4.21 × 10−103\nGentile, P. A., Roberts, M. S. E., McLaughlin, M. A., et al. 2014, ApJ, 783, 69\n947\nGuerra, C., Meliani, Z., & Voisin, G. 2024, A&A, 690, A75\n948\nHall, D. S. 1990, in NATO Advanced Science Institutes (ASI) Series C, Vol. 319,\n949\n95\n950\nHan, E., Lopez-Valdivia, R., Mace, G., & Jaffe, D. 2023, in American Astro-\n951\nnomical Society Meeting Abstracts, Vol. 241, American Astronomical Soci-\n952\nety Meeting Abstracts, 429.07\n953\nHarvey, D., Skillman, D. R., Patterson, J., & Ringwald, F. A. 1995, PASP, 107,\n954\n551\n955\nKaplan, D. L., Bhalerao, V. B., van Kerkwijk, M. H., et al. 2013, ApJ, 765, 158\n956\nKluzniak, W., Ruderman, M., Shaham, J., & Tavani, M. 1988, Nature, 334, 225\n957\nKochanek, C. S. 1992, ApJ, 385, 604\n958\nLanza, A. F. 2006, MNRAS, 369, 1773\n959\nLanza, A. F. & Rodonò, M. 1999, A&A, 349, 887\n960\nLanza, A. F. & Rodonò, M. 2002, Astronomische Nachrichten, 323, 424\n961\nLanza, A. F., Rodono, M., & Rosner, R. 1998, MNRAS, 296, 893\n962\nLazaridis, K., Verbiest, J. P. W., Tauris, T. M., et al. 2011, MNRAS, 414, 3134\n963\nMacDonald, J. & Mullan, D. J. 2009, ApJ, 700, 387\n964\nMacDonald, J. & Mullan, D. J. 2017, ApJ, 850, 58\n965\nMorin, J. 2012, EAS Publications Series, 57, 165\n966\nNg, C. W., Takata, J., Strader, J., Li, K. L., & Cheng, K. S. 2018, ApJ, 867, 90\n967\nPallanca, C., Mignani, R. P., Dalessandro, E., et al. 2012, ApJ, 755, 180\n968\nPan, Z., Lu, J. G., Jiang, P., et al. 2023, Nature, 620, 961\n969\nPapitto, A., Ferrigno, C., Bozzo, E., et al. 2013, Nature, 501, 517\n970\nParker, E. N. 1955, ApJ, 122, 293\n971\nParker, E. N. 1979, ApJ, 230, 905\n972\nPodsiadlowski, P. 1991, Nature, 350, 136\n973\nPress, W. H., Teukolsky, S. A., Vetterling, W. T., & Flannery, B. P. 2002, Numer-\n974\nical recipes in C++ : the art of scientific computing\n975\nRadhakrishnan, V. & Srinivasan, G. 1982, Current Science, 51, 1096\n976\nRappaport, S., Verbunt, F., & Joss, P. C. 1983, ApJ, 275, 713\n977\nRasio, F. A., Shapiro, S. L., & Teukolsky, S. A. 1989, ApJ, 342, 934\n978\nRidolfi, A., Freire, P. C. C., Torne, P., et al. 2016, MNRAS, 462, 2918\n979\nRoberts, M. S. E. 2012, Proceedings of the International Astronomical Union, 8,\n980\n127–132\n981\nRoberts, M. S. E. 2013, in IAU Symposium, Vol. 291, Neutron Stars and Pulsars:\n982\nChallenges and Opportunities after 80 years, ed. J. van Leeuwen, 127–132\n983\nRoberts, M. S. E., Al Noori, H., Torres, R. A., et al. 2018, in IAU Symposium,\n984\nVol. 337, Pulsar Astrophysics the Next Fifty Years, ed. P. Weltevrede, B. B. P.\n985\nPerera, L. L. Preston, & S. Sanidas, 43–46\n986\nRoberts, M. S. E., Mclaughlin, M. A., Gentile, P., et al. 2014, Astronomische\n987\nNachrichten, 335, 313\n988\nRomani, R. W., Filippenko, A. V., Silverman, J. M., et al. 2012, ApJ, 760, L36\n989\nRuderman, M., Shaham, J., Tavani, M., & Eichler, D. 1989, ApJ, 343, 292\n990\nShaifullah, G., Verbiest, J. P. W., Freire, P. C. C., et al. 2016, MNRAS, 462, 1029\n991\nSmedley, S. L., Tout, C. A., Ferrario, L., & Wickramasinghe, D. T. 2015, MN-\n992\nRAS, 446, 2540\n993\nSorahana, S., Yamamura, I., & Murakami, H. 2013, ApJ, 767, 77\n994\nStappers, B. W., Archibald, A. M., Hessels, J. W. T., et al. 2014, ApJ, 790, 39\n995\nStappers, B. W., Bailes, M., Lyne, A. G., et al. 2001, MNRAS, 321, 576\n996\nStappers, B. W., Bailes, M., Lyne, A. G., et al. 1996a, ApJ, 465, L119\n997\nStappers, B. W., Bessell, M. S., & Bailes, M. 1996b, ApJ, 473, L119\n998\nSterne, T. E. 1939, MNRAS, 99, 451\n999\nStrader, J., Swihart, S., Chomiuk, L., et al. 2019, ApJ, 872, 42\n1000\nSullivan, A. G. & Romani, R. W. 2024 [arXiv:2405.13889]\n1001\nvan Buren, D. 1986, AJ, 92, 136\n1002\nvan den Heuvel, E. P. J. & van Paradijs, J. 1988, Nature, 334, 227\n1003\nVoisin, G., Breton, R. P., & Summers, C. 2020a, MNRAS, 492, 1550\n1004\nVoisin, G., Clark, C. J., Breton, R. P., et al. 2020b, MNRAS, 494, 4448\n1005\nWang, S. Q., Wang, J. B., Wang, N., et al. 2021, ApjL, 922, L13\n1006\nWarner, B. 1988, Nature, 336, 129\n1007\nWijnands, R. & van der Klis, M. 1998, Nature, 394, 344\n1008\nYadav, R. K., Christensen, U. R., Morin, J., et al. 2015, ApJ, 813, L31\n1009\nYoshida, S. 2019, MNRAS, 486, 2982\n1010\nZahn, J. P. 2008, in EAS Publications Series, Vol. 29, EAS Publications Series, 1011\ned. M. J. Goupil & J. P. Zahn, 67–90\n1012\nZhao, J. & Heinke, C. O. 2023, MNRAS, 526, 2736\n1013\nArticle number, page 13 of 13\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21283v1.pdf",
    "total_pages": 13,
    "title": "Reconstruction of spider system's observables from orbital period modulations via the Applegate mechanism",
    "authors": [
      "Vittorio De Falco",
      "Amodio Carleo",
      "Alessandro Ridolfi",
      "Alessandro Corongiu"
    ],
    "abstract": "Redback and black widow pulsars are two classes of peculiar binary systems\ncharacterized by very short orbital periods, very low mass companions, and, in\nseveral cases, regular eclipses in their pulsed radio signal. Long-term timing\nrevealed systematic but unpredictable variations in the orbital period, which\ncan most likely be explained by the so-called Applegate mechanism. This relies\non the magnetic dynamo activity generated inside the companion star and\ntriggered by the pulsar wind, which induces a modification of the star's\noblateness (or quadrupole variation). This, in turn, couples with the orbit by\ngravity, causing a consequent change in the orbital period. The Applegate\ndescription limits to provide estimates of physical quantities by highlighting\ntheir orders of magnitude. Therefore, we derive the time-evolution differential\nequations underlying the Applegate model, that is, we track such physical\nquantities in terms of time. Our strategy is to employ the orbital period\nmodulations, measured by fitting the observational data, and implementing a\nhighly accurate approximation scheme to finally reconstruct the dynamics of the\nspider system under study and the relative observables. Among the latter is the\nmagnetic field activity inside the companion star, which is still a matter of\ndebate for its complex theoretical modeling and the ensuing expensive numerical\nsimulations. As an application, we exploit our methodology to examine two\nspider sources: 47 Tuc W (redback) and 47 Tuc O (black widow). The results\nobtained are analyzed and then discussed with the literature.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}