{
  "id": "arxiv_2502.21203v1",
  "text": "Approximation of anisotropic pair potentials using multivariate interpolation\nMohammadreza Fakhraei,1 Chris A. Kieslich,1, 2, a) and Michael P. Howard1, b)\n1)Department of Chemical Engineering, Auburn University, Auburn, AL 36849,\nUnited States\n2)Wallace H. Coulter Department of Biomedical Engineering, Georgia Institute of Technology, Atlanta,\nGeorgia 30332, United States\nThe interaction between two particles with shape or interaction anisotropy can be modeled using a pairwise\npotential energy function that depends on their relative position and orientation; however, this function is\noften challenging to mathematically formulate. Data-driven approaches for approximating anisotropic pair\npotentials have gained significant interest due to their flexibility and generality but often require large sets\nof training data, potentially limiting their feasibility when training data is computationally demanding to\ncollect. Here, we investigate the use of multivariate polynomial interpolation to approximate anisotropic pair\npotentials from a limited set of prescribed particle configurations. We consider both standard Chebyshev\npolynomial interpolation as well as mixed-basis polynomial interpolation that uses trigonometric polynomials\nfor coordinates along which the pair potential is known to be periodic. We exploit mathematical reasoning and\nphysical knowledge to refine the interpolation domain and to design our interpolants. We test our approach on\ntwo-dimensional and three-dimensional model anisotropic nanoparticles, finding satisfactory approximations\ncan be constructed in all cases.\nI.\nINTRODUCTION\nAnisotropic particles are widely encountered as both\nsynthetic1,2 and natural3–5 materials, and the complex\ninteractions between these particles is known to lead to\ninteresting collective behaviors such as self-assembly.6–8\nFor example, shape-anisotropic nanoparticles have been\nused to synthesize photonic crystals with desirable opti-\ncal properties,9,10 dense and exotic superlattices,11 and\nporous supraparticles;12 anisotropic surface interactions\nhave been designed to drive the formation of protein\nnanocages;13 and shape is believed to play a role in\nthe aggregation of microplastics in the environment.14,15\nComputer simulations are useful tools for understanding\nand engineering these mesoscale processes, so there is in-\nterest to develop robust, efficient modeling capabilities\nfor anisotropic particles.\nAn anisotropic particle can be represented as a sin-\ngle body with translational and rotational degrees of\nfreedom,16 and a pairwise potential energy function\ncan be used to model how the effective interaction be-\ntween two anisotropic particles depends on their rela-\ntive position and orientation.\nExamples of such en-\nergy functions include the Kern–Frenkel potential for\npatchy nanoparticles,17 the Gay–Berne potential for\nellipsoids,18 and an anisotropic generalization of the\nWeeks–Chandler–Andersen repulsive potential19 to hard\npolyhedra.20 These pair potentials have functional forms\nthat are relatively straightforward to parametrize and im-\nplement in simulations but only represent a limited set\nof anisotropic particles. Additional types of anisotropic\nparticles can be described as composites of smaller con-\nstituent particles that interact isotropically.21 An effec-\ntive anisotropic interaction arises from the placement of\na)Electronic mail: kieslich@gatech.edu\nb)Electronic mail: mphoward@auburn.edu\nthe constituent particles and the nature of their interac-\ntions with each other. This approach offers the flexibil-\nity to represent many types of anisotropic particles;15,22\nhowever, such models can be cumbersome to construct\nand their computational cost grows with the number of\nconstituent particles required.\nRecently, there has been significant interest in us-\ning data-driven methods to approximate anisotropic\npair potentials with unknown functional dependence\non the relative position and orientation of the parti-\ncles.\nAn anisotropic potential modeled as a multi-\nvariate series of cubic B-splines and cosines was fit\nto measured forces and torques23 using a generaliza-\ntion of the multiscale coarse-graining method.24,25 Lin-\near regression of a downselected pool of particle-centered\ndescriptors26,27 and density expansions28 has been used\nto approximate anisotropic pair potentials without pre-\nscribing the functional form. Neural-network potentials\nwere also used to model anisotropic interactions of ben-\nzene and sexithiophene29 as well as shape-anisotropic\nnanoparticles30 by force and torque matching.\nThese\ndata-driven models have shown promising accuracy but\ntraining them can require large amounts of data that may\nnot always be feasible to collect, e.g., if the underlying\nmodel is costly to simulate.\nIn this work, we explore the possibility of using mul-\ntivariate interpolation to approximate anisotropic pair\npotentials with limited data.\nSpecifically, we consider\nan N-term approximation ˆu of the true pair potential u\nthat is a function of the relative position r and relative\norientation Ωof two anisotropic particles,\nˆu(r, Ω) =\nN−1\nX\nn=0\ncnψn(r, Ω),\n(1)\nwhere cn and ψn are the n-th coefficient and basis func-\ntion, respectively.\nThe set of coefficients {cn} can be\nuniquely determined from a system of linear equations\narXiv:2502.21203v1  [cond-mat.soft]  28 Feb 2025\n\n\n2\nequating ˆu and u at only N points where u has been\nsampled. Different interpolation schemes typically con-\nsist of both a set of basis functions and a set of sam-\nple points that are connected to each other in some way.\nFor example, piecewise linear interpolation is usually per-\nformed with uniformly spaced sample points that are\ncolocated with the boundaries of the locally linear pieces,\nwhereas Chebyshev polynomial interpolation is typically\nperformed using sample points placed at the roots or ex-\ntrema of the Chebyshev polynomials of the first kind that\nalso serve as global basis functions.\nThis relationship\nbetween basis functions and sample points for interpo-\nlation schemes differs from black-box machine-learning\napproaches, for which the sample points are usually only\nexpected to cover the input space, and it can help pro-\nduce good approximations with relatively small amounts\nof data. For example, Chebyshev polynomial interpola-\ntion using the Chebyshev extrema as sample points tends\nto minimize oscillations near the edges of the approxima-\ntion domain.31,32\nPolynomials with analogous form to eq (1) have been\nsuccessfully used to construct classical potential energy\nfunctions. The Chebyshev Interaction Model for Efficient\nSimulation (ChIMES)33–36 approximates the many-body\npotential of mean force (up to four-body terms) using a\nmultivariate polynomial in the distances between bodies\nwhose basis functions are products of Chebyshev polyno-\nmials of the first kind. ChIMES has been demonstrated\nto accurately model molten carbon,33 water,34 carbon\ncondensation,35 and nitrogen under shock compression.36\nIn ChIMES, the coefficients of the basis functions are fit\nto match the forces observed in a quantum-mechanical\nsimulation using least-squares regression rather than in-\nterpolate the energy. Nance and co-workers have used\nLangrange polynomials with sparsely sampled Cheby-\nshev extrema to interpolate an ab initio potential en-\nergy surface and reaction path for the isomerization of\n2-butene.37,38 Additionally, Morrow et al. used a combi-\nnation of Lagrange polynomials and trigonometric poly-\nnomials with sparse sampling to model a potential en-\nergy surface for azomethane.39 Based on physical knowl-\nedge, they used Lagrange polynomials as basis functions\nfor nonperiodic coordinates (e.g., bond lengths and bond\nangles) and trigonometric polynomials as basis functions\nfor periodic coordinates (e.g., torsional angles). Nguyen\nand Huang also used a mix of basis functions for force\nand torque matching of anisotropic potentials;23 in their\nwork, the radial-distance dependence was captured by\nB-spline functions, while all other angular dependences\nwere expressed using cosines.\nBuilding on this prior work, we develop and assess\na framework for using multivariate interpolation to ap-\nproximate anisotropic pair potentials. Anisotropic inter-\nactions present several challenges for interpolation that\nmust be addressed. First, the prescribed sample points\nmay contain overlapping configurations with large repul-\nsion (large or divergent energies) that are challenging\nto accurately approximate using polynomials, but these\nconfigurations may occur at varying center-to-center sep-\narations of the particles due to their anisotropy. Second,\nphysical symmetries of the shapes may introduce aliasing\neffects or sampling inefficiencies. Finally, the interaction\nenergy may vary much more significantly with respect to\nsome coordinates than others.\nWe address these chal-\nlenges by developing suitable coordinate transformations\nto remove unfavorable configurations from the approxi-\nmation domain, leveraging physical symmetries to reduce\nthe approximation domain, and choosing appropriate ba-\nsis functions and degrees of approximation for our trans-\nformed coordinates based on both physical and math-\nematical considerations.\nOverall, we find that our ap-\nproach produces quite satisfactory approximations using\nrelatively few terms (and corresponding sample points)\nin eq (1).\nThe rest of this article is organized as follows.\nWe\nfirst describe the model two- and three-dimensional\nanisotropic nanoparticles, comprised of Lennard-Jones\nparticles, that we considered as test problems. We then\ndevelop our framework for interpolating anisotropic pair\npotentials using a two-dimensional rod nanoparticle as\na motivating example. We apply our framework to ap-\nproximate anisotropic pair potentials for all our two- and\nthree-dimensional nanoparticles and assess its accuracy.\nWe conclude with a summary of our key results and some\nremarks on the framework.\nII.\nMODEL ANISOTROPIC NANOPARTICLES\nWe used three two-dimensional (rod, square, trian-\ngle) and three three-dimensional (rod, cube, tetrahedron)\nanisotropic nanoparticles as representative test problems\nfor our framework (Figure 1).\nAll nanoparticles were\nmodeled using spherical constituent particles with nomi-\nnal diameter σ that were regularly arranged inside the\nnanoparticle volume and separated from their nearest\nneighbors by 2σ/3. The constituent-particle discretiza-\ntion was also similar for all nanoparticles (6 constituent\nparticles per axis or edge). The initial position and ori-\nentation of a nanoparticle was defined such that its cen-\nter of mass was at the origin and its moment of inertia\ntensor was diagonal (i.e., its principal axes were aligned\nwith the Cartesian axes). The two-dimensional nanopar-\nticles translated in x and y, and they rotated about the\nz-axis by angle α. The three-dimensional nanoparticles\ntranslated in x, y, and z, and they rotated using an in-\ntrinsic (body-attached) Euler angle sequence in which the\nnanoparticle was first rotated about its z-axis by α, then\nabout its x-axis by β, and last about its z-axis again by\nγ.\nThe total energy between two nanoparticles was\ncomputed as a pairwise sum of interactions between\nconstituent particles in different nanoparticles.\nThe\nconstituent particles interacted through a perturbed\n\n\n3\nx\nx\ny\ny\n(a)\n(b)\nz\n(c)\n(d)\n(f)\n(e)\nFIG. 1. Two-dimensional nanoparticles [(a) rod, (b) square, and (c) triangle] and three-dimensional nanoparticles [(d) rod, (e)\ncube, and (f) tetrahedron] in their initial orientations. Images rendered using VMD 1.9.4.40\nLennard-Jones potential,19\nu(r) =\n(\nuLJ(r) + (1 −λ)ε,\nr ≤21/6σ\nλuLJ(r),\nr > 21/6σ ,\n(2)\nwhere uLJ is the standard Lennard-Jones potential,\nuLJ(r) = 4ε\n\u0014\u0010σ\nr\n\u001112\n−\n\u0010σ\nr\n\u00116\u0015\n,\n(3)\nε is the energy scale, λ modulates the strength of the\nattraction, and r is the distance between the centers of\nthe constituent particles. The constituent-particle inter-\naction was truncated and shifted to zero at 3 σ for com-\nputational convenience. To help reduce the dependence\nof our model on the constituent-particle discretization\nacross different nanoparticle shapes, we numerically com-\nputed λ to make the interaction energy −5ε for the most\nattractive configuration for each nanoparticle. We first\nminimized u with respect to r and Ωwhen λ = 1, start-\ning from a edge-to-edge or face-to-face configuration. We\nthen performed a bisection search for 0 ≤λ ≤1 to solve\nfor λ such that u = −5ε for this configuration.\nIII.\nFRAMEWORK\nA.\nMultivariate interpolation\nWe considered multivariate interpolation schemes us-\ning continuous, differentiable basis functions on the do-\nmain of ˆu because the gradient of ˆu is required for some\nenergy minimization methods and to evaluate forces and\ntorques for molecular dynamics simulations.16 The mul-\ntivariate basis functions and sample points were con-\nstructed using a tensor product that forms all possi-\nble combinations of univariate basis functions and sam-\nple points selected for each coordinate. Specifically, we\nused univariate interpolation schemes based on Cheby-\nshev polynomials and trigonometric polynomials.\nFor\nthe Chebyshev polynomial scheme, the univariate basis\nfunctions were the first P + 1 Chebyshev polynomials\nof the first kind Tn(x) for n = {0, ..., P}, which have\nthe domain −1 ≤x ≤1.\nThe corresponding sample\npoints were the extrema of the highest degree polyno-\nmial TP , which occur at cos(πm/P) for m = {0, ..., P}\nwhen P ≥1 and nominally at 0 for P = 0.\nFor the\ntrigonometric scheme, the univariate basis functions were\nthe P +1 complex exponential functions ϕn(x) = einx for\nn = {−P/2, ..., P/2}, which have the domain 0 ≤x < 2π;\nhere, P is required to be even. The corresponding sam-\nple points were uniformly spaced in the domain of the\nbasis function, at 2πm/(P + 1) for m = {0, ..., P}. In\nboth cases, the domain of the coordinate being inter-\npolated was linearly transformed to the domain of the\nbasis function. We anticipated that the Chebyshev poly-\nnomials might be better basis functions for nonperiodic\ncoordinates, while the trigonometric polynomials might\nbe better basis functions for periodic coordinates. We\nwill discuss this more later.\nWe initially attempted to interpolate u(x, y) for a pair\nof two-dimensional rods fixed in their initial orientation\nas a function of the Cartesian position (x, y) of one rel-\native to the other (Figure 2). The domain of the inter-\npolant ˆu was −8 σ ≤x ≤8 σ and −4 σ ≤y ≤4 σ, and we\nconsidered 5 sample points (P = 4) for both coordinates.\nTo establish a reference point for our chosen polynomial\ninterpolation schemes, we also constructed a multivariate\nlinear piecewise interpolant on an equivalent-size uniform\ngrid of sample points. The linear piecewise interpolant\nis simpler to evaluate than the polynomial interpolant\nbut is not continuously differentiable. For some sample\n\n\n4\n-8\n-4\n0\n4\n8\nx (σ)\n4\n0\n4\ny (σ)\n(a)\n4\n0\n4\ny (σ)\n(b)\n(c)\n-8\n-4\n0\n4\n8\nx (σ)\n4\n0\n4\ny (σ)\n(d)\n-8\n-4\n0\n4\n8\nx (σ)\n(e)\n5\n0\n5\nenergy (ε)\nFIG. 2. Energy of a pair of two-dimensional rods fixed in their\ninitial orientation as a function of relative Cartesian position:\n(a) true, (b–c) piecewise linear interpolation using Cartesian\ncoordinates, and (d–e) Chebyshev polynomial interpolation\nusing Cartesian coordinates. In (b) and (d), 5 sample points\nwere used per coordinate, while in (c) and (e), 9 sample points\nwere used per coordinate.\npoints, u diverged or was very large, so we capped the\nenergy to be less than 5 ε as a typical “large” value that\nwould not be expected to be frequently observed in a\nsimulation.\nBoth approximations were poor compared\nto the true pair potential [Figure 2(a)]. The piecewise\nlinear interpolant had limited resolution of the repulsion\nand did not capture the deep attraction between side-\nby-side rods [Figure 2(b)]. The Chebyshev polynomial\ninterpolant did worse at capturing the repulsion and also\nexhibited unphysical attraction at large separations [Fig-\nure 2(d)]. Increasing the resolution of the interpolation\nto use 9 sample points (P = 8) per coordinate did not\nresolve these issues [Figures 2(c) and 2(e)].\nThis result highlights one of the key challenges for in-\nterpolating anisotropic pair potentials. By construction,\nthe multivariate sample points form a grid that spans\nthe entire domain; however, some of these sample points\ninclude energetically-unfavorable configurations that de-\ncrease the accuracy of the interpolation for other configu-\nrations and, practically, may not be as important to faith-\nfully resolve because they are less likely to be observed.\nMachine-learning-based approximations are less suscep-\ntible to this complication because their sample space\nis not as rigidly prescribed and configurations can be\nstraightforwardly excluded from the training data. In-\ndeed, constant-temperature molecular simulations have\noften be used to collect the training data for such mod-\nels, so these high-energy configurations are naturally ex-\ncluded by the simulation.23,26,27,29,30 A different strategy\nis required to remove such configurations from interpola-\ntive approximations.\nB.\nVariable transformation\nFor many types of particles, the pair potential is ex-\npected to rapidly increase to enforce a strong, short-\nranged repulsion when the particles approach a config-\nuration in which their volumes overlap.\nFor example,\nthe isotropic Lennard-Jones potential [eq (3)] increases\ndrastically when r < σ (two spheres overlap), so highly\nenergetically unfavorable configurations can be excluded\nby setting a lower bound on r. For anisotropic pair poten-\ntials, though, an analogous lower bound on the particles’\nseparation is more complex to prescribe because it can\ndepend on both the relative position r and orientation Ω\nof the particles. For example, our two-dimensional rods\ncan only approach to a center-to-center distance of 4.3 σ\nin an end-to-end configuration but to 1 σ in a side-to-\nside configuration if their volume is nominally that of a\nspherocylinder.\nTo address this issue, we first represented the rela-\ntive particle position r in spherical coordinates (r, θ, ϕ),\nwhere r is the center-to-center distance, 0 ≤θ < 2π is\nthe azimuthal angle, and 0 ≤ϕ ≤π is the polar an-\ngle. Both angles used the standard convention relative\nto the principal axes of the reference particle chosen as\nthe origin. We then defined r0(θ, ϕ, Ω) as a position- and\norientation-dependent lower bound on r. Different cri-\nteria for r0 could be adopted; in this work, we defined\nr0 as the largest r for which u exceeded a threshold 5 ε\nbecause the probability of observing particles in such a\nconfiguration with larger energy is unlikely if ε is compa-\nrable to thermal energy. For our nanoparticles, we solved\nfor r0 numerically: for a given (θ, ϕ, Ω), we performed a\ndecreasing linear search to find the first r where u > 5 ε\nusing a small step size (0.1 σ) and starting from an ini-\ntial guess at which u < 5ε for all configurations, then we\nrefined the resulting bracket using bisection search.\nAn upper bound on r is also typically adopted to\nreduce the number of pair interactions that must be\nevaluated in a simulation.16 Inspired by core-shifted\nforms of eq (3) and the Gay–Berne model for ellipsoids,\nwe assumed that anisotropic interactions resulting from\nshort-ranged attractions would sufficiently decay after\nthe center-to-center distance was increased by a nomi-\nnal cutoff distance rc, making the approximation domain\nr0 ≤r ≤r0 + rc. We used rc = 3 σ for all nanoparticles\nin this work.\nIn our multivariate interpolation schemes, the domain\nof each coordinate must be specified independently of the\nothers, so these bounds on r are not immediately suitable\nfor this purpose. We first considered a variable redefini-\ntion ∆r = r −r0, which is bounded 0 ≤∆r ≤rc and\nso is suitable for interpolation. To test the effectiveness\nof this redefinition, we constructed a one-dimensional in-\n\n\n5\n5\n0\n5\nenergy (ε)\n(a)\ntrue\n∆r\nρ\n0\n5\n(c)\ntrue\n− sym.\n+ sym.\n0\n5\n(e)\ntrue\n− sym.\n+ sym.\n1\n2\n3\nr (σ)\n5\n0\n5\nenergy (ε)\n(b)\ntrue\n∆r\nρ\n0\nπ\n2π\nθ\n0\n5\n(d)\ntrue\n− sym.\n+ sym.\n0\nπ\n2π\nα\n0\n5\n(f)\ntrue\n− sym.\n+ sym.\nFIG. 3. Energy for a pair of two-dimensional rods as a function of (a–b) r at fixed θ and α, (c–d) θ at fixed r and α, and\n(e–f) α at fixed r and θ for the configurations described in the text. The true potential energy is compared to one-dimensional\nlinear piecewise interpolants (top row) or Chebyshev polynomial interpolants (bottom row). In (a–b), the interpolants were\nconstructed using either ∆r or ρ as the transformed distance coordinate, while in (c–f), the interpolants were constructed either\nwithout (−) or with (+) symmetry (sym.) All interpolants used 9 sample points.\nterpolant ˆu(∆r) for the side-to-side configuration of our\ntwo-dimensional rod (θ = π/2, α = 0) using either piece-\nwise linear interpolation [Figure 3(a)] or Chebyshev poly-\nnomial interpolation [Figure 3(b)] with 9 sample points\n(P = 8). While we observed significant improvements\ncompared to equivalent traces of Figure 2 (interpolation\nusing Cartesian coordinates), there were still visible er-\nrors in the approximation.\nThe piecewise linear inter-\npolant poorly approximated the attractive minimum due\nto the lack of samples in that region, while the Cheby-\nshev polynomial interpolant exhibited oscillatory behav-\nior that we attribute to attempting to represent a diverg-\ning function using a polynomial.\nBased on these shortcomings, we considered an alter-\nnative variable redefinition that leverages physical knowl-\nedge. Since many pair potentials are known to depend\non powers of 1/r (rather than r), we defined\nρ =\n1/r −1/r0\n1/(r0 + rc) −1/r0\n,\n(4)\nwhere 0 ≤ρ ≤1. Both the piecewise linear interpolant\nand Chebyshev polynomial interpolant based on ρ im-\nproved substantially compared to the same based on ∆r\nusing the same number of points. The linear piecewise\ninterpolant still had some small inaccuracies in approxi-\nmating the attractive minimum, but the Chebyshev poly-\nnomial interpolant was in excellent agreement with the\ntrue energy across the entire domain. We believe that the\ntransformation to ρ helped both by placing more sam-\nple points at shorter distances where the energy changed\nmore rapidly, as well as by effectively changing the func-\ntional form of the interpolation.\nC.\nSymmetry\nHaving accurately approximated the energy u with re-\nspect to only the center-to-center distance r, we then\nconsidered schemes for each of the other translational\ncoordinates as well as the rotational coordinates.\nWe\nconstructed a one-dimensional interpolant ˆu(θ) for two-\ndimensional rods fixed in their initial orientation (α = 0)\nand another interpolant ˆu(α) for two-dimensional rods\ninitially in an end-to-end configuration (θ = 0) using the\nsame number of points as for ˆu(ρ). In both cases, r was\nfixed at the maximum value of r0 as θ or α was var-\nied. Unfortunately, both the piecewise linear interpolants\n[Figures 3(c) and 3(e)] and the Chebyshev polynomial in-\nterpolants [Figures 3(d) and 3(f)] were highly inaccurate.\nOne cause of this approximation error is that u quickly\nvaries when the rod passes through configurations close\nto overlap, similarly to how u increases when r decreases.\nHowever, unlike in the case of r, there was not an obvi-\nous variable transformation that could be used to remove\nsuch configurations because some of them occurred in the\nmiddle of the approximation domain.\nWe additionally noted that u was periodic with respect\nto θ and α due to physical symmetries of the rod. The\nother nanoparticles we considered also have symmetries,\nand symmetry is often present to some extent in many\nanisotropic particles that are of scientific interest.41,42 We\nhypothesized that accounting for symmetry (periodicity)\nwhen defining our approximation domain would improve\nthe accuracy of ˆu. Symmetry arguments were used in\nref 30 to reduce the input space to the neural-network\nanisotropic pair potential, with mixed success reported.\nFor the translational spherical coordinates (θ, ϕ), we\n\n\n6\nTABLE I. Upper bounds of angles sampled for interpolation, solid angle represented, and corresponding reduction relative to\nthe total solid angle (4π2 for two-dimensional nanoparticles, 32π3 for three-dimensional nanoparticles).\nnanoparticle\nθ\nϕ\nα\nβ\nγ\nsolid angle\nreduction\nrod (2D)\nπ/2\nπ\nπ2/4\n8\nsquare\nπ/4\nπ/2\nπ2/8\n32\ntriangle\nπ/3\n2π/3\n2π2/9\n18\nrod (3D)\nπ/2\n2π\nπ/2\n2π\n≈158\ncube\nπ/4 π/2\n2π\ncos−1(1/\n√\n3) π/2 (3 −\n√\n3)π3/12\n≈303\ntetrahedron 2π/3\nπ\n2π\nπ\n2π/3\n32π3/9\n9\nconsidered symmetries of the reference particle (serving\nas the origin for the interaction) that could be expressed\nas proper rotations that preserve the orientation of the\ncoordinate system. We then rotated the second particle\naround the reference particle to reduce θ and ϕ to their\nsmallest equivalent values. For example, a pair of two-\ndimensional rods with relative position θ ≥π can be\nrotated about the z-axis of the reference particle by π.\nThe reference particle is in an equivalent configuration\nafter this rotation, but the second particle now has θ <\nπ.\nFurther, if θ > π/2 after this transformation, the\nrods can be rotated again about the new y-axis of the\nreference particle by π. This transformation again leaves\nthe reference particle in an equivalent configuration, but\nnow 0 ≤θ ≤π/2.\nThe orientation coordinates represented by Euler an-\ngles (0 ≤α < 2π, 0 ≤β ≤π, and 0 ≤γ < 2π) can also be\nreduced using symmetry. A procedure for doing so has\nbeen used previously in the context of crystallography\nto standardize orientation descriptors.43 For our Euler\nangle convention, the domain of γ for three-dimensional\nparticles (α for two-dimensional particles) can be reduced\nby the degree of rotational symmetry about the princi-\npal axis aligned with the z-axis. For example, the two-\ndimensional rod can be rotated by π to an equivalent\nconfiguration, so 0 ≤α < π is sufficient to represent\nits orientations. We recommend that the principal axis\nwith the highest degree of rotational symmetry should be\naligned in this way. Additionally, for three-dimensional\nparticles, the domain of β can be reduced to 0 ≤β ≤π/2\nif the principal axis aligned with the x-axis has two-fold\nrotational symmetry by remapping α to π+α, β to π−β,\nand γ to 2π −γ.43 We applied these strategies for all our\nnanoparticles, reducing the solid angle represented by a\nfactor between 8 and 303 (Table I). Details of the rota-\ntions needed to reduce the translational coordinates for\neach nanoparticle are described in the Supporting Infor-\nmation.\nTo test how much leveraging symmetry might im-\nprove approximation accuracy, we constructed new in-\nterpolants ˆu(θ) and ˆu(α) for the two-dimensional rods\nusing the same number of points in the reduced domains\nthat account for symmetry.\nBoth the piecewise linear\ninterpolants [Figures 3(c) and 3(e)] and the Chebyshev\npolynomial interpolants [Figures 3(d) and 3(f)] that used\nsymmetry agreed much better with the true energy than\n0\n2\n4\nenergy (ε)\n(a)\ntrue\nC\nT\n0\nπ/2\nπ\nα\n20\n0\n20\nderivative (ε)\n(b)\ntrue\nC\nT\nFIG. 4. (a) Energy for a pair of two-dimensional rods as a\nfunction of α with θ = π/2 and r fixed at the maximum\nvalue of r0 as α varies.\nThe true energy is compared to a\nChebyshev polynomial interpolant (C) using 33 sample points\n(P = 32) and a trigonometric polynomial interpolant (T)\nusing 27 sample points (P = 26).\n(b) The first derivative\nof the same with respect to α.\nthose that did not.\nBy removing periodicities due to\nknown symmetry, the sampling density of unique con-\nfiguration space effectively increases, which is important\nwhen approximating using limited data.\nD.\nSelecting univariate approximations\nIn\naddition\nto\nphysical\nsymmetries\nof\nspecific\nanisotropic particles, some of the coordinates chosen for\nour approximation have inherent periodicity (θ, α, and\nγ).\nApplication of symmetry to reduce their domains\nmay remove some of these periodicities but some may\nremain; indeed, α and γ for three-dimensional particles\nand α for two-dimensional particles are always periodic\nusing our procedure. We typically expect that not only\nthe energy but also its partial derivatives with respect\nto periodic coordinates should be periodic. The sample\n\n\n7\npoints for the Chebyshev polymomials naturally enforce\nperiodicity of the interpolant, but its first derivative is\nnot guaranteed to be periodic. Trigonometric polynomi-\nals, on the other hand, are inherently periodic functions\nthat also have periodic derivatives; they work well for\napproximating periodic data but can struggle to repre-\nsent nonperiodic data.\nHence, a “mixed” basis,39,44,45\nformed from a tensor product of Chebyshev polynomi-\nals for nonperiodic coordinates and trigonometric poly-\nnomials for periodic coordinates, may be advantageous\nfor multivariate interpolation of anisotropic pair poten-\ntials.\nIn support of this notion, we compared the use of\nChebyshev polynomials and trigonometric polynomials\nto interpolate ˆu(α) for two-dimensional rods with θ =\nπ/2 and r fixed at the maximum r0 as α varied (Figure 4).\nTo ensure a reasonably faithful approximation of the en-\nergy, we used 33 points for the Chebyshev polynomial in-\nterpolant and 27 points for the trigonometric polynomial\ninterpolant. (The reasons for selecting these particular\nnumbers of points are described below.) The trigonomet-\nric polynomial interpolant, despite having slightly fewer\nterms and sample points, produced a better approxima-\ntion of ˆu than the Chebyshev polynomial interpolant,\nwhich showed unphysical oscillations. We also computed\ndˆu/dα, and these differences were more exaggerated. We\nnoted that dˆu/dα was also discontinuous across the peri-\nodic boundary for the Chebyshev polynomial interpolant,\nalthough the true energy and the trigonometric polyno-\nmial interpolant were continuous.\nThis example high-\nlights the potential benefits of selecting trigonometric\npolynomials for periodic coordinates.\nAfter selecting the type of basis function for a given\ncoordinate, the degree of the univariate polynomial must\nalso be chosen.\nWe anticipated that some coordinates\nmay be more challenging to interpolate than others, re-\nquiring a higher degree polynomial and more sample\npoints. Even for interpolating a single coordinate, some\nconfigurations may be more challenging than others, as\ncan be seen for the side-to-side, side-to-end, and end-to-\nend configurations of our two-dimensional rods (Figure\nS1). To efficiently refine the approximation of a given\ncoordinate, we considered only univariate polynomial de-\ngrees that produced nested sample points, i.e., all sam-\nple points continued to be used as the degree increased.\nNested points of a nominal nonnegative integer “level” l\nwere generated by choosing P = 2ℓwhen ℓ≥1 and P = 0\nwhen ℓ= 0 for Chebyshev polynomials and P = 3ℓ−1 for\ntrigonometric polynomials. We considered 2ℓ+ 1 nested\nsample points for the corresponding linear piecewise lin-\near interpolant.\nIV.\nRESULTS AND DISCUSSION\nWe\ntested\nour\nframework\non\nthe\nmodel\ntwo-\ndimensional and three-dimensional nanoparticles we se-\nlected as test problems (Figure 1).\nWe constructed a\nlinear piecewise interpolant, a Chebyshev polynomial in-\nterpolant, and a mixed-basis polynomial interpolant that\nused Chebyshev polynomials for the nonperiodic coor-\ndinates and trigonometric polynomials for the periodic\ncoordinates. All interpolants used ρ as the transformed\ncoordinate for the center-to-center distance, and Table I\nlists the angles with corresponding upper bounds for each\nnanoparticle after application of symmetry. The periodic\ncoordinates were α and γ.\nTo interrogate how much data was required to ac-\ncurately approximate the energy u, we exhaustively\nsearched combinations of univariate approximations of\ndifferent degrees that produced a multivariate interpolant\nˆu with fewer than a threshold number of sample points\n[N in eq (1)]. In this discussion, we emphasize that the\nnumber of sample points also describes the number of\nbasis functions included in the polynomial interpolants,\nand interpolants with more sample points are expected to\nbe more accurate because they have sampled more con-\nfigurations and have more flexibility in their functional\nforms. Based on Figure S1 for the two-dimensional rod,\nwe used a minimum of 17 sample points for ρ to en-\nsure we faithfully captured the dependence on center-\nto-center distance, which we expect to play a significant\nrole in determining the forces between particles. We also\nused a minimum of 2 sample points for two-dimensional\nnanoparticles and 3 sample points for three-dimensional\nnanoparticles for the angle coordinates as well as a max-\nimum number of sample points for all coordinates to re-\nduce the size of the search space by excluding interpolants\nthat were unlikely to perform well. All univariate approx-\nimations were also required to use nested sample points.\nTable S1 summarizes the minimum and maximum sam-\nple points considered for each coordinate for the differ-\nent nanoparticles.\nFor the two-dimensional nanoparti-\ncles, the approximated pair potential was a function of\nonly three coordinates, ˆu(ρ, θ, α), so we set the threshold\nnumber of sample points to a modest 2 × 103. For the\nthree-dimensional nanoparticles, we increased N to 104\nfor the rod, for which ˆu(ρ, ϕ, α, β) is a function of four\ncoordinates, and to 5×104 for the cube and tetrahedron,\nfor which ˆu(ρ, θ, ϕ, α, β, γ) depends on all six coordinates.\nTo compare the accuracy of the three interpolation\nschemes, we randomly generated an additional 104 test\nconfigurations for the two-dimensional nanoparticles and\n5 × 104 test configurations for the three-dimensional\nnanoparticles using uniform sampling in the spherical co-\nordinates and Euler angles with rejection to obtain only\npoints that, when reduced, were inside the domain of\nthe interpolants. We computed the square of the Pear-\nson correlation coefficient R2 and root mean square error\n(RMSE) for each multivariate interpolant by comparing\nthe approximated energy ˆu and the true energy u for the\ntest configurations. For clarity, we will present only the\nresults from interpolants that improved (had larger R2\nor smaller RMSE) as the total number of sample points\nincreased. Both metrics identified the same best inter-\npolants, with the exception of the linear piecewise inter-\n\n\n8\n0.8\n0.9\n1.0\nR 2\n(a)\nrod\nL\nC\nM\n(b)\nsquare\nL\nC\nM\n(c)\ntriangle\nL\nC\nM\n0\n1000\n2000\nsample points\n10\n1\n10\n0\nRMSE (ε)\n(d)\nL\nC\nM\n0\n1000\n2000\nsample points\n(e)\nL\nC\nM\n0\n1000\n2000\nsample points\n(f)\nL\nC\nM\nFIG. 5.\n(a–c) R2 and (d–e) RMSE for linear piecewise (L), Chebyshev polynomial (C), and mixed-basis polynomial (M)\ninterpolants for the two-dimensional nanoparticles [(a) & (d) rod, (b) & (e) square, and (c) & (f) triangle] as a function of total\nnumber of sample points. For clarity, points are only shown for interpolants that increased R2 or decreased RMSE.\nFIG. 6. Parity plots of the approximated energy ˆu vs. the true energy u for the two-dimensional nanoparticles (rod, square,\nand triangle) and best (a–c) linear piecewise, (d–f) Chebyshev polynomial, and (g–i) mixed-basis polynomial interpolant for\neach nanoparticle.\n\n\n9\n8\n0\n8\ny (σ)\ntrue\nrod\nsquare\ntriangle\n8\n0\n8\ny (σ)\nL\n8\n0\n8\ny (σ)\nC\n8\n0\n8\nx (σ)\n8\n0\n8\ny (σ)\nM\n8\n0\n8\nx (σ)\n8\n0\n8\nx (σ)\n5\n0\n5\nenergy (ε)\n-0.5\n0\n0.5\n∆u (ε)\nFIG. 7. True energy u (top row) and energy residual ∆u = ˆu −u for the two-dimensional nanoparticles (rod, square, and\ntriangle) and best linear piecewise (L), Chebyshev polynomial (C), and mixed-basis polynomial interpolants. In the top row,\nthe black lines demarcate the domain of center-to-center distances considered for ˆu, while in the remaining rows, the grey\nregions indicate configurations that are outside the domain of ˆu.\npolant for the tetrahedron. For most of the results we\npresent here, we computed r0 numerically for both the\nsample points and test points so that we could focus on\nthe accuracy of ˆu. We will discuss approximation of r0\nitself at the end of this section.\nA.\nTwo-dimensional nanoparticles\nWe first calculated R2 and the RMSE for each inter-\npolation scheme for our two-dimensional nanoparticles\n(Figure 5). For the rod, the Chebsyhev polynomial inter-\npolants were slightly more accurate than the linear piece-\nwise interpolants, but the mixed-basis polynomial inter-\npolants were slightly less accurate; the Chebyshev poly-\nnomial interpolant additionally improved fastest with\nnumber of sample points.\nFor the square, both the\nChebyshev and mixed-basis polynomial interpolants ap-\nproximated the energy more accurately and improved\nfaster with number of sample points than the linear\npiecewise interpolants. For the triangle, all three inter-\npolation schemes reached a similar level of final accu-\nracy, but the mixed-basis polynomial interpolants had\nthe smallest RMSE and improved fastest with number of\nsample points. The number of univariate sample points\nused for each coordinate is shown in Table S2 for the\nbest interpolant for each particle type and scheme. We\nnoted that the piecewise linear interpolants consistently\nrequired more sample points with respect to ρ than the\npolynomial interpolants, and as a result, were restricted\nto use fewer points with respect to the angles θ and α.\nTo better understand differences in interpolation\nschemes, we created parity plots of the approximated en-\nergy ˆu vs. the true energy u for the best interpolants\nfound for each scheme (Figure 6). In all cases, the par-\nity plots showed quite satisfactory agreement, consistent\nwith R2 being close to one and RMSE being close to\nzero. The linear piecewise interpolants consistently over-\npredicted the energy of repulsive configurations some-\nwhat for all particles, while the Chebyshev polynomial\nand mixed-basis polynomial interpolants were highly ac-\ncurate for those configurations. This error is likely due to\nthe difference in functional form of the interpolants. All\ninterpolation schemes typically captured the energy of at-\ntractive configurations well, but the mixed-basis polyno-\nmial interpolant underpredicted the attraction between\ntriangles. These differences can be more clearly seen in\na plot of the residual ∆u = ˆu−u against the true energy\nu (Figure S2), where systematic deviations of ∆u from\nzero suggest there are some behaviors not captured by\nthe approximations.\nTo more specifically understand the configurations\nthese errors were associated with, we evaluated the en-\nergy as a function of relative translation for particles fixed\nin an orientation that included the minimum-energy con-\nfiguration. Figure 7 shows the true energy u in the xy\nplane, along with the lower bound r0 and upper bound\nr0 + rc on the center-to-center distance r.\nThis visu-\n\n\n10\n0.8\n0.9\n1.0\nR 2\n(a)\nrod\nL\nC\nM\n(b)\ncube\nL\nC\nM\n(c)\ntetrahedron\nL\nC\nM\n0\n5000\n10000\nsample points\n10\n1\n10\n0\nRMSE (ε)\n(d)\nL\nC\nM\n0\n25000\n50000\nsample points\n(e)\nL\nC\nM\n0\n25000\n50000\nsample points\n(f)\nL\nC\nM\nFIG. 8.\n(a–c) R2 and (d–e) RMSE for linear piecewise (L), Chebyshev polynomial (C), and mixed-basis polynomial (M)\ninterpolants for the three-dimensional nanoparticles [(a) & (d) rod, (b) & (e) square, and (c) & (f) triangle] as a function of\ntotal number of sample points. For clarity, points are only shown for interpolants that increased R2 or decreased RMSE.\nalization confirms that the cutoff we selected was suffi-\nciently large that the true energy was negligible beyond\nthis upper bound. We then evaluated the residual ∆u\nfor each best interpolant for only configurations inside\nthe domain of ˆu. The linear piecewise interpolant strug-\ngled for configurations near corners of the particles, with\nthe residual typically being negative for these configu-\nrations (i.e., the approximated energy is more attrac-\ntive than the true energy).\nThe positive residuals for\nthe linear piecewise interpolants tended to occur near\nclose edge-to-edge configurations of the rods, and edge-\nto-edge configurations of the squares and triangles that\ntended to be very repulsive. The Chebyshev and mixed-\nbasis polynomial interpolants had mostly similar behav-\nior, showing small inaccuracies for configurations that\nwere close to the minimum-energy configuration. Con-\nsistent with the parity plot, the mixed-basis polynomial\ninterpolant, in particular, had a significant positive resid-\nual near these attractive configurations. We suspect that\nthe primary reason for this error is that there was no\nsample point close to this orientation for the triangle\n(α = π/3). Traces of the energy as a function of center-\nto-center distance r for multiple orientations show essen-\ntially the same trends (Figure S3).\nB.\nThree-dimensional nanoparticles\nWe performed the same analysis of R2 and RMSE for\nour three-dimensional nanoparticles (Figure 8). For the\nrod, all interpolation schemes produced accurate approx-\nimations, with the mixed-basis polynomial interpolant\nhaving a slightly faster improvement with number of sam-\nple points than the other two. We note that substantially\nmore sample points were required to achieve a compara-\nble accuracy as for the two-dimensional rod, which was\nexpected because of the increase in both number of co-\nordinates and total solid angle being approximated for\nthe three-dimensional rod. For the cube, the mixed-basis\npolynomial interpolant outperformed the linear piecewise\nand Chebyshev polynomial interpolants, achieving com-\nparable accuracy as for the three-dimensional rod. How-\never, even more sample points were now required. Al-\nthough the total solid angle was actually smaller for the\ncube than for the three-dimensional rod (Table I), the\ncube was described by six coordinates rather than four.\nBecause we used a tensor product to construct our multi-\nvariate interpolant, the increase in number of coordinates\nrestricted us to smaller degrees of univariate approxima-\ntion per coordinate in order to stay below the threshold\ntotal number of sample points. This tradeoff highlights\none challenge of constructing multivariate interpolants\nusing tensor products, whose size grows highly unfavor-\nably with dimensionality. For the tetrahedron, all inter-\npolation schemes had similar performance but achieved\na smaller R2 and larger RMSE than for any of the other\nnanoparticles. We expected that the tetrahedron would\nbe the most challenging particle to approximate due to\nits lesser degree of symmetry, and our results suggest that\nmore sample points may be needed to better approximate\nthis interaction.\nAs for the two-dimensional nanoparticles, we also cre-\nated parity plots for the best-performing interpolant for\neach particle type and interpolation scheme (Figure 9).\n\n\n11\nFIG. 9. Parity plots of the approximated energy ˆu vs. the true energy u for the three-dimensional nanoparticles (rod, cube,\nand tetrahedron) and best (a–c) linear piecewise, (d–f) Chebyshev polynomial, and (g–i) mixed-basis polynomial interpolant\nfor each nanoparticle.\nThe number of univariate sample points used for each co-\nordinate is shown in Table S2. Qualitatively similar be-\nhavior was obtained as for the two-dimensional nanopar-\nticles but the scatter in the points increased, consistent\nwith the somewhat smaller R2 and larger RMSE. One no-\ntable difference is that all methods struggled to capture\nthe attractions between tetrahedra, even though the most\nattractive configurations were not present in the test set.\nAll the interpolation schemes gave systematically posi-\ntive residuals for these configurations (Figure S4). This\nsystematic error also suggests that these configurations\nwere not adequately sampled by any of the interpola-\ntion schemes.\nIncreasing the degree of the univariate\napproximations would likely help address this issue at\nthe expense of adding additional sample points. Traces\nof the energy as a function of center-to-center distance r\nfor multiple orientations show essentially the same trends\n(Figure S5).\nC.\nApproximation of r0\nUntil now, we have numerically computed r0 each time\nit was needed to determine ρ so that we could focus on\ncomparing different schemes for approximating ˆu. How-\never, for practical purposes in simulations, an approxi-\nmation of r0(θ, ϕ, Ω) is also needed for faster evaluation.\nThe multivariate interpolation methods and framework\nwe have used for ˆu are amenable to approximating r0;\nhowever, it is not immediately clear how much error in\nan approximation ˆr0 may affect the accuracy of ˆu. We ex-\nplored this question using the two-dimensional and three-\ndimensional rod as a case study.\nWe considered only Chebyshev polynomial inter-\npolants given their good performance for both rods. We\nfirst created an approximation ˆr0 using the same an-\ngle points as the best Chebyshev polynomial interpolant\nfor each rod, which had a modest RMSE of 0.039 σ\nfor the two-dimensional rods and 0.104 σ for the three-\ndimensional rods. We then computed the RMSE for all\nthe Chebyshev polynomial interpolants appearing in Fig-\nures 5(d) and 8(d), but we now used ˆr0 to calculate ρ.\nThe RMSE for ˆu unfortunately increased significantly\ncompared to using the numerically determined r0 (Figure\n10), indicating that having an accurate approximation ˆr0\nis likely important. To assess how much ˆr0 needed to im-\nprove, we constructed additional approximations using\nmore points for each cooordinate (Table S3), aiming to\n\n\n12\n0\n1000\n2000\nnumber of points\n10\n1\n10\n0\nRMSE u (ε)\n(a)\n0\n5000\n10000\nnumber of points\n(b)\n0\n0.05\n0.1\nRMSE r0 (σ)\n(c)\n2D\n3D\nFIG. 10. RMSE for approximated energy ˆu using approximated ˆr0 to evaluate ρ for (a) two-dimensional rod and (b) three-\ndimensional rod. The different ˆu in (a) and (b) are the same as in Figures 5(d) and 8(d), respectively. The number of sample\npoints increases and the RMSE decreases for ˆr0 as the color shade darkens (Table S3). The lightest curve uses the angular\npoints of the best ˆu to construct ˆr0, while the darkest curve uses a numerical evaluation of r0. (c) Correlation between RMSE\nfor ˆu and for ˆr0 for the same particles.\nreduce the RMSE for both ˆr0 and ˆu. Indeed, we found\nthat we could achieve comparable accuracy to the numer-\nically determined r0 using a multivariate interpolant ˆr0\nwith more sample points. We correlated the RMSE for\nˆu with the RMSE for ˆr0 [Figure 10(c)] and found that\nan RMSE for ˆr0 less than 0.01 σ produced comparable\nRMSE in ˆu as when using the numerically determined\nr0. This test supports the viability of approximating ˆr0\nin addition to ˆu.\nV.\nCONCLUSIONS\nIn this work, we developed a framework for using mul-\ntivariate interpolation to approximate anisotropic pair\npotentials. We focused on multivariate interpolants that\nused basis functions and sample points constructed from\na tensor product of those for univariate Chebyshev and\ntrigonometric polynomials.\nThe key elements of the\nframework are:\n(1) a physically-motivated coordinate\ntransformation that excludes highly energetically unfa-\nvorable configurations, (2) a systematic reduction of the\ndomain to be approximated using symmetry, (3) refine-\nment of univariate approximations for each coordinate,\nand (4) use of trigonometric polynomials to enforce dif-\nferentiability with respect to periodic coordinates. Our\ntests conducted while developing our framework indicate\nthat the first three elements are particularly important\nfor obtaining good approximations.\nWe showed that our approach could accurately approx-\nimate the energy between three different two-dimensional\nnanoparticles using fewer than 2 × 103 sample points,\na three-dimensional rod using fewer than 104 sample\npoints, and a cube using fewer than 5×104 sample points.\nWe also obtained a reasonable approximation of the en-\nergy between two tetrahedra; however, it was less accu-\nrate than for the other nanoparticles we tested, which we\nattribute to the tetrahedron having the least symmetry.\nOverall, our multivariate polynomial interpolants typi-\ncally performed at least as well as, if not better than, lin-\near piecewise interpolants that we also tested as a refer-\nence point (particularly for repulsive configurations) and\nhave the benefit of being differentiable everywhere in the\napproximation domain. They also required substantially\nfewer sample points than have been previously used to\nconstruct data-driven approximations of anisotropic pair\npotentials.29,30\nThere is a practical tradeoff between accuracy and\ncomputational cost that must be considered when de-\nsigning the interpolation scheme. The interpolant is the\nsum of products of up to six univariate polynomials. As\nthe degree of each univariate approximation and/or the\nnumber of coordinates included increases, the number\nof sample points that must be collected as well as the\nnumber of terms that must be evaluated both increase.\nThe samples are only collected once and are all known\nin advance, so these calculations are trivially parallel\nand potentially well-suited to high-throughput comput-\ning. However, a large number of sample points may be\nprohibitive to collect if each individual calculation is de-\nmanding.\nAdditionally, the increase in the number of\nterms increases the computational cost of evaluating the\ninterpolant, which may become limiting if done repeat-\nedly in a simulation.\nSparse interpolation37–39,44–49 is\none strategy that can potentially help address this trade-\noff by reducing the number of sample points and terms in\nthe multivariate interpolant, which we intend to explore\nin the future.\nACKNOWLEDGMENTS\nWe acknowledge support from the Auburn Univer-\nsity Research Support Program (M.F.), the National\nInstitutes of Health under Award No. R35GM147164\n(C.A.K.), and the National Science Foundation under\n\n\n13\nAward No. 2223084 (M.P.H). This work was completed\nwith resources provided by the Auburn University Easley\nCluster.\n1M. A. Boles, M. Engel, and D. V. Talapin, “Self-assembly of\ncolloidal nanocrystals: From intricate structures to functional\nmaterials,” Chemical Reviews 116, 11220–11289 (2016).\n2Z. Cai, J. Teng, Z. Li, S. Ravaine, M. He, Y. Song, Y. Yin,\nH. Zheng, and A. Zhang, “From colloidal particles to photonic\ncrystals: Advances in self-assembly and their emerging applica-\ntions,” Chemical Society Reviews 50, 5898–5951 (2021).\n3C. M. Roth, B. L. Neal, and A. M. Lenhoff, “Van der waals\ninteractions involving proteins,” Biophysical Journal 70, 977–987\n(1996).\n4M. F. Hagan, “Modeling viral capsid assembly,” in Advances in\nChemical Physics, Vol. 155, edited by S. A. Rice and A. R. Dinner\n(John Wiley & Sons, Inc., Hoboken, NJ, 2014) pp. 1–67.\n5W. M. Aumiller, M. Uchida, and T. Douglas, “Protein cage as-\nsembly across multiple length scales,” Chemical Society Reviews\n47, 3433–3469 (2018).\n6M.\nJ.\nSolomon,\n“Directions\nfor\ntargeted\nself-assembly\nof\nanisotropic colloids from statistical thermodynamics,” Current\nOpinion in Colloid & Interface Science 16, 158–167 (2011).\n7S. N. Fejer, D. Chakrabarti, and D. J. Wales, “Self-assembly of\nanisotropic particles,” Soft Matter 7, 3553–3564 (2011).\n8K. Thorkelsson, P. Bai, and T. Xu, “Self-assembly and applica-\ntions of anisotropic nanomaterials: A review,” Nano Today 10,\n48–66 (2015).\n9F. Meseguer, “Colloidal crystals as photonic crystals,” Col-\nloids and Surfaces A: Physicochemical and Engineering Aspects\n270–271, 1–7 (2005).\n10S.-H. Kim, S. Y. Lee, S.-M. Yang, and G.-R. Yi, “Self-assembled\ncolloidal structures for photonics,” NPG Asia Materials 3, 25–33\n(2011).\n11J. Henzie, M. Gr¨unwald, A. Widmer-Cooper, P. L. Geissler, and\nP. Yang, “Self-assembly of uniform polyhedral silver nanocrystals\ninto densest packings and exotic superlattices,” Nature Materials\n11, 131–137 (2012).\n12M. Yetkin, Y. M. Wani, K. Kritika, M. P. Howard, M. Kappl, H.-\nJ. Butt, and A. Nikoubashman, “Structure formation in supra-\nparticles composed of spherical and elongated particles,” Lang-\nmuir 40, 1096–1108 (2024).\n13X. Chen, T. Zhang, H. Liu, J. Zang, C. Lv, M. Du, and G. Zhao,\n“Shape-anisotropic assembly of protein nanocages with identi-\ncal building blocks by designed intermolecular π–π interactions,”\nAdvanced Science 10, 2305398 (2023).\n14X. Wang, N. Bolan, D. C. Tsang, B. Sarkar, L. Bradney, and\nY. Li, “A review of microplastics aggregation in aquatic environ-\nment: Influence factors, analytical methods, and environmen-\ntal implications,” Journal of Hazardous Materials 402, 123496\n(2021).\n15B. R. Argun and A. Statt, “Influence of shape on heteroaggre-\ngation of model microplastics: a simulation study,” Soft Matter\n19, 8081–8090 (2023).\n16M. P. Allen and D. J. Tildesley, Computer Simulation of Liquids\n(Oxford University Press, 2017).\n17N. Kern and D. Frenkel, “Fluid–fluid coexistence in colloidal\nsystems with short-ranged strongly directional attraction,” The\nJournal of Chemical Physics 118, 9882–9889 (2003).\n18R. Berardi, C. Fava, and C. Zannoni, “A gay–berne potential for\ndissimilar biaxial particles,” Chemical Physics Letters 297, 8–14\n(1998).\n19J. D. Weeks, D. Chandler, and H. C. Andersen, “Role of repulsive\nforces in determining the equilibrium structure of simple liquids,”\nThe Journal of Chemical Physics 54, 5237–5247 (1971).\n20V. Ramasubramani, T. Vo, J. A. Anderson, and S. C. Glotzer,\n“A mean-field approach to simulating anisotropic particles,” The\nJournal of Chemical Physics 153, 084106 (2020).\n21T. D. Nguyen and S. J. Plimpton, “Aspherical particle models\nfor molecular dynamics simulation,” Computer Physics Commu-\nnications 243, 12–24 (2019).\n22Y. M. Wani, P. G. Kovakas, A. Nikoubashman, and M. P.\nHoward, “Mesoscale simulations of diffusion and sedimentation\nin shape-anisotropic nanoparticle suspensions,” Soft Matter 20,\n3942–3953 (2024).\n23H. T. L. Nguyen and D. M. Huang, “Systematic bottom-up\nmolecular coarse-graining via force and torque matching using\nanisotropic particles,” The Journal of Chemical Physics 156,\n184118 (2022).\n24W. G. Noid, J.-W. Chu, G. S. Ayton, V. Krishna, S. Izvekov,\nG. A. Voth, A. Das, and H. C. Andersen, “The multiscale coarse-\ngraining method. i. a rigorous bridge between atomistic and\ncoarse-grained models,” The Journal of Chemical Physics 128,\n244114 (2008).\n25W. G. Noid, P. Liu, Y. Wang, J.-W. Chu, G. S. Ayton, S. Izvekov,\nH. C. Andersen, and G. A. Voth, “The multiscale coarse-graining\nmethod. ii. numerical implementation for coarse-grained molec-\nular models,” The Journal of Chemical Physics 128, 244115\n(2008).\n26G. Campos-Villalobos, G. Giunta, S. Mar´ın-Aguilar, and M. Di-\njkstra, “Machine-learning effective many-body potentials for\nanisotropic particles using orientation-dependent symmetry func-\ntions,” The Journal of Chemical Physics 157, 024902 (2022).\n27G. Campos-Villalobos, R. Subert, G. Giunta, and M. Dijkstra,\n“Machine-learned coarse-grained potentials for particles with\nanisotropic shapes and interactions,” npj Computational Mate-\nrials 10, 228 (2024).\n28A. Lin, K. K. Huguenin-Dumittan, Y.-C. Cho, J. Nigam, and\nR. K. Cersonsky, “Expanding density-correlation machine learn-\ning representations for anisotropic coarse-grained particles,” The\nJournal of Chemical Physics 161, 074112 (2024).\n29M. O. Wilson and D. M. Huang, “Anisotropic molecular coarse-\ngraining by force and torque matching with neural networks,”\nThe Journal of Chemical Physics 159, 024110 (2023).\n30B. R. Argun, Y. Fu, and A. Statt, “Molecular dynamics simula-\ntions of anisotropic particles accelerated by neural-net predicted\ninteractions,” The Journal of Chemical Physics 160, 244901\n(2024).\n31W. H. Press, S. A. Teukolsky, W. T. Vetterling, and B. P.\nFlannery, Numerical Recipes 3rd Edition: The Art of Scientific\nComputing, 3rd ed. (Cambridge University Press, USA, 2007)\nChap. 5, pp. 201–254.\n32L. N. Trefethen, Approximation Theory and Approximation\nPractice, Extended Edition (Society for Industrial and Ap-\nplied Mathematics, Philadelphia, PA, 2019) Chap. 2, pp. 7–12,\nhttps://epubs.siam.org/doi/pdf/10.1137/1.9781611975949.\n33R. K. Lindsey, L. E. Fried, and N. Goldman, “Chimes:\nA\nforce matched potential with explicit three-body interactions for\nmolten carbon,” Journal of Chemical Theory and Computation\n13, 6222–6229 (2017).\n34R. K. Lindsey, L. E. Fried, and N. Goldman, “Application of the\nchimes force field to nonreactive molecular systems: Water at\nambient conditions,” Journal of Chemical Theory and Computa-\ntion 15, 436–447 (2019).\n35R. K. Lindsey, N. Goldman, L. E. Fried, and S. Bastea, “Many-\nbody reactive force field development for carbon condensation in\nc/o systems under extreme conditions,” The Journal of Chemical\nPhysics 153, 054103 (2020).\n36R. K. Lindsey, S. Bastea, Y. Lyu, S. Hamel, N. Goldman, and\nL. E. Fried, “Chemical evolution in nitrogen shocked beyond the\nmolecular stability limit,” The Journal of Chemical Physics 159,\n084502 (2023).\n37J. Nance, E. Jakubikova, and C. T. Kelley, “Reaction path fol-\nlowing with sparse interpolation,” Journal of Chemical Theory\nand Computation 10, 2942–2949 (2014).\n38J. Nance and C. T. Kelley, “A sparse interpolation algorithm\nfor dynamical simulations in computational chemistry,” SIAM\nJournal on Scientific Computing 37, S137–S156 (2015).\n39Z. Morrow, H.-Y. Kwon, C. T. Kelley, and E. Jakubikova, “Effi-\n\n\n14\ncient approximation of potential energy surfaces with mixed-basis\ninterpolation,” Journal of Chemical Theory and Computation\n17, 5673–5683 (2021).\n40W. Humphrey, A. Dalke, and K. Schulten, “Vmd: Visual molec-\nular dynamics,” Journal of Molecular Graphics 14, 33–38 (1996).\n41A. K. Pearce, T. R. Wilks, M. C. Arno, and R. K. O’Reilly, “Syn-\nthesis and applications of anisotropic nanoparticles with precisely\ndefined dimensions,” Nature Reviews Chemistry 5, 21–45 (2021).\n42P. F. Damasceno, M. Engel, and S. C. Glotzer, “Predictive self-\nassembly of polyhedra into complex structures,” Science 337,\n453–457 (2012).\n43G. Nolze, “Euler angles and crystal symmetry,” Crystal Research\nand Technology 50, 188–201 (2015).\n44Z. Morrow, C. Liu, C. T. Kelley, and E. Jakubikova, “Approx-\nimating periodic potential energy surfaces with sparse trigono-\nmetric interpolation,” The Journal of Physical Chemistry B 123,\n9677–9684 (2019).\n45Z. Morrow and M. Stoyanov, “A method for dimensionally adap-\ntive sparse trigonometric interpolation of periodic functions,”\nSIAM Journal on Scientific Computing 42, A2436–A2460 (2020).\n46S. Smolyak, “Quadrature and interpolation formulas for tensor\nproducts of certain classes of functions.” Dokl. Akad. Nauk SSSR\n148, 1042–1045 (1963).\n47K. L. Judd, L. Maliar, S. Maliar, and R. Valero, “Smolyak\nmethod for solving dynamic economic models: Lagrange inter-\npolation, anisotropic grid and adaptive domain,” Journal of Eco-\nnomic Dynamics and Control 44, 92–123 (2014).\n48C. L. Petix, M. Fakhraei, C. A. Kieslich, and M. P. Howard,\n“Surrogate modeling of the relative entropy for inverse design\nusing smolyak sparse grids,” Journal of Chemical Theory and\nComputation 20, 1538–1546 (2024).\n49C. A. Kieslich, F. Boukouvala, and C. A. Floudas, “Optimiza-\ntion of black-box problems using smolyak grids and polynomial\napproximations,” Journal of Global Optimization 71, 845–869\n(2018).\n\n\nSupporting Information: Approximation of anisotropic pair potentials using\nmultivariate interpolation\nMohammadreza Fakhraei,1 Chris A. Kieslich,1, 2, a) and Michael P. Howard1, b)\n1)Department of Chemical Engineering, Auburn University, Auburn, AL 36849,\nUnited States\n2)Wallace H. Coulter Department of Biomedical Engineering,\nGeorgia Institute of Technology, Atlanta, Georgia 30332,\nUnited States\na)Electronic mail: kieslich@gatech.edu\nb)Electronic mail: mphoward@auburn.edu\n1\narXiv:2502.21203v1  [cond-mat.soft]  28 Feb 2025\n\n\nI.\nSYMMETRY\nWe applied symmetry to reduce the relative translational coordinates θ and ϕ as shown\nin Table 1 using the following procedures:\n• Rod (2D). If θ > π, rotate by π about z-axis so θ ≤π. Then, if θ > π/2, rotate by π\nabout y-axis so θ ≤π/2.\n• Square. If θ > π/2, rotate by −π/2 about the z-axis until θ ≤π/2. Then, if θ > π/4,\nrotate by π about the vector [1/\n√\n2, 1/\n√\n2] so θ ≤π/4.\n• Triangle. If θ > 2π/3, rotate about the z-axis by −2π/3 until θ < 2π/3. Then, if\nθ > π/3, rotate by π about the vector [1/2,\n√\n3/2] so θ ≤π/3.\n• Rod (3D). If ϕ > π/2, rotate by π about the x-axis so ϕ ≤π/2. Then, rotate by −θ\nabout the z-axis so θ = 0.\n• Cube. If ϕ > π/2, rotate by π about the x-axis so ϕ ≤π/2. Next, if θ > π/2, rotate\nabout the z-axis by −π/2 until θ < π/2. Last, if θ > π/4, rotate by 2π/3 about the\nvector [1/\n√\n3, 1/\n√\n3, 1/\n√\n3] until θ ≤π/4.\n• Tetrahedron. If θ > 2π/3, rotate by −2π/3 about the z-axis until θ < 2π/3.\nII.\nSELECTING UNIVARIATE APPROXIMATIONS\nTABLE I. Minimum (min.) and maximum (max.) numbers of sample points considered for each\ncoordinate for ˆu.\nnanoparticle\nρ\nangles\nmin. max. min. max.\nrod (2D), square, triangle\n17\n257\n2\n33\nrod (3D)\n17\n65\n3\n65\ncube, tetrahedron\n17\n33\n3\n33\n2\n\n\nFIG. 1. Energy for a pair of two-dimensional rods as a function of r at different fixed θ and α. The\nthree configurations are (θ, α) = (π/2, 0), (0, π/2), and (0, 0), illustrated below the curves. The\ntrue energy is compared to Chebyshev polynomial interpolation with respect to ρ using either 9 or\n17 sample points. Note the oscillations for the interpolant using 9 sample points for the end-to-end\nconfiguration.\n3\n\n\nTABLE II. Number of sample points for each coordinate for the best linear piecewise (L), Chebyshev\npolynomial (C), and mixed-basis polynomial (M) interpolants found for ˆu.\nnanoparticle interpolant ρ θ ϕ α β γ\nrod (2D)\nL\n33 5\n9\nC\n17 9\n9\nM\n17 9\n9\nsquare\nL\n65 5\n5\nC\n17 9\n9\nM\n17 9\n9\ntriangle\nL\n33 5\n9\nC\n17 5\n17\nM\n17 9\n9\nrod (3D)\nL\n17\n5 17 5\nC\n17\n5 17 5\nM\n17\n9\n9 5\ncube\nL\n33 3 3 17 3 3\nC\n17 3 5 17 3 3\nM\n17 3 9\n9 3 3\ntetrahedron\nL\n33 3 5\n5 5 3\nC\n17 3 9\n3 5 5\nM\n17 3 17 3 5 3\n4\n\n\nTABLE III. Number of sample points for each coordinate for Chebyshev polynomial interpolants\nˆr0 with varied RMSE.\nnanoparticle θ\nϕ\nα\nβ γ RMSE (σ)\nrod (2D)\n9\n9\n0.039\n17\n33\n0.014\n33\n65\n0.007\n65\n128\n0.001\nrod (3D)\n5\n17\n5\n0.104\n9\n33\n5\n0.037\n17 33\n9\n0.02\n33 65 17\n0.007\n5\n\n\nIII.\nTWO-DIMENSIONAL NANOPARTICLES\nFIG. 2. Same as Figure 5, but showing the residual energy ∆u = ˆu −u vs. the true energy u.\n6\n\n\nFIG. 3. Comparison of energy approximated using linear piecewise (L), Chebyshev polynomial (C),\nand mixed-basis polynomial (M) interpolants to the true energy for two-dimensional nanoparticles\nas a function of r at different fixed θ and α. The three configurations (θ, α) are the same for the\nrod as in Figure 1; (0, 0), (0, π/4), and (π/4, 0) for the square; and (π/3, π/3), (0, 0), and (0, π/3)\nfor the triangle, illustrated at the bottom.\n7\n\n\nIV.\nTHREE-DIMENSIONAL NANOPARTICLES\nFIG. 4. Same as Figure 8, but showing the residual energy ∆u = ˆu −u vs. the true energy u.\n8\n\n\nFIG. 5. Comparison of energy approximated using linear piecewise (L), Chebyshev polynomial\n(C), and mixed-basis polynomial (M) interpolants to the true energy for the three-dimensional\nnanoparticles as a function of r at different fixed θ, ϕ, and orientation. The three configurations\nare (ϕ, α, β) = (π/2, 0, 0), (0, π/2, π/2), and (0, 0, 0) for the rod; (θ, ϕ, α, β, γ) = (0, π/2, 0, 0, 0),\n(0, π/2, π/4, 0, 0), and (π/4, π/2, 0, 0, 0) for the cube; and (θ, ϕ, α, β, γ) = (4π/3, π, π/2, 7π/18, π/6),\n(0, 0, 0, 0, 0), and (2π/3, π/2, π/3, 0, 0) for the tetrahedron, illustrated at the bottom.\n9\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21203v1.pdf",
    "total_pages": 23,
    "title": "Approximation of anisotropic pair potentials using multivariate interpolation",
    "authors": [
      "Mohammadreza Fakhraei",
      "Chris A. Kieslich",
      "Michael P. Howard"
    ],
    "abstract": "The interaction between two particles with shape or interaction anisotropy\ncan be modeled using a pairwise potential energy function that depends on their\nrelative position and orientation; however, this function is often challenging\nto mathematically formulate. Data-driven approaches for approximating\nanisotropic pair potentials have gained significant interest due to their\nflexibility and generality but often require large sets of training data,\npotentially limiting their feasibility when training data is computationally\ndemanding to collect. Here, we investigate the use of multivariate polynomial\ninterpolation to approximate anisotropic pair potentials from a limited set of\nprescribed particle configurations. We consider both standard Chebyshev\npolynomial interpolation as well as mixed-basis polynomial interpolation that\nuses trigonometric polynomials for coordinates along which the pair potential\nis known to be periodic. We exploit mathematical reasoning and physical\nknowledge to refine the interpolation domain and to design our interpolants. We\ntest our approach on two-dimensional and three-dimensional model anisotropic\nnanoparticles, finding satisfactory approximations can be constructed in all\ncases.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}