{
  "id": "arxiv_2502.21153v1",
  "text": "1 \n \nHidden States and Dynamics of Fractional Fillings in tMoTe2 Moiré Superlattices \n \n \n \nYiping Wang1,2, Jeongheon Choe1, Eric Anderson3, Weijie Li3, Julian Ingham4, Eric A. \nArsenault1, Yiliu Li1, Xiaodong Hu5, Takashi Taniguchi6, Kenji Watanabe7, Xavier Roy1, Dmitri \nBasov4, Di Xiao5, Raquel Queiroz4, James C. Hone2, Xiaodong Xu3,5, X.-Y. Zhu1,* \n \n1 Department of Chemistry, Columbia University, New York, NY 10027, USA \n2 Department of Mechanical Engineering, Columbia University, New York, NY 10027, USA \n3 Department of Physics, University of Washington, Seattle, WA 98195, USA \n4 Department of Physics, Columbia University, New York, NY 10027, USA \n5 Department of Materials Science and Engineering, University of Washington, Seattle, WA \n98195, USA \n6 Research Center for Materials Nanoarchitectonics, National Institute for Materials Science, \n1-1 Namiki, Tsukuba 305-0044, Japan \n7 Research Center for Electronic and Optical Materials, National Institute for Materials Science, \n1-1 Namiki, Tsukuba 305-0044, Japan \n \nThe fractional quantum anomalous Hall (FQAH) effect was recently discovered in twisted \nMoTe2 bilayers (tMoTe2)1–4. Experiments to date have revealed Chern insulators from hole \ndoping at n = -1, -2/3, -3/5, and -4/7 (per moiré unit cell) 1–6. In parallel, theories predict that, \nbetween v = -1 and -3, there exist exotic quantum phases 7–15, such as the coveted fractional \ntopological insulators (FTI), fractional quantum spin Hall (FQSH) states, and non-abelian \nfractional states. Here we employ transient optical spectroscopy 16,17 on tMoTe2 to reveal \nnearly 20 hidden states at fractional fillings that are absent in static optical sensing or \ntransport measurements. A pump pulse selectively excites charge across the correlated or \npseudo gaps, leading to the disordering (melting) of correlated states 18. A probe pulse detects \nthe subsequent melting and recovery dynamics via exciton and trion sensing 1,3,19–21. Besides \nthe known states, we observe additional fractional fillings between n = 0 and -1 and a large \nnumber of states on the electron doping side (n > 0). Most importantly, we observe new states \nat fractional fillings of the Chern bands at n = -4/3, -3/2, -5/3, -7/3, -5/2, and -8/3. These states \n \n* To whom correspondence should be addressed. E-mail: xyzhu@columbia.edu. \n\n\n2 \n \nare potential candidates for the predicted exotic topological phases 7–15. Moreover, we show \nthat melting of correlated states occurs on two distinct time scales, 2-4 ps and 180-270 ps, \nattributed to electronic and phonon mechanisms, respectively. We discuss the differing \ndynamics of the electron and hole doped states from the distinct moiré conduction and \nvalence bands. \n Quantum states that support fractional charge excitations are fascinating manifestations of \nmany-body interactions in condensed matter. These states, originally discovered as the fractional \nquantum Hall (FQH) effect in 2D electron gases at high magnetic fields22, have been observed \nrecently in moiré superlattices of tMoTe2 bilayers 1–4 and multilayer graphene/hexagonal boron-\nnitride interfaces 23 in the absence of magnetic field.  Unlike fractional charge orderings from \ngeneralized Wigner crystal formation in moiré bands 20,21,24,25, the recently discovered FQAH \neffects1–4,23 represent fractional charge excitations obeying anyon statistics, formed from many \nbody correlations in flat Chern bands. In addition to the FQAH states, fractional fillings between \nv = -1 and -3 have been predicted to result in other exotic quantum phases 7–15, but these states \nhave not been detected to date. A transport measurement assigned a n = -3 state to FQSH state26, \nbut the presence of ferromagnetic order may challenge this interpretation 27,28. \nTo find new states in the Chern bands, we investigate dual-gated R-stacked MoTe2 bilayers \nwith twist angles of q = 3.7o and 3.1o, respectively (Fig. 1a, detailed in Extended Data Fig. 1 and \n2), known to exhibit FQAH effects 1–4. In our approach 16,17,  illustrated in Fig. 1b for a Mott \ninsulator, a pump pulse with ℏ𝜔! (= 0.99 eV) below the optical gap (1.12 eV) 1 of MoTe2 induces \nintraband excitation of a doped electron or hole. Relaxation within the continuum of conduction \nor valence band states occurs on ultrafast (≤ 100 fs) time scales (II) 16,17,29, but the correlation gap \nprovides a bottleneck in relaxation and leads to the transient formation of excitation across the gap \n(III), referred to as a holon-doublon pair in a Mott insulator 18. The presence of sufficient excitation \nleads to disordering and gap-closing 16–18 (IV), followed by recovery at longer times (V). This \napproach also applies to correlated electron liquid, where the bottleneck in intraband relaxation \nleads to the transient formation of excitation across a pseudo-gap, thus disrupting correlation and \nrenders the system more Fermi liquid like. The dynamics are followed as a function of pump-probe \ndelay (Dt) from exciton (~1.120-1.135 eV) and trion (~1.100-1.120 eV) sensing by the probe pulse \n(ℏ𝜔\"), which detects the increase in the effective dielectric constant 19–21 and the resulting decrease \n\n\n3 \n \nin oscillator strengths. We present DR/R, where DR = R(Dt) – R; R(Dt) and R are the reflectance \nspectrum at Dt and before time zero (static), respectively. The pump-induced change is detected as \na reduced amplitude of the derivative-shaped resonance and DR/R shows a characteristic flip in \nsign from that of R (Fig. 1c).  Our measurement reveals predominantly the equilibrium states \nbefore they are “melted” by the pump pulse. We do not observe increases in oscillator strength \nafter photo-excitation, indicating transient formation of correlated insulators are not important. \nThe sensitivity and specificity of pump-probe spectroscopy comes from its background-free \nnature, because the correlated states are selectively perturbed by the pump pulse when the photon \nenergy is below the optical gaps of constituent 2D semiconductors. \nTime domain detection of fractional fillings of the Chern bands: q = 3.7o \nWe first focus on sample D1 (q = 3.7o) and compare the static reflectance spectrum (Fig. 1d) \nand transient spectra, Fig. 1e and 1f at Dt = 13 ps and 300 ps, respectively, as functions of gate \nvoltage (Vg) and ℏ𝜔\". In static spectrum, the n = -1 and 1 states can be identified by the \nenhancements in R. The transient spectra show drastically enhanced resolution and sensitivity, \nleading to the detection of 20 states. Fig. 1g shows selected linecuts at exciton (black) and trion \n(orange) resonances, with the moiré filling factor v listed (see Method and Extended Data, Table \n1). A static spectroscopic technique based a separate WSe2 sensor layer was used to detect a large \nnumber of correlated insulators in the topologically trivial WS2/WSe2 moiré superlattice21, but this \napproach is less sensitive for the tMoTe2 system3. \nOn the electron side, we resolve n = 1 and at least 10 states at fractional fillings. The number \nof states identified here is more than twice of those detected in steady-state spectroscopic sensing1. \nThese states, also observed in other transition metal dichalcogenide (TMD) moiré systems, have \nbeen called generalized Wigner crystals 20,21,24,25. They are formed when the onsite (U) and inter-\nsite (V) Coulomb energies overwhelm the kinetic energy (t). In WS2/WSe2 moiré superlattices, \nArsenault et al. recently pointed out the similarity of generalized Wigner crystals to charge density \nwaves (CDW) and showed evidences for the polaronic nature of localized charges16. \nFrom hole doping of the Chern bands, we observe states at n = -1, -2/3, -1/2, -1/3, and likely -\n3/5 and -2/5. These states have been predicted in the phase diagrams for hole doping30. The n = -\n1, -2/3, -3/5 states are zero-field Chern insulators 1–4 and n = -1/2 a composite Fermi-liquid31. The \n\n\n4 \n \nn = -1/3 state is in the region without magnetic order 4and is a topologically trivial charge order \nstate8,30,32. The n = −2/5 state is also in the non-magnetic region 28 and possibly a charge order \nstate. For doping beyond n = -1, we observe new fractional states at n = -4/3, -3/2, and -5/3. Each \nof these new states exhibits a small feature on top of intense DR/R signal over broad doping levels \n(n < -1.2). Since transport measurements showed no gaps in this doping range 26–28, we assign the \nbroad background DR/R to the disruption of highly correlated liquid states from pump excitation \nacross pseudo gaps. Thus, the observed n = -4/3, -3/2, and -5/3 states are likely incipient, emerging \nfrom the highly correlated liquid states. \nWhile the above experiments are carried out at a sample temperature of 2.0 K, we also perform \ntemperature-dependent measurements (Extended Data Fig. 3-5). On the electron side, many of the \ncharge order states exist at T = 7 K, with n = 1 persisting to T = 20 K. On the hole side, the n = -\n4/3, -3/2, and -5/3 states are no longer resolved at elevated temperatures, but there is evidence for \npump-induced reduction in oscillator strength persisting to T ≥ 7 K. The n = -1 state can be resolved \nat early pump-probe delays at T = 20 K, which is higher than the critical temperature of Tc ~13 K \nreported earlier1,2. These findings suggest that our transient measurement is sensitive to not only \ncorrelated insulators but also to residual electronic correlations above nominal Tc.  \nTime domain detection of fractional fillings of the Chern bands: q = 3.1o \nWe carry out transient measurements on a second tMoTe2 sample (D2) with q = 3.1o.  While \nthe competition between kinetic energy and Coulomb energies varies with q, band topologies of \ntMoTe2 are unchanged for the two twist angles (q = 3.1o and 3.7o) 33–35. Fig. 2a and Fig. 2b show \nDR/R maps at representative delays, Dt = 13 ps and 450 ps, respectively.  The lower moiré unit \ncell density of D2 compared to D1 allows us to reach filling factors close to n = ±3. While the \nabundant charge ordered states on the electron side remain clearly observed, those from the hole \nside are harder to resolve. To improve resolution, we present 2D spectral maps in derivative form, \nd(DR/R)/dn, where n is the doping density (∝Vg). Figs. 2c show d(DR/R)/dn spectral maps \naveraged over Dt = 13, 25, and 45 ps; each state is identified at the inflection point connecting a \npeak and a valley. Fig. 2d shows selected line-cuts at Dt =13 ps and 450 ps. States at n ≥ -1 are \nresolved in both time windows, while those between n = -1 and -3 are only observed at Dt = 13 ps, \nnot at Dt = 450 ps. The three states at n = -4/3, -3/2, and -5/3 observed in D1 are reproduced in D2. \n\n\n5 \n \nBetween n = -2 and -3, we resolve three new states at n = -8/3, -5/2, and -7/3. As in D1, the n = -\n4/3, -3/2, -5/3, -8/3, -5/2, and -7/3 states in D2 all exhibit small features on top of intense and broad \nDR/R signal. These states are likely incipient from highly correlated liquids with pseudo gaps. In \naddition to the new states at n < -1, we observe a series of fractional states at n = -1/5, -1/3, -1/2, -\n2/3, -4/5. Overall, we resolve a total of 29 states.  \nControl Sample at q = 5.5o \nAs a control to the above findings of correlated states at q = 3.7o and 3.1o, we carry out \nmeasurements on a tMoTe2 sample with a larger twist angle of q = 5.5o (D3), Extended data Fig. \n6. No correlated states have been found at such a large twist angle 1–4 and we confirm this in \ndoping-dependent photoluminescence (PL) measurement. Consistent with static PL sensing, no \nstates are detected in pump-probe spectral mapping in the entire doping range (-5.5x1012 to \n5.5x1012 cm-2).  \nMelting dynamics: electronic vs. phononic \nHaving identified a zoo of states, we now investigate their melting and reordering dynamics. \nWe present DR/R maps at Dt = 1.5 – 300 ps, Fig. 3 for D1. Similar spectral maps for D2 are shown \nin Extended Data Fig. 7. The correlated states are observed in the entire time window, with varying \ndegrees of resolution. On the electron side, there are two distinct time windows of melting and \nrecovery, as evidenced by the DR/R signal reaching the first minimum between 1.5 and 13 ps. \nFollowing partial recovery, DR/R decreases again on the longer time scale of ~300 ps, before \nrecovering on ns time scales (see Fig. 4 for time-traces). On the hole side, we observe primarily \nthe first melting characterized by a minimum at Dt ~13 ps.  \nTo understand the origins of melting/recovery processes, we present in Fig. 4 selected temporal \nprofiles for D1 at (a) n = ±1, (b) n = ±4/3, (c) n = ±3/2, (d) n = 0 at the probe photon energy where \nDR/R reaches minimum.  Similar profiles for other filling factors are summarized in Extended \nData Fig. 8. For electron doping, the time profiles are characterized by initial decays with time \nconstants of tm1 = 2-3.5 ps and recoveries with time constants of tr1 = 20 – 40 ps. This stage \nfollowing excitation can be attributed to disordering from charge hopping  16–18 and we call this \n“electronic melting”.  As control, we confirm that this fast melting/recovery process is absent for \nn = 0, Fig. 4d, where only the decaying tail of an initial spike is observed; the latter likely originates \n\n\n6 \n \nfrom transient response of the graphite gates16,17. In sample D2, there are clearly resolved states \nnear Vg = 0, making the precise assignment of charge neutrality difficult (see Methods). The state \nclosest to Vg = 0 (arrow in Fig. 2b or 2e) is likely a hole-doped state at -1/7 ≤ n < 0. Confirming \nthis, we show that the electronic melting process is observed at 2 K but disappears at 70 K (> Tc), \nExtended Data Fig. 9. At this low doping level, electronic melting and recovery occur with time \nconstants of tm1 = 1.5±0.5 ps and tr1 = 3.4 ± 0.9 ps, respectively, both shorter than corresponding \ntime constants at higher hole doping levels. \nFor n = 0, 1, 4/3, and 3/2, we observe at Dt > 7ps high frequency oscillations that are known \ncoherent phonon wavepackets launched at the graphite electrodes by the excitation pulse and \narrived at tMoTe2 with a time delay (Extended Data Fig. 10)36,37.  For n = 0, we find that the \nexcitation of phonons in tMoTe2 decreases the oscillator strengths of both excitons and trions \n(Extended Data, Fig. 11), as shown by DR/R reaching a minimum at Dt = 300 ± 20 ps, Fig. 4d. \nHowever, this change alone does not explain the observations at n = 1, 4/3, and 3/2 (Fig. 4a-c), as \ntheir magnitudes in the decrease of DR/R are much larger than that at n = 0. Moreover, the \noccurrences of the second minima for n = 1, 4/3, and 3/2 are time delayed from that of n = 0 by \n~150 ps, likely reflecting the time for re-heating the electrons by phonons. Thus, the second \nminima in DR/R observed for n = 1, 4/3, and 3/2 reveal an additional mechanism for pump-induced \nincreases in effective dielectric constants specific of the correlated states, i.e, re-melting of these \nstates. We refer to this stage as “phonon melting”, similar to strain wave induced melting of CDW \nand semiconductor-to-metal transitions 38,39.  The phonon melting is responsible for the much-\nenhanced contrast in transient spectra for some of the correlated states at long time delays, Fig. 1 \nand Fig. 2. \nWe now turn to the melting and recovery dynamics of states at n = -1, -4/3, and -3/2. While \nthe n = -1 state is well-resolved, the n = - 4/3 and -3/2 states are identified only as weak features \non a broad continuum. These states are likely incipient, emerging from a highly correlated liquid \nwith pseudo gaps. The time profiles at n = - 4/3 and -3/2 probe predominantly the dynamics of the \nunderlying correlated liquid. The most obvious difference from electron doping is that phonon \noscillations and the subsequent phonon melting/recovery are much reduced for hole doping at n = \n-1, and becomes negligible for n = -4/3 and -3/2. The negligible phonon perturbation for n = -1 is \nassociated with an absence of spectral changes in exciton and trion sensing, in contrast to a time-\n\n\n7 \n \ndependent blue shift observed for the phonon-perturbed n = 1 state, Extended Data, Fig. 12. \nMoreover, the electronic melting processes of states from hole doping are slower than those of \ncorresponding electron doping (Fig. 4a-c). The melting and recovery time constants for n = -1, -\n4/3, and -3/2 are tm1 = 4.3-6.5 ps and tr1 = 24-38 ps, repectively.   \nHere we present a tentative interpretation, Fig. 4f. The key feature of twisted TMD bilayers \nis the layer skyrmion texture of interlayer tunneling 33. There are three distinct stacking regions \nat small twist angles – AA, XM, and MX. Interlayer tunneling is large in the AA regions but \nvanishes in the MX/XM regions. When a charge is located in the MX/XM stacking region, \nthe wavefunction is made of non-bonding states at MX in one layer and XM in the other. For \nelectron doping, the moiré conduction band derive primarily from the Q point due to \ninterlayer hybridization 32,40 and are delocalized spatially in zigzag stripes across the \nentire moiré unit cell 40. This results in a large energy oscillation (dph) by the \nbreathing phonon, which modulates the interlayer distance and, thus, hybridization.  The \nhybridized and spatially delocalized nature also facilitates inter-site hopping (th) of \nholons and doublons, thus, accelerating melting and recovery dynamics. In contrast, \nfor hole doped states (n < 0), the uppermost moiré valence band near the K points is localized \nto the MX or XM regions that form the honeycomb lattice 33–35. The layer localized and \nnonbonding nature suggests that hole-doped states are insensitive to interlayer distance, \nleading to small dph. Holon/doublon hopping is inhibited between neighboring MX/XM sites \nand is also small between next-nearest neighbor sites, thus slowing melting and recovery \ndynamics. In the presence of sufficiently large displacement field, the hole doped states are \npolarized to a single layer 1–4; Holon/doublon hopping th may be increased and the modulation \nof displacement field by the breathing mode may also increase the magnitude of dph, as are \nobserved in Fig 4e. \nWhile the qualitative proposal based on spatial wavefunction variations provides a tentative \nexplanation of the differing dynamics of electron and hole doped states, theories are needed to \nquantitative understand these differences. Moreover, the honeycomb MX/XM lattice is also related \nto the formation of topological states; whether the robustness of some of the hole doped states as \ncompared to the electron doped ones is related to topology remains an open question. \nDiscussions \n\n\n8 \n \nOur results establish the presence of the n = -4/3, -3/2, -5/3, -7/3, -5/2, and -8/3 states from \nfractional fillings of the Chern bands in tMoTe2. The discovery of these states that have evaded \ndetection in prior experiments 1–4,26,27,41 underscores the superior sensitivity of our time-domain \napproach. These states are located in the phase space with small or no ferromagnetic order 27,28. \nWhile their origins cannot be confirmed here, some of these fractional states are candidates for the \nexotic topological states predicted in recent theories 7–15.  Kwan et al. 7 proposed the n = -4/3 state \npotentially as an abelian FTI consisting of two copies of n = -2/3 in the K and K’ valleys, stabilized \nby phonon coupling and/or sufficient nonlocal Coulomb screening. Chen et al.42 suggested n = -\n3/2 as a non-abelian FCI, but the lack of spin/valley polarization27 argues against this proposal. \nMay-Mann et al. 11 proposed half-integer FQSH edge states to form pairs of charged counter-\npropagating bosonic modes; our observed n = -3/2 and -5/2 states might be related to these \nproposed edges states. We are not aware of theories on the n = -5/3 and -7/3 states; an intriguing \npossibility is that they are FCIs, but fluctuations of weak magnetic order may make experimental \nverification difficult. The n = -8/3 state is weakly magnetic27 and potentially a topological state in \nthe second moiré band. Further theoretical studies are warranted. \nAn intriguing question is why states at n = -4/3, -3/2, -5/3, -7/3, -5/2, and -8/3 have not been \nresolved in prior transport measurements, that showed no evidence of gap formation at these \nfillings26–28. These states are likely incipient, emerging from highly correlated liquid states in the \nbroad doping range (-3 < n < -1.2). While the pump-probe approach can be sensitive to remanent \ncorrelation and pseudo gaps, transport measurements are not. Improved transport measurements \nare needed to isolate the correlated insulator responses from interfering effects of liquid-like states. \nOne may also fully develop the correlated gaps from incipient states by sample engineering, e.g., \nreduction in disorder and control of dielectric screening, to allow the detection of quantized \ntransport, particularly with edge resolution.   \n \nReferences \n1. \nCai, J. et al. Signatures of fractional quantum anomalous Hall states in twisted MoTe2. \nNature 622, 63–68 (2023). \n2. \nPark, H. et al. Observation of fractionally quantized anomalous Hall effect. Nature 622, \n74–79 (2023). \n3. \nZeng, Y. et al. Thermodynamic evidence of fractional Chern insulator in moiré MoTe2. \nNature 622, 69–73 (2023). \n\n\n9 \n \n4. \nXu, F. et al. Observation of integer and fractional quantum anomalous Hall effects in \ntwisted bilayer MoTe 2. Phys Rev X 13, 031037 (2023). \n5. \nJi, Z. et al. Local probe of bulk and edge states in a fractional Chern insulator. Nature 635, \n578–583 (2024). \n6. \nRedekop, E. et al. Direct magnetic imaging of fractional Chern insulators in twisted \nMoTe2. Nature 635, 584–589 (2024). \n7. \nKwan, Y. H. et al. When Could Abelian Fractional Topological Insulators Exist in \nTwisted MoTe2 (and Other Systems). arXiv preprint arXiv:2407.02560 (2024). \n8. \nYu, J. et al. Fractional Chern insulators versus nonmagnetic states in twisted bilayer MoTe \n2. Phys Rev B 109, 045147 (2024). \n9. \nZhang, Y.-H. Vortex spin liquid with neutral Fermi surface and fractional quantum spin \nHall effect at odd integer filling of moir\\’e Chern band. arXiv preprint arXiv:2402.05112 \n(2024). \n10. \nWang, C. et al. Higher Landau-Level Analogues and Signatures of Non-Abelian States in \nTwisted Bilayer MoTe $ _2$. arXiv preprint arXiv:2404.05697 (2024). \n11. \nMay-Mann, J., Stern, A. & Devakul, T. Theory of half-integer fractional quantum spin \nHall insulator edges. arXiv preprint arXiv:2403.03964 (2024). \n12. \nSodemann Villadiego, I. Halperin states of particles and holes in ideal time reversal \ninvariant pairs of Chern bands and the fractional quantum spin Hall effect in moiré MoTe \n2. Phys Rev B 110, 045114 (2024). \n13. \nXu, C., Mao, N., Zeng, T. & Zhang, Y. Multiple Chern bands in twisted MoTe $ _2 $ and \npossible non-Abelian states. arXiv preprint arXiv:2403.17003 (2024). \n14. \nReddy, A. P., Paul, N., Abouelkomsan, A. & Fu, L. Non-Abelian fractionalization in \ntopological minibands. arXiv preprint arXiv:2403.00059 (2024). \n15. \nAhn, C.-E., Lee, W., Yananose, K., Kim, Y. & Cho, G. Y. First Landau Level Physics in \nSecond Moir\\’e Band of $2.1^\\circ $ Twisted Bilayer MoTe ${} _2$. arXiv preprint \narXiv:2403.19155 (2024). \n16. \nArsenault, E. A. et al. Two-Dimensional Moiré Polaronic Electron Crystals. Phys Rev Lett \n132, 126501 (2024). \n17. \nArsenault, E. A. et al. Time-Domain Signatures of Distinct Correlated Insulators in a \nMoir\\’e Superlattice. arXiv preprint arXiv:2406.15067 16, 549 (2024). \n18. \nMurakami, Y., Golež, D., Eckstein, M. & Werner, P. Photo-induced nonequilibrium states \nin Mott insulators. arXiv preprint arXiv:2310.05201 (2023). \n19. \nTang, Y. et al. Simulation of Hubbard model physics in WSe2/WS2 moiré superlattices. \nNature 579, 353–358 (2020). \n20. \nRegan, E. C. et al. Mott and generalized Wigner crystal states in WSe2/WS2 moiré \nsuperlattices. Nature 579, 359–363 (2020). \n21. \nXu, Y. et al. Correlated insulating states at fractional fillings of moiré superlattices. \nNature 587, 214–218 (2020). \n22. \nStormer, H. L., Tsui, D. C. & Gossard, A. C. The fractional quantum Hall effect. Rev Mod \nPhys 71, S298 (1999). \n23. \nLu, Z. et al. Fractional quantum anomalous Hall effect in multilayer graphene. Nature \n626, 759–764 (2024). \n24. \nLi, H. et al. Imaging two-dimensional generalized Wigner crystals. Nature 597, 650–654 \n(2021). \n\n\n10 \n \n25. \nLi, H. et al. Wigner molecular crystals from multielectron moiré artificial atoms. Science \n(1979) 385, 86–91 (2024). \n26. \nKang, K. et al. Evidence of the fractional quantum spin Hall effect in moiré MoTe2. \nNature 628, 522–526 (2024). \n27. \nPark, H. et al. Ferromagnetism and Topology of the Higher Flat Band in a Fractional \nChern Insulator. arXiv preprint arXiv:2406.09591 (2024). \n28. \nAnderson, E. et al. Programming correlated magnetic states with gate-controlled moiré \ngeometry. Science (1979) 381, 325–330 (2023). \n29. \nPetek, H. & Ogawa, S. Femtosecond time-resolved two-photon photoemission studies of \nelectron dynamics in metals. Prog Surf Sci 56, 239–310 (1997). \n30. \nReddy, A. P. & Fu, L. Toward a global phase diagram of the fractional quantum \nanomalous Hall effect. Phys Rev B 108, 245159 (2023). \n31. \nAnderson, E. et al. Trion sensing of a zero-field composite Fermi liquid. Nature 635, 590–\n595 (2024). \n32. \nWang, C. et al. Fractional chern insulator in twisted bilayer mote2 (2023). Phys Rev Lett \n132, 036501 (2024). \n33. \nWu, F., Lovorn, T., Tutuc, E., Martin, I. & MacDonald, A. H. Topological insulators in \ntwisted transition metal dichalcogenide homobilayers. Phys Rev Lett 122, 086402 (2019). \n34. \nZhang, X.-W. et al. Polarization-driven band topology evolution in twisted MoTe2 and \nWSe2. Nat Commun 15, 4223 (2024). \n35. \nAbouelkomsan, A., Reddy, A. P., Fu, L. & Bergholtz, E. J. Band mixing in the quantum \nanomalous Hall regime of twisted semiconductor bilayers. Phys Rev B 109, L121107 \n(2024). \n36. \nYoon, Y. et al. Terahertz phonon engineering with van der Waals heterostructures. Nature \n631, 771–776 (2024). \n37. \nLi, Y. et al. Coherent Modulation of Two-Dimensional Moiré  States with On-Chip THz \nWaves. Nano Lett 24, 12156–12162 (2024). \n38. \nAmano, T. et al. Propagation of insulator-to-metal transition driven by photoinduced \nstrain waves in a Mott material. Nat Phys 1–8 (2024). \n39. \nMariette, C. et al. Strain wave pathway to semiconductor-to-metal transition revealed by \ntime-resolved X-ray powder diffraction. Nat Commun 12, 1239 (2021). \n40. \nMagorrian, S. J. et al. Multifaceted moiré superlattice physics in twisted WSe 2 bilayers. \nPhys Rev B 104, 125440 (2021). \n41. \nXu, F. et al. Interplay between topology and correlations in the second moir\\’e band of \ntwisted bilayer MoTe2. arXiv preprint arXiv:2406.09687 (2024). \n42. \nChen, F., Luo, W.-W., Zhu, W. & Sheng, D. N. Robust non-Abelian even-denominator \nfractional Chern insulator in twisted bilayer MoTe $ _2$. arXiv preprint \narXiv:2405.08386 (2024). \n  \n \nMETHODS \nDevice Fabrication and Doping \nFlakes of the van der Waals materials used to fabricate the heterostructure devices – graphite, \nh-BN, and monolayer MoTe2 – were mechanically exfoliated onto oxygen-plasma cleaned Si/SiO2 \n\n\n11 \n \nsubstrates and identified by optical contrast under an optical microscope. Atomic force microscopy \n(AFM) was used to determine h-BN thickness and confirm the flakes to be free of residue. As \nMoTe2 was air sensitive, its exfoliation, as well as the rest of the device fabrication process, was \nperformed in an argon filled glovebox with H2O and O2 concentrations less than 0.1 ppm. Before \nstarting the transfer, the MoTe2 monolayer was cut in half by an AFM tip. Standard dry transfer \ntechniques were used to fabricate the heterostructure. First, the top gate was formed by picking up \nh-BN, the top graphite flake, the top gate h-BN dielectric, and a graphite grounding pin. Next, the \nfirst half of the MoTe2 flake was picked up, the other half was rotated by the desired angle, and \nthen picked up and placed down to form the moiré superlattice. Finally, the stack was placed down \non a prepared backgate. This backgate consisted of an h-BN dielectric layer on top of a graphite \nflake, as well as gold contacts and wire bonding pads deposited using standard electron beam \nlithography and E-beam evaporation, allowing for electrical contact to both gates and to the \ngrounding pin. The back gate was AFM-cleaned in contact mode before use. The finished \nheterostructure was placed onto the SiO2/Si substrate (SiO2 thickness: 285 nm for D1 and 90 nm \nfor D2) by melting down the PC at ~170 °C, and the stamp polymer was dissolved in anhydrous \nchloroform in a glovebox environment for 5 minutes, completing the device. For D1, the top and \nbottom h-BN gate dielectrics are both 35nm. For D2, the top gate h-BN is 32nm and the bottom \ngate h-BN is 37nm. We estimate the thickness of graphite electrodes from optical contrast on the \nSi/SiO2 substrate. For D1, the top gate graphite is approximately 2-3 graphene layers, and the \nbottom is ~10 nm. For D2, the top is approximately two graphene layers and bottom ~2-3 nm. \nDetermination of carrier density and twist angle  \nThe thickness of the bottom hBN layer in the tMoTe2 devices was measured by an atomic \nforce microscopy (AFM). We calculated the geometrical capacitance per unit area between the \ngate and the sample using the formula 𝐶# =\n$!\"#$$\n%!\"# , where 𝜀&'(=3.0 is the dielectric constant of h-\nBN 1,2, 𝜀) is the vacuum permittivity, 𝑑&'( is the thickness of the top or bottom h-BN layer. This \nequation applies to either side of tMoTe2 sample to give top (Ctg) or bottom (Cbg) capacitance. The \ncarrier density in tMoTe2 was determined by n = (VtgCtg+VbgCbg)/e, where Vtg/bg is the top/bottom \ngate voltage, and e is the elementary charge. The twist angles of the tMoTe2 were determined from \nthe spectral features observed in reflectance contrast measurements. The exciton resonance in \ntMoTe2 shows abrupt changes at superlattice filling factors ν = ±1 (Fig. 1 and Fig. 2), enabling us \n\n\n12 \n \nto extract the corresponding carrier density. The twist angle was calculated from 𝜃= #√3/2 ∙𝑎! ∙\n180/𝜋, where a0 = 3.52 Å is the MoTe₂ lattice constant. \nReflection contrast measurements  \nEach tMoTe2 sample was mounted in a closed-cycle cryostat (Quantum Design, OptiCool) for \nall experiments, with a base temperature of 1.97 K during experiments. Steady-state reflectance \nmeasurements were carried out using a broadband lamp (Thorlabs, SLS201L). To minimize \nheating, a 1100 nm ±50 nm band-pass filter and a neutral density filter were employed. After \ncollimation, the lamp light was focused onto the back pupil of the objective to illuminate the \nsample area using a 100X, 0.75 NA objective. The excitation power of the white light was \nmaintained at approximately 100 nW. The reflected light was collected by the same objective, and \na dual-axis galvo mirror scanning system was employed. Following the spatial scanning of the \nsample, controlled by the angles of the galvo mirrors, the reflected light was spatially filtered \nthrough a pinhole and then dispersed by a spectrometer onto an InGaAs array (PyLoN-IR, \nPrinceton Instruments). \nPump-probe measurements  \nWe carry out pump-probe experiments using femtosecond pulses (400 kHz, 1050 nm, 250 fs) \ngenerated by a solid-state laser (Light Conversion, Carbide). The laser output is split into two \nbeams to form the pump and probe arms. For the probe, a portion of the fundamental beam is \nfocused into a YAG crystal to generate a stable white light continuum, which is then spectrally \nfiltered (1125 nm, 50 nm band-pass filter) to cover the exciton and trion energies in MoTe2. The \npump beam is directed to a motorized delay stage to control the pump-probe delay, ∆t, and then \nfocused onto a second YAG crystal to generate another broadband white light continuum, which \nis subsequently filtered down to 1250 ± 50 nm. After filtering, the pump beam passes through an \noptical chopper to generate alternating pump-on and pump-off signals. The pump and probe beams \nare then directed collinearly onto the sample through a 100X, 0.75 NA objective. The pump and \nprobe spot diameters are approximately 1.5 μm and 1 μm, respectively. The pulse duration at the \nsample was estimated to be ~ 200 fs from the coherent artifact in pump-probe cross correlation. \nThe same objective is used to collect the reflected light, which is spectrally filtered to remove the \npump component and then dispersed onto an InGaAs detector array (PyLoN-IR, Princeton \n\n\n13 \n \nInstruments). The pump-on and pump-off spectra at varying ∆t are used to calculate the transient \nreflectance signal (ΔR/R), where ΔR = R(DT) – R and R is reflectance without pump. Note that, \nat the pump photon energy used here, there is no detectable excitation directly of the \nsemiconducting MoTe2. Such excitation would lead to Pauli blocking which would give rise to a \nnearly instantaneous bleaching signal at exciton/trion energies; this was not observe in time-\nresolved spectra. We use excitation photon energy below the optical gap of MoTe2 to avoid the \ncreation of excitons; pump excitation above the optical gap would result in overwhelming response \nof bleaching and recombination dynamics of excitons/trions. In the measurement, we vary the \npump fluence from r = 7 to 42 µJ/cm2, use a probe fluence of 22 µJ/cm2 for all the measurement, \nExtended data fig. 13. The peak amplitude of DR/R signal is found to scale linearly with pump \nfluence. The electronic melting and recovery dynamics are independent of r in this range. In all \ndata presented in the text, we use constant pump and probe fluences of 42 µJ/cm2 and of 22 µJ/cm2, \nrespectively. \nCoherent phonons launched at graphite electrodes \nThe few-layer graphene/graphite gate electrodes in a vdW structure are known to function as \nopto-elastic transducers 36,37.  Since the density of electrons that can be excited by the pump photon \nof ℏ𝜔 = 0.99 eV is approximately three orders of magnitude higher in the graphite electrode than \nthat in the doped moiré structure, most of the absorption of pump light occurs in the former. The \nresulting strain field in the photo-excited graphite electrodes launch acoustic phonon wavepackets \nthat propagate through the h-BN spacer and reach the tMoTe₂ at a time delay determined by the \nspacer thickness and the phonon group velocity. We estimate that phonon group velocity from the \narrival time of the wavepackets and the h-BN thickness: vphg ≈ dhBN/tdelay ≈ 3.5 km/s, in agreement \nwith the longitudinal acoustic phonon velocity in h-BN 37. The phonon wavepackets modulate the \nelectronic structure and the effective dielectric environment of tMoTe₂, enabling detection of the \nphonon oscillations through coherent changes in the exciton resonances in MoTe₂. The acoustic \nphonon wavepackets launched from the graphite electrodes are broad band and those detected at \ntMoTe₂ are frequency selected by resonant modes, particularly inter-layer breathing (LB) mode in \nthe multilayer vdW structure 36,37.  \nAssignment of Filling Factors \n\n\n14 \n \nThe filling factor ν is defined as the number of electrons or holes per moiré superlattice site. \nTo determine ν, we use the well-established insulating states, ν = 0, ν = ±1 and ν = ±2 as reference \npoints to extract the conversion factor between gate voltage (Vg = Vtg +Vbg) and the filling factor \nfor both electron and hole doping. We start by identifying the gate voltages for all insulating states, \ndetermined by the maximum change in reflection observed in the pump-probe map (e.g., Fig. 1g). \nFor distinct and closely spaced states, we determine their peak positions and full width at half-\nmaximum (FWHM) by fitting Lorentzian profiles to the exciton/trion spectral weight as a function \nof gate voltage. To reduce interference effects from the top and bottom hBN layers and the \nsubstrate, which can distort the reflection spectrum, we integrate the reflection contrast over an \nenergy window around the exciton/trion peak to extract the spectral weight (see Extended Data \nFig. 12). The fitting results for all states, along with the corresponding gate voltages, are presented \nin Extended Data Table 1. \nFor device D1, the gate voltages corresponding to ν = 0, ν = 1 and ν = -1 are determined from \nthe static and transient reflection. Using a linear fit to these points, we establish the relationship \nbetween filling factor and gate voltage. The filling factors for other insulating states are then \ncalculated based on their gate voltages and the conversion factor. Each state is assigned to the \nclosest rational number with a small denominator, as these generally represent lower-energy states.  \nFor device D2, we applied the same method to determine the states between ν = 1 and ν = -1. \nTwo peaks close to ν = 0 (|ν |< 1/7), were not assigned specific filling factors due to the limited \nresolution and uncertainty in the precise gate voltage at ν = 0. For states |ν |>1, the gate voltage \nbecomes more effective; therefore, we used v = -2, v = -1 and v = 0 to define the relationship for \n-2 < ν < -1 states and use v = 0, v=1 and v =2 to define the relationship for ν >1. For less well-\ndeveloped states (ν < −2), we estimated the peak positions and widths from the first derivative of \nthe reflection contrast contour plot with respect to energy (see Fig. 2c and d for the averaged \nderivative map at different time delays, and Extended Data Fig. 7 for individual time delays). The \ngate voltages corresponding to these correlated states are determined by the inflection points in the \nderivative map and the associated spectral weight. \n \nACKNOWLEDGEMENTS \n\n\n15 \n \nTime-resolved spectroscopy experiments were supported by Programmable Quantum \nMaterials, an Energy Frontier Research Center funded by the U.S. Department of Energy (DOE), \nOffice of Science, Basic Energy Sciences (BES), under award DE-SC0019443. Methodology \ndevelopment for the pump-probe experiments was support by the DOE-BES under award DE-\nSC0024343 (XYZ). The device fabrication was supported by DOE-BES under the award DE-\nSC0018171(XX), using the facilities and instrumentation supported by NSF MRSEC DMR-\n2308979. XYZ and XR acknowledge partial support by the US Army Research Office, grant \nnumber W911NF-23-1-0056, for supporting the temperature-dependent experiments. XYZ \nacknowledges support by the Department of Defense (DOD) Multidisciplinary University \nResearch Initiative (MURI) under grant number W911NF2410292 for the development of \nmechanistic models of electron-phonon coupling. YW acknowledges the Max-Planck New York \nCenter (MPNYC) for fellowship support. EAA acknowledges support from the Simons \nFoundation as a Junior Fellow in the Simons Society of Fellows (965526). Facilities supported by \nthe Materials Science and Engineering Research Center (MRSEC) through NSF grant DMR-\n2011738 were utilized in this work. K.W. and T.T. acknowledge support from the JSPS KAKENHI \n(Grant Numbers 21H05233 and 23H02052) and World Premier International Research Center \nInitiative (WPI), MEXT, Japan. We thank Nishchhal Verma and Daniel Munoz Segovia for helpful \ndiscussions, Yinjie Guo, Jordan Pack, and Sanat Ghosh for assistance with sample preparation. \nAuthor Contributions \nY.W., X.Y.Z., and X.X. conceived this work. Y.W., along with J.C., conducted all spectroscopic \nmeasurements, analyzed, and interpreted the results, with the assistance of E.A.A. and YL, and \ninputs from D.B., X.R., and J.C.H. E.A. was responsible for the fabrication and characterization \nof sample (D1) and W.L. for sample (D2), under the supervision of X.X. T.T. and K.W. provided \nthe hBN crystal. J.I., R.Q., X.H., and D.X. contributed to mechanistic interpretations. The \nmanuscript was prepared by Y.W. and X.Y.Z., incorporating inputs from all coauthors. X.Y.Z. \nsupervised the project. All authors read and commented on the manuscript. \nCompeting Interests. The authors declare no competing interests. \nData Availability Statement. The data within this paper are available upon reasonable request.  \n \n \n\n\n16 \n \n \nFigure 1. Pump-probe spectroscopy detects hidden states at fractional fillings in tMOTe2.  a. \nSchematics of a dual-gated MoTe2 bilayer device (D1) with a twist angle q = 3.7o. The pump photon energy \nis ℏ𝜔\"= 0.99 eV and the broadband probe with photo energies ℏ𝜔#  = 1.0-1.2 eV. b. Schematic illustration \nof pump-induced processes in a correlated state, illustrated here for a Mott state with a lower and upper \nHubbard  band (LHB and UHB). Excitation across the correlated gap (I) creates a hot carrier, which relaxes \non ultrafast time scales (II) to form a holon-doublen pair across the gap (III). These are followed by \ndisordering/melting as represented by a reduction or closing of the correlated gap (IV), followed by \nrecovery on a longer time scale (V). c. Schematic illustration of an exciton or trion reflection spectrum from \na correlated state, with change induced by the pump and the corresponding differential reflectance \nspectrum. d. Static reflection spectrum (R) as a function of gate bias (Vg) and probe photon energy (ℏ𝜔#). \ne. & f. Transient reflection spectra, ΔR/R (pseudo color), where ΔR = R(Dt) – R, as a function of Vg and \nℏ𝜔# for delay times of Dt = 13 ps and 300 ps, respectively. g. Linecuts from the spectral maps f at exciton \n(black) and trion (red) energies. The calibrated filling factors (n) are indicated on the line cuts. All \nexperiments carried are out at a sample temperature of T = 2.0 K.  \n\n\n17 \n \n \n \nFigure 2. Pump-probe spectroscopy detects hidden states at fractional fillings of the first and second \nChern bands in tMOTe2 device 2 (D2) with a twist angle q = 3.1o.  Transient reflection spectra, ΔR/R \n(pseudo color), where ΔR = R(Dt) – R, as a function of Vg and ℏ𝜔# for delay times of Dt = 13 ps (a) and 450 \nps (b), respectively. Panels (c) is a derivative spectral map d(DR/R)/dVg, averaged over three early delays \ntimes (Dt = 13, 25, and 45 ps). The color scales are normalized, negative (blue) to positive (red). (d) Linecuts \nfrom the spectral maps of ΔR/R at exciton (black or grey), trion (red) energies, and from derivative spectral \nmap d(DR/R)/dn. The calibrated filling factors (n) are indicated on the line cuts.). All experiments carried \nare out at a sample temperature of T = 2.0 K.  \n \n\n\n18 \n \n \nFigure 3. Melting and recovery dynamics of correlated states. Transient reflection spectra at the \nindicated pump-probe delay times (from top to bottom) of Dt = 1.5, 13, 25, 37, 49, 150, 300 ps for a. hole \ndoping and b. electron doping. The arrows illustrate the time windows for electronic melting/reordering \nand phonon melting/reordering. All spectra obtained from Device D1 (q = 3.7o), at a sample temperature of \nT = 2.0 K.  \n \n \n\n\n19 \n \n \nFigure 4. Melting and recovery dynamics. Time profiles of transient reflection (DR/R) for: a n = ±1, b \nn = ±4/3, c n = ±3/2, and d n = 0 from device D1 (q = 3.7o). e. Time profiles of the n = -1 state in device \nD2 (q = 3.1o) at two displacement fields, D = 0.0 (red) and 0.2 V/nm (blue). Each profile is obtained at the \nprobe photon energy where DR/R reaches minimum, integrated over a small spectral window (±2 meV). \nNote that each panel is divided into two scales (0-75 ps and 75 – 1875 ps). In panels a, b, c, and e, the DR/R \nvalues are normalized to the minima on the short time scale (< 20 ps). In panel d, there is no minimum on \nthe short time scale (< 20 s) and the normalization factor was an average of those in panels a-c. The \nnormalized DR/R values between 75-1875 ps in panels a, b, and c are scaled by a factor of 0.5. All data \nobtained at a sample temperature of T = 2.0 K with zero displacement field. f. Illustration of the moiré \nsuperlattice showing the layer-localized and non-bonding XM/MX (blue/orange) regions that form the \nhoneycomb lattice, and the interlayer hybridized AA regions. The lower panel illustrates inter-site hopping \n(th) and modulation of electronic states by the breathing phonon (dph) in the conduction band (CB) and \nvalence band (VB). \n \n \n \n\n\nHidden States and Dynamics of Fractional Fillings in tMoTe2 Moiré Superlattices \n \n \n \nYiping Wang1,2, Jeongheon Choe1, Eric Anderson3, Weijie Li3, Julian Ingham4, Eric A. Arsenault1, \nYiliu Li1, Xiaodong Hu5, Takashi Taniguchi6, Kenji Watanabe7, Xavier Roy1, Dmitri Basov4, Di \nXiao5, Raquel Queiroz4, James C. Hone2, Xiaodong Xu3,5, X.-Y. Zhu1,1 \n \n1 Department of Chemistry, Columbia University, New York, NY 10027, USA \n2 Department of Mechanical Engineering, Columbia University, New York, NY 10027, USA \n3 Department of Physics, University of Washington, Seattle, WA 98195, USA \n4 Department of Physics, Columbia University, New York, NY 10027, USA \n5 Department of Materials Science and Engineering, University of Washington, Seattle, WA 98195, \nUSA \n6 Research Center for Materials Nanoarchitectonics, National Institute for Materials Science, \n1-1 Namiki, Tsukuba 305-0044, Japan \n7 Research Center for Electronic and Optical Materials, National Institute for Materials Science, 1-1 \nNamiki, Tsukuba 305-0044, Japan \n \n \n \n1 To whom correspondence should be addressed. E-mail: xyzhu@columbia.edu. \n\n\n \nExtended Data Fig. 1: Device Images. a-b. 50X microscope image of device D1 and D2, the scale bar is 20 µm. \n \n  \n \nExtended Data Fig. 2: Device characterization. a. RMCD signal versus v and perpendicular electric field D at zero magnetic \nfield µ0H = 0 (D1). The phase space with non-vanishing signal corresponds to the ferromagnetic state. b.  RMCD signal versus vertical \nmagnetic field with µ0H swept back and forth at n = -0.4*1013cm-2 and D = 0V/nm (D2). c.  D1: PL intensity plot as a function of doping \nand photon energy. d.  D2: PL intensity plot as a function of doping and photon energy. e. Reflection as a function of doping and photon \nenergy (D1). f. Reflection as a function of doping and photon energy (D2). \n \n \n \n\n\n \nExtended Data Fig. 3: Pump-probe spectroscopy at T = 7 K of tMoTe2 device 1 (D1) with a twist angle q = 3.7o.  Transient \nreflection spectrum as a function of carrier density (n) and probe photon energy E (ℏ𝜔!) at pump-probe delays of a. ∆t = 4 ps, b. ∆t = \n39 ps, c. ∆t = 399 ps and d. ∆t = 1399 ps at 54 uJ/cm2(∆R/R0 color range -2x10-4 to 2x10-4). There is no external magnetic field (B = \n0) or displacement field (D = 0).  \n \n \n\n\nExtended Data Fig. 4: Pump-probe spectroscopy at T = 20 K of tMoTe2 device 1 (D1) with a twist angle q = 3.7o. Transient \nreflection spectrum as a function of carrier density (n) and probe photon energy E (ℏ𝜔!) at pump-probe delays of a. ∆t = 4 ps, b. ∆t = \n39 ps, c. ∆t = 399 ps and d. ∆t = 1399 ps at 54 uJ/cm2(∆R/R0 color range -2x10-4 to 2x10-4). There is no external magnetic field (B = \n0) or displacement field (D = 0).  \n \n \n \n\n\nExtended Data Fig. 5: Pump-probe spectroscopy at T = 50 K of tMoTe2 device 1 (D1) with a twist angle q = 3.7o.  Transient \nreflection spectrum as a function of carrier density (n) and probe photon energy E (ℏ𝜔!) at pump-probe delays of a. ∆t = 4 ps, b. ∆t = \n39 ps, c. ∆t = 399 ps and d. ∆t = 1399 ps at 54 uJ/cm2(∆R/R0 color range -2x10-3 to 2x10-3). There is no external magnetic field (B = \n0) or displacement field (D = 0).  \n \n \n\n\n \nExtended Data Fig. 6: Pump-probe spectroscopy of a tMoTe2 device (D3) with a twist angle q = 5.5o.  (a) Optical image (~100 \nµm x 100 µm) of device D3. (b) PL spectra as a function doping level (estimated from calculated capacitance). The left and right \nshow displacements fields of D = 0 and -0.02 V/nm; the latter is used to compensate for a small build-in potential; (c-e) Transient \nreflection spectrum as a function of total gate voltage Vg (V) and probe photon energy E (ℏω2) at pump-probe delays of c. ∆t \n= 7 ps, d. ∆t = 13 ps, and e ∆t = 500 ps. The pump (0.99 eV) and probe fluences are at 42 µJ/cm2 and 22 µJ/cm2, respectively. Sample \ntemperature T = 1.6 K. There is no external magnetic field (B = 0) or displacement field (D = 0).  The gate voltage ranges in (c-e) \ncorrespond to the same estimated doping range shown in the PL maps (b).  \nNo specific states (at particular Vg or doping levels) are resolved in the pump-probe spectral maps at all three selected Dt values (7, \n13, 500 ps), in agreement with the PL maps in (b). The transient spectral maps feature exciton and trion resonances, with energy \nsplitting in certain doping ranges; these splitting features have been observed before and attributed to exciton/trion fine structures in \nMoTe2 monolayers (Nature Nanotech. 2013, 9, 634-638; Nature Nanotech. 2017, 12, 144-149) and/or exciton polarons in tMoTe2 \nbilayers (Nature Nanotech. 2022, 17, 934-939). The broad contrasts in exciton/trion DR/R signal vary slowly with Dt and likely result \nfrom the dynamics or hot-carrier relaxation, carrier-phonon scattering, phonon cooling, and balances in exciton and trion populations. \n \n \n \n \n\n\nExtended Data Fig. 7: Melting dynamics of correlated states. a. Transient reflection spectra at the indicated pump-probe delay \ntimes (from top to bottom) of ∆t = 1.5, 13, 25, 37, 49, 150, 450 and 1150 ps for a. hole doping and b. The corresponding 1st derivative \n(with respect to n) of the transient reflection spectra in a. All spectra obtained from tMoTe2 device D2 (q = 3.1o), at a temperature of \nT = 2 K, with no external electric or magnetic field. \n \n \n \n\n\n \n \nExtended Data Fig. 8: Time profiles of difference states. a. Time profiles of all the electron doping states in D1. b. electronic \nmeting and recovery time constant of all the electron doped states. c. phonon melting and recovery time constant of electron doped \nstates d. Time profiles of hole doped states. e. electronic meting and recovery time constant of all the hole doped states. (f) Time \nprofile of v = 0, 1/3 and 1/2, data normalized to t = 0 ps. (g) Time profile difference of v = 1/3,1/2 to v = 0. All data obtained at a \ntemperature of T = 2 K, with no external electric or magnetic field.  \n \n \n \n\n\n \nExtended Data Fig. 9: Time profiles of a hole doped state of -1/7 ≤ n < 0, which is closest to Vg = 0. Upper: sample temperature T \n= 2 K (nominal reading on sample stage 1.58 K); Lower: sample temperature T = 70 K, which is above the Tc. Electronic and phonon \nmelting processes are observed at 2 K, but not 70 K. \n \n \nExtended Data Fig. 10: Delayed arrival of coherent phonon wavepackets launched at the graphite electrodes. a. Time profiles \nof the n = 1 state with melting and recovery fitting (red). b. coherent phonon oscillation after the melting and recovery background is \nsubtracted. c. Fourier transform of the coherent phonons.  \n \n \n \n\n\n \nExtended Data Fig. 11: spectral resolved time profile.  a. Transient reflection as a function of delay time and spectral energy for \nnon-correlated state v = 0 in D1. b. Short time window of a. c. Time profiles of the n = 0 state at the exciton energy, only phonon \nmodulation process observed. e. Transient reflection as a function of delay time and spectral energy for v = 1 and f. v = -1  \n \n \n\n\n \nExtended Data Fig. 12: Pump-probe spectroscopy at T = 2 K of tMoTe2.   Transient reflection spectrum as a function of carrier \ndensity (n) and probe photon energy E (ℏ𝜔!) at pump-probe delays of a. Device D1 ∆t = 300 ps, with the dash line square indicating \nthe integration range for the exciton (black) and trion (blue) shown in Figure 1g of the main text. b. Device D2 ∆t = 450 ps, with the \ndash line square indicating the integration range for the exciton (black), trion (blue), and trion derivative (red) shown in Figure 2d of \nthe main text %% trion device 2 : 1.107—1.114 eV, exciton: 1.130 1.122, derivative: 1.115-  1.106 device 1: trion 1.108-1.114 \nexciton e1.120-1.125, exciton h 1.126-1.123, trion hole: 1.112-1.117 \n \n \nExtended Data Fig. 13: Pump fluence dependent. (a) Transient reflection in the exciton spectral region for the n = 1 sate at pump \nfluences of r = 7, 14, and 42 µJ/cm2 and a pump-probe delay time of Dt = 7 ps. The magnitude of DR/R scales approximately linearly \nwith r. Time profiles of the v = 1 state at different fluences on two time scales (b) 0-75 ps and (c) 75-1875 ps. Each profile is obtained \nfrom integration of DR/R in a probe photon energy window of 1.119-1.125 eV. All profiles in (b) and (c) are normalized to DR/R at Dt \n= 7 ps. The electronic melting/recovery processes are independent of r (b), while the relative magnitude of the phonon melting processes \nincreases with pump fluence (c). \n \n\n\nExtended table  \nFilling factor assignment: \n \nD1 \n \nD2 \nFilling factor \n(closest state) \nFilling factor \nGate Voltage \nFilling factor \n(closest state) \nFilling factor  \nGate Voltage \n-5/3 \n-1.779 \n-13.600 \n-8/3 \n-2.702 \n-16.295 \n-3/2 \n-1.589 \n-12.150 \n-5/2 \n-2.500 \n-15.095 \n-4/3 \n-1.350 \n-10.325 \n-7/3 \n-2.239 \n-13.540 \n-1 \n-1 \n-7.644 \n-2 \n-1.967 \n-11.918 \n-2/3 \n-0.663 \n-5.069 \n-5/3 \n-1.636 \n-9.940 \n-3/5 \n-0.568 \n-4.344 \n-3/2 \n-1.493 \n-9.090 \n-1/2 \n-0.501 \n-3.834 \n-4/3 \n-1.327 \n-8.100 \n-2/5 \n-0.402 \n-3.079 \n-1 \n-1 \n-6.511 \n-1/3 \n-0.316 \n-2.418 \n-4/5 \n-0.802 \n-5.242 \n2/7 \n0.280 \n2.243 \n-2/3 \n-0.664 \n-4.336 \n1/3 \n0.345 \n2.756 \n-1/2 \n-0.497 \n-3.235 \n2/5 \n0.404 \n3.234 \n-1/3 \n-0.334 \n-2.157 \n3/7 \n0.469 \n3.758 \n-1/7 \n-0.163 \n-1.032 \n1/2 \n0.478 \n3.820 \n0 \n0 \n-0.028 \n4/7 \n0.578 \n4.622 \n1/7 \n0.155 \n1.063 \n2/3 \n0.729 \n5.836 \n1/3 \n0.327 \n2.198 \n3/4 \n0.732 \n5.856 \n4/7 \n0.541 \n3.608 \n6/7 \n0.879 \n7.033 \n2/3 \n0.661 \n4.402 \n1 \n1 \n8.000 \n6/7 \n0.829 \n5.510 \n6/5 \n1.190 \n9.522 \n1 \n1 \n6.672 \n4/3 \n1.331 \n10.645 \n6/5 \n1.163 \n7.709 \n3/2 \n1.493 \n11.943 \n4/3 \n1.333 \n8.830 \n5/3 \n1.625 \n13.000 \n3/2 \n1.506 \n9.970 \n \n \n \n5/3 \n1.633 \n10.808 \n \n \n \n9/5 \n1.764 \n11.675 \n \n \n \n2 \n1.990 \n11.940 \n \n \n \n11/5 \n2.182 \n13.070 \n \n \n \n7/3 \n2.349 \n14.060 \n \n \n \n5/2 \n2.494 \n14.910 \n \n \n \n8/3 \n2.684 \n16.030 \n \n \n \n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21153v1.pdf",
    "total_pages": 31,
    "title": "Hidden States and Dynamics of Fractional Fillings in tMoTe2 Moiré Superlattices",
    "authors": [
      "Yiping Wang",
      "Jeongheon Choe",
      "Eric Anderson",
      "Weijie Li",
      "Julian Ingham",
      "Eric A. Arsenault",
      "Yiliu Li",
      "Xiaodong Hu",
      "Takashi Taniguchi",
      "Kenji Watanabe",
      "Xavier Roy",
      "Dmitri Basov",
      "Di Xiao",
      "Raquel Queiroz",
      "James C. Hone",
      "Xiaodong Xu",
      "X. -Y. Zhu"
    ],
    "abstract": "The fractional quantum anomalous Hall (FQAH) effect was recently discovered\nin twisted MoTe2 bilayers (tMoTe2). Experiments to date have revealed Chern\ninsulators from hole doping at v = -1, -2/3, -3/5, and -4/7 (per moir\\'e unit\ncell). In parallel, theories predict that, between v = -1 and -3, there exist\nexotic quantum phases, such as the coveted fractional topological insulators\n(FTI), fractional quantum spin Hall (FQSH) states, and non-abelian fractional\nstates. Here we employ transient optical spectroscopy on tMoTe2 to reveal\nnearly 20 hidden states at fractional fillings that are absent in static\noptical sensing or transport measurements. A pump pulse selectively excites\ncharge across the correlated or pseudo gaps, leading to the disordering\n(melting) of correlated states. A probe pulse detects the subsequent melting\nand recovery dynamics via exciton and trion sensing. Besides the known states,\nwe observe additional fractional fillings between v = 0 and -1 and a large\nnumber of states on the electron doping side (v > 0). Most importantly, we\nobserve new states at fractional fillings of the Chern bands at v = -4/3, -3/2,\n-5/3, -7/3, -5/2, and -8/3. These states are potential candidates for the\npredicted exotic topological phases. Moreover, we show that melting of\ncorrelated states occurs on two distinct time scales, 2-4 ps and 180-270 ps,\nattributed to electronic and phonon mechanisms, respectively. We discuss the\ndiffering dynamics of the electron and hole doped states from the distinct\nmoir\\'e conduction and valence bands.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}