{
  "id": "arxiv_2502.21124v1",
  "text": "1 \n \nSynthesis and characterizations of arsenic doped FeSe \nbulks  \n \nPriya Singh1, Manasa Manasa1, Mohammad Azam1, Tatiana Zajarniuk2, Konrad Kwatek3, \nTomasz Cetner1, Andrzej Morawski1, Jan Mizeracki1, Shiv J. Singh1* \n \n1Institute of High Pressure Physics (IHPP), Polish Academy of Sciences, Sokołowska 29/37, 01-142 \nWarsaw, Poland \n2Institute of Physics, Polish Academy of Sciences, Aleja Lotnikow 32/46, 02-668 Warsaw, Poland  \n3Faculty of Physics, Warsaw University of Technology, Koszykowa 75, 00-662 Warsaw, Poland \n \n \n \n \n \n \n \n \n \n \n \n \n*Corresponding author: \n Email: sjs@unipress.waw.pl \n \n \n\n\n2 \n \nAbstract \nFeSe(11) family has a simple crystal structure belonging to iron-based superconductors (FBS) \nand has many stable phases including hexagonal and tetragonal structures, but only the \ntetragonal phase exhibits the superconductivity. In this study, we have investigated the effects \nof chemical pressure induced by As-doping at Se-sites in the FeSe system by preparing a series \nof FeSe1-xAsx (x = 0.005, 0.01, 0.02, 0.05, 0.1, and 0.2) bulks. A broad characterization has been \nperformed on these samples using structural, microstructural, transport, and magnetic \nmeasurements. The obtained lattice parameters are increased by As-doping, which suggests the \nsuccessful insertion of As at Se-sites into the tetragonal lattice for low doping contents up to \n5%, whereas the higher As-substitution appears in the form of the FeAs impurity phase. The \ntemperature dependence of the resistivity of all samples has similar behaviour and depicts the \nhighest onset transition temperature of around 11.5 K, but the zero resistivity is not reached \nuntil the measured temperature of 7 K, which could be due to the presence of the impurity \nphases. Our study suggests that a dopant with a large ionic radius, i.e., Arsenic, promotes the \nformation of the hexagonal phase of the 11 family and is effective for a small amount of doping \nlevel for the superconducting properties, whereas higher As-doping levels reduce the \nsuperconducting properties. \nKeywords: Iron-based superconductors, high-Tc superconductors, critical transition \ntemperature \n \n \n \n \n \n \n \n \n \n \n\n\n3 \n \n1. Introduction \nThe iron-based superconductor (FBS) was discovered in 2008 through F-doped LaOFeAs, \nexhibiting a superconducting transition temperature Tc = 26 K [1]. Following this report, many \ncompounds have been discovered under this high-Tc material and the transition temperature \n(Tc) has been enhanced up to 58 K for F-doped SmFeAsO [2], [3]. In addition, the Tc of F-\ndoped LaOFeAs is increased up to 43 K under the applied external pressure [4]. These high-Tc \nsuperconductors can be classified into 6–7 families following their crystal structure [5], [6], \n[7], [8] : REOFeAs (1111) (RE = rare earth), AFe2As2 (122) (A = Ba, K, Ca) (122), CaKFe4As4 \n(1144), and LiFeAs (111), thick perovskite-type oxide blocking layers, including \nSr4V2O6Fe2As2 (42622), Sr4Sc2O6Fe2P2 (42622) and chalcogenide FeX representing 11 (X = \nchalcogenide). FeSe belongs to the 11-family with the simplest crystal structure and the \nsuperconductivity can be induced either by charge carrier doping (hole or electron type) or by \nthe applied external pressure. At the ambient pressure, the superconductivity has been observed \nat Tc = ~8 K for FeSe1-x with x = 0.12 [9]. Hence, the superconductivity in the FeSe system can \nbe induced either by Se deficiency, i.e., FeSe1-x  [9], [10], [11] or by Fe excess, i.e., Fe1+xSe \n[12], [13], [14]. Furthermore, the Tc may be greatly enhanced up to 37 K at an applied pressure \nof about 7 GPa [10]. Generally, the superconductivity in FBS appears after the suppression of \nmagnetic order by a suitable doping [15], [16]. Numerous superconductors have been derived \nfrom FeSe in pursuit of finding new superconductors. The superconducting transition is \nenhanced in the system including AxFe2-ySe2 (A = K, Rb, Tl, etc.) [17], [18] and other organic \nintercalated superconductors, (Li,Fe)OHFeSe [19], heavily electron-doped FeSe through \npotassium deposition, specifically, single-layer FeSe/SrTiO3 films with a record high-Tc of \n~100 K [20]. The effects of different doping at Se or Fe-sites in the FeSe system have been \ninvestigated to comprehend the superconductivity mechanism, including Cu [21], [22] Ni [23], \nCr [24], Co [25] at Fe sites, as well as S [25], [26], [27] and Te [25] at Se sites [28]. Further \nresearch has shown that substituting Te at Se sites results the highest Tc of up to 14.8 K with \nan optimal Te content of 50% under the ambient pressure [29]. However, the preparation of \nsingle-phase superconducting samples for this 11-family is challenging due to its intricate \nphase diagram of 11-family, which has numerous stable crystalline forms, such as tetragonal-\nFexSe, hexagonal-FexSe, orthorhombic FeSe2, tetragonal-FexSe, monoclinic Fe3Se4, and \nhexagonal Fe7Se8, in which the tetragonal phase generally exhibits the superconductivity with \nTc = 8 K [9]. Many reports have revealed that the tetragonal phase coexists with the hexagonal \nphase, signifying a continual competition between these phases during the growth process [30]. \n\n\n4 \n \nIf the growth conditions are not suitable, the hexagonal phases, particularly hexagonal-FexSe \nand hexagonal Fe7Se8, emerge rapidly alongside the main tetragonal 11-phase, which adversely \naffects the superconducting properties [31], [32]. Numerous studies examine the impact of \ncharge carriers, whether hole or electron-doping, on the characteristics of the FeSe system. \nLarge dopant size (Sb) and the equivalent size (Si) dopants at Se sites have been reported in \nthe FeSe1-x system [33], [34], [35] where the hexagonal phase was observed and the onset \ntransition temperature (~9 K) remained nearly constant [33] throughout 5-20% doping \ncontents. These kinds of doping prompted us to investigate the properties of FeSe system with \nnovel dopants. Consequently, we have selected As-doping at Se sites in FeSe system, as there \nare no existing reports in the literature. Since the 11 family exhibits the same tetragonal \nstructure as the pnictide (FeAs) superconductors, including the 1111 and 122 families. In the \nFeAs-based compounds, the Fe-atoms establish a square lattice, with arsenic positioned above \nand below the centre of the Fe-ions square. The substitution of Arsenic with alternative \nelements is crucial for determining the electronic and magnetic characteristics of the iron-based \nsuperconductors, where the hole or electron doping either causes superconductivity or inhibits \nthe magnetic order. To explore the properties of FeSe system through a hole-carrier doping at \nthe Se sites, we have selected this novel arsenic dopant, which is larger than the Se-ionic radius. \nIn this report, we investigate the effects of As-doping at Se sites in the FeSe(11) \nmaterial. A series of FeSe1-xAsx bulks is prepared using the conventional synthesis method and \ncharacterized through various measurements. Structural and microstructural investigations \nsuggest that a small amount of As-doping is possible at Se sites in the FeSe phase, whereas \nhigher doping contents appear in the form of FeAs as an impurity phase. The resistivity and \nmagnetization measurements confirm the appearance of the onset superconducting transition. \nOur study depicts that the large size of dopant (i.e. Arsenic) does not support the formation of \na tetragonal 11 phase but exhibits the superconducting transition up to 11.6 K. \n2. Experimental Details \nA series of FeSe1-xAsx polycrystalline samples were prepared using conventional two-step \nsolid-state reaction methods with x = 0.005, 0.01, 0.02, 0.05, 0.1, and 0.2. The initial precursors, \nFe powder (99.99% purity, Alfa Aesar), Se powder (99.99% purity, Alfa Aesar), and Arsenic \n(As) chunks (99.99% purity, abcr), were mixed in an agate mortar for 15–20 min according to \ntheir nominal compositions. All the chemical processes were performed in a highly pure inert \ngas atmosphere glove box, exhibiting minimal ppm levels of oxygen and moisture. We \n\n\n5 \n \nprepared 1 g of samples in a single batch.  The powders were mixed rigorously and, \nsubsequently, cold-pressed into discs with an 11 mm diameter at a uniaxial pressure of 200 \nbars. The prepared pellets were sealed into an evacuated quartz tube. The evacuated quartz tube \nhelps to minimize the oxygen and moisture atmosphere surrounding the precursors. In the first \nstep, the evacuated quartz tubes were heated at 600 ℃ for 11 h in the box furnace. After the \ncompletion of the reaction, this quartz tube was opened inside the glove box, and the pellets \nwere reground. The powders were pelletized again, having the same diameter as the first step. \nAfterwards, the pellets were sealed again in an evacuated quartz tube. In the subsequent step, \nthe sealed tube was heated again at 600 °C for 4 hours within the same furnace. The final disks \nwere blackish and had the same diameter and thickness as the original ones.  \nThe prepared samples, in the form of pellets, were cut into a rectangular bar shape inside \nthe glove box to prevent oxidation, moisture, or contamination. For the phase and structural \nanalysis, XRD measurements have been performed using a Philips X’Pert Pro diffractometer \nwith filtered Cu–Kα radiation (wavelength: 1.5418 Å, power: 30 mA, 40 kV) and a PIXcel1D \nposition scintillation detector. A Zeiss Ultra Plus field-emission scanning electron microscope \nequipped with the EDS microanalysis system by Bruker mod is employed for the detailed \nmicrostructural analysis and the elemental mapping of the constituent elements. The transport \nproperties, particularly the resistivity, were measured across a temperature range of 7–300 K \nin the absence of a magnetic field, employing a four-probe approach with a closed-cycle \nrefrigerator (CCR). The data were collected using a low-warming procedure to study the \ntemperature dependence of resistivity at current I = 20 mA. Magnetic measurements were \nperformed utilizing a VSM connected to a Quantum Design PPMS, applying a field of 50 Oe \nin zero-field cool (ZFC) and field-cool (FC) modes across a temperature range of 5-30 K. \n3. Results and discussion \nAll the prepared samples are characterized using X-ray powder diffraction, as illustrated in \nFigure 1. Due to the utilization of a Pt sample holder, these patterns also encompass the Pt \npeaks. The main peak 101 in Figure 1 corresponds to the tetragonal phase of FeSe, referring to \nthe superconducting phase. Low As-doped samples (x = 0.005 and 0.01) have the main peak of \nthe tetragonal phase with space group P4/nmm, while a significant presence of the hexagonal \n(Fe7Se8) phase is also detected. With further increase of As-doping contents (x = 0.02-0.1), the \nhexagonal phase is dominated over the tetragonal phase, becoming the primary phase seen. \nInterestingly, for x = 0.2, the tetragonal phase re-emerges as the predominant phase, while the \n\n\n6 \n \nconcentration of the hexagonal phase is reduced compared to other intermediate doping levels. \nHowever, at this doping level, the concentration of the FeAs phase commences to increase. The \npresence of substantial quantities of hexagonal Fe7Se8 and FeAs phases could not be favourable \nfor the superconducting properties. This suggests that the larger atomic size of the dopant is \nnot supportive of the tetragonal phase formation of FeSe. Along with these impurities, \nadditional peaks are detected from the Pt sample holder used for our XRD instrument. The \ncalculated lattice parameters are a = 3.764 Å, c = 5.521 Å for x = 0.01; a = 3.763 Å, c = 5.529 \nÅ for x = 0.05; a = 3.763 Å, c = 5.525 Å for x = 0.2. The obtained lattice parameters for FeSe \nare a = 3.765 Å, and c = 5.518 Å, as reported elsewhere [36]. Hence, the lattice parameter ‘c’ \nis increased for the low amount of As-contents (x ≤0.05), which confirms the successful \ninsertion of As at Se sites. One can note that the lattice ‘c’ of high As-doping contents (i.e., x = \n0.2) is nearly identical to that of the samples x = 0.01-0.05. It means the arsenic may no longer \nbe effectively incorporated into the FeSe lattice beyond a certain doping level, namely, x = \n0.05, and manifest as the FeAs phase. One can note that the presence of several phases may \nresult in substantial error bars for these obtained lattice parameters.         \nTo examine the distribution of the constituent elements inside these samples, the bulks \nwere polished using sandpaper from low grade to extremely fine grade without the application \nof any lubricant. The elemental mapping for various bulk samples is collected for all samples \nand illustrated in Figure 2(a)-(o) for the selected samples x = 0.005, 0.05,  and 0.2, respectively. \nThe sample x = 0.005 exhibits a nearly homogeneous distribution of the constituent elements \nFe, Se, and As; however at many places, the inhomogeneities are also evident, confirming the \nexistence of Fe7Se8 (hexagonal phase) and FeAs phase (Figures 2(a)-(e)). The inhomogeneity \nof the constituent elements was more pronounced for the sample x = 0.05, suggesting a \nsignificant presence of impurity phases (Figures 2(f)-(j)). As the concentration of As-dopants \nincreases, the sample exhibits greater inhomogeneity, as depicted in Figures 2(k)-(o) for x = \n0.2. Similar elemental mappings are also observed for other samples. These results confirm the \npresence of hexagonal and FeAs phases alongside the tetragonal phase, and also suggest that \nAs-doping increases the inhomogeneity of the constituent elements. The observations were \nconsistent with the above-discussed XRD data. \nThe polished samples are also used for the microstructural analysis and the \nbackscattered scanning electron (BSE) images are collected on various magnification scales \nfor all these samples to reveal chemical contrast. Figure 3(a)-(i) depicts BSE images of the \nselected samples x = 0.005, 0.05 and 0.2 arranged from low to high-resolution scale. These \n\n\n7 \n \nimages exhibit light grey, white, and black contrasts that correspond to FeSe1-xAsx, hexagonal \nphase Fe7Se8, and pores respectively. In some places, the black contrast refers to the FeAs \nphase. Figure 3 suggests that the samples are not very compact and many pores do exist. It \nappears that many grains are not well connected due to the presence of micro- or nanopores, \nand impurity phases such as FeAs or Fe7Se8 between them. The observed images of all these \nsamples confirm the presence of hexagonal and FeAs phases, i.e., inhomogeneous \nmicrostructure, supporting the analysis of the elemental mapping. \nThe temperature dependence of the normal state resistivity is illustrated in Figure 4(a) \nfor all the prepared bulks within the temperature range of 7–300 K. The resistivity behaviour \nis almost the same as reported for FeSe1-x [9], [37], however, a systematic variation of the \nresistivity corresponding to different As-doping contents is not evident, which could be due to \nthe formation of a hexagonal phase promoted by As-dopants. The resistivity is increased for \nthe samples x = 0.01 and 0.02 in comparison to x = 0.005, however it is decreased for x = 0.05. \nThe sample x = 0.1 has exhibited a significantly high resistivity value across the whole \ntemperature range which could be due to the main phase of the hexagonal phase for this sample, \nas shown in Figure 1. With further increased level of As-doping, specifically x = 0.2, the \nresistivity is lower than that of the sample x = 0.1, although higher than that of other samples. \nThis non-systematic behaviour may result from the existence of several impurity phases and \nthe competition between hexagonal and tetragonal phases, as corroborated by the structural and \nmicrostructural studies.   \nTo understand the superconducting transition of these samples, the low-temperature \nresistivity behaviour is shown in Figure 4(b) within the temperature range 7-20 K. Interestingly,  \nall samples exhibit a drop in the resistivity around 11 K, nevertheless, no zero resistivity is \nobserved until the measured temperature up to 7 K. A slight increase of the onset transition is \nobserved for low As-doped FeSe, specifically for x = 0.005, 0.01, and 0.02. At high As-doping \nlevels, the onset transition temperature is slightly reduced. Interestingly, the zero resistivity is \nnot reached, which could be attributable to the existence of non-superconducting phases. The \nsample x = 0.20 reaches nearly zero but doesn’t exhibit complete zero resistivity up to 8 K. The \nmaximum value of critical temperature is observed for a 2% doping level (x = 0.02) with Tconset \n=11.5 K. The basis for the definition of the onset critical temperature is the deviation from the \nlinear behaviour of the normal state resistivity (ρ).  \n\n\n8 \n \nTo confirm the superconducting behaviour, we have measured the magnetic moment of \ntwo specific samples: x = 0.05 and 0.2 within the temperature range of 5-30 K at a magnetic \nfield of 50 Oe, as depicted in Figure 5. We have presented a normalized magnetic moment to \nfacilitate a comparative study of these samples. The existence of the impurity phases results a \nsignificant background in the magnetic moment measurements, as shown in Figure 5, which \nagrees well with the above-discussed analysis. Both samples, x = 0.2 and 0.05, exhibit the same \nsuperconducting transition at approximately 8.5 K, suggesting that the actual As-contents in \nthese samples may be nearly identical. The structural analysis agrees well with this observation. \nThe obtained Tc from these measurements is around 2-3 K lower than that of the resistivity \nmeasurements. It could be possible due to inhomogeneity and the existence of the non-\nsuperconducting phase in As-doped samples.  \nTo summarize our findings, we have plotted Tconset value from the resistivity \nmeasurements and the room temperature resistivity (ρ300 Κ) with As-doping contents (x) in \nFigure 6. A slight variation in the room temperature resistivity is observed for low As-doping \ncontents, specifically x = 0.005, 0.01, 0.02 and 0.05, but it increases significantly for high As-\ndoping contents, as depicted in Figure 6(a). The Tconset is slightly improved for low As-doping \ncontents from 10.8 K to 11.5 K. Further increases in As-doping contents, i.e., 5-10%, slightly \nreduce the transition temperature, however a significant reduction is observed for the x = 0.2 \nsample, as illustrated in Figure 6(b). These analyses suggest that As-doping works effectively \nfor low doping contents up to 5%, but high amounts of doping reduce the transition temperature \nand enhance the inhomogeneity of the FeSe1-xAsx bulks. More studies involving a large amount \nof As-doping (x>0.2) and the single crystal growth of FeSe1-xAsx could be helpful for a clear \nunderstanding of the influence of As-doping on the properties of FeSe materials. \n4. Conclusion: \nWe have prepared a series of FeSe1-xAsx (x = 0.005, 0.01, 0.02, 0.05, 0.1 and 0.2) bulks and \ninvestigated the arsenic (As) doping effect on the properties of the FeSe system. Structural and \nmicrostructural analysis confirms the inhomogeneity of the samples attributable to the presence \nof the impurity phases. Arsenic doping contents induce superconductivity with the highest \nTconset = 11.5 K for 2% As-doping, but zero resistivity is not observed within the measured \ntemperature range. However, at higher As-doping concentrations, the superconducting \ntransition is reduced. Our study suggests that a low amount of As-doping (up to 5%) can be \neffective for FeSe to induce the superconducting properties. Further comprehensive research is \n\n\n9 \n \nrequired to understand the influence of arsenic dopants on the FeSe structure and its effect on \nsuperconducting characteristics. \n \nAcknowledgments: \nThe \nwork \nwas \nfunded \nby \nSONATA-BIS \n11 \nproject \n(Registration \nnumber: \n2021/42/E/ST5/00262) sponsored by National Science Centre (NCN), Poland. SJS \nacknowledges financial support from National Science Centre (NCN), Poland through research \nProject number: 2021/42/E/ST5/00262. \n \n \n\n\n10 \n \nReferences \n \n[1] Y. Kamihara, T. Watanabe, M. Hirano, H. Hosono, “Iron-Based Layered Superconductor La[O1-\nxFx]FeAs (x = 0.05−0.12) with Tc = 26 K,” J. Am. Chem. Soc., vol. 130, p. 3296, 2008.  \n[2] X. Wang, J. Yu, B. Ruan, B. Pan, Q. Mu, T. Liu, K. Zhao, G. Chen and Z. Ren, “Revisiting the \nElectron-Doped SmFeAsO: Enhanced Superconductivity up to 58.6 K by Th and F Codoping,” \nChinese Physics Letters, vol. 34, p. 077401, 2017.  \n[3] S. J. Singh, H. Ogino, J. Shimoyama and K. Kishio, “Weak-link behaviour observed in iron-based \nsuperconductors with thick perovskite-type blocking layers,” Supercond. Sci. Technol., vol. 26, p. \n105020, 2013.  \n[4] H. Takahashi, K. Igawa, K. Arii, Y. Kamihara, M. Hirano and H, Hosono, “Superconductivity at \n43 K in an iron-based layered compound LaO1-xFxFeAs,” Nature , vol. 453, p. 376–378, 2008.  \n[5] H. Hosono, A. Yamamoto, H. Hiramatsu and Y. Ma, “Recent advances in iron-based \nsuperconductors toward applications,” Materials Today, vol. 21, pp. 278-302, 2018.  \n[6] J. I. Shimoyama, “Potentials of iron-based superconductors for practical future materials,” \nSupercond. Sci. Technol., vol. 27, p. 044002, 2014.  \n[7] J. Paglione, R. Greene, “High-temperature superconductivity in iron-based materials,” Nature \nPhysics, vol. 6, pp. 645-658, 2010.  \n[8] Q. Si, R. Yu, and E. Abrahams, “High-temperature superconductivity in iron pnictides and \nchalcogenides,” Nat Rev Mater, vol. 1, p. 16017, 2016.  \n[9] F. Hsu, J. Luo, K. Yeh, T. Chen, T. Huang, P.M. Wu, Y. Lee, Y. Huang, Y. Chu, D. Yan, M. Wu, \n“Superconductivity in the PbO-type structure α-FeSe,” Proc. Natl. Acad. Sci. U.S.A, vol. 105, pp. \n14262-14264, 2008.  \n[10] S. Margadonna, Y. Takabayashi, Y. Ohishi, Y. Mizuguchi, Y. Takano, T. Kagayama, T. Nakagawa, \nM. Takata, and K. Prassides, “Pressure evolution of the low-temperature crystal structure and \nbonding of the superconductor FeSe,” Phys. Rev. B, vol. 80, p. 0645, 2009.  \n[11] K.-W. Yeh, T.-W. Huang, Y.-L. Huang, T.-K. Chen, F.-C. Hsu, P.M. Wu, Y.-C. Lee, Y.-Y. Chu, C.-\nL. Chen, J.-Y. Luo, D.-C. Yan and M.-K. Wu, “Tellurium substitution effect on superconductivity \nof the α-phase iron selenide,” Eur. Phys. Lett., vol. 84, p. 37002, 2008.  \n[12] T. M. McQueen, A. J. Williams, P. W. Stephens, J. Tao, V. Ksenofontov, F. Casper, C. Felser and \nR. J. Cava, “Tetragonal-to-Orthorhombic Structural Phase Transition at 90 K in the \nSuperconductor Fe1.01Se,” Phys. Rev. Lett. , vol. 103, p. 057002, 2009.  \n[13] V.A. Sidorov, A.V. Tsvyashchenko, R.A. Sadykov, “Interplay between magnetism and \nsuperconductivity and appearance of a second superconducting transition in α-FeSe at high \npressure,” J. Phys.: Condens. Matter , vol. 21 , p. 415701, 2009.  \n\n\n11 \n \n[14] T. M. McQueen, Q. Huang, V. Ksenofontov, C. Felser, Q. Xu, H. Zandbergen, Y. S. Hor, J. Allred, \nA. J. Williams, D. Qu, J. Checkelsky, N. P. Ong and R. J. Cava , “Extreme sensitivity of \nsuperconductivity to stoichiometry in Fe1+δSe,” Phys. Rev. B, vol. 79, p. 014522, 2009 .  \n[15] C. Lester, Jiun-Haw Chu, J. G. Analytis, S. C. Capelli, A. S. Erickson, C. L. Condron, M. F. Toney, \nI. R. Fisher, and S. M. Hayden, “Erratum: Neutron scattering study of the interplay between \nstructure and magnetism in Ba(Fe1−\u0001Co\u0001)2As2,” Phys. Rev. B, vol. 79, p. 144523, 2009.  \n[16] Y.Qiu, W.Bao, Q.Huang, T.Yildirim, J.M.Simmons, M.A.Green, J.W.Lynn, Y.C. Gasparovic, J.Li, \nT.Wu, G.Wu, X.H.Chen, “Crystal Structure and Antiferromagnetic Order in NdFeAsO1−\u0001F\u0001 (\u0001 =\n0.0 and 0.2) Superconducting Compunds from Neutron Diffraction Measurements,” Phys. Rev. \nLett. , vol. 101, p. 257002, 2008.  \n[17] J. Guo, S. Jin, G. Wang, S. Wang, K. Zhu, T. Zhou, M. He, and X. Chen, “Superconductivity in \nthe iron selenide KxFe2Se2 (0<x<1.0),” Phys. Rev. B., vol. 82, p. 180520, 2010.  \n[18] Ming-Hu Fang, Hang-Dong Wang, Chi-Heng Dong, Zu-Juan Li, Chun-Mu Feng, Jian Chen and \nH. Q. Yuan, “Fe-based superconductivity with Tc = 31 K bordering an antiferromagnetic insulator \nin (Tl, K)FexSe2,” EPL , vol. 94, p. 27009, 2011.  \n[19] X. F. Lu, N. Z. Wang, H. Wu, Y. P. Wu, D. Zhao, X. Z. Zeng, X. G. Luo, T. Wu, W. Bao, G. H. \nZhang, F. Q. Huang, Q. Z. Huang & X. H. Chen, “Coexistence of superconductivity and \nantiferromagnetism in (Li0.8Fe0.2)OHFeSe,” Nature Materials, vol. 14, p. 325–329 , 2015.  \n[20] J. F. Ge, Z.L. Liu, C. Liu et al., “Superconductivity above 100 K in single-layer FeSe films on \ndoped SrTiO3,” Nature Mater, vol. 14, p. 285–289, 2015.  \n[21] A J Williams, T M McQueen, V Ksenofontov, C Felser and R J Cava, “The metal–insulator \ntransition in Fe1.01−xCuxSe,” J. Phys.: Condens. Matter, vol. 21, p. 305701, 2009.  \n[22] Zajicek, Z. and Singh, S. J. and Jones, H. and Reiss, P. and Bristow, M. and Martin, A. and Gower, \nA. and McCollam, A. and Coldea, A. I., “Drastic effect of impurity scattering on the electronic \nand superconducting properties of Cu-doped FeSe,” Phys. Rev. B., vol. 105, p. 115130, 2022.  \n[23] R. Shipra, H. Takeya, K. Hirata and A. Sundaresan, “Effects of Ni and Co doping on the physical \nproperties of tetragonal FeSe0.5Te0.5 superconductor,” Physica C: Superconductivity, vol. 470, pp. \n528-532, 2010.  \n[24] A. K. Yadav, A. D. Thakur and C. V. Tomy, “Enhanced superconducting properties in FeCrxSe,” \nSolid State Communications, vol. 151, pp. 557-560, 2011.  \n[25] Y. Mizuguchi, F. Tomioka, S. Tsuda, T. Yamaguchi and Y. Takano , “Substitution Effects on FeSe \nSuperconductor,” J. Phys. Soc. Jpn. , vol. 78, p. 074712, 2009.  \n[26] Q. Ma, Q. Gao, W.Shan, X. Li, H. Li, Z. Ma, “The superconductivity and transport properties in \nFeTe with S addition,” Vacuum, vol. 195, p. 110661, 2022.  \n[27] A. I. Coldea, “Electronic Nematic States Tuned by Isoelectronic Substitution in Bulk FeSe1−xSx,” \nFront. Phys., vol. 8, p. 594500, 2021.  \n\n\n12 \n \n[28] R. Viennois, E. Giannini, D. van der Marel, R. ˇCerný , “Effect of Fe excess on structural, \nmagnetic and superconducting properties of single-crystalline Fe1+xTe1−ySey,” Journal of Solid \nState Chemistry, vol. 183, pp. 769-775, 2010.  \n[29] B. C. Sales, A. S. Sefat, M. A. McGuire, R. Y. Jin, and D. Mandrus, Y. Mozharivskyj, “Bulk \nsuperconductivity at 14 K in single crystals of Fe1+\u0003Te\u0001Se1−\u0001,” Phys. Rev. B. , vol. 79, p. 094521, \n2009.  \n[30] S. Medvedev, T. M. Mcqueen, I. A. Troyan, T. Palasyuk, M. I. Eremets, R. J. Cava, S. Naghavi, \nF. Casper, V. Ksenofontov, G. Wortmann and C. Felser, “Electronic and magnetic phase diagram \nof β-Fe1.01Se with superconductivity at 36.7 K under pressure,” Nature Mater, vol. 8 , pp. 630-\n633, 2009 .  \n[31] M. Manasa, M. Azam, T. Zajarniuk, R. Diduszko, T. Cetner, A. Morawski, A. Wiśniewski, & S. \nJ. Singh, “Cometal Addition Effect on Superconducting Properties and Granular Behaviours of \nPolycrystalline FeSe0.5Te0.5,” Materials, vol. 16, p. 2892, 2023.  \n[32] M. Azam, M. Manasa, T. Zajarniuk, R. Diduszko, T. Cetner, A. Morawski, J. Więckowski, A. \nWiśniewski, S. J. Singh, “High-Pressure Synthesis and the Enhancement of the Superconducting \nProperties of FeSe0.5Te0.5,” Materials, vol. 16, p. 5358, 2023.  \n[33] Sudesh, S. Rani, G.D. Varma, “Effect of Sb and Si doping on the superconducting properties of \nFeSe0.9,” Physica C, vol. 485, p. 137–144, 2013.  \n[34] S. Pandya, S. Sherif, L. S. S. Chandra and V. Ganesan, “Magneto-transport studies of FeSe0.9− xMx\n(M = Si, Sb),” Supercond. Sci. Technol. , vol. 24 , p. 045011, 2011.  \n[35] J. Ge, S. Cao, S. Shen, S. Yuan, B. Kang, J. Zhang, “The transport properties in antimony doped \niron selenide Fe(Se1-xSbx)0.92 system,” Cryogenics, vol. 51, pp. 253–256, , 2011.  \n[36] P. P. Singh, “ Effects of disorder in FeSe: an ab initio study,” J. Phys.: Condens. Matter , vol. 22, \np. 135501 , 2010.  \n[37] M. -K. Wu, M. -J. Wang and K. -W. Yeh, “Recent advances in β-FeSe1−x and related \nsuperconductors,” Science and Technology of Advanced Materials, vol. 14, p. 014402, 20133.  \n \n \n \n \n \n \n \n\n\n13 \n \nFigure 1: Powder X-ray diffraction patterns (XRD) at room temperature for the prepared \nsamples FeSe1-xAsx at ambient pressure with x = 0.01, 0.05, 0.1, and 0.2. FeAs, hexagonal \n(Fe7Se8) and Pt phases are observed as the impurity phases. The Pt impurity phase is observed \nfrom the XRD sample holder.   \n \n \n \n \n \n \n\n\n14 \n \nFigure 2: Elemental mapping for the constituent elements of FeSe1-xAsx polycrystalline \nsamples: (a)-(e) x = 0.005; (f)-(j) x = 0.05; and (k)-(o) x = 0.2. For each sample, the first image \ndepicts a Scanning Electron Microscope (SEM) image, and the last image represents the \ncombined image of Fe, Se and As-elements. The rest of the images are the elemental mapping \nof the individual elements.  \n \n \n \n \n \n \n\n\n15 \n \nFigure 3: Backscattered electron image (BSE; AsB) of the samples with (a–c) x = 0.005, (d–\nf) x = 0.05 and (g–i) x = 0.2 samples. Bright, light grey, and black contrasts correspond to \nFe7Se8 (hexagonal phase), FeSe1-xAsx, and pores, respectively. The black contrast may indicate \nthe presence of the FeAs phase in certain locations.   \n \n \n \n \n \n \n \n \n \n \n\n\n16 \n \nFigure 4: (a) The variation of resistivity with temperature for all the samples up to the room \ntemperature (300 K). (b) The variation of low-temperature resistivity with temperature ranges \nfrom 7 to 20 K. The insets of these figures (a) and (b) illustrate the resistivity variation for the \ndoping content x = 0.1. \n \n \n \n \n \n \n \n \n \n \n \n\n\n17 \n \nFigure 5: The temperature dependence of the normalized magnetic moment (M / M5K) with an \napplied magnetic field of 50 Oe for FeSe1-xAsx with x = 0.05 and x = 0.2 in zero-field cooling \n(ZFC) and field cooling (FC) modes. The inset figure shows the variation of the normalized \nmagnetic moment for the sample x = 0.05. \n \n \n \n \n\n\n18 \n \n \nFigure 6: The variation of (a) room temperature resistivity (ρ300K) and (b) the onset critical \ntemperature Tconset from the resistivity measurements with As-doping content (x). \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21124v1.pdf",
    "total_pages": 18,
    "title": "Synthesis and characterizations of arsenic doped FeSe bulks",
    "authors": [
      "Priya Singh",
      "Manasa Manasa",
      "Mohammad Azam",
      "Tatiana Zajarniuk",
      "Konrad Kwatek",
      "Tomasz Cetner",
      "Andrzej Morawski",
      "Jan Mizeracki",
      "Shiv J. Singh"
    ],
    "abstract": "FeSe(11) family has a simple crystal structure belonging to iron-based\nsuperconductors (FBS) and has many stable phases including hexagonal and\ntetragonal structures, but only the tetragonal phase exhibits the\nsuperconductivity. In this study, we have investigated the effects of chemical\npressure induced by As-doping at Se-sites in the FeSe system by preparing a\nseries of FeSe1-xAsx (x = 0.005, 0.01, 0.02, 0.05, 0.1, and 0.2) bulks. A broad\ncharacterization has been performed on these samples using structural,\nmicrostructural, transport, and magnetic measurements. The obtained lattice\nparameters are increased by As-doping, which suggests the successful insertion\nof As at Se-sites into the tetragonal lattice for low doping contents up to 5%,\nwhereas the higher As-substitution appears in the form of the FeAs impurity\nphase. The temperature dependence of the resistivity of all samples has similar\nbehaviour and depicts the highest onset transition temperature of around 11.5\nK, but the zero resistivity is not reached until the measured temperature of 7\nK, which could be due to the presence of the impurity phases. Our study\nsuggests that a dopant with a large ionic radius, i.e., Arsenic, promotes the\nformation of the hexagonal phase of the 11 family and is effective for a small\namount of doping level for the superconducting properties, whereas higher\nAs-doping levels reduce the superconducting properties.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}