{
  "id": "arxiv_2502.21215v1",
  "text": "arXiv:2502.21215v1  [physics.flu-dyn]  28 Feb 2025\narXiv manuscript No.\n(will be inserted by the editor)\nAn analytical solution for horizontal velocity proﬁles\nin the hurricane boundary layer\nK. R. Sathia · M. G. Giometto†\nReceived: DD Month YEAR / Accepted: DD Month YEAR\nAbstract\nTheoretical analyses of the hurricane boundary layer have traditionally relied on\nslab models, which provide a limited description of wind proﬁles. Literature on\nheight-resolving methods is typically based on linear analyses, which may fall\nshort of capturing the full sensitivity of the solution to variations in input pa-\nrameters. This work proposes an approximate analytical solution of a nonlinear\nsingle-column model for horizontal winds that uses a constant eddy viscosity and\nis valid outside the eyewall. Building on literature that uses a linearized system\nof equations, we use a series expansion to account for the nonlinearities. We ﬁnd\nthat a ﬁrst-order correction is suﬃcient for most practical cases. This solution\nhelps provide a simpliﬁed understanding of the sensitivity of the radial and tan-\ngential wind proﬁles to input parameters such as the distance from the hurricane\neye and the Coriolis force.\nKeywords Analytical modeling · Nonlinear equations · Series solution · Single\nColumn Model\n1 Introduction\nThe vertical structure of mean wind in hurricane boundary layers (HBLs) is of rele-\nvance for a wide range of engineering applications, including hurricane forecasting,\ndamage modeling, and risk assessment for coastal infrastructure.\nPractical diﬃculties in obtaining wind speed and ﬂux measurements in the\nHBL have traditionally limited the amount of available observational data. Ad-\nvances over the past two decades in observational capabilities (Cione et al., 2020)\nK. R. Sathia\nDepartment of Civil Engineering and Engineering Mechanics, Columbia University, New York,\nNY, USA\nE-mail: krs2199@columbia.edu\n† M. G. Giometto\nDepartment of Civil Engineering and Engineering Mechanics, Columbia University, New York,\nNY, USA\nE-mail: mg3929@columbia.edu\n\n\n2\nK. R. Sathia and M. G. Giometto\nhave provided signiﬁcant insight into HBL processes and informed the develop-\nment of empirical wind proﬁles such as those presented in Vickery et al. (2009),\nwhich have proved useful for operational use. Additionally, recent developments in\nturbulence-resolving HBL simulations (e.g., Bryan et al., 2017a,b; Worsnop et al.,\n2017; Momen et al., 2021; Chen et al., 2021; Ma and Sun, 2021), have opened the\ndoors for a more mechanistic understanding of HBL dynamics.\nSimpliﬁed theoretical analyses are also being explored that build on these ad-\nvancements and enhance our understanding of the wind variation seen in numerical\nand observational studies. Theoretical analyses of the HBL are typically performed\nusing slab models (Kepert, 2010; Smith and Montgomery, 2023) which average out\nor prescribe the vertical dynamical structure. Height-resolving analyses, with a fo-\ncus on the velocity proﬁles, gained traction towards the last quarter of the 20th cen-\ntury (Rosenthal, 1962; Smith, 1968; Eliassen and Lystad, 1977; Meng et al., 1995).\nA summary of these contributions is presented in a recent review by Chang et al.\n(2024).\nAn inﬂuential paper by Kepert (2001) incorporated much of the work in these\nprevious studies and established the system of linear equations used in height-\nresolving models. These equations are the radial and tangential momentum bal-\nance that use the gradient wind balance to model the radial pressure gradient,\nand neglect second and higher order products of velocities. In the limit of large\nradial distance from the storm center, the solution to these equations converges to\nthe classic Ekman layer solution. More recent publications built on this work to\ninclude vertically varying eddy viscosity (Vickery et al., 2009), non-axisymmetric\ngradient wind (Snaiki and Wu, 2017a) and the vertical advection in the eyewall\n(Yang et al., 2021). These works have provided insight into the vertical structure\nof the mean wind in the HBL but are based on a linearized formulation of the\nproblem. While there is some literature that discusses the drawbacks of neglecting\nnonlinearities (Kepert and Wang, 2001; Foster, 2009; Vogl and Smith, 2009), these\nanalyses have relied on a numerical approach to solve the diﬀerential equations.\nThere remains a need for an analytical formula for the variation of mean speed\nthat is backed by nonlinear theory, matches realistic hurricane wind proﬁles, and is\nsuﬃciently simple for use in engineering practice. Such a solution would also help\nelucidate dependencies between ﬂow features and make these easier to interpret\nconceptually.\nThis work proposes an analytical solution of the nonlinear HBL equations valid\noutside the eyewall, using a single column model with constant eddy-viscosity.\nBuilding on Kepert (2001), which analyses the linearised version of the same model,\nwe use a series expansion to account for the nonlinearities. We ﬁrst discuss the\ngoverning equations, boundary conditions and the physical validity of the solutions\nto these equations in Sect. 2 and 3. This is followed by the description of the series\nsolution, of the nonlinear eﬀects and a comparison against the numerical solution\nin Sect. 4. The analytical solution allows for a simple analysis of sensitivity to the\nvarious parameters. This is explored in Sect. 5. A simpler alternative solution for\nthe velocity magnitude is proposed in Sect. 6, which is informed by the analysis\nin Sect. 4 and 5. Conclusions are drawn in Sect. 7.\n\n\nAnalytical solution for the HBL velocity proﬁles\n3\n2 Governing Equations and Non-Dimensionalization\nThe governing equations for the mean velocity proﬁles in the stationary and ax-\nisymmetric HBL far from the eyewall are\nd\ndz\n\u0012\nK dur\ndz\n\u0013\n=\n\u0012V 2\ng\nR + fVg\n\u0013\n−u2\nθ\nR −u2\nr\nR −fuθ ,\n(1)\nd\ndz\n\u0012\nK duθ\ndz\n\u0013\n= uruθ\nR\n+ fur −nur Vg\nR ,\n(2)\nwhere ur is the radial velocity, uθ is the tangential velocity, Vg is the gradient\nwind speed, f is the Coriolis frequency, R is the radial distance from the axis of\nrotation, n is the non-dimensional radial derivative of gradient wind and K is the\nsum of the molecular and turbulent viscosities, which we treat in this analysis to\nbe constant. A detailed derivation is provided in Appendix 9.1. We have used the\nmodelling choices ∂ur/∂r = −ur/R and ∂uθ/∂r = −nVg/R which restrict the\nequations to the region outside the eyewall.\nWe start by considering a constant gradient wind Vg = G. A linearly varying\ngradient wind is considered in Appendix 9.3. For a constant gradient wind, (1)\nand (2) is solved with the boundary conditions\nur(0) = ur(∞) = uθ(0) = 0 ,\nuθ(∞) = G .\n(3)\nConsider the coordinate transformation ˆu = ur and ˆv = uθ−G. Next, introduce\nnon-dimensional height ξ = z/H and non-dimensional velocity variables u = ˆu/G\nand v = ˆv/G. A depth scale similar to the Ekman layer depth H =\np\n2K/I can\nbe constructed to normalize z, where,\nI =\ns\u0012\nf + 2G\nR\n\u0013 \u0012\nf + (1 −n)G\nR\n\u0013\n(4)\nis the inertial stability, as deﬁned in Kepert (2001). Substituting the transforma-\ntions into (1) and (2), one obtains\nd2u\ndξ2 = H2G\nKR\n\u0014\n−\n\u0012 1\nRo + 2\n\u0013\nv −(u2 + v2)\n\u0015\n,\n(5)\nd2v\ndξ2 = H2G\nKR\n\u0014\u0012 1\nRo + (1 −n)\n\u0013\nu + uv\n\u0015\n,\n(6)\nwhere Ro = G/(fR) is a Rossby number based on the gradient wind speed G\nand the radial distance R at which the velocity proﬁles are to be determined.\nSubstituting for H, the equations become\nd2u\ndξ2 = −˜αv −˜γ(u2 + v2) ,\n(7)\nd2v\ndξ2 = ˜βu + ˜γuv ,\n(8)\n\n\n4\nK. R. Sathia and M. G. Giometto\nn\n˜α\n˜β\n˜γ\nCase 1\n0.30\n3.37\n1.19\n1.67\nCase 2\n0.45\n3.79\n1.06\n1.89\nCase 3\n0.60\n4.43\n0.90\n2.20\nTable 1: Three cases analysing the eﬀect of n (with Ro = 100).\nwhere\n˜α = 2\ns\n\u0000 1\nRo + 2\n\u0001\n\u0000 1\nRo + (1 −n)\n\u0001 ,\n˜β = 2\ns\u0000 1\nRo + (1 −n)\n\u0001\n\u0000 1\nRo + 2\n\u0001\n,\n˜γ =\n2\nq\u0000 1\nRo + 2\n\u0001 \u0000 1\nRo + (1 −n)\n\u0001 .\n(9)\nNote that {˜α, ˜β, ˜γ} = 2H2{α, β, γ} where α, β and γ are deﬁned in Equation 8 of\nKepert (2001).\nNormalized boundary conditions for (7) and (8) are\nu(0) = u(∞) = v(∞) = 0 ,\nv(0) = −1 .\n(10)\nWe emphasize here that the non-dimensional problem depends only on two\nparameters, namely n and the non-dimensional Coriolis frequency 1/Ro.\n3 Physical validity of governing equation\nHurricanes occur in the Northern Hemisphere roughly in the latitudes 8◦N to\n40◦N and with gradient wind speeds from about 20 to 80 m/s. “Outside the\neyewall” could be considered to be R ∈[20,200] km. These values correspond to\nRo ∈[1, 200]. The only other parameter in the non-dimensional equations is n.\nFrom Table 2 of Mallen et al. (2005), n ∈[0.04,0.67].\nConsider three cases of n, as tabulated in Table 1. Equations (7) and (8) with\nboundary conditions (10) are solved over a ﬁnite but suﬃciently large domain\nnumerically for cases 1 and 3 and are shown in Fig. 2.\nWe expect velocity proﬁles to resemble those of the classical Ekman layer\nsolution. u should feature a jet with negative peak velocity near the surface and\ndecay further aloft; 1 + v should be positive and be characterized by an elevated\nmaximum and asymptote to a value of 1 aloft to match the gradient wind.\nWe see that the expected behaviour is followed in Case 1 but not Case 3. For\nCase 3, 1 + v does not tend to 1 aloft. The stable numerical solution for 1 + v\nappears like a mirror image about 0 of what we would have expected based on the\nEkman layer solution.\nWe ﬁnd that there is a switch in the stable numerical solution from a form\nsimilar to Case 1 (Fig. 1,a) where v has a positive slope near the ground, to that\nseen in Case 3 (Fig. 1,b) where v has a negative slope near the ground. Through\nsome trial and error, we ﬁnd that this switch occurs at n ≈0.5, with a mild\nsensitivity to Ro. (Note that a Neumann boundary condition du/dξ = dv/dξ = 0\n\n\nAnalytical solution for the HBL velocity proﬁles\n5\n-0.5\n0\n0.5\n1\n0\n1\n2\n3\n4\n5\n6\n7\nCase 1\nu\n1+v\n(a)\n-1\n-0.8\n-0.6\n-0.4\n-0.2\n0\n0\n1\n2\n3\n4\n5\n6\n7\nCase 3\nu\n1+v\n(b)\nFig. 1: Numerical solution for Cases 1 and 3 of Table 1.\nis used for Case 3. Using a Dirichlet condition instead would have caused a sharp\nchange in v aloft to match the boundary condition.) The eﬀect on the proﬁles\nupon changing Ro is minimal (not shown).\nTo analyse possible solutions to (7) and (8) aloft, we set d2u/dξ2 = d2v/dξ2 =\n0 (the eﬀects of curvature in the velocity proﬁles should only be present close to\nthe ground). We get two algebraic equations\nu2 + v2 +\n\u0012\n2 + 1\nRo\n\u0013\nv = 0 ,\nuv + u\n\u0012\n(1 −n) + 1\nRo\n\u0013\n= 0 .\n(11)\nThere are four solutions to this system of algebraic equations, which are\nu = 0, v = 0 ,\nu = 0, v = −\n\u0012\n2 + 1\nRo\n\u0013\n,\nu = ±\ns\u0012\n(1 −n) + 1\nRo\n\u0013\n(1 + n), v = −\n\u0012\n(1 −n) + 1\nRo\n\u0013\n.\n(12)\nIn Fig. 1(b), we see that the u →0 and (1 + v) →−(1 + 1/Ro). This is consistent\nwith a possible solution in (12), and therefore appears to be a mathematically\nvalid tendency. But this is clearly not physical, since the velocity should approach\nthat of the gradient wind aloft.\nOne simple reason for this switch could be the increasing dominance of the\nnonlinear terms as n becomes larger. This is seen clearly from (5) and (6). For\neven a moderately large Ro (say, Ro > 10), the eﬀect of 1/Ro can be neglected.\nFocusing on n, we see that as n becomes larger, the coeﬃcient attached to u in\n(6) is much smaller than that attached to uv, and hence the nonlinear behaviour\ndominates the linear.\nDetails of the numerical solver are given in Appendix 9.2 and a qualitative\nmechanism for this ﬂip is described. Additionally, in Appendix 9.2, we plot velocity\nproﬁles with a vertically varying eddy viscosity (Fig. 10,a). Even with the variable\neddy viscosity, the switch of solution behaviour is seen. However, the n at which\n\n\n6\nK. R. Sathia and M. G. Giometto\nthis switch occurs appears to be pushed to a higher value (n ≈0.67 for the chosen\neddy viscosity proﬁle).\nMeng et al. (1995), Kepert (2001) and other subsequent work (Snaiki and Wu,\n2017b; Fang et al., 2018; Yang et al., 2021) consider a slip condition instead at the\nbottom boundary. The switch in solution behaviour for large n is observed with\nthis boundary condition as well. For example, using C = 0.002 and K = 50 m2s−1\nas in Kepert (2001), the switch is observed at n ≈0.69 (Fig. 10,b). Raising C to\na larger value, such as 0.02, causes the switch to occur at a lower n ≈0.55.\nThe observed behaviour limits the physical validity of the governing equations\nand suggests that care must be taken when using large values of n to ensure that\nthe solution to the equations retains physical tendencies.\n4 Approximate analytical solution\nAcknowledging the above limitations of the governing equations, we constrain the\nstudy in this section to n ∈[0, 0.45]. Increases in the parameters Ro and n make the\nsolution increasingly dependent on the nonlinear terms. In all the cases considered,\nthe coeﬃcient attached to the nonlinear terms are of the same order of magnitude\nas those of the linear terms, and therefore nonlinear terms cannot be neglected.\nWe follow Lyapunov’s artiﬁcial small parameter method (Nayfeh, 2008). At-\ntaching an artiﬁcial small parameter δ to the nonlinear terms, the equations are\nd2u\ndξ2 = −˜αv −δ˜γ(u2 + v2) ,\n(13)\nd2v\ndξ2 = ˜βu + δ˜γuv .\n(14)\nConsider a series expansion of the form\nu(ξ) = u0(ξ) + δu1(ξ) + δ2u2(ξ) + · · · ,\n(15)\nv(ξ) = v0(ξ) + δv1(ξ) + δ2v2(ξ) + · · · .\n(16)\nSubstituting the series and collecting orders of δ, we obtain the following systems\nof equations at the ﬁrst few orders. The leading order equations read\n∂2u0\n∂ξ2 = −˜αv0 ,\n(17)\n∂2v0\n∂ξ2 = ˜βu0 ,\n(18)\nwith boundary conditions u0(0) = u0(∞) = v0(∞) = 0, v0(0) = −1. Similarly, the\nﬁrst order correction reads\n∂2u1\n∂ξ2 = −˜αv1 −˜γ(u2\n0 + v2\n0) ,\n(19)\n∂2v1\n∂ξ2 = ˜βu1 + ˜γ(u0v0) ,\n(20)\n\n\nAnalytical solution for the HBL velocity proﬁles\n7\nwith boundary conditions u1(0) = u1(∞) = v1(0) = v1(∞) = 0. The second order\ncorrection is\n∂2u2\n∂ξ2 = −˜αv2 −˜γ(2u0u1 + 2v0v1) ,\n(21)\n∂2v2\n∂ξ2 = ˜βu2 + ˜γ(u0v1 + u1v0) ,\n(22)\nwith the same boundary conditions as for the ﬁrst order problem.\nNote that we have used the no-slip boundary condition instead of a slip con-\ndition. This choice is made to come up with a suﬃciently simple form of the\nsolution including nonlinear eﬀects that can represent the various trends seen in\nmore complicated analyses. Future versions of this analysis that include a varying\neddy viscosity or a higher ﬁdelity boundary condition would likely match realistic\nvelocity proﬁles even more closely.\nThe solution to the equations at the leading order is simply that of the Ekman\nlayer, namely\nu0 = −˜α\n2 e−ξ sin(ξ) ,\n(23)\nv0 = −e−ξ cos(ξ) .\n(24)\nTo obtain the ﬁrst-order correction, substitute for u0 and v0 from Eqns. (23) and\n(24) into (20) and (19), and then substitute u1 from (20) in (19). The resulting\nequation can be solved by considering an ansatz which is a linear combination of\nterms in the following product of sets\nn\n1, e−ξ, e−2ξo\n× {1, cos(ξ), sin(ξ), cos(2ξ), sin(2ξ)} .\n(25)\nSubstituting the ansatz, comparing terms and solving for the coeﬃcients, we obtain\nu1(ξ) = ˜γ\n10\n\u0012 ˜α2\n4 + 1\n\u0013\ne−ξ cos(ξ) + ˜γ\n30e−ξ sin(ξ)\n−˜γ\n10\n\u0012 ˜α2\n4 + 1\n\u0013\ne−2ξ + ˜γ\n30\n\u0012\n−3\n8 ˜α2 + 2\n\u0013\ne−2ξ sin(2ξ) ,\n(26)\nv1(ξ) =\n˜γ\n15˜αe−ξ cos(ξ) −˜γ\n5˜α\n\u0012 ˜α2\n4 + 1\n\u0013\ne−ξ sin(ξ)\n−˜γ\n10˜α\n\u0012 ˜α2\n4 + 1\n\u0013\ne−2ξ +\n˜γ\n30˜α\n\u00123˜α2\n4\n+ 1\n\u0013\ne−2ξ cos(2ξ) .\n(27)\nThe solutions beyond the ﬁrst order become increasingly unwieldy and diﬃcult\nto interpret conceptually. Further, as elaborated below, the ﬁrst-order solution\nalready represents a noticeable enhancement in accuracy compared to the lin-\near leading-order solution, and is also suﬃciently close to the numerical solution.\nThis work will therefore focus primarily on the ﬁrst-order solution. Appendix 9.4\npresents the second order correction for the interested reader.\nNoting that the gradient wind vector is seldom constant with height in the\nHBL, Appendix 9.3 generalizes the above solution to linearly decreasing gradient\nwinds.\n\n\n8\nK. R. Sathia and M. G. Giometto\n4.1 Comparison with numerical solution\nLeading and ﬁrst order solutions are contrasted against the numerical solution\nin Fig. 2 for cases 1 and 2 of Table 1. Case 1 has a small n = 0.3 that falls\nwell within the solution’s region of validity. Based on the ﬁgure, it is apparent\nthat a ﬁrst-order correction is suﬃcient to closely match the numerical solution.\nThe corrections modulate the inﬂow, yielding slightly more diﬀused inﬂow and\ntangential velocity proﬁles. Case 2 is characterized by a relatively larger n = 0.45,\nwhich is close to the bordering n ≈0.5 beyond which the switch in stable solution\nwas observed (§ 3). The solution features a slower convergence rate, requiring\na larger number of terms to obtain an adequate approximation. However, these\nhigher order solutions are required only when n becomes quite close to (say, within\n0.05 of) the critical value, and a ﬁrst order solution remains suﬃcient for smaller\nn. For n ⪆0.5, the analytical solution diverges.\n-0.5\n0\n0.5\n1\n0\n1\n2\n3\n4\n5\n6\n7\nCase 1\nNumerical\nOrder 1\nOrder 0\n(a)\n-0.5\n0\n0.5\n1\n0\n1\n2\n3\n4\n5\n6\n7\nCase 2\nNumerical\nOrder 1\nOrder 0\n(b)\nFig. 2: Analytical and numerical solution for cases 1 and 2 of Table 1.\nThe correction term v1 is negative near the ground (upto ξ ≈3) and u1 has\nan S-like shape where it is positive at the ground and negative above. Both the u1\nand v1 terms thus have a tendency to reduce the magnitudes of the peak radial\nand tangential velocities respectively.\nThe role of the corrections in moderating the gradient of the velocity near\nthe ground is also interesting. The derivative of v1 is negative upto ξ ≈1, and\nthus decreases the slope of tangential velocity at the ground. As n increases, the\nstrength of this reduction in the slope of v0 by v1 also increases. This may be\nconnected to the switch in solution behaviour, and is elaborated in Appendix 9.2.\nOverall, the proposed corrections oﬀer improvements to the linear (leading-order)\nsolution and additional insight into the nonlinear eﬀects.\n5 Sensitivity Analysis\nTo characterize the role of the input parameters, we analyse here the sensitivity\nof the normalized solutions to their variations. A discussion on sensitivities is also\npresented for the solutions in the more intuitive dimensional form.\n\n\nAnalytical solution for the HBL velocity proﬁles\n9\n-0.5\n0\n0.5\n1\n0\n1\n2\n3\n4\n5\n6\n7\nRo = 1\nRo = 10\nRo = 100\n(a)\n-0.5\n0\n0.5\n1\n0\n1\n2\n3\n4\n5\n6\n7\nn = 0\nn = 0.15\nn = 0.3\nn = 0.45\n(b)\nFig. 3: Sensitivity of the ﬁrst order accurate solutions in normalized form to Ro\nand n.\nG\n40 m s-1\nn\n0.25\nK\n50 m2s-1\nR\n50 km\nf\n5 × 10−5 s-1\nGz\n0 s-1\nTable 2: Dimensional values of parameters used to plot Figures 4 to 6.\nFigure 3(a) shows the sensitivity to Ro for n = 0.3. For a given latitude, a small\nRo means either that G is small or that R is large. Thus, small Ro is not a very\ninteresting case. When Ro becomes large, we expect the eﬀect of the latitude to be\nnegligibly small. Wind proﬁles should get closer to each other as Ro increases. This\nis reﬂected in Fig. 3(a), with the curve for Ro = 10 appearing almost superimposed\non the curve for Ro = 100. Figure 3(b) plots the sensitivity to n for Ro = 100. As\nn increases, so does the strength of the inﬂow. The sensitivity to n for 1 + v is,\nhowever, far less pronounced than for u.\nSensitivities of the solutions in dimensional form are discussed next. Solutions\nare dimensionalized based on parameter values listed in Table 2, with the exception\nof the parameter that is being varied.\nFigure 4(a) shows the sensitivity to G.\nAs is expected, G has a strong impact on the shape and magnitude of the velocity\ncomponents. As G increases, the uθ proﬁles feature a strengthened jet with a more\npronounced nose moving closer to the surface. A similar behavior characterizes the\nur proﬁle. The sensitivity to variations in n is shown in Fig. 4(b). As was seen\nin the non-dimensional analysis in Fig.3(b), despite its importance in determining\nthe convergence of the analytical solution, this parameter only modulates the ur\nproﬁle with a modest impact on uθ. The sensitivity to K is shown in Fig. 5(a). As\nK increases, there is increased mixing, causing the jet to become wider. With larger\nK, the peak of this more diﬀuse jet also tends to become higher. The role of K here\nis similar to that in the Ekman layer. The eﬀect of increasing R (Fig. 5,b) is quite\nsimilar to that of increasing K. As R increases, the jet becomes less pronounced\nand thicker, and its elevation above the surface level increases. This is consistent\nwith the intuition that as we move farther away from the eye of the hurricane, the\neﬀect of the centrifugal force term in the gradient wind forcing becomes smaller,\n\n\n10\nK. R. Sathia and M. G. Giometto\n-40\n-20\n0\n20\n40\n60\n80\n0\n500\n1000\n1500\n2000\nG = 30 ms-1\nG = 45 ms-1\nG = 60 ms-1\nG = 75 ms-1\n(a)\n-20\n-10\n0\n10\n20\n30\n40\n0\n500\n1000\n1500\n2000\nn = 0\nn = 0.15\nn = 0.3\nn = 0.45\n(b)\nFig. 4: Sensitivity of the ﬁrst order accurate solution in dimensional form to G\nand n. z is in metres and the velocity components in metres per second.\nand the wind proﬁle tends to that due to a geostrophic forcing. The mild decrease\nin the peak magnitudes of ur and uθ with increasing R is due to the change in Ro\nand this eﬀect is negligible as seen in the ﬁgure.\n-20\n-10\n0\n10\n20\n30\n40\n0\n500\n1000\n1500\n2000\nK = 25 m2s-1\nK = 50 m2s-1\nK = 75 m2s-1\nK = 100 m2s-1\n(a)\n-20\n-10\n0\n10\n20\n30\n40\n0\n500\n1000\n1500\n2000\nR = 25 km\nR = 50 km\nR = 100 km\nR = 200 km\n(b)\nFig. 5: Sensitivity to K and R.\nThese sensitivities can be further analysed quantitatively using the analytical\nsolution. For example, we examine the peak magnitude and height of the inﬂow and\nuse the leading order solution for the radial velocity for simplicity. Diﬀerentiating\n23 and setting to zero, one obtains ξpeak\nur\n= π/4, corresponding to\nzpeak\nur\n= 1.11\nr\nKR\nG\n\u0012\u0012 1\nRo + 2\n\u0013 \u0012 1\nRo + (1 −n)\n\u0013\u0013−0.25\n≈0.93\ns\nKR\nG√1 −n .\n(28)\nwhere in the last step we have use 1/Ro ≈0. From this formula we see that, to\nthe leading order, R and K have the same eﬀect on the height of the inﬂow peak.\nThis was also observed in the two parts of Fig. 5. From the formula, as G and n\n\n\nAnalytical solution for the HBL velocity proﬁles\n11\nincrease, the height of the peak decreases, which is also seen in Fig. 4. Substituting\nin 23, the magnitude of peak inﬂow is\nupeak\nr\n= 0.32G\ns\n1\nRo + 2\n1\nRo + (1 −n) ≈0.46\nG\n√1 −n .\n(29)\nThis formula shows that as n increases, the magnitude of peak inﬂow increases.\nThis is seen in Fig. 4(b). Figure 6(a) shows the sensitivity to f. Coriolis frequency\nhas a small impact for this radius, since the centrifugal term dominates the Coriolis\nterm. The impact of f is slightly more visible for a larger radius of, say R = 200 km\n(not shown). But for cases of interest, i.e., for small R and large G, the eﬀect due\nto f is negligible.\nThe sensitivity to variations in Gz is shown in Fig. 6(b). As apparent, this\nparameter mainly aﬀects the slope of uθ away from the surface, with minimal\nimpact on the ur proﬁles.\n-20\n-10\n0\n10\n20\n30\n40\n0\n500\n1000\n1500\n2000\nf = 2.5\n10-5 s-1\nf = 5\n10-5 s-1\nf = 7.5\n10-5 s-1\nf = 10\n10-5 s-1\n(a)\n-20\n-10\n0\n10\n20\n30\n40\n0\n500\n1000\n1500\n2000\nGz = -0.001 s-1\nGz = -0.002 s-1\nGz = -0.003 s-1\nGz = -0.004 s-1\n(b)\nFig. 6: Sensitivity to f and Gz.\nAlthough (30) was derived using the linear solution (23), we can extend this to\nthe nonlinear solution using the fact the solution is insensitive to Ro (see Fig. 3,a).\nNeglecting 1/Ro, the solution to (7) and (8) is only a function of ξ and n. For a\nﬁxed n, the non-dimensional peak is a constant value. In a dimensional setting,\nthis thus means that even the nonlinear solution features\nzpeak\nur\n, zpeak\nuθ\n∝\nr\nKR\nG f(n) .\n(30)\nIf we vary only G (or, alternatively, K or R) holding the other constants ﬁxed,\nthen height of the peak velocity values for the leading and ﬁrst order analytical\nand numerical solutions are simply multiples of each other. We demonstrate this\nin Fig. 7, where normalized variations of peak heights for a range of parameter\nsweeps are shown. Normalized peak heights are deﬁned as\nζui\nG = zpeak\nui\n(G, q0) −zpeak\nui\n(G0, q0)\nzpeak\nui\n(G0, q0)\n,\n(31)\n\n\n12\nK. R. Sathia and M. G. Giometto\nwhere ui denotes either ur or uθ, and q0 refers to the other dimensional parameters\nthat we hold ﬁxed. We see that the six curves overlap for variations in G, R and\nK. The overlap is weaker for larger G and R, due to the small eﬀect from Ro.\nThe above reasoning does not however hold for n, and this is conﬁrmed by\nFig.7(b) where no collapse is observed. We also note that the numerical solution\nshows a faster growth of peak height with n than the linear solution. The ﬁrst order\nanalytical solution is an improvement to the linear solution but fails to match the\nnumerical solution as n increases. The ﬁgure also shows that, for the numerical and\nﬁrst order solutions, the rate of growth of the peak height is higher for tangential\nvelocity than radial velocity. This is not captured by the linear solution, for which\nthe dashed curve overlaps the solid one.\n30\n40\n50\n60\n70\nG (ms-1)\n-0.35\n-0.3\n-0.25\n-0.2\n-0.15\n-0.1\n-0.05\n0\n(a)\n0\n0.1\n0.2\n0.3\n0.4\n0.5\nn\n0\n0.05\n0.1\n0.15\n0.2\n0.25\n0.3\n(b)\n20\n40\n60\n80\n100\nK (m2s-1)\n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\nNumerical u\nOrder 1 u\nOrder 0 u\nNumerical ur\nOrder 1 ur\nOrder 0 ur\n(c)\n40\n50\n60\n70\n80\n90\n100\nR (km)\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n(d)\nFig. 7: Normalized variations of peak heights for the tangential and radial veloc-\nities against variations of selected dimensional parameters.\n6 Velocity Magnitude\nFigure 8(a) plots the numerical solution for the velocity magnitude\np\nu2 + (1 + v)2,\nfor a range of representative Ro and n values. As apparent from the ﬁgure, the\nsolution is insensitive to both of these parameters. This is surprising, especially\nwhen considering the role of n in controlling the convergence of the analytical\nsolution.\n\n\nAnalytical solution for the HBL velocity proﬁles\n13\n0\n0.2\n0.4\n0.6\n0.8\n1\n0\n1\n2\n3\n4\n5\n6\n7\n(a)\n0\n10\n20\n30\n40\n50\n0\n500\n1000\n1500\n2000\n2500\n3000\nNumerical solution\nAnalytical solution\nCurve fit\n(b)\nFig. 8: Left: Numerical solution for the velocity magnitude in normalized form,\nfor various n and Ro. Figure also includes the analytical solution 32, 33 and the\ncurve ﬁt 34. Right: Numerical, analytical and curve ﬁt solutions in dimensional\nform. The curves from left to right are cases 1 to 4 of Table 3 respectively.\nIf one is interested only in the magnitude of velocity, then this ﬁnding presents\nan alternative strategy to obtain the velocity proﬁle for larger n. We had noted\nin Sect. 4 that for small n, the analytical solution with ﬁrst order correction is\nindistinguishable from the numerical solution. We can therefore consider the case\nwhen Ro →∞and n = 0 for the ﬁrst order analytical solution. In this limit,\nthe coeﬃcients are constant numerical values. Substituting 1/Ro = n = 0 in (23),\n(24), (26) and (27), we obtain\nu0 + u1 = −1.37e−ξ sin(ξ) + 0.42e−ξ cos(ξ)\n−0.42e−2ξ −0.05e−2ξ sin(2ξ) ,\n(32)\n1 + v0 + v1 = 1 −0.97e−ξ cos(ξ) −0.30e−ξ sin(ξ)\n−0.15e−2ξ + 0.12e−2ξ cos(2ξ) .\n(33)\nSince the coeﬃcients are just numerical values (and not functions of Ro or n),\nan even simpler strategy could be to perform a curve ﬁt. A simple ﬁt C(ξ) of the\nvelocity magnitude yields\nC(ξ) = 1 −0.88e−ξ cos(ξ) −0.28e−ξ sin(ξ)\n−0.13e−2ξ cos(2ξ) + 0.31e−2ξ sin(2ξ) .\n(34)\nFigure 8(a) also includes\np\n(u0 + u1) + (1 + v0 + v1)2 from (32) and (33), and the\ncurve ﬁt C(ξ) in (34). We see that both of these are quite close to the other four\ncurves. This solution can also be tested for robustness in a dimensional setting.\nWe consider four curves, with various values of the dimensional parameters listed\nin Table 3. The black symbols in Fig. 8(b) are obtained by solving the dimensional\nequations (1) and (2) numerically with boundary conditions (3). The purple curves\nlabelled “analytical” are\nG\nr\u0010\nu0\n\u0010 z\nH\n\u0011\n+ u1\n\u0010 z\nH\n\u0011\u00112\n+\n\u0010\n1 + v0\n\u0010 z\nH\n\u0011\n+ v1\n\u0010 z\nH\n\u0011\u00112\n,\n(35)\n\n\n14\nK. R. Sathia and M. G. Giometto\nG (m s-1)\nR (km)\nf (s-1)\nn\nK (m2 s-1)\nCase 1\n20\n50\n2.5 × 10−5\n0.1\n10\nCase 2\n30\n100\n5 × 10−5\n0.2\n20\nCase 3\n40\n150\n7.5 × 10−5\n0.3\n30\nCase 4\n50\n200\n10 × 10−5\n0.4\n40\nTable 3: Parameters used in the four curves of Fig. 8(b).\nwhere u0 + u1 are 1 + v0 + v1 are from (32) and (33). The green curves are\nGC(z/H) where C(ξ) is from (34). We see that curves from the analytical solution\nand the curve ﬁt are able to match the numerical solution very closely. The curve\nﬁt shows a slight deviation for larger n (see rightmost curve), but the analytical\nsolution superposes the numerical solution almost exactly. This proves further that\nthe simpler strategies derived in this section are robust alternatives to the series\nexpansion from Sect.4, when considering the velocity magnitude.\nUsing this new analytical solution, we can now obtain the depth and peak\nvalue of the velocity magnitude by diﬀerentiating\np\n(u0 + u1) + (1 + v0 + v1)2 and\nsetting to 0.\nξpeak = 2.56 =⇒zpeak = 3.62\nr\nKR\nG\n\u0012\u0012 1\nRo + 2\n\u0013 \u0012 1\nRo + (1 −n)\n\u0013\u0013−0.25\n.\n(36)\nFor large Rossby number, this simpliﬁes further to\nzpeak = 3.04\ns\nKR\nG√1 −n .\n(37)\nThe dependence of the height of the peak from 37 is also seen in Figs. 4 and 5. As\nK and R increase, the height of the peak tangential velocity increases. Whereas as\nG increases, the height of the peak decreases slightly. The sensitivity of the depth\nappears to be greater for K and R because they have a much broader range of\nphysical values than does G. The coeﬃcient 3.04 is larger than the coeﬃcient 0.93\nobtained earlier, indicating that the peak inﬂow occurs at a lower height than that\nof the velocity magnitude. This is consistent with the solution to the Ekman layer.\nSubstituting 37 in 35 gives us a maximum dimensional velocity magnitude of\n1.0528G. Notice that this value depends only on the gradient wind magnitude.\nThus, while the height at which the peak occurs is dependent on the viscosity,\nradius etc., the percentage supergradient predicted by this analysis, i.e. 5.28%, is\na constant. The existing literature largely focuses on the radius of maximum wind\n(RMW) within the eyewall, where much higher supergradient values are reported\n(e.g., Kepert and Wang, 2001). We emphasize that our analysis is constrained to\nthe region outside the eyewall. Despite this diﬀerent focus, the value we obtain,\n5.28%, still falls within the range of supergradient values reported in some of these\nstudies (e.g., Yang et al., 2021).\n\n\nAnalytical solution for the HBL velocity proﬁles\n15\n7 Summary and Conclusions\nThis work has presented approximate solutions to the nonlinear equations de-\nscribing the vertical structure of the horizontal velocity proﬁles in the HBL under\nconstant and linearly varying gradient wind. The formulation is based on a series-\nexpansion approach and it has been shown that including a ﬁrst-order correction\nto the linear leading order solution increases the accuracy of the model while re-\ntaining a relatively simple form. The solution has been compared against a linear\ncounterpart and a corresponding “exact” numerical solution across a range of re-\nalistic values of the input parameters in both normalized and dimensional form.\nVelocities were scaled with gradient wind speed G and vertical coordinate z was\nscaled with\np\n2K/I, following Kepert (2001). We found that\np\n2K/I remains a\nrobust choice of scaling for z even when accounting for the nonlinear terms in the\ngoverning equations, further corroborating ﬁndings from the numerical study of\nFoster (2009).\nIt was shown that nonlinear terms cause a switch in the stable solution from a\nphysical one, where uθ →G aloft, to a nonphysical one where uθ →−G (1 + 1/Ro).\nThus, care must be taken when prescribing n, so that the solution to the equa-\ntions retains physical tendencies. This also prompts a closer look at the modeling\nassumption ∂v/∂r ≈−nVg/R. A better approximation to this radial derivative\nas a function of z (for example, ∂v/∂r ≈−nv/R) instead of a constant or linear\nfunction throughout the height of the boundary layer could yield an approximation\nthat is closer to reality.\nFrom a wind proﬁles perspective, the non-dimensional ﬁrst order solution ex-\nhibits a reduced peak velocity magnitude and more elevated jets when compared\nto its leading-order counterpart. In normalized form, the parameter Ro was found\nto have a negligible impact on the velocity proﬁles. In dimensional form, the so-\nlution was found, as expected, to be sensitive to variations in G, R and K and\ninsensitive to variations in f. These were used to show that both the height of in-\nﬂow and tangential velocity peak in both the linear and nonlinear solutions follow\na\np\nKR/G dependence. The parameter n, along with its role in controlling the\nconvergence of the analytical solution, was found to primarily control the inﬂow\nproﬁle. It however does not have a signiﬁcant eﬀect on the tangential velocity and\nvelocity magnitude. Building on this lack of sensitivity to variations in Ro and\nn, a simple alternative expression was proposed to describe the velocity magni-\ntude proﬁle. This simpliﬁed expression provides insight into the dependence of the\njet height and magnitude on the various parameters and shows that the peak jet\nmagnitude is 5.28% supergradient.\nIn summary, the proposed series solution provides a nuanced yet still conceptu-\nally simple description of velocity proﬁles in the HBL and associated sensitivites,\naccounting for the impact of non-linear terms. Although valid only away from\nthe eyewall and under the assumption of constant eddy viscosity, this formulation\nserves as a foundation for developing operational models that capture the correct\nsensitivities of the hurricane boundary layer proﬁle.\n\n\n16\nK. R. Sathia and M. G. Giometto\n8 Acknowledgements\nThis research was funded by the National Institute of Standards and Technology\n(ror.org/05xpvk416) under Grant No. 70NANB22H057. A special thanks to Dr.\nJaeyoung Jung, Postdoctoral Scholar, Columbia University for his help with the\nnumerical ODE solver.\nReferences\nBryan GH, Dahl NA, Nolan DS, Rotunno R (2017a) An eddy injection method\nfor large-eddy simulations of tornado-like vortices. Monthly Weather Review\n145:1937–1961\nBryan GH, Worsnop RP, Lundquist JK, Zhang JA (2017b) A simple method for\nsimulating wind proﬁles in the boundary layer of tropical cyclones. Boundary-\nLayer Meteorology 162:475–502\nChang Y, Wang J, Li S, Chan P (2024) A comprehensive review on the modeling\nof tropical cyclone boundary layer wind ﬁeld. Physics of Fluids 36\nChen X, Bryan GH, Zhang JA, Cione JJ, Marks FD (2021) A framework for\nsimulating the tropical cyclone boundary layer using large-eddy simulation and\nits use in evaluating pbl parameterizations. Journal of the Atmospheric Sciences\n78:3559–3574\nCione JJ, Bryan GH, Dobosy R, Zhang JA, de Boer G, Aksoy A, Wadler JB, Kalina\nEA, Dahl BA, Ryan K, et al. (2020) Eye of the storm: Observing hurricanes\nwith a small unmanned aircraft system. Bulletin of the American Meteorological\nSociety 101:E186–E205\nEliassen A, Lystad M (1977) The ekman layer of a circular vortex-a numerical and\ntheoretical study. Geophysica Norvegica 31:1–16\nFang G, Zhao L, Cao S, Ge Y, Pang W (2018) A novel analytical model for\nwind ﬁeld simulation under typhoon boundary layer considering multi-ﬁeld cor-\nrelation and height-dependency. Journal of Wind Engineering and Industrial\nAerodynamics 175:77–89\nFoster RC (2009) Boundary-layer similarity under an axisymmetric, gradient wind\nvortex. Boundary-Layer Meteorology 131:321–344\nKepert J (2001) The dynamics of boundary layer jets within the tropical cyclone\ncore. part i: Linear theory. Journal of the Atmospheric Sciences 58:2469–2484\nKepert J (2010) Slab-and height-resolving models of the tropical cyclone bound-\nary layer. part i: Comparing the simulations. Quarterly Journal of the Royal\nMeteorological Society 136:1686–1699\nKepert J, Wang Y (2001) The dynamics of boundary layer jets within the trop-\nical cyclone core. part ii: Nonlinear enhancement. Journal of the Atmospheric\nSciences 58:2485–2501\nMa T, Sun C (2021) Large eddy simulation of hurricane boundary layer turbulence\nand its application for power transmission system. Journal of Wind Engineering\nand Industrial Aerodynamics 210:104,520\nMallen KJ, Montgomery MT, Wang B (2005) Reexamining the near-core radial\nstructure of the tropical cyclone primary circulation: Implications for vortex\nresiliency. Journal of the Atmospheric Sciences 62:408–425\n\n\nAnalytical solution for the HBL velocity proﬁles\n17\nMeng Y, Matsui M, Hibi K (1995) An analytical model for simulation of the wind\nﬁeld in a typhoon boundary layer. Journal of Wind Engineering and Industrial\nAerodynamics 56:291–310\nMomen M, Parlange MB, Giometto MG (2021) Scrambling and reorientation of\nclassical atmospheric boundary layer turbulence in hurricane winds. Geophysical\nResearch Letters 48:e2020GL091,695\nNayfeh AH (2008) Perturbation methods. John Wiley & Sons\nPowell MD, Vickery PJ, Reinhold TA (2003) Reduced drag coeﬃcient for high\nwind speeds in tropical cyclones. Nature 422:279–283\nRosenthal SL (1962) A theoretical analysis of the ﬁeld of motion in the hurricane\nboundary layer. National Hurricane Res Project Rep p 12\nSmith RK (1968) The surface boundary layer of a hurricane. Tellus 20:473–484\nSmith RK, Montgomery MT (2014) On the existence of the logarithmic surface\nlayer in the inner core of hurricanes. Quarterly Journal of the Royal Meteoro-\nlogical Society 140:72–81\nSmith RK, Montgomery MT (2023) Tropical cyclones: Observations and basic\nprocesses, vol 4. Elsevier\nSnaiki R, Wu T (2017a) A linear height-resolving wind ﬁeld model for tropical\ncyclone boundary layer. Journal of Wind Engineering and Industrial Aerody-\nnamics 171:248–260\nSnaiki R, Wu T (2017b) Modeling tropical cyclone boundary layer: Height-\nresolving pressure and wind ﬁelds. Journal of Wind Engineering and Industrial\nAerodynamics 170:18–27\nVickery PJ, Wadhera D, Powell MD, Chen Y (2009) A hurricane boundary layer\nand wind ﬁeld model for use in engineering applications. Journal of Applied\nMeteorology and Climatology 48:381–405\nVogl S, Smith RK (2009) Limitations of a linear model for the hurricane boundary\nlayer. Quarterly Journal of the Royal Meteorological Society 135:839–850\nWorsnop RP, Bryan GH, Lundquist JK, Zhang JA (2017) Using large-eddy simula-\ntions to deﬁne spectral and coherence characteristics of the hurricane boundary\nlayer for wind-energy applications. Boundary-Layer Meteorology 165:55–86\nYang J, Chen Y, Zhou H, Duan Z (2021) A height-resolving tropical cyclone bound-\nary layer model with vertical advection process. Natural Hazards 107:723–749\n9 Appendices\n9.1 Appendix 1: Governing Equations\nThe Navier Stokes equations in cylindrical coordinates, in a reference frame rotat-\ning with the Earth and moving with the hurricane are\n∂ur\n∂t + ur ∂ur\n∂r + uθ\nr\n∂ur\n∂θ + uz ∂ur\n∂z −u2\nθ\nr = −1\nρ\n∂P\n∂r + fuθ + Dνm,r ,\n(38)\n∂uθ\n∂t + ur ∂uθ\n∂r + uθ\nr\n∂uθ\n∂θ + uz ∂uθ\n∂z + uruθ\nr\n= −1\nrρ\n∂P\n∂θ −fur + Dνm,θ ,\n(39)\n∂uz\n∂t + ur ∂uz\n∂r + uθ\nr\n∂uz\n∂θ + uz ∂uz\n∂z = −1\nρ\n∂P\n∂z + Dνm,z\n(40)\n\n\n18\nK. R. Sathia and M. G. Giometto\nwhere the terms Dνm represent molecular diﬀusion.\nThe continuity equation in cylindrical coordinates is\n∂ur\n∂r + ur\nr + 1\nr\n∂uθ\n∂θ + ∂uz\n∂z = 0 .\n(41)\nMultiplying the continuity equation (41) by ur and adding to the radial momentum\nequation (38), by uθ and adding to (39), and by uz and adding to (40), we obtain\n∂ur\n∂t + ∂(urur)\n∂r\n+ 1\nr\n∂(uruθ)\n∂θ\n+ ∂(uruz)\n∂z\n+ u2\nr\nr = −1\nρ\n∂P\n∂r + u2\nθ\nr +fuθ +Dνm,r , (42)\n∂uθ\n∂t + ∂(uruθ)\n∂r\n+ 1\nr\n∂(uθuθ)\n∂θ\n+ ∂(uzuθ)\n∂z\n+ uruθ\nr\n= −1\nrρ\n∂P\n∂θ −uruθ\nr\n−fur +Dνm,θ ,\n(43)\n∂uz\n∂t + ∂(uruz)\n∂r\n+ 1\nr\n∂(uθuz)\n∂θ\n+ ∂(uzuz)\n∂z\n+ uruz\nr\n= −1\nρ\n∂P\n∂z + Dνm,z .\n(44)\nTaking the time-average, we have\n∂(urur)\n∂r\n+ 1\nr\n∂(uruθ)\n∂θ\n+ ∂(uruz)\n∂z\n+ u2r\nr = −1\nρ\n∂P\n∂r + u2\nθ\nr + fuθ + Dνm,r ,\n(45)\n∂(uruθ)\n∂r\n+ 1\nr\n∂(uθuθ)\n∂θ\n+ ∂(uzuθ)\n∂z\n+ uruθ\nr\n= −1\nrρ\n∂P\n∂θ −uruθ\nr\n−fur + Dνm,θ , (46)\n∂(uruz)\n∂r\n+ 1\nr\n∂(uθuz)\n∂θ\n+ ∂(uzuz)\n∂z\n+ uruz\nr\n= −1\nρ\n∂P\n∂z + Dνm,z .\n(47)\nThe vertical momentum equation does not hold much physical signiﬁcance far\nfrom the eyewall, so it can be ignored for this analysis.\nThe gradient wind balance is expected to hold in the radial direction. Also, no\naverage pressure gradient is expected in the azimuthal direction. That is,\n1\nρ\n∂P\n∂r = V 2\ng\nr + fVg ,\n(48)\n1\nρ\n∂P\n∂θ = 0 .\n(49)\nSubstituting, we get\n∂(urur)\n∂r\n+ 1\nr\n∂(uruθ)\n∂θ\n+ ∂(uruz)\n∂z\n+ u2r\nr = −\n\u0012V 2\ng\nr + fVg\n\u0013\n+ u2\nθ\nr +fuθ+Dνm,r , (50)\n∂(uruθ)\n∂r\n+ 1\nr\n∂(uθuθ)\n∂θ\n+ ∂(uzuθ)\n∂z\n+ uruθ\nr\n= −uruθ\nr\n−fur + Dνm,θ .\n(51)\nThe azimuthal direction can be considered statistically homogeneous. Hence\n∂(urur)\n∂r\n+ ∂(uruz)\n∂z\n+ u2r\nr = −\n\u0012V 2\ng\nr + fVg\n\u0013\n+ u2\nθ\nr + fuθ + Dνm,r ,\n(52)\n∂(uruθ)\n∂r\n+ ∂(uzuθ)\n∂z\n+ uruθ\nr\n= −uruθ\nr\n−fur + Dνm,θ .\n(53)\n\n\nAnalytical solution for the HBL velocity proﬁles\n19\nFar from the eyewall, the average vertical velocity uz ≈0. Thus\nuruz ≈u′ru′z ,\nuθuz ≈u′\nθu′z .\n(54)\nAdditionally, the following assumption is made\nurur ≈urur ,\nuθur ≈uθur ,\nuθuθ ≈uθuθ .\n(55)\nThis assumption might break down close to the surface. But close to the surface\n(and suﬃciently far from the eyewall) it is also known that the velocity proﬁles\nfollow the log-law (Powell et al., 2003; Smith and Montgomery, 2014). Future ver-\nsions of this procedure that account for variable-eddy viscosity could simply adjust\nthe eddy viscosity so that the velocity follows the log-law near the wall. The equa-\ntions become\n2ur ∂ur\n∂r + ∂(u′ru′z)\n∂z\n+ u2\nr\nr = −\n\u0012V 2\ng\nr + fVg\n\u0013\n+ u2\nθ\nr + fuθ + Dνm,r ,\n(56)\nuθ ∂ur\n∂r + ur ∂uθ\n∂r + ∂(u′zu′\nθ)\n∂z\n+ 2uruθ\nr\n= −fur + Dνm,θ .\n(57)\nWe now require modelling assumptions for ∂uθ/∂r and ∂ur/∂r. We follow Bryan et al.\n(2017b) here. Assume that, far aloft, the tangential velocity varies radially through\na power law\nuθ(r) = Vmax\n\u0012\nr\nrmax\n\u0013−n\n,\n(58)\nwhere Vmax and rmax correspond to a tangential velocity and radial distance\nwithin the eyewall. Diﬀerentiating, we get\nduθ\ndr (r) = −nVmax\nr\n\u0012\nr\nrmax\n\u0013−n\n.\n(59)\nFar aloft, uθ(r) = Vg. If it is assumed that this radial variation holds throughout\nthe depth of the HBL, then\n∂uθ\n∂r (r, z) ≈−nVg\nr\n.\n(60)\nTo model the term ∂ur/∂r, take the time-average of the continuity equation.\n∂ur\n∂r + ur\nr + 1\nr\n∂uθ\n∂θ + ∂uz\n∂z = 0 .\n(61)\nBy statistical homogeneity, ∂uθ/∂θ = 0. Far from the eyewall, the eﬀect of vertical\nvelocity can also be neglected. Hence\n∂ur\n∂r = −ur\nr .\n(62)\nSubstituting for ∂uθ/∂r and ∂ur/∂r, we have\n∂(u′ru′z)\n∂z\n= −\n\u0012V 2\ng\nr + fVg\n\u0013\n+ u2\nθ\nr + u2\nr\nr + fuθ + Dνm,r ,\n(63)\n\n\n20\nK. R. Sathia and M. G. Giometto\n∂(u′zu′\nθ)\n∂z\n= −uruθ\nr\n−fur + nur Vg\nr + Dνm,θ .\n(64)\nModel the turbulent stresses using a Boussinesq assumption (and absorb the vis-\ncous stresses into these). At a speciﬁc radial distance r = R\n∂\n∂z\n\u0012\nK ∂ur\n∂z\n\u0013\n=\n\u0012V 2\ng\nR + fVg\n\u0013\n−u2\nθ\nR −u2\nr\nR −fuθ ,\n(65)\n∂\n∂z\n\u0012\nK ∂uθ\n∂z\n\u0013\n= uruθ\nR\n+ fur −nur Vg\nR .\n(66)\nThis is a system of two equations has two unknowns ur and uθ, which are functions\nonly of the vertical coordinate z. The equations to be solved are thus\nd\ndz\n\u0012\nK dur\ndz\n\u0013\n=\n\u0012V 2\ng\nR + fVg\n\u0013\n−u2\nθ\nR −u2\nr\nR −fuθ\n(67)\nd\ndz\n\u0012\nK duθ\ndz\n\u0013\n= uruθ\nR\n+ fur −nur Vg\nR\n(68)\n9.2 Appendix 2: Numerical solver\n-0.5\n0\n0.5\n1\n0\n2\n4\n6\n(a)\n-0.5\n0\n0.5\n1\n(b)\n-0.5\n0\n0.5\n1\n(c)\nFig. 9: Snapshots from the pseudo-time evolution of the numerical solution of case\n3 of Table 1. Dot-dashed lines are u and solid lines are 1 + v.\nTo solve the system of ordinary diﬀerential equations numerically, we use a\nﬁnite diﬀerence based solver. A pseudo-time term is added and time marching is\nperformed with a 3rd order Runge-Kutta method. We use a domain size from ξ = 0\nto ξ = 10 and 200 grid points to discretize the domain. The initial condition is set\nto be the linear solution\nuinitial = −˜α\n2 e−ξ sin(ξ) ,\n(69)\nvinitial = −e−ξ cos(ξ) + f\nGzξ .\n(70)\nFirst and second derivatives are based on 5th and 6th order WENO schemes re-\nspectively. The WENO based derivatives are capable of capturing sharp gradients\nand oﬀers greater numerical stability compared to simpler ﬁnite diﬀerences based\n\n\nAnalytical solution for the HBL velocity proﬁles\n21\nderivatives. This is especially useful here since there is a signiﬁcant deviation of\nthe steady state solution for large n from the initial condition, which caused a di-\nvergence of the solution when the simpler ﬁnite diﬀerences based derivatives were\nused.\nFigure 9 shows snapshots at every 2750 steps of pseudo-time of the solution\nof case 3 of Table 1. We notice that, ﬁrst, the nonlinearities tend to make the\ngradient of the tangential velocity near the bottom boundary less steep. Once the\ncurve becomes approximately perpendicular to the boundary (Fig. 9,c), there is a\nsharp switch of the tangential velocity curve to the other stable solution (cf. (11)).\nThis behaviour where the nonlinearities tend to make the gradient of the tangential\nvelocity near the ground smaller is also seen in cases without a switch of solution\n(Fig. 2). This also suggests that the critical value of n could be that for which the\nslope of the tangential velocity solution is exactly zero at the ground.\nThe n for which the switch in solution is seen can be postponed if the velocity\ngradient near the ground is forced to be larger. This could be due, for example, to\na variable eddy viscosity or a slip boundary condition. Consider the eddy viscosity\nproﬁle\nK(z) = 0.4z\n\u0010\n1 −z\nL\n\u00114\n.\n(71)\nFigure 10(a) shows the numerical solution to (1) and (2) with n = 0.6 and using\nK(ξ) from (71) (with L = 3000 m) instead of a constant value. The values of the\nother constants are those speciﬁed in Table 2. We see that even for n = 0.6, the\nproﬁles continue to be physical. If we push to a larger value of n, the switch in\nsolution is seen again, through a similar mechanism as in Fig. 9. By trial and error,\nthe transitional value of n ≈0.67. Figure 10(b) plots the numerical solution to (1)\n-20\n-10\n0\n10\n20\n30\n40\n0\n500\n1000\n1500\n2000\n(a)\n-20\n-10\n0\n10\n20\n30\n40\n0\n500\n1000\n1500\n2000\n(b)\nFig. 10: Numerical solution for n = 0.6 with (a) variable eddy viscosity (b) a slip\nboundary condition. Dot-dashed lines are the radial velocity and solid lines are\nthe tangential velocity.\nand (2) again with n = 0.6, but using a slip boundary condition at the ground\ninstead of a no-slip condition, as in Kepert (2001). Once again the proﬁles remain\nphysical. The switch occurs for n ⪆0.69. If we choose a larger value of C = 0.02,\nthe switch is seen at a smaller value of n ≈0.55.\n\n\n22\nK. R. Sathia and M. G. Giometto\n9.3 Appendix 3: Extension to linearly varying gradient wind\nConsider a linearly varying gradient wind\nVg = G + z Gz\n(72)\nwhere Gz < 0. To incorporate the tendency of v to Vg above the inﬂow layer, we\nchange the boundary conditions to\nur(z = 0) = 0 ,\nuθ(z = 0) = 0 ,\ndur\ndz\n\f\f\f\f\f\nz→∞\n= 0 ,\nduθ\ndz\n\f\f\f\f\f\nz→∞\n= Gz .\n(73)\nSubstituting (72) in (1) and (2), and following the same steps for variable changes\nand non-dimensionalization, the equations become\n∂2u\n∂ξ2 = −˜αv −˜γ(u2 + v2) + (˜α f\nGz)ξ + (˜γ f\nGz\n2)ξ2 ,\n(74)\n∂2v\n∂ξ2 = ˜βu + ˜γuv −(˜γ f\nGzn)uξ ,\n(75)\nand the boundary conditions become\nu(ξ = 0) = 0 ,\nv(ξ = 0) = −1 ,\ndu\ndξ\n\f\f\f\f\f\nξ→∞\n= 0 ,\ndv\ndξ\n\f\f\f\f\f\nξ→∞\n= f\nGz\n(76)\nwhere f\nGz = GzH/G is the non-dimensional slope of gradient wind. f\nGz is now an\nadditional non-dimensional parameter in the governing equations.\nIncluding the artiﬁcial small parameter δ as in § 4, the governing equations\nbecome\n∂2u\n∂ξ2 = −˜αv + (˜αf\nGz)ξ −δ\n\u0010\n˜γ(u2 + v2) −(˜γ f\nGz\n2)ξ2\u0011\n,\n(77)\n∂2v\n∂ξ2 = ˜βu + δ\n\u0010\n˜γuv −(˜γ f\nGzn)uξ\n\u0011\n.\n(78)\nExpanding the solution using the asymptotic series 15 results in the following\nsystems of equations at the ﬁrst few orders. The leading order reads\n∂2u0\n∂ξ2 = −˜αv0 + (˜αf\nGz)ξ ,\n(79)\n∂2v0\n∂ξ2 = ˜βu0 ,\n(80)\nwith boundary conditions u0(0) = u′\n0(∞) = 0, v0(0) = −1, v′\n0(∞) = f\nGz. The ﬁrst\norder correction is\n∂2u1\n∂ξ2 = −˜αv1 −˜γ(u2\n0 + v2\n0 −f\nGz\n2ξ2) ,\n(81)\n∂2v1\n∂ξ2 = ˜βu1 + ˜γ(u0v0 −f\nGznξu0) ,\n(82)\n\n\nAnalytical solution for the HBL velocity proﬁles\n23\nwith boundary conditions u1(0) = u′\n1(∞) = v1(0) = v′\n1(∞) = 0. The second order\ncorrection reads\n∂2u2\n∂ξ2 = −˜αv2 −˜γ(2u0u1 + 2v0v1) ,\n(83)\n∂2v2\n∂ξ2 = ˜βu2 + ˜γ(u0v1 + u1v0 −f\nGznξu1) ,\n(84)\nwith the same boundary conditions as for the ﬁrst order problem.\nThese equations contain additional non-homogeneous terms which are products\nof polynomial terms {ξ, ξ2, ...} and the terms {exp(−ξ) cos(ξ), exp(−ξ) sin(ξ), ...}.\nThis calls for a larger set of basis functions in our ansatz, namely\nn\n1, ξ, ξ2o\n×\nn\n1, e−ξ, e−2ξo\n× {1, cos(ξ), sin(ξ), cos(2ξ), sin(2ξ)} .\n(85)\nSubstituting the ansatz and solving for the coeﬃcients readily results in the fol-\nlowing leading-order solution\nu0 = −˜α\n2 e−ξ sin(ξ) ,\n(86)\nv0 = −e−ξ cos(ξ) + f\nGzξ ,\n(87)\nand ﬁrst-order correction\nu1(ξ) = ˜γ\n10\n\u0012 ˜α2\n4 + 1\n\u0013\ne−ξ cos(ξ) + ˜γ\n30e−ξ sin(ξ)\n−˜γ\n10\n\u0012 ˜α2\n4 + 1\n\u0013\ne−2ξ + ˜γ\n30\n\u0012\n−3\n8 ˜α2 + 2\n\u0013\ne−2ξ sin(2ξ) +\nf\nGz˜γ ˜α2\n8\n(1 −n) ξe−ξ sin(ξ) ,\n(88)\nv1(ξ) =\n˜γ\n15˜αe−ξ cos(ξ) −˜γ\n5˜α\n\u0012 ˜α2\n4 + 1\n\u0013\ne−ξ sin(ξ)\n−˜γ\n10˜α\n\u0012 ˜α2\n4 + 1\n\u0013\ne−2ξ +\n˜γ\n30˜α\n\u00123˜α2\n4\n+ 1\n\u0013\ne−2ξ cos(2ξ) .\n(89)\nHigher order solutions can similarly be obtained. We observe that there is no term\ninvolving f\nGz in v1. Even the term involving f\nGz in u1 is quite small compared to\nthe other terms and almost no diﬀerence is seen in a plot where the term is ignored\n(not shown). Hence one can suﬃciently incorporate the eﬀect of f\nGz with just the\nterm f\nGzξ in v0 and safely ignore its presence in the corrections.\nDue to limited observational data, there are very few numerical values reported\nin the literature for Gz. Here, we choose a representative value to be that used in\nBryan et al. (2017b), i.e., a decrease of the gradient wind speed of 40 m s-1 over\n18 km. Assuming this Gz is for R = 50 km and K = 50 m2 s-1 gives H = 250 m.\nHence f\nGz = 250/18000 = 0.014.\nFigure 11 shows the comparison between the numerical and analytical solutions\nfor Cases 2 and 4 in Table 2, and with f\nGz = 0.014. We observe, as before, that the\nsolution converges well for relatively smaller n, whereas the convergence is slower\nas n approaches the limiting value n ≈0.5. The solution again diverges for larger\nn, with the limit n ≈0.5 not appearing to be aﬀected by the speciﬁc value of f\nGz\n(not shown).\n\n\n24\nK. R. Sathia and M. G. Giometto\n-0.5\n0\n0.5\n1\n0\n1\n2\n3\n4\n5\n6\n7\nCase 1\nNumerical\nOrder 1\nOrder 0\n(a)\n-0.5\n0\n0.5\n1\n0\n1\n2\n3\n4\n5\n6\n7\nCase 2\nNumerical\nOrder 1\nOrder 0\n(b)\nFig. 11: Cases 1 and 2 from Table 1, with f\nGz = 0.014.\n9.4 Appendix 4: Higher order approximation solution forms\nThe second order corrections are\nu2(ξ) = ˜γ2\n \ne−ξ cos(ξ)\n25600 ˜α\n\u0010\n25 ˜α4 + 98 ˜α2 + 688\n\u0011\n−e−ξ sin(ξ)\n115200 ˜α\n\u0010\n135 ˜α4 + 210 ˜α2 + 368\n\u0011\n+ e−2ξ\n300 ˜α\n\u0010\n˜α2 + 4\n\u0011\n+ e−2ξ cos(2ξ)\n2400 ˜α\n\u0010\n3 ˜α4 −4 ˜α4 −64\n\u0011\n+ e−2ξ sin(2ξ)\n1800 ˜α\n\u0010\n3 ˜α2 −16\n\u0011\n−e−3ξ cos(ξ)\n76800 ˜α\n\u0010\n171 ˜α4 + 422 ˜α2 + 1040\n\u0011\n−e−3ξ sin(ξ)\n25600 ˜α\n\u0010\n39 ˜α4 + 198 ˜α2 + 240\n\u0011\n−e−3ξ sin(3ξ)\n76800 ˜α\n\u0010\n27 ˜α4 −26 ˜α2 + 144\n\u0011 !\n,\n(90)\nv2(ξ) = ˜γ2\n \ne−ξ cos(ξ)\n115200 ˜α2\n\u0010\n270 ˜α4 + 420 ˜α2 + 736\n\u0011\n+ e−ξ sin(ξ)\n25600 ˜α2\n\u0010\n50 ˜α4 + 196 ˜α2 + 1376\n\u0011\n+ e−2ξ\n300 ˜α2\n\u0010\n˜α2 + 4\n\u0011\n−e−2ξ cos(2ξ)\n900 ˜α2\n\u0010\n3 ˜α2 + 4\n\u0011\n+ e−2ξ sin(2ξ)\n1200 ˜α2\n\u0010\n3 ˜α4 + 16 ˜α2 + 16\n\u0011\n−e−3ξ cos(ξ)\n76800 ˜α2\n\u0010\n186 ˜α4 + 452 ˜α2 −160\n\u0011\n−e−3ξ sin(ξ)\n25600 ˜α2\n\u0010\n14 ˜α4 −132 ˜α2 + 160\n\u0011\n−e−3ξ cos(3ξ)\n76800 ˜α2\n\u0010\n6 ˜α4 + 172 ˜α2 + 32\n\u0011 !\n.\n(91)\nHigher order corrections are similarly obtained, but involve many more cross terms.\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21215v1.pdf",
    "total_pages": 24,
    "title": "An analytical solution for horizontal velocity profiles in the hurricane boundary layer",
    "authors": [
      "Kishore R. Sathia",
      "Marco G. Giometto"
    ],
    "abstract": "Theoretical analyses of the hurricane boundary layer have traditionally\nrelied on slab models, which provide a limited description of wind profiles.\nLiterature on height-resolving methods is typically based on linear analyses,\nwhich may fall short of capturing the full sensitivity of the solution to\nvariations in input parameters. This work proposes an approximate analytical\nsolution of a nonlinear single-column model for horizontal winds that uses a\nconstant eddy viscosity and is valid outside the eyewall. Building on\nliterature that uses a linearized system of equations, we use a series\nexpansion to account for the nonlinearities. We find that a first-order\ncorrection is sufficient for most practical cases. This solution helps provide\na simplified understanding of the sensitivity of the radial and tangential wind\nprofiles to input parameters such as the distance from the hurricane eye and\nthe Coriolis force.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}