{
  "id": "arxiv_2502.21033v1",
  "text": "arXiv:2502.21033v1  [math.NA]  28 Feb 2025\nA data augmentation strategy for deep neural networks with\napplication to epidemic modelling\nMuhammad Awais∗, Abu Sayfan Ali†, Giacomo Dimarco‡, Federica Ferrarese§, Lorenzo\nPareschi¶,\nAbstract\nIn this work, we integrate the predictive capabilities of compartmental disease dynamics\nmodels with machine learning ability to analyze complex, high-dimensional data and uncover\npatterns that conventional models may overlook. Speciﬁcally, we present a proof of concept\ndemonstrating the application of data-driven methods and deep neural networks to a recently\nintroduced SIR-type model with social features, including a saturated incidence rate, to im-\nprove epidemic prediction and forecasting. Our results show that a robust data augmentation\nstrategy trough suitable data-driven models can improve the reliability of Feed-Forward Neural\nNetworks (FNNs) and Nonlinear Autoregressive Networks (NARs), making them viable alter-\nnatives to Physics-Informed Neural Networks (PINNs). This approach enhances the ability to\nhandle nonlinear dynamics and oﬀers scalable, data-driven solutions for epidemic forecasting,\nprioritizing predictive accuracy over the constraints of physics-based models. Numerical simu-\nlations of the post-lockdown phase of the COVID-19 epidemic in Italy and Spain validate our\nmethodology.\nKey words. Data Driven models in epidemiology, Deep learning, Data augmentation,\nFeed-Forward Neural Networks, Nonlinear Autoregressive Networks, COVID 19 data\n1\nIntroduction\nThe COVID-19 pandemic has underscored the need for accurate and computationally eﬃcient\npredictive models that not only describe the spread of infectious diseases but also provide fast\nand reliable forecasts to guide public health interventions. A key challenge in epidemic modeling\nis balancing mechanistic realism with computational tractability. Among the most widely used\napproaches are compartmental models, such as the classical Susceptible-Infectious-Recovered\n(SIR) models, which describe disease dynamics by partitioning the population into epidemio-\nlogically relevant compartments [16, 29, 32]. Speciﬁcally, these models categorize individuals\nas susceptible (capable of contracting the disease), infected (currently infected and capable of\ntransmitting the disease), and recovered (immune or isolated from the population). Despite\n∗Department of Mathematics and Computer Science, University of Ferrara, Italy, e-mail: wsammm@unife.it\n†Department of Mathematics and Computer Science, University of Ferrara, Italy, e-mail: abusafyan.ali@unife.it\n‡Department of Mathematics and Computer Science, University of Ferrara, Italy, e-mail: giacomo.dimarco@unife.it\n§Department of Mathematics and Computer Science, University of Ferrara, Italy, e-mail: federica.ferrarese@unife.it\n¶Department of Mathematics and Computer Science, University of Ferrara, Italy, and Maxwell Institute\nfor Mathematical Sciences and Department of Mathematics Heriot-Watt University, Edinburgh, UK, e-mail:\nlorenzo.pareschi@unife.it\n1\n\n\ntheir simplicity and eﬀectiveness in capturing some fundamental epidemic trends, classical SIR\nmodels assume constant transmission and recovery rates, limiting their ability to represent the\ncomplex, nonlinear, and time-varying nature of real-world epidemics.\nTo address these limitations, extended versions of the SIR model have been proposed in the\nrecent past, incorporating time- and state-dependent transmission rates, saturated incidence\nfunctions, and heterogeneous population behaviors [1, 12, 21]. For example, models incorporat-\ning saturated or nonlinear incidence rates [4, 22, 23], as well as kinetic approaches to contact\ndynamics [7], have proven eﬀective in capturing the impact of social distancing measures during\nthe pandemic. These reﬁnements enhance realism and allow for better representation of the\ndiverse factors inﬂuencing epidemic trajectories.\nIn parallel, machine learning techniques, particularly neural networks, have emerged as pow-\nerful tools for studying epidemic spread [3, 13, 33]. By leveraging their ability to approximate\ncomplex, nonlinear relationships, neural networks complement traditional modeling approaches\nand extend their applicability. Recent advancements, such as Physics-Informed Neural Networks\n(PINNs), integrate mechanistic knowledge of underlying physical or biological processes directly\ninto the training phase of neural networks [20]. This integration ensures model robustness and\nconsistency with known dynamics, even when data are scarce or uncertain. For instance, PINNs\nhave been successfully applied to solve forward and inverse problems in epidemic modeling, en-\nsuring that predictions adhere to underlying physical laws [6, 9, 28, 31, 41].\nFeed-Forward Neural Networks (FNNs) and Nonlinear Autoregressive Networks (NARs)\nalso oﬀer promising approaches for epidemiological predictions [2, 27, 34]. FNNs map inputs\ndirectly to outputs through layers of nonlinear transformations, making them eﬀective for tasks\nsuch as interpolation and short-term forecasting. This approach has been applied across various\ndomains, including early recolonization detection in Parkinson disease, biological parameter es-\ntimation in disease models, COVID-19 data analysis, musculoskeletal disorder risk assessment,\nand statistical modeling for selecting optimal FNN architectures [17, 24, 36, 38, 42, 44]. How-\never, FNNs do not account for temporal dependencies, limiting their ability to model the\nevolution of epidemics over time.\nConversely, NARs are speciﬁcally designed to process sequential data, making them well-\nsuited for time-series forecasting in epidemic modeling. By incorporating previous values of\nthe time series, NARs retain information about past states, enabling them to capture temporal\ndependencies in epidemic dynamics. These networks have been successfully applied in the recent\npast to forecast infection peaks, estimate recovery rates, and simulate intervention scenarios [10,\n25, 30, 34, 35, 40, 43].\nIn this work, we introduce a hybrid epidemic forecasting approach that integrates mechanis-\ntic epidemiological models with data-driven FNNs and NARs, creating a surrogate model capa-\nble of generalizing across diﬀerent epidemic scenarios. This approach enables fast, data-driven\nepidemic forecasting while preserving the interpretability of traditional mechanistic models.\nThe resulting methodology is applied to analyze the post-lockdown phase of the COVID-19\nepidemic in Italy and Spain, leveraging real-world data and enhanced computational strategies\nto improve predictive accuracy. This framework enables us to augment real-world epidemic\ndata with synthetic simulations generated from a generalized SIR model, which includes a sat-\nurated incidence rate to better reﬂect intervention eﬀects and behavioral changes. The main\nidea consists in addressing the limitations posed by sparse real-world data by generating addi-\ntional synthetic information using a generalized SIR data driven model. Speciﬁcally, we focus\non an extension known as the social-SIR model with a saturated incidence rate, referred to here\nas the generalized SIR model in the following. This model modiﬁes the transmission dynam-\nics [23] by allowing the infection rate to vary with time and the number of infected individuals.\nSuch modiﬁcations enable the incorporation of external interventions, such as lockdowns or\nvaccination campaigns, as well as psychological and behavioral adaptations [14].\n2\n\n\nThe enriched dataset, combining real and synthetic data, is then used to train the neural\nnetworks, allowing them to eﬀectively learn epidemic dynamics and improve predictive accu-\nracy. By leveraging the ﬂexibility of FNNs and the sequential modeling capabilities of NARs,\nour approach captures both short-term and long-term epidemic trends. Unlike PINNs, which\nexplicitly encode governing equations into the network architecture, our method enables net-\nworks to infer dynamics implicitly through data-driven learning. This eliminates the need for\nembedding diﬀerential equations directly into the training process, enhancing adaptability to\ndiﬀerent scenarios while reducing computational complexity.\nThe remainder of this paper is structured as follows. In Section 2, we recall some standard\nfeatures about the classical SIR model and we introduce the social-SIR model with a saturated\nincidence rate used to produce synthetic data. Section 3 deﬁnes the optimization problems used\nto estimate parameters and the incidence function during the pre- and post-lockdown phases in\nItaly and Spain. In Section 4, we present the neural network structures, distinguishing between\nFNNs and NARs and we perform some detailed numerical experiments to validate our strategy.\nFinally, Section 5 summarizes our ﬁndings and outlines potential future research directions.\n2\nProblem setting\nThe governing equations of the standard SIR model, which describes the spread of an infectious\ndisease in a population of N individuals divided into three compartments, Susceptible (S),\nInfected (I), and Recovered (R), are given by\ndS(t)\ndt\n= −β S(t)I(t)\nN\n,\ndI(t)\ndt\n= β S(t)I(t)\nN\n−γI(t),\ndR(t)\ndt\n= γI(t),\n(2.1)\nwhere the total population corresponds to N = S(t) + I(t) + R(t), and the system is comple-\nmented with suitable initial conditions. The parameters β > 0 and γ > 0 represent the disease\ntransmission rate and the recovery rate, respectively, and are assumed to be constant in (2.1).\nFor simplicity, we also absorb N into the coeﬃcient β in the following.\nThe above model despite of its simplicity it has been shown to be able to capture some\nfeatures related to the spread of an epidemic. However, as expected, it also suﬀers of some\ndrawbacks due to the inability to describe more complex structured solutions which has been\nobserved for instance during the last COVID-19 epidemic [26]. In particular, recent studies\nhave highlighted the crucial role of transmission coeﬃcients in relation to social behavior,\nwhich signiﬁcantly inﬂuences pathogen spread [5]. In this research direction, the works in [5,\n23] explored how controlling the number of daily social contacts can guide partial lockdown\nstrategies. This is type of phenomena we address in this work and which cannot be captured\nwith the system (2.1). Building on this perspective, some of the authors of the present work have\ndeveloped in the recent past a new mathematical framework linking social contact distributions\nwith disease transmission in multi-agent systems in [23]. This is achieved by integrating a\nclassical compartmental epidemiological model with kinetic equations governing social contact\n3\n\n\nformation. The resulting model is given by\ndS(t)\ndt\n= −βS(t)I(t)H(t,I(t)),\ndI(t)\ndt\n= βS(t)I(t)H(t,I(t)) −γI(t),\ndR(t)\ndt\n= γI(t),\n(2.2)\nwhere H(t, I(t)) is a macroscopic incidence rate [23], representing a time-dependent adjustment\nto infection rates based on behavioral and policy changes (e.g., lockdowns). In the sequel we\nconsider the following bounded function that moderates infection spread\nH(t, I(t)) =\n1\n1 + ν\nβ\nR t\n0 I(s)ds\n,\n(2.3)\nwhere ν > 0 is a constant that it has been shown to reﬂect the variance in contact rates within\nthe population. The system (2.2) even if built on a diﬀerent basis, shares conceptual similarities\nwith the models introduced in [16], where a nonlinear, bounded function g(I) modulates disease\ntransmission. This approach accounts for the fact that, as the number of infected individuals\nincreases, the eﬀective infection force may decrease due to factors such as behavioral adaptations\nor resource limitations. On the same direction in [37] it has been introduced a nonlinear,\nsaturated incidence rate of the form\ng(I)S =\nβImS\n1 + αIk ,\nwith\ndS(t)\ndt\n= −g(I(t))S(t)\n(2.4)\nwhere βImS represents the baseline infection force, and\n1\n1+αIk accounts for behavioral re-\nsponses, such as increased caution among susceptible individuals. Here, β, m, k are positive\nconstants, and α is a non-negative constant [19, 45, 46]. A speciﬁc case, with m = 1, k = 1,\nyields the form proposed in [16] to model the crowding eﬀect observed during the 1973 cholera\noutbreak in Bari:\ng(I) =\nβI\n1 + αI .\n(2.5)\nAlternatively, setting m = 1, k = 2 results in the Monod’\n¨A`ıHaldane (M’\n¨A`ıH) function,\ng(I) =\nβI\n1 + αI2 ,\n(2.6)\nwhich is commonly used to model physiological constraints in infection dynamics.\nThe so-called social-SIR model (2.2) exhibits a similar incidence rate behavior, extending\nthe form in (2.5) to account for the impact of protective measures such as lockdown strategies\nand infection control. Unlike classical models, this generalized framework incorporates a time-\ndependent, saturated incidence rate to capture the cumulative eﬀects of infection dynamics and\nbehavioral adaptations in response to an epidemic. This model has previously been successfully\nemployed to analyze the eﬀects of partial lockdown strategies in various European countries.\nGiven that we choose in the following, for demonstrating the proposed data augmentation\nstrategy, a dataset corresponding to a period marked by COVID-19 lockdowns, we opted to use\nthis model in our study. It is worth to mention that, the complexity introduced by lockdown\nmeasures, makes the forecasting process more challenging compared to standard scenarios.\nTherefore, in the following, we employ system (2.2) to develop our data-driven strategy and\nthe associated deep learning framework, enabling epidemic forecasting.\n4\n\n\n3\nOn the the construction of a data driven social-SIR\nmodel\nIn the context of epidemic prediction, mathematical models such as those presented in the\nprevious section provide valuable insights into the spread of infectious diseases. However, these\nmodels often rely on predeﬁned assumptions and parameters that may not fully capture the\ncomplexities of real-world epidemics. Neural networks oﬀer a powerful alternative by learning\ndirectly from data, enabling them to model complex, nonlinear relationships that traditional\nepidemic models may struggle to represent. However, one major limitation of training neural\nnetworks exclusively on available data is that, while they can eﬀectively interpolate within\na given time interval, they struggle to make accurate predictions beyond the observed data\npoints [2, 9, 33]. To address this issue, we propose an approach that combines a mathematical\nepidemiological model’\n¨Aˆıthe social-SIR model (2.2)’\n¨Aˆıwith real outbreak data. The key idea\nis to generate additional synthetic information by solving this generalized SIR model, thereby\nﬁlling the gaps between available real or measured data points. With this enriched dataset,\none can train a neural network more eﬀectively to predict future infection trends in a given\npopulation. As we demonstrate later, this approach leverages both real and synthetic data,\nsigniﬁcantly improving predictive accuracy and enhancing the model’\n¨Aˆos ability to forecast\nepidemic dynamics. However, to implement this strategy, the model must be capable of inter-\npolating through the experimental data points. Therefore, in the following section, we discuss\nhow the parameters in (2.2) are deﬁned.\n3.1\nParameters estimation\nTo develop our approach, we focus on the COVID-19 outbreak in two European countries,\nItaly and Spain, during the 2020 pandemic. Given that both countries implemented restrictive\nmeasures during this period, we proceed as follows. We deﬁne two optimization phases: in\nthe ﬁrst phase, we estimate the parameters β and γ for the pre-lockdown period using the\nmodel (2.2) with H(t, I(t)) = 1; in the second phase, we estimate the function H(t, I(t)) from\npost-lockdown data.\nThe COVID-19 data for Italy are available from the GitHub repository of the Italian Civil\nProtection Department, while data for Spain can be accessed here. In practice, to estimate the\nparameters β and γ, we formulate the following minimization problem:\nmin\nβ,γ J (ˆI, I),\n(3.1)\nsubject to the constraint that the equations of system (2.2) have to be satisﬁed when H(t, I(t)) =\n1. The objective function to be minimized is deﬁned as\nJ (ˆI, I) = ∥ˆI(t) −I(t)∥2,\n(3.2)\nwhere ˆI(t) represents the reported infected cases from the data set at disposal, while I(t) is\nthe model output, and ∥· ∥denotes the L2 norm.\nWe consider data over the time interval [t0, tl), where t0 (set to February 24, 2020) marks\nthe initial time, and tl represents the lockdown start date (March 9 for Italy and March 14 for\nSpain). We search for a minimum under the constraints\n0 ≤β ≤0.6,\n0 ≤γ ≤0.06,\n(3.3)\nwhere the bounds are chosen accordingly to the available estimates [26]. To solve the optimiza-\ntion problems in (3.1), we rely on the use of the Matlab functions fmincon in combination with\n5\n\n\na RK4 integration method of the system of ODEs. The result of the optimization procedure\non the pre-lockdown phase gives, for Italy, the following values\nβIt\nest = 0.3107,\nγIt\nest = 0.0328,\n(3.4)\nwhile for Spain\nβSp\nest = 0.2340,\nγSp\nest = 0.0224.\n(3.5)\nIn Figure 1 on the left the evolution of the dynamics in the pre-lockdown phase in Italy\nobtained by solving the social-SIR model (2.2) with H(t, I(t)) = 1, using the estimated param-\neters β = βIt\nest and γ = γIt\nest in (3.4). This is compared, in the same image, to the experimental\ndata from the pre-lockdown phase, spanning up to time tl = 14 with a time step ∆t = 1 corre-\nsponding to 14 days with 1 day interval between the measurements. The estimated dynamics\naligns quite well with the available data, as conﬁrmed by the embedded plot which shows the\npointwise error over time between the solution of the generalized SIR model and the data at\ndisposal, i.e.\nE(t) = |ˆI(t) −I(t)|.\n(3.6)\nIn the same Figure on the right the pre-lockdown dynamics in Spain computed by solving\nthe social-SIR model (2.2) with H(t, I(t)) = 1, using the estimated parameters β = βSp\nest and\nγ = γSp\nest in (3.5) compared with the experimental data spanning up to time tl = 18. The two\nsolutions are in good agreement as conﬁrmed by the plot showing the pointwise error computed\nas in (3.6).\nFigure 1: Pre-lockdown phase. Dynamics of the infected population computed by solving the social-\nSIR model (2.2) with β and γ as in (3.4) (Italy), and as in (3.5) (Spain) and H(t, I(t)) = 1,\ncompared with the experimental data. In the embedded plot the pointwise error between the two\nquantities computed as in (3.6). On the left, Italy. On the right, Spain.\nOnce β and γ have been estimated, we proceed to determine the pointwise values H(t, I(t))\nin (2.2) in such a way that the model ﬁts as well as possible the post-lockdown data, i.e., data\nin the interval [tl, T ], where T (set to July 1st) is the ﬁnal observation time for both countries.\nTo this end, we solve the following new optimization problem\nmin\nH(t) J (ˆI, I),\n(3.7)\n6\n\n\nsubject to the constraint that the solution has to satisfy the equations of the system (2.2), with\nJ (·) deﬁned as in (3.2), and that\n0 ≤H(t) ≤1.\n(3.8)\nIn order to determine the optimal value of H, we split the time interval [tl, T ] into Nt time\nintervals of length ∆t, and we solve a sequence of optimal control problems\nmin\nH J ∆t(ˆI, I) :=\nZ t+∆t\nt\n∥ˆI(s) −I(s)∥2ds,\n(3.9)\ns.t. the explicit time discretization of the generalized SIR dynamics\nSn+1 = Sn + ∆tβInSnHn,\nIn+1 = In + ∆t (βInSnHn −γIn) ,\nRn+1 = Rn + ∆tγIn,\n(3.10)\nwhere we denoted by tn = n∆t for any n = 1, . . . , Nt. We then consider a discretization of the\nintegral in (3.9) using the rectangle rule\nJ ∆t(ˆI, I) = ∆t\n\u0010\nˆIn+1 −In+1\u0011\n.\n(3.11)\nBy direct computation, it can be shown that the expression for H at each discrete time tn is\ngiven by\nHn = P[0,1]\n \nˆIn −In + Inγ∆t\nInSnβ∆t\n!\n,\n(3.12)\nwhere P[0,1](·) denotes the projection over the interval [0, 1].\nThe results of this study are reported in Figure 2 where on the left we show the post-\nlockdown experimental data and the solution of the generalized SIR model with the contact\nfunction H as in (3.12). The estimated and true solution are in good agreement as shown in\nthe embedded plot which represents the corresponding pointwise error computed as in (3.6).\nOn the right, we show the estimated values of Hn computed as in (3.12) as a function of time.\nThe function H exhibits oscillations over time, suggesting potential measurement errors in the\ndata. First row, Italy. Second row, Spain.\n7\n\n\nFigure 2: Post-lockdown phase. On the left the dynamics of the infected population computed by\nsolving the generalized SIR model (2.2) with β and γ as in (3.4) (Italy), and as in (3.5) (Spain)\ncompared with the experimental data. In the embedded plot the pointwise error between the two\ninfected populations computed as in (3.6). On the right the contact function H computed as in\n(3.12). First row, Italy. Second row, Spain.\n4\nEstimation and prediction using real COVID-19\ndata and Neural Networks design for epidemic pre-\ndiction\nIn this section, we consider two distinct types of neural network architectures: Feed-Forward\nNeural Networks (FFNs) and Nonlinear Autoregressive Networks (NARs). Both approaches\n8\n\n\nare implemented using a general neural network framework with L + 1 layers, as follows\nx1 = W 1x + b1,\nxl = σ ◦(W lxl−1 + bl),\nl = 2, . . . , L −1,\nU NN(x; b, W) = W LzL−1 + bL,\n(4.1)\nwhere x = (x1, . . . , xd) ∈Rd is the input, σ is an activation function to convert the input\nsignals to output signals, and W = (W 1, . . . , W L) and b = (b1, . . . , bL) represent the weights\nand biases. The weights and biases associated with these connections serve as the parameters\nof the network, adjusted iteratively through techniques like gradient descent or Adam method\nduring the training phase to minimize prediction errors and enhance model performance. In\nour context, the idea is to solve the following minimization problem\nθ∗= arg min\nθ\nL(θ),\n(4.2)\nto ﬁnd the optimal parameters θ = (W 1, b1, . . . , W L, bL) which minimize a certain loss function\nL(θ) that includes errors from both real and synthetic data generated by solving the generalized\nSIR model. Real data provides an accurate representation of the epidemic dynamics, while\nsynthetic data ﬁlls gaps between observed data points and provides high-resolution trajectories.\nThe loss function is expressed as\nL(θ) = ωrLr(θ) + ωsLs(θ),\n(4.3)\nwhere ωr, ωs > 0 are given weights, and\nLj(θ) = 1\nNj\nNj\nX\ni=1\n∥Ij(t) −INN\nj\n(t, θ)∥2,\n(4.4)\nfor j = {r, s}, where Ij(t) is the actual number of infected. These are either the real data or\nthe data generated by solving the social SIR model (synthetic data), while INN\nj\n(t, θ) is the\npredicted state. Finally, Nr, Ns refer to the number of available real and synthetic data points\nrespectively. With this choice, it is possible to appropriately weight the contribution of real\ndata alongside the data generated by the model.\nFeed-Forward Neural Networks.\nFFNs are a foundational type of neural network ar-\nchitecture designed to map inputs directly to outputs without considering temporal depen-\ndencies. For epidemic prediction, we design a FFN that takes the current time t as input and\nproduces the value of infected I(t) as output. This approach relies on learning a direct mapping\nbetween the time and the epidemic dynamics, eﬀectively interpolating the trajectory based on\nthe training data. The architecture of the FFN consists of the following components\n• Input Layer: The single input feature is the current time t.\n• Hidden Layers: One or more fully connected layers with nonlinear activation functions\n(e.g., ReLU or tanh) capture the relationship between time and the epidemic states.\n• Output Layer: The output consists of a node corresponding to the predicted value of\nthe infected at time t, i.e. I(t).\nIt is well known that, while FFNs are eﬀective for interpolation tasks, their inability to model\nsequential dependencies limits their accuracy in predicting future epidemic dynamics. This\nlimitation arises because FFNs lack memory mechanisms, meaning they cannot leverage infor-\nmation from previous states to inﬂuence current predictions. For this reason, in the following\nwe propose an alternative strategy.\n9\n\n\nNonlinear Autoregressive Networks.\nTo capture the temporal dynamics of the epi-\ndemic, we then rely on Nonlinear Autoregressive Networks (NARs) capable of modeling se-\nquential data. Unlike FFNs, NARs incorporate information about past states, making them\nparticularly eﬀective for time-series predictions. The NAR is designed to predict the future\nstate of the epidemic based on the previous state of the solution. The architecture consists of\nthe following components:\n• Input Layer: The input features are the values of the infected at time t −d, . . . , t −1,\ni.e. I(t −d), . . . , I(t −1) for a certain d ≥1 .\n• Hidden Layers: One or more fully connected layers with nonlinear activation functions\n(e.g., ReLU or tanh) capture nonlinear relationships in the time series data.\n• Output Layer: Produces the predicted next state, I(t), representing the system’s state\nat time t.\nOnce trained, NAR networks can predict the future states of the epidemic compartments by\nrecursively feeding its outputs back as inputs for subsequent time steps (closed loop strategy).\nThis enables the generation of full epidemic trajectories from a given initial condition.\n4.1\nNeural network for epidemic prediction\nTo evaluate the performances of FFNs and NARs in epidemic prediction, we conduct some\nnumerical experiments using both real and synthetic data. The real data covers the period\nfrom the lockdown start date (in Italy March 9th, in Spain March 14th) to July 1st. These\ndata are available on a daily basis, corresponding to a time step of ∆tr = 1. The synthetic data\nare generated by solving the generalized SIR model given in (2.2), with β and γ as in (3.4)\n(Italy), and as in (3.5) (Spain) over the same time interval, using a ﬁner time step ∆ts = 0.2,\nand with H estimated by solving the minimization problem in (3.7). Since H is originally\ndeﬁned at daily intervals as in (3.12), we use linear interpolation to extend its deﬁnition to the\nﬁner grid. Both networks are trained using the Levenberg-Marquardt optimizer for 500 epochs.\nIn the case of real data we set ωr = 1 and ωs = 0, while in the case of synthetic data we set\nωr = 0 and ωs = 1 in (4.3).\nFeedforward neural network.\nWe design a FFN with three fully connected layers, each\nconsisting of 10 nodes, and use the tanh activation function, relying on the use of the Mat-\nlab function feedforwardnet. The input to the network is the time interval [tl, T ], being tl\nthe lockdown starting date and T the ﬁnal time supposed to be July 1st. The output is the\nnormalized number of infected I(t), which corresponds to either real data or synthetic data\ngenerated as described above. We train the neural network using the Matlab function train.\nTo evaluate the neural network’s performance, we ﬁrst compute its solution over the training\nset for both Italy (ﬁrst row) and Spain (second row). Speciﬁcally, we consider the time interval\n[tl, T ] with a time step ∆tr = 1. In the left panel of Figure 3 and of Figure 4, we compare\nthe solution obtained using a neural network trained on both real and synthetic data, with the\navailable data for respectively the Italian and the Spanish case. The neural network provides\na good approximation of the solution, making it well-suited for interpolation tasks. Next, to\nassess its predictive capabilities, we focus on the time interval (T, Ttest], where T (July 1st) is\nthe starting time and Ttest (July 15th) is the ﬁnal time, using the same daily discretization.\nThe right panels of Figures 3 and 4 present a comparison between the network’s predictions for\nthe test set and the daily real data available in that period. Additionally, the ﬁgures display\nthe pointwise error between the neural network’s outputs and the real data, calculated as in\n(3.6). The standard FNN as expected faces challenges in forecasting future dynamics and the\ndata augmentation does not provide a clear improvement in the results.\n10\n\n\nFigure 3: Feedforward neural network for Italy. On the left the dynamics of the infected population\ncomputed by training a FNN on real and synthetic data and tested over the train interval [tl, T ]\ncompared to the available data. On the right the solution computed with the same FNN tested\nover the time interval (T, Ttest] compared to the available data. Embedded the error between the\navailable data test and the neural network solution computed as in (3.6).\nNonlinear autoregressive neural network.\nWe design now a NAR network with three\nfully connected layers, each consisting of 10 nodes, and use the tanh activation function. To\nimplement the neural network we use the Matlab function narnet. We consider a time interval\n[tl, T ], being tl the time in which the lockdown started and T the ﬁnal time supposed to be\nJuly 1st. We discretize the interval with time step ∆tr = 1 if we deal with real data, or with\ntime step ∆ts = 0.2 if we deal with synthetic data as before. The input to the network is the\nnumber of infected at time t−2∆t, t−∆t, and the output is I(t) that is the number of infected\nat time t. Both the input and output data are generated as described above by considering a\nsocial-SIR model. As for the FNN we ﬁrst evaluate the performance of the NAR network on\nthe training set. Since the number of infected individuals during the training interval is known,\nwe can use an open-loop prediction approach using the true training set values to forecast the\nnext time step’s solution.\n11\n\n\nFigure 4: Feedforward neural network for the Spain case. On the left the dynamics of the infected\npopulation computed by training a FNN on real and synthetic data and tested over the train\ninterval [tl, T ] compared to the available data. On the right the solution computed with the same\nFNN tested over the time interval (T, Ttest] compared to the available data. Embedded the error\nbetween the available data test and the neural network solution computed as in (3.6). First row,\nItaly. Second row, Spain.\nFigure 5 shows the solution obtained by training a NAR network on both real and synthetic\ndata, then testing it on the same dataset and comparing it to the available data. On the left,\nwe have the results for Italy, and on the right, for Spain. Both the NAR networks, trained on\nreal and synthetic data, are able to accurately approximate the underlying dynamics when one\nconsiders the training interval.\n12\n\n\nFigure 5: Nonlinear autoregressive network: training data. Solution obtained by training a NAR\nnetwork on both real and synthetic data, then testing it on the same dataset and comparing it to\nthe available data. On the left, the case for Italy, and on the right, the one for Spain.\nWe then test the NAR network for both short-term and long-term predictions. For short-\nterm predictions, we compare the neural network solution with a test set containing daily data\nfrom July 2nd to July 8th for both Italy and Spain, while for long-term predictions, we extend\nthe test period to July 15th. Since these data are assumed to be unknown a priori, we convert the\nopen-loop NAR network into a closed-loop form. This allows the network to generate predictions\nfor the desired number of steps by using its previous predictions as input, without relying on\nthe true values for evolution. Figure 6 shows the solution produced by the NAR network trained\non both real and synthetic data, compared with the available true data. Additionally, we plot\nthe pointwise error in time computed as in (3.6). In the ﬁrst row, the short-term prediction\nwhile in the second row, the long term prediction. On the left, Italy. On the right, Spain. The\nNAR network trained on synthetic data is able to provide a very accurate approximation of the\nsolution and demonstrates strong predictive capabilities. Notably, it signiﬁcantly outperforms\nthe results obtained when training exclusively on real data, as it is particularly evident in the\ncase of Italy.\n13\n\n\nFigure 6: Nonlinear autoregressive network: short and long time predictions. Solution obtained by\ntraining a NAR network on both real and synthetic data, then testing it to produce daily data from\nJuly 2nd to July 8th (ﬁrst row), and extend to July 15th (second row), compared with the available\ntrue data. On the left, the case for Italy, and on the right, the one for Spain.\n5\nConclusion\nIn this study, we explored the impact of a data augmentation strategy on enhancing the fore-\ncasting capabilities of Feed-Forward Neural Networks (FNNs) and Nonlinear Autoregressive\nNetworks (NARs) in analyzing and predicting the dynamics of the COVID-19 epidemic during\nthe post-lockdown phase in Italy and Spain. By integrating real data with synthetic data gen-\nerated from a generalized SIR model, we demonstrated the eﬀectiveness of neural networks in\ncapturing complex epidemic dynamics. FNNs performed well in interpolating within observed\ndata, while NARs were particularly eﬀective in capturing temporal dependencies, making them\n14\n\n\nsuitable for long-term forecasting. The generalized SIR model provided a robust foundation for\ngenerating high-resolution synthetic data, enriching the neural network training process. The\nkey outcome of this work is the development of a hybrid methodology that bridges the gap\nbetween traditional mathematical modeling and machine learning techniques, such as Physics-\nInformed Neural Networks (PINNs), oﬀering a scalable and ﬂexible framework for epidemic\nmodeling and prediction in real-world scenarios.\nWhile this study has focused on FNNs and NARs, other neural network architectures could\nbe explored to further improve epidemic forecasting. For example, Long Short-Term Mem-\nory (LSTM) networks and Transformer-based models have been increasingly used for time-\nseries prediction and could provide additional advantages in learning long-term dependencies\n[2, 11, 39]. Similarly, hybrid AI-mechanistic models, which integrate deep learning with tradi-\ntional compartmental models, have shown promise in epidemic modeling [47]. Future research\ncould investigate whether these approaches provide added value in capturing epidemic trends\ncompared to the models used in this study, particularly in scenarios with limited or noisy data.\nAn important direction for future research is the incorporation of uncertainty quantiﬁcation\n(UQ) to better account for variability and noise in real-world data [1, 8, 15, 18]. While neural\nnetworks provide powerful forecasting tools, their deterministic nature limits their ability to\nexpress conﬁdence in predictions, which is crucial in public health decision-making. Approaches\nsuch as Bayesian deep learning, Monte Carlo Dropout, and ensemble learning can be explored\nto quantify the range of possible epidemic trajectories. Additionally, integrating probabilistic\nsurrogate models with mechanistic epidemiological frameworks can improve risk assessment and\nearly-warning systems for future outbreaks. By embedding UQ techniques within the proposed\nhybrid framework, epidemic forecasting can become more robust, interpretable, and reliable to\nbetter account for variability and noise in real-world data.\nAcknowledgments\nThis work has been written within the activities of GNCS and GNFM groups of INdAM\n(Italian National Institute of High Mathematics). G.D. and F.F. thank the Italian Ministry\nof University and Research (MUR) through the PRIN 2020 project (No. 2020JLWP23) “In-\ntegrated Mathematical Approaches to Socio Epidemiological Dynamics”. L.P. acknowledges\nthe support by the Royal Society under the Wolfson Fellowship “Uncertainty quantiﬁcation,\ndata-driven simulations and learning of multiscale complex systems governed by PDEs” and\nby MIUR-PRIN 2022 Project (No. 2022KKJP4X), “Advanced numerical methods for time de-\npendent parametric partial diﬀerential equations with applications”. The partial support by\nICSC – Centro Nazionale di Ricerca in High Performance Computing, Big Data and Quantum\nComputing, funded by European Union – NextGenerationEU is also acknowledged.\nReferences\n[1] G. Albi, G. Bertaglia, W. Boscheri, G. Dimarco, L. Pareschi, G. Toscani, and M. Zanella.\nKinetic modelling of epidemic dynamics: social contacts, control with uncertain data, and\nmultiscale spatial dynamics.\nIn Predicting Pandemics in a Globally Connected World:\nToward a Multiscale, Multidisciplinary Framework through Modeling and Simulation, vol-\nume 1, pages 43–108. Springer, 2022.\n[2] A. B. Amendolara, D. Sant, H. G. Rotstein, and E. Fortune. Lstm-based recurrent neural\nnetwork provides eﬀective short term ﬂu forecasting. BMC Public Health, 23(1):1788, 2023.\n15\n\n\n[3] N. Baker, F. Alexander, T. Bremer, A. Hagberg, Y. Kevrekidis, H. Najm, M. Parashar,\nA. Patra, J. Sethian, S. Wild, et al. Brochure on basic research needs for scientiﬁc machine\nlearning: Core technologies for artiﬁcial intelligence. Technical report, USDOE Oﬃce of\nScience (SC)(United States), 2018.\n[4] M. Barth´elemy, A. Barrat, R. Pastor-Satorras, and A. Vespignani. Dynamical patterns of\nepidemic outbreaks in complex heterogeneous networks. J. Theoret. Biol., 235(2):275–288,\n2005.\n[5] G. Beraud, S. Kazmercziak, P. Beutels, D. Levy-Bruhl, X. Lenne, N. Mielcarek, Y. Yaz-\ndanpanah, P.-Y. Boelle, N. Hens, and B. Dervaux. The french connection: The ﬁrst large\npopulation-based contact survey in france relevant for the spread of infectious diseases.\nPLoS ONE, 10(7), 2015.\n[6] S. Berkhahn and M. Ehrhardt.\nA physics-informed neural network to model COVID-\n19 infection and hospitalization scenarios. Advances in continuous and discrete models,\n2022(1):61, 2022.\n[7] G. Bertaglia, W. Boscheri, G. Dimarco, and L. Pareschi. Spatial spread of COVID-19 out-\nbreak in Italy using multiscale kinetic transport equations with uncertainty. Mathematical\nBiosciences and Engineering: MBE, 18(5):7028–7059, 2021.\n[8] G. Bertaglia, L. Liu, L. Pareschi, and X. Zhu. Bi-ﬁdelity stochastic collocation methods\nfor epidemic transport models with uncertainties. Networks and Heterogeneous Media,\n17(3):401–425, 2022.\n[9] G. Bertaglia, C. Lu, L. Pareschi, and X. Zhu. Asymptotic-preserving neural networks for\nmultiscale hyperbolic models of epidemic spread. Mathematical Models and Methods in\nApplied Sciences, 32(10):1949–1985, 2022.\n[10] G. Bontempi, S. Ben Taieb, and Y.-A. Le Borgne. Machine learning strategies for time\nseries forecasting. Business Intelligence: Second European Summer School, eBISS 2012,\nBrussels, Belgium, July 15-21, 2012, Tutorial Lectures 2, pages 62–77, 2013.\n[11] G. Bontempi, S. Ben Taieb, and Y.-A. Le Borgne. Machine learning for time-series epi-\ndemic modeling. Journal of AI & Healthcare, 7(3):295–310, 2023.\n[12] F. Brauer, C. Castillo-Chavez, and Z. Feng. Mathematical Models in Epidemiology, vol-\nume 69 of Texts in Applied Mathematics. Springer, New York, 2019. With a foreword by\nSimon Levin.\n[13] S. L. Brunton and J. N. Kutz. Data-driven science and engineering: Machine learning,\ndynamical systems, and control. Cambridge University Press, 2022.\n[14] B. Buonomo and R. Della Marca. Eﬀects of information-induced behavioural changes dur-\ning the COVID-19 lockdowns: The case of Italy. Royal Society Open Science, 7(3):201635,\n2020.\n[15] A. Capaldi, S. Behrend, B. Berman, J. Smith, J. Wright, and A. L. Lloyd. Parameter\nestimation and uncertainty quantication for an epidemic model. Mathematical biosciences\nand engineering, page 553, 2012.\n[16] V. Capasso and G. Serio.\nA generalization of the Kermack-McKendrick deterministic\nepidemic model. Mathematical Biosciences, 42(1):43–61, 1978.\n16\n\n\n[17] C.-L. Chen, D. B. Kaber, and P. G. Dempsey. A new approach to applying feedforward\nneural networks to the prediction of musculoskeletal disorder risk. Applied ergonomics,\n31(3):269–282, 2000.\n[18] G. Chowell. Fitting dynamic models to epidemic outbreaks with quantiﬁed uncertainty:\nA primer for parameter uncertainty, identiﬁability, and forecasts. Infectious Disease Mod-\nelling, 2(3):379–398, 2017.\n[19] Q. Cui, Z. Qiu, W. Liu, and Z. Hu. Complex dynamics of an SIR epidemic model with\nnonlinear saturate incidence and recovery rate. Entropy, 19(7):305, 2017.\n[20] T. De Ryck and S. Mishra. Numerical analysis of physics-informed neural networks and\nrelated models in physics-informed machine learning. Acta Numerica, 33:633’\n¨A`ı713, 2024.\n[21] O. Diekmann and J. A. P. Heesterbeek. Mathematical Epidemiology of Infectious Diseases:\nModel Building, Analysis and Interpretation. Wiley, Chichester, UK, 2000.\n[22] O. Diekmann, J. A. P. Heesterbeek, and J. A. J. Metz. On the deﬁnition and the compu-\ntation of the basic reproduction ratio R0 in models for infectious diseases in heterogeneous\npopulations. J. Math. Biol., 28(4):365–382, 1990.\n[23] G. Dimarco, B. Perthame, G. Toscani, and M. Zanella.\nKinetic models for epidemic\ndynamics with social heterogeneity. Journal of Mathematical Biology, 83(1):4, 2021.\n[24] N. Fadavi and N. Fadavi. Early recognition of parkinson’s disease through acoustic analysis\nand machine learning. World Journal of Advanced Research and Reviews, 23(2).\n[25] A. Fokas, N. Dikaios, and G. Kastis. Mathematical models and deep learning for predicting\nthe number of individuals reported to be infected with SARS-CoV-2. Journal of the Royal\nSociety Interface, 17(169):20200494, 2020.\n[26] M. Gatto, E. Bertuzzo, L. Mari, S. Miccoli, L. Carraro, R. Casagrandi, and A. Rinaldo.\nSpread and dynamics of the COVID-19 epidemic in italy: Eﬀects of emergency contain-\nment measures. Proceedings of the National Academy of Sciences of the United States of\nAmerica, 117(19):10484 ’\n¨A`ı 10491, 2020.\n[27] I. Goodfellow, Y. Bengio, and A. Courville.\nDeep Learning.\nMIT Press, 2016.\nhttp://www.deeplearningbook.org.\n[28] S. Han, L. Stelz, H. Stoecker, L. Wang, and K. Zhou. Approaching epidemiological dynam-\nics of COVID-19 with physics-informed neural networks. Journal of the Franklin Institute,\n361(6):106671, 2024.\n[29] H. W. Hethcote. The mathematics of infectious diseases. SIAM Review, 42(4):599–653,\n2000.\n[30] M. Jamshidi, A. Lalbakhsh, J. Talla, Z. Peroutka, F. Hadjilooei, P. Lalbakhsh,\nM. Jamshidi, L. La Spada, M. Mirmozafari, M. Dehghani, et al. Artiﬁcial intelligence and\nCOVID-19: deep learning approaches for diagnosis and treatment. Ieee Access, 8:109581–\n109595, 2020.\n[31] S. Jin, Z. Ma, and K. Wu. Asymptotic-preserving neural networks for multiscale time-\ndependent linear transport equations. Journal of Scientiﬁc Computing, 94(3):57, 2023.\n17\n\n\n[32] W. O. Kermack and A. G. McKendrick. A contribution to the mathematical theory of\nepidemics. Proceedings of the Royal Society of London. Series A, Containing Papers of a\nMathematical and Physical Character, 115(772):700–721, 1927.\n[33] V. La Gatta, V. Moscato, M. Postiglione, and G. Sperli. An epidemiological neural network\nexploiting dynamic graph structured data applied to the COVID-19 outbreak.\nIEEE\nTransactions on Big Data, 7(1):45–55, 2020.\n[34] Z. Li, Y. Zheng, J. Xin, and G. Zhou. A recurrent neural network and diﬀerential equa-\ntion based spatiotemporal infectious disease model with application to COVID-19.\nIn\n12th International Joint Conference on Knowledge Discovery, Knowledge Engineering and\nKnowledge Management, volume 1, 2020.\n[35] Z. Liao, P. Lan, X. Fan, B. Kelly, A. Innes, and Z. Liao. SIRVD-Dl: A COVID-19 deep\nlearning prediction model based on time-dependent SIRVD. Computers in Biology and\nMedicine, 138:104868, 2021.\n[36] D. Liu and A. Sopasakis. A combined neural ODE-bayesian optimization approach to\nresolve dynamics and estimate parameters for a modiﬁed sir model with immune memory.\nHeliyon, 10(19), 2024.\n[37] W.-m. Liu, S. A. Levin, and Y. Iwasa. Inﬂuence of nonlinear incidence rates upon the\nbehavior of SIRS epidemiological models. Journal of mathematical biology, 23:187–204,\n1986.\n[38] A. McInerney and K. Burke.\nA statistical modelling approach to feedforward neural\nnetwork model selection. Statistical Modelling, page 1471082X241258261, 2024.\n[39] K. Nabi, M. Tahmid, A. Raﬁ, M. Kader, and M. Haider. Comparative analysis of rnn and\ncnn for covid-19 forecasting. Results in Physics, 24:104137, 2021.\n[40] K. N. Nabi, M. T. Tahmid, A. Raﬁ, M. E. Kader, and M. A. Haider. Forecasting COVID-\n19 cases: A comparative analysis between recurrent and convolutional neural networks.\nResults in Physics, 24:104137, 2021.\n[41] K. I. Ouyoussef, J. El Karkri, L. M. Tine, and R. Aboulaich. Physics-informed neural\nnetworks for parameter estimation and simulation of a two-group epidemiological model.\nInternational Journal of Modeling, Simulation & Scientiﬁc Computing, 15(3), 2024.\n[42] E. Pashaei and E. Pashaei. Training feedforward neural network using enhanced black\nhole algorithm: a case study on COVID-19 related ACE2 gene expression classiﬁcation.\nArabian Journal for Science and Engineering, 46:3807–3828, 2021.\n[43] A. Puleio. Recurrent neural network ensemble, a new instrument for the prediction of\ninfectious diseases. The European Physical Journal Plus, 136(3):319, 2021.\n[44] V. S. H. Rao and M. N. Kumar. Estimation of the parameters of an infectious disease\nmodel using neural networks. Nonlinear Analysis: Real World Applications, 11(3):1810–\n1818, 2010.\n[45] S. Ruan and W. Wang.\nDynamical behavior of an epidemic model with a nonlinear\nincidence rate. Journal of diﬀerential equations, 188(1):135–163, 2003.\n18\n\n\n[46] Y. Tang, D. Huang, S. Ruan, and W. Zhang.\nCoexistence of limit cycles and homo-\nclinic loops in a SIRS model with a nonlinear incidence rate. SIAM Journal on Applied\nMathematics, 69(2):621–639, 2008.\n[47] L. Wang, X. Zheng, C. Sun, H. Li, and S. Zhang. Hybrid ai-epidemiology model for covid-19\nforecasting: Combining machine learning and mechanistic models. PLOS Computational\nBiology, 17(5):e1009050, 2021.\n19\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21033v1.pdf",
    "total_pages": 19,
    "title": "A data augmentation strategy for deep neural networks with application to epidemic modelling",
    "authors": [
      "Muhammad Awais",
      "Abu Sayfan Ali",
      "Giacomo Dimarco",
      "Federica Ferrarese",
      "Lorenzo Pareschi"
    ],
    "abstract": "In this work, we integrate the predictive capabilities of compartmental\ndisease dynamics models with machine learning ability to analyze complex,\nhigh-dimensional data and uncover patterns that conventional models may\noverlook. Specifically, we present a proof of concept demonstrating the\napplication of data-driven methods and deep neural networks to a recently\nintroduced SIR-type model with social features, including a saturated incidence\nrate, to improve epidemic prediction and forecasting. Our results show that a\nrobust data augmentation strategy trough suitable data-driven models can\nimprove the reliability of Feed-Forward Neural Networks (FNNs) and Nonlinear\nAutoregressive Networks (NARs), making them viable alternatives to\nPhysics-Informed Neural Networks (PINNs). This approach enhances the ability to\nhandle nonlinear dynamics and offers scalable, data-driven solutions for\nepidemic forecasting, prioritizing predictive accuracy over the constraints of\nphysics-based models. Numerical simulations of the post-lockdown phase of the\nCOVID-19 epidemic in Italy and Spain validate our methodology.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}