{
  "id": "arxiv_2502.21159v1",
  "text": "BBGKY hierarchy for quantum error mitigation\nTheo Saporiti\n,∗Oleg Kaikov\n, Vasily Sazonov\n, and Mohamed Tamaazousti\nUniversit´e Paris-Saclay, CEA, List, F-91120, Palaiseau, France\n(Dated: March 3, 2025)\nMitigation of quantum errors is critical for current NISQ devices. In the current work, we address this\ntask by treating the execution of quantum algorithms as the time evolution of an idealized physical\nsystem. We use knowledge of its physics to assist the mitigation of the quantum noise produced\non the real device. In particular, the time evolution of the idealized system obeys a corresponding\nBBGKY hierarchy of equations. This is the basis for the novel error mitigation scheme that we\npropose. Specifically, we employ a subset of the BBGKY hierarchy as supplementary constraints\nin the ZNE method for error mitigation. We ensure that the computational cost of the scheme\nscales polynomially with the system size. We test our method on digital quantum simulations of the\nlattice Schwinger model under noise levels mimicking realistic quantum hardware. We demonstrate\nthat our scheme systematically improves the error mitigation for the measurements of the particle\nnumber and the charge within this system. Relative to ZNE we obtain an average reduction of the\nerror by 18.2% and 52.8% for the respective above observables. We propose further applications of\nthe BBGKY hierarchy for quantum error mitigation.\nI.\nINTRODUCTION\nThe coupling of quantum computers to their surround-\ning environment is unavoidable, hence efficient methods\nto reduce quantum noise are highly demanded. While\nthe general theory of quantum error correction offers a\nframework to achieve fully fault-tolerant computations\n[1–4], its required qubit overhead remains prohibitively\nhigh for today’s quantum devices [5].\nAs an alterna-\ntive to the currently challenging quantum error correc-\ntion, quantum error mitigation (QEM) approaches were\nproposed [6–14]. Despite their fundamental limitations\n[15, 16], they remain the main available tools for the\ncurrent noisy intermediate-scale quantum (NISQ) devices\n[17] and for the upcoming early phases of fault-tolerant\ncomputing [18–20].\nIn this work, we empirically investigate how additional\ninformation provided by physics can improve the perfor-\nmance of QEM. The cornerstone idea of our approach is\nthat the time-evolved state of any noiseless quantum sys-\ntem, at any time during the computation process, obeys\na corresponding Schr¨odinger equation, so physical laws\ncan be used to verify quantum computations. Unfortu-\nnately, this idea alone is of small practical use, since a full\nquantum state tomography of exponentially many mea-\nsurements is required for the perfect knowledge of the\nstate.\nTo employ this concept in practice, one has to\ndramatically reduce the number of necessary measure-\nments, for instance by symmetry verification [21] or by\nusing N-representability conditions [22].\nIn this paper, we employ the fact that the full\ndynamics of the idealized system of NQ qubits can\nbe obtained from a quantum Bogoliubov-Born-Green-\nKirkwood-Yvon (BBGKY) hierarchy [23–26] of 4NQ\nequations.\nIn classical computations, to avoid imple-\n∗theo.saporiti@cea.fr\nmenting an exponentially large system of coupled dy-\nnamical equations, one generally truncates the hierarchy\nby modeling the high-order correlators or by assuming\ntheir vanishing [27–29]. However, for strongly correlated\nsystems or any general computational task, there are no\n(known) naturally small parameters justifying these trun-\ncations [29, 30]. In quantum computations, truncations\nare no longer necessary, as one can directly measure any\nobservable from the quantum device. One can then use\ncorresponding equations from the BBGKY hierarchy to\ntest the correctness of the measurements, hence of the\nquantum computations.\nIn this paper, we use the important fact that the\namount of terms in all hierarchical equations is bounded\nby poly(NQ), and by focusing on poly(NQ)-large sub-\nsets of the hierarchy, only a polynomial in NQ amount\nof additional classical resources is needed for the above-\nmentioned tests. We employ these supplementary infor-\nmations from the BBGKY hierarchy to improve the ZNE\nmethod [9, 31] in digital quantum simulations. Specifi-\ncally, we formulate a novel QEM scheme and apply it\nto the Schwinger model [32] brought to quantum lattice\nsimulations as a\n1\n2-spin model in the particular imple-\nmentation of [33]. The Schwinger model has been widely\nstudied and used as a benchmark toy model for quantum\ncomputations, for instance in the recent works [33–40].\nThe paper is structured as follows. In section II we\nderive and describe the BBGKY hierarchy. Section III\nis dedicated to our QEM method: in subsection III A we\nbriefly review the ZNE scheme, in subsection III B we\ndescribe how we select the BBGKY equations from the\nhierarchy, and in subsection III C we present our QEM\ntechnique.\nIn section IV we apply our method to the\nlattice Schwinger model. Finally in section V we conclude\nand discuss further potential applications of the method.\narXiv:2502.21159v1  [quant-ph]  28 Feb 2025\n\n\n2\nII.\nTHE BBGKY HIERARCHY\nWe begin by deriving the BBGKY hierarchy and by\ndiscussing its properties.\nConsider a quantum\n1\n2-spin model composed of NQ\nqubits, each of which is labeled by an index i\n∈\n{1, . . . , NQ} =: S.\nLet A ⊆S represent a subsystem\nof the spin model, and let\nσ(A, (µi)i∈A) :=\nY\ni∈A\nσµi\ni\n(1)\ndefine a Pauli string, where µi ∈{1, 2, 3} and σµi\ni\nis the\nPauli operator acting on the i-th qubit in the µi-th di-\nrection. Assume the model has an Hamiltonian of the\nform\nH := 1\n2\nX\ni∈S\nhµ\ni σµ\ni + 1\n4\nX\ni,j∈S\ni<j\nV µν\nij σµ\ni σν\nj ,\n(2)\nwhere hµ\ni is the interaction term of the i-th spin in the\nµ-th direction with an external magnetic field, V µν\nij\nis the\ninteraction potential term among the i-th and j-th spins\nof respective µ-th and ν-th directions, and where from\nnow on Einstein’s summation is implied. Moreover, here\nand throughout the work, we set ℏ= c = 1.\nIf one injects (1) and (2) into Ehrenfest’s theorem and\ncomputes all the commutators, one obtains [41]\nd\ndt\n*Y\ni∈A\nσµi\ni\n+\n=\nX\ni,j∈A\ni̸=j\nV µiν\nij\n2\nεµjνλ\n*\nσλ\nj\nY\nk∈A\\{i,j}\nσµk\nk\n+\n+\nX\ni∈A\nhλ\ni εµiλν\n*\nσν\ni\nY\nj∈A\\{i}\nσµj\nj\n+\n+\nX\ni∈A\nj /∈A\nV µν\nij\n2 εµiµλ\n*\nσλ\ni σν\nj\nY\nk∈A\\{i}\nσµk\nk\n+\n,\n(3)\nwhere εµνλ is the three-dimensional Levi-Civita symbol.\nWe call (3) the BBGKY equation of the σ(A, (µi)i∈A)\nPauli string.\nThis is because, if one considers all the\nPauli strings of all possible directions (namely all par-\ntitions A ⊆S of all possible (µi)i∈A) then, by comput-\ning all their associated BBGKY equations (3), the com-\nplete exponentially large BBGKY-like hierarchy is gener-\nated. More precisely, for a specific Pauli string of length\n|A| = n ≤NQ, the time derivative of that n-point cor-\nrelator is determined by a linear combination of (n −1)-\npoint, n-point and (n + 1)-point correlators, respectively\nfound in the first, second and third summations of (3), all\nselected according to the values hµ\ni and V µν\nij\nin (2). The\nright-hand side (RHS) of (3) contains up to 9n(n −1)-\nmany (n −1)-point correlators, up to 9n-many n-point\ncorrelators, and up to 27n(NQ −n)-many (n + 1)-point\ncorrelators. Importantly, this implies that the amount of\ncorrelators in the RHS of (3) is polynomial in n and NQ,\nand bounded by 81N 2\nQ/8.\nIII.\nMITIGATION TECHNIQUE\nIn this section, we provide a short review of ZNE in the\ncontext of time evolution. Then we present our method,\na BBGKY-improved ZNE scheme, which we formulate as\na post-processing linear least-squares (LLSQ) optimiza-\ntion procedure. Our method incorporates a poly(NQ)-\nlarge subset of the BBGKY hierarchy evaluated across\nall time points. We consider the list of l Pauli strings\n{Qq}q∈{0,...,l−1}, where for brevity Qq is defined as in\n(1). Our goal is to mitigate the corresponding measure-\nments obtained from a realistic quantum device. We fo-\ncus solely on Pauli strings because they form an operator\nbasis for the observables of the system.\nA.\nThe ZNE method\nBy Trotterization, the evolution time T is discretized\ninto N slices of duration ∆t := T/N, and evolution steps\nare obtained thanks to a Suzuki-Trotter decomposition\nscheme of order dST [42–45]. Then, different realizations\nof the quantum circuit implementing the time evolution\nare generated, each of them containing local unitary fold-\nings [10] with a frequency of η ≥0 insertions per step.\nUnder the assumption that unitary foldings are affected\nby the same kind of noise as regular evolution steps, this\nimplies an error level at the s-th step s ∈{0, . . . , N}\nrelative to the original η = 0 circuit of\n1 ≤εsη := s + 2 ⌊ηs⌋\ns\ns→∞\n−−−→2η + 1.\n(4)\nPerforming the above m times with different noise levels\nη ∈(η1, . . . , ηm) =: ⃗η, at each time point ts := s∆t,\nwe end up with an experimentally measured set of data\npoints (εsη, ⟨Qq⟩sη), where ⟨Qq⟩sη is the measurement\nof Qq at time point ts, estimated with NS shots, under\nthe η noise level [46]. For a given quantity at a given\ntime point, these experimentally measured points can be\ninterpolated across the error levels with a least-squares\npolynomial (LSP) in ε of degree d ≤m −1, leading to a\nzero noise ε →0 extrapolated\n\nQ0\nq\n\u000b\ns [9, 10].\nB.\nSelection of BBGKY equations\nGiven the set of expectation values {⟨Qq⟩}q∈{0,...,l−1},\nthe physical knowledge provided by a BBGKY equa-\ntion can help their mitigation if and only if its associ-\nated Pauli string is hierarchically connected to any of\nthe {Qq}q∈{0,...,l−1}.\nFor a given generic σ(A, (µi)i∈A), the RHS of equa-\ntion (3) provides all of the correlators σ(B, (νi)i∈B),\nwith B ⊆S of directions (νi)i∈B, that are connected\nto its time evolution via the hierarchy. In that case, we\nsay that the σ(B, (νi)i∈B) are downstream connected to\nσ(A, (µi)i∈A). We now want to determine the inverse,\n\n\n3\na1\na2\na3\nb\nc1\nc2\nc3\nn + 1\nn −1\nn\nFIG. 1. In this diagram, b is a Pauli string of interest, and\na1, c1 are (n + 1)-point correlators, a2, b, c2 are n-point corre-\nlators, and a3, c3 are (n −1)-point correlators. All c1, c2, c3\nare downstream connected to b, and all a1, a2, a3 are upstream\nconnected to b.\nthat is, given a Pauli string σ(B, (νi)i∈B), find all cor-\nrelators σ(A, (µi)i∈A) generating σ(B, (νi)i∈B) in their\nRHS of (3). In that case, we say that σ(A, (µi)i∈A) is\nupstream connected to σ(B, (νi)i∈B).\nOverall, we say\nthat a correlator is connected to a Pauli string of interest\nif it is either downstream or upstream connected to that\nPauli string.\nTo\nfind\nall\nupstream\nconnected\ncorrelators\nσ(A, (µi)i∈A)\nto\na\ngiven\nσ(B, (νi)i∈B),\nthere\nare\nonly 3 possibilities: denoting nA = |A| and nB = |B|,\nσ(B, (νi)i∈B) can appear in the BBGKY equation of\nσ(A, (µi)i∈A) either as an (nA + 1)-point, nA-point or\n(nA −1)-point correlator.\nThe selection rules to find\nσ(A, (µi)i∈A) candidates in all three cases are derived in\nappendix A. There we also show that, importantly, the\nupper bound for the amount of ans¨atze one has to check\nto pick up all the upstream connected σ(A, (µi)i∈A) is\npolynomial in NQ. Figure 1 schematically summarizes\nthe two possible kinds of connections.\nFor our mitigation purposes, we select the BBGKY\nequations associated to the subset of the BBGKY hier-\narchy whose Pauli strings are connected to any of the\n{Qq}q∈{0,...,l−1} by at most r connections. The subset\nis obtained by iteratively computing over itself all of\nits downstream and upstream connected Pauli strings,\nas explained in appendix A, for a total of r iterations.\nThis generates a list of g BBGKY equations containing\nΛ ≥l correlators, the actual amount of expectation val-\nues {⟨Qq⟩}q∈{0,...,l−1,l,...,Λ−1} that have to be measured.\nC.\nOur BBGKY-improved ZNE method\nOur method aims at improving the ZNE-obtained mea-\nsurements\n\nQ0\nq\n\u000b\ns with better BBGKY-constrained\n\nQ∅\nq\n\u000b\ns\nextrapolations.\nBecause ZNE is a LLSQ minimization\nprocedure, we want to incorporate the selected BBGKY\nequations as linear combinations of\n\nQ∅\nq\n\u000b\ns. To do so, we\napproximate the time derivatives in (3) with derivatives\nof a Bernstein polynomial, fitting the N +1 extrapolated\nexpectation values.\nWe use (derivatives of) Bernstein\npolynomials because they are linear in the\n\nQ∅\nq\n\u000b\ns and\nbecause they uniformly converge to the functions (deriva-\nε\nts+1\n⟨Q∅\nq⟩(t)\n⟨Q∅\nq⟩s\nts\nts+2\n⟨Q0\nq⟩s\n(εs+1,η, ⟨Qq⟩s+1,η)\nFIG. 2. Schematic depiction of our method: each slice of data\n(red crosses) is interpolated with a LSP (dotted gray lines),\nproducing a series of intermediate ZNEs (dark red points),\nwhich in turn are fitted with a Bernstein polynomial (pur-\nple line), giving access to time derivatives at each time point\n(purple squares). These are then used to improve the ZNEs\nthanks to the BBGKY equations, producing different LSPs\n(continuous gray lines) leading to BBGKY-improved ZNEs\n(black circles). The dashed black lines represent the ε ≥1\nbound.\ntives) they are fitting, with an error of the order O(1/N)\n[47]. Starting from the Bernstein polynomial [48]\n\nQ∅\nq\n\u000b\n(t) :=\nN\nX\ns=0\n\nQ∅\nq\n\u000b\ns bsN\n\u0012 t\nT\n\u0013\n,\n(5)\nconstructed out of the N + 1 Bernstein polynomial basis\nelements bsN(x) of degree N, with x ∈[0, 1] hence t ∈\n[0, T], then\nd\ndt\n\nQ∅\nq\n\u000b\n(t) =\nN\nX\ns=0\n\nQ∅\nq\n\u000b\ns βsN\n\u0012 t\nT\n\u0013\n,\n(6)\nwhere we define\nβsN(x) := 1\n∆t\n\n\n\n\n\n−(1 −x)N−1\nif s = 0\nxN−1\nif s = N\nbs−1,N−1(x) −bs,N−1(x)\notherwise\n.\n(7)\nUsing the approximate time derivatives (6), approxi-\nmations of the BBGKY equations (3) can be expressed\nas linear combinations of\n\nQ∅\nq\n\u000b\ns. Thereby, BBGKY equa-\ntions can be cast inside the original ZNE LLSQ procedure\nas additional constraints of the minimization problem\nargmin\n⃗a\n1\n2∥⃗v(⃗a)∥2\nwith\n⃗v(⃗a) := M⃗a −⃗y,\n(8)\nwhere ⃗a will be defined later in (11) and where\nM :=\n\u0012\nM⃗η\nG\n\u0013\nwith\nM⃗η :=\nΛ−1\nM\nq=0\nN\nM\ns=1\n\n\n\nεd\nsη1\n. . . 1\n...\n... ...\nεd\nsηm . . . 1\n\n\n\n|\n{z\n}\n=:Ms⃗η\n.\n(9)\n\n\n4\nHere\nMs⃗η\nis\na\nVandermonde-like\nmatrix,\nG\nis\nfilled\nwith\ng(N + 1)\nlines\nof\nappropriate\nentries\nencoding\nthe\ncorresponding\nBBGKY\nequations\nat\nevery\ntime\npoint\nts,\nand\nthe\ntarget\nvector\n⃗y := ((⃗y01⃗η, . . . ,⃗y0N⃗η), . . . , (⃗yΛ−1,1,⃗η, . . . ,⃗yΛ−1,N,⃗η),⃗g)\nsequentially groups all s ≥1 experimental measure-\nments ⃗yqs⃗η := (⟨Qq⟩sη1 , . . . , ⟨Qq⟩sηm) together with the\ng(N + 1)-long ⃗g vector encoding the s = 0 expectation\nvalues of the BBGKY equations.\nWe do not mitigate\nany\n\nQ∅\nq\n\u000b\n0 because they can be numerically computed\nwith arbitrary precision at t = 0, hence they are known\na priori. Notice that by setting g = 0 one recovers the\noriginal ZNE procedures, in which case\n\nQ∅\nq\n\u000b\n=\n\nQ0\nq\n\u000b\nand M\ndecouples into N\nindependent ZNEs,\neach\nminimizing the error on\n⟨Qq⟩sη ≈\n\nQ∅\nq\n\u000b\ns +\nd\nX\nδ=1\naqsδεδ\nsη,\n(10)\nwhere all LSP coefficients aqsδ are packed into\n⃗a := ((⃗a01, . . . ,⃗a0N), . . . , (⃗aΛ−1,1, . . . ,⃗aΛ−1,N)),\n(11)\nwith ⃗aqs := (aqsd, . . . , aqs1,\n\nQ∅\nq\n\u000b\ns). In particular,\n\nQ∅\nq\n\u000b\ns\ncan be extracted from (⃗a)p at index p = p(q, s) =\n(d + 1) + (s −1)(d + 1) + q(d + 1)N.\nFinally, no-\ntice that M is a rectangular matrix of polynomial size\n[mNΛ + g(N + 1)] × (d + 1)NΛ, and that G couples to-\ngether all extrapolated\n\nQ∅\nq\n\u000b\ns in two ways: across all time\npoints, as in (6), and according to their connections in\nthe hierarchy, as in (3). Figure 2 graphically represents\nour method, and in appendix C we give an example of\nan M matrix.\nIV.\nRESULTS OF THE MITIGATION\nWe now briefly overview the lattice Schwinger model\nand the quantities we want to mitigate with our method.\nWe then show and discuss the obtained numerical results.\nA.\nThe lattice Schwinger model\nThe Schwinger model [32] describes one-dimensional\nquantum electrodynamics. This continuous model can be\nbrought to its lattice Hamiltonian formulation via Kogut-\nSusskind construction [49]. Then, the original degrees of\nfreedom can be recast into quantum\n1\n2-spins [50] with\nopen boundary conditions [33]. We test our method on\nthe latter, whose (dimensionless) Hamiltonian is\nH := −m\ng\n√x\nX\ni∈S\n(−1)iσ3\ni\n+\nNQ−1\nX\ni=1\n\u0012NQ\n4\n−1\n2\n\u0018i −1\n2\n\u0019\n+ l0(NQ −i)\n\u0013\nσ3\ni\n+ x\n2\nNQ−1\nX\ni=1\n\u0000σ1\ni σ1\ni+1 + σ2\ni σ2\ni+1\n\u0001\n+ 1\n2\nX\ni,j∈S\ni<j\n(NQ −j + λ)σ3\ni σ3\nj ,\n(12)\nwhere m/g is the lattice mass over coupling ratio, x =\n(NQ/V )2 with V the (dimensionless) lattice volume, l0\nthe background electric field, λ ≫1 a Lagrange mul-\ntiplier to restrict simulations within the vanishing total\ncharge sector, and a final constant term was disregarded.\nThe Hamiltonian (12) is in the appropriate form of (2),\nand we are interested in the Pauli strings of the quantities\nQ := 1\n2\nX\ni∈S\nσ3\ni\nand\nP := NQ\n2\n−1\n2\nX\ni∈S\n(−1)iσ3\ni .\n(13)\nThese are, respectively, the electric charge operator and\nthe particle number operator. Moreover [Q, H] = 0 and\n[P, H] ̸= 0, meaning that they represent two distinct be-\nhaviors over which we can test our method: ⟨P⟩will vary\nin time while ⟨Q⟩will stay constant. In the following, we\nwill often employ the abuses of notation Qq = Q, P with\nq = Q, P to indicate the mitigation of the above linear\ncombinations of Pauli strings.\nB.\nNumerical framework\nWe assess the effectiveness of our method against ZNE\nwith, respectively, the following 2-norms\nL∅\nq :=\nv\nu\nu\nt∆t\nN\nX\ns=0\nh\nQ∅q\n\u000b\ns −⟨Qq⟩(ts)\ni2\n,\n(14)\nL0\nq :=\nv\nu\nu\nt∆t\nN\nX\ns=0\nh\nQ0q\n\u000b\ns −⟨Qq⟩(ts)\ni2\n,\n(15)\nwhich quantify the accumulated error of the extrapola-\ntions against the exact diagonalization (ED) evolution\n⟨Qq⟩(t) over all time points ts. All of our computations\nare performed in Qiskit 1.3 [51] within a simulated quan-\ntum device whose realistic noise model is generated in\nreal time from the backend physical properties of the\nIBM Brisbane quantum processor [52].\nIn the follow-\ning, we fix the parameters NQ = 4, initial state |0101⟩,\nNS = 10240, N = 20, T = 4, ⃗η = (0, 1, 1.5, 2), dST = 1,\nd = 2, λ = 100 and V = 30 [33].\nUnless otherwise\nstated we fix r = 0, while the remaining parameters m/g\n\n\n5\nand l0 will vary throughout these simulations. We sys-\ntematically check through an idealized noiseless simula-\ntion that, for every simulation, the total Trotter error of\norder O\n\u0000(∆t)dST\u0001\ntogether with the shot noise of order\nO\n\u00001/√NS\n\u0001\nis no bigger than 0.02 with respect to the ED\nevolution.\nC.\nNumerical results\nFigure 3 shows, for the P observable, a parameter scan\nof 10×10 blocks over the region (l0, m/g) ∈[0, 1.5]2 where\nit is computed, in the top panel, the error of ZNE with\nrespect to the ED dynamics and, in the bottom panel,\nthe improvement of our method with respect to ZNE.\nThe top panel gives us the scale of the ZNE error, and\nthe bottom panel tells us by how much that error was\nreduced within our BBGKY-improved scheme.\nA sys-\ntematic improvement over the entire parameter-region\nis manifest by the presence of only negative L∅\nP −L0\nP\nvalues and, taking average values as in table I, it is ap-\nproximately 18.2%. The diagonal line in both panels can\nbe explained by a system-dependent artifact caused by\nthe alignment of the ED dynamics to the saturation, or\nflattening, of the measurements as in figure 4.\nFigure 4 shows the time evolution of the (l0, m/g) =\n(0, 0) block of figure 3. We see that after ∼15 Trotter\nsteps the measurements saturate, and recovering the orig-\ninal dynamics becomes challenging. Nevertheless, thanks\nto the additional BBGKY constraints, we see that the\nBernstein polynomial correctly tries to match the time\n0.0\n0.5\n1.0\n1.5\nm/g\n0.0\n0.5\n1.0\n1.5\nl0\n0.0\n0.5\n1.0\n1.5\nm/g\n0.5\n1.0\n1.5\n2.0\n2.5\nL0\nP\n−0.35\n−0.30\n−0.25\n−0.20\nL∅\nP −L0\nP\nFIG. 3. Top panel: improvement of the ZNE mitigation for\nthe particle number ⟨P⟩with respect to the ED evolution.\nBottom panel: advantage of our method compared to the top\npanel.\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\n3.5\n4.0\nt\n2.0\n2.5\n3.0\n3.5\n4.0\n⟨P⟩\n⟨P⟩sη1\n⟨P⟩sη2\n⟨P⟩sη3\n⟨P⟩sη4\n\nP 0\u000b\n\nP ∅\u000b\n\nP ∅\u000b\n(t)\n⟨P⟩(t)\nFIG. 4.\nEvolution of the particle number ⟨P⟩in the\n(l0, m/g) = (0, 0) regime. The red crosses are measurements\nat increasing noise levels, the dark red points are ZNEs, the\nblack circles are BBGKY-improved ZNEs, the purple line is\nthe Bernstein polynomial associated to the latter, and the\ndashed gray line is the ED evolution.\nderivatives of the ED evolution.\nFigure 5 shows the contents of figure 3 but for the\nQ observable. Again, a systematic improvement over the\nentire parameter-region is observed with our method and,\nfrom table I, we see that it is approximately 52.8% with\nrespect to ZNE. Here the bottom-left artifact region of\nthe bottom panel can be explained by the small values of\n(l0, m/g), reducing the importance of the BBGKY equa-\ntions in the LLSQ minimization.\n0.0\n0.5\n1.0\n1.5\nm/g\n0.0\n0.5\n1.0\n1.5\nl0\n0.0\n0.5\n1.0\n1.5\nm/g\n0.124\n0.126\n0.128\n0.130\nL0\nQ\n−0.070\n−0.068\n−0.066\n−0.064\nL∅\nQ −L0\nQ\nFIG. 5. Top panel: improvement of the ZNE mitigation for\nthe electric charge ⟨Q⟩with respect to the ED evolution. Bot-\ntom panel: advantage of our method compared to the top\npanel.\n\n\n6\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\n3.5\n4.0\nt\n−0.05\n0.00\n0.05\n0.10\n⟨Q⟩\n⟨Q⟩sη1\n⟨Q⟩sη2\n⟨Q⟩sη3\n⟨Q⟩sη4\n\nQ0\u000b\n\nQ∅\u000b\n\nQ∅\u000b\n(t)\n⟨Q⟩(t)\nFIG. 6. Evolution of the electric charge ⟨Q⟩in the (l0, m/g) =\n(0, 0) regime. The same symbols and colors of figure 4 are\nused.\nFigure 6 shows the time evolution of the (l0, m/g) =\n(0, 0) block of figure 5. Here, no saturation phenomenon\noccurs, because all measurements remain equally noisy.\nNevertheless, thanks to the additional BBGKY con-\nstraints, we see again that the Bernstein polynomial cor-\nrectly tries to match the null time derivative of the con-\nserved quantity Q.\nTable I summarizes as averages the errors, the absolute\nand the relative improvements of the previous two pa-\nrameter scans, shown in figures 3 and 5. Again, with our\nmethod, we see a systematic improvement of the two mit-\nigations with respect to ZNE, for both the non-conserved\nP and the conserved Q, although we observe a larger\nrelative improvement in the mitigation of ⟨Q⟩. This is\nbecause noise concentrates around the ED evolution in\nfigure 6 so, in the minimization of the LLSQ problem,\nthe Bernstein polynomial is less penalized in deviating\nfrom the ZNE to match the null time derivative of ⟨Q⟩.\nWe now study how the size of the selected subset of\nBBGKY equations affects the results of the mitigation.\nThis is displayed in figure 7, where the mitigation of ⟨P⟩\nin the (l0, m/g) = (0, 0) block is repeated for different\nmaximal connections radii r. The top panel displays the\nerrors of the ZNE and BBGKY-improved mitigations,\nq\nL0\nq (ZNE)\nL∅\nq (Ours)\nL∅\nq −L0\nq\n(L∅\nq −L0\nq)/L0\nq\nP\n1.975\n1.659\n-0.316\n-18.2%\nQ\n0.128\n0.060\n-0.068\n-52.8%\nTABLE I. First column: average errors of ZNE against ED.\nSecond column: average errors of our method against ED.\nThird column: absolute average improvements of our method\nagainst ZNE. Fourth column: relative average improvements\nof our method against ZNE. The averages for the q = P, Q\nobservables are computed, respectively, from the data of fig-\nures 3 and 5.\n0.4\n0.6\nL∅\nP, L0\nP\n0\n1\n2\n3\n4\n5\n6\n7\nr\n0.0\n0.5\n1.0\ng/Λ\nFIG. 7. Top panel: errors for the mitigation of the particle\nnumber ⟨P⟩, in the (l0, m/g) = (0, 0) regime at different r,\nwith ZNE (dark red points) and our method (black circles).\nBottom panel: determination of the hierarchical subset.\nwhile the bottom panel quantifies how many BBGKY\nequations g cover the dynamics of the measured Λ quan-\ntities.\nA ratio of g/Λ = 1, which is reached at r = 6 and\nremains so at r = 7, means that the subset of equations\nis fully determined with respect to its unknowns. In the\npresent case Λ = 126 < 256 = 4NQ, because the BBGKY\nhierarchy splits into 4 independent hierarchies of sizes\n1, 1, 126 and 128.\nIn particular, the two first hierar-\nchies are composed, respectively, of solely the identity\nand σ3\n1σ3\n2σ3\n3σ3\n4, which are conserved quantities of (12).\nThe third hierarchy involves {σ3\ni }i∈S, which are required\nto build the conserved Q observable.\nWe see that the inclusion of additional BBGKY con-\nstraints reduces the error with respect to ZNE immedi-\nately starting from r = 0, in accordance with figure 3.\nIn our experiments with the Schwinger model, no clear\npattern regarding the reduction or the increase of ab-\nsolute errors can be stated for r > 0, neither in this\n(l0, m/g) = (0, 0) simulation nor in other different points\nof the parameter scan. We conjecture that a similar be-\nhavior is valid for other systems and therefore the op-\ntimal regime of our method lies close to a small r = 0\nhierarchical subset. This is because, given the ratio of\nthe number of lines in the M matrix distributed among\nZNE and the BBGKY equations, the LLSQ problem pre-\nvents the Bernstein polynomial from deviating too much\nfrom the original ZNEs even as g increases. Moreover,\nthe number of time points N may be too small for the\nBernstein polynomial to benefit from its uniform conver-\ngence, leading to a systematic non-negligible additional\napproximation error from (6).\nV.\nCONCLUSIONS\nIn this paper, we considered executions of quantum al-\ngorithms as time evolutions of idealized systems. Their\nnoiseless dynamics are governed by physical laws, which\n\n\n7\ncan be employed to mitigate the quantum errors aris-\ning from their physical realizations.\nFor this purpose,\nwe derived a corresponding BBGKY-like hierarchy and\nselected a poly(NQ)-large subset of its equations.\nWe\nproposed a novel QEM scheme encapsulating these sup-\nplementary physics-informed constraints into the ZNE\nprocedure. A LLSQ problem is thereby obtained, whose\nrequired classical computational resources scale polyno-\nmially in NQ. We numerically investigated the effective-\nness of our method on digital quantum simulations, mim-\nicking realistic quantum hardware noise, of the lattice\nSchwinger model.\nBy applying our method to the lattice Schwinger\nmodel, we assessed our BBGKY-informed QEM scheme\nagainst ZNE by comparing the mitigation of quantum\nobservables to known ED evolutions. It was found that,\nin the considered regions of the parameter scan and un-\nder the selected input parameters, our method systemat-\nically improves the QEM of ZNE measurements. More-\nover, with our method, it was found that the range of\nrelative improvement of the error with respect to ZNE\nspans from 18.2% to 52.8%, depending on whether the\nmitigated quantity is conserved or not. It was found that\nthe maximal connections radius of the selected hierarchi-\ncal subset should be close to r = 0, as such a subset of\nBBGKY equations already guarantees a systematic im-\nprovement over ZNE.\nFurther expansion of this work includes imaginary time\nevolution and evolution with time-dependent Hamiltoni-\nans. The latter would pave the way to the mitigation of\nadiabatic time evolution. This would also allow the miti-\ngation of quantum circuits, if implemented as Trotterized\ntime evolutions of a time-dependent system. Finally, the\nsupplementary physical knowledge of the BBGKY hierar-\nchy could be used to not only help ZNE but other mitiga-\ntion schemes as well, either on digital or analog quantum\nmachines. This could be done either as an entirely post-\nprocessing procedure, or directly affecting the parameters\nof quantum computation, as in variational methods.\nACKNOWLEDGMENTS\nThis work has received support from the French\nState managed by the National Research Agency un-\nder the France 2030 program with reference ANR-22-\nPNCQ0002. We acknowledge the use of IBM Quantum\nservices for this work.\nThe views expressed are those\nof the authors, and do not reflect the official policy or\nposition of IBM or the IBM Quantum team.\nAppendix A: Upstream connected correlators\nHere we derive an algorithm composed of three sub-\nroutines to obtain all σ(A, (µk)k∈A) correlators upstream\nconnected to the target σ(B, (νk)k∈B). First, define the\nfunction ¯ε(µ, ν) := λ|εµνλ|, where Einstein’s summation\nis still implied, to be interpreted as that index such that\nεµν¯ε(µ,ν) ̸= 0. Let also nA = |A| and nB = |B|.\nFor the nA = nB case, we observe in the second sum-\nmation of (3) that, for σ(B, (νk)k∈B) to appear in the\nexpectation value, it must be A = B.\nRegarding the\ndirections (µk)k∈A, selecting an i ∈A (nB choices) and\nletting µk = νk for all k ∈A \\ {i}, we see that if we want\nν to pick up the desired ν = νi value then, because of the\nLevi-Civita symbol, it must be µi ̸= νi (2 choices). Then\nλ = ¯ε(µi, νi), hence σ(B, (νi)i∈B) appears in the second\nsummation only if\nh¯ε(µi,νi)\ni\n̸= 0.\n(A1)\nIn total, 2nB possible σ(A, (µk)k∈A) ans¨atze have to be\nchecked against the magnetic field.\nFor the nA = nB −1 case, we observe in the third\nsummation of (3) that, for σ(B, (νk)k∈B) to appear in\nthe expectation value, it must be A = B \\ {j} for a\nselected j ∈B (nB choices). Regarding the directions\n(µk)k∈A, selecting a specific i ∈A (nB −1 choices) and\nletting µk = νk for all k ∈A \\ {i}, we see that if we want\nλ to pick up the desired λ = νi value then, again because\nof the Levi-Civita symbol, it must be µi ̸= νi (2 choices).\nThen µ = ¯ε(µi, νi), hence σ(B, (νk)k∈B) appears in the\nthird summation only if\nV ¯ε(µi,νi)νj\nij\n̸= 0.\n(A2)\nNotice that the index ν will necessarily pick ν = νj be-\ncause it is contracted independently. In total, 2nB(nB −\n1) possible σ(A, (µk)k∈A) ans¨atze have to be checked\nagainst the interaction potential.\nFor the nA = nB + 1 case, we observe in the first sum-\nmation of (3) that, for σ(B, (νk)k∈B) to appear in the\nexpectation value, it must be A = B ∪{i} for a selected\ni ∈S \\ B (NQ −nB choices). Regarding the directions\n(µk)k∈A, selecting a specific j ∈B (nB choices) and let-\nting µk = νk for all k ∈A \\ {i, j} and µi ∈{1, 2, 3}\n(3 choices), we see that if we want λ to pick up the de-\nsired λ = νj value then, once again because of the Levi-\nCivita symbol, it must be µj ̸= νj (2 choices).\nThen\nν = ¯ε(µj, νj), hence σ(B, (νk)k∈B) appears in the first\nsummation only if\nV µi¯ε(µj,νj)\nij\n̸= 0.\n(A3)\nIn total, 6nB(NQ −nB) possible σ(A, (µk)k∈A) ans¨atze\nhave to be checked against the interaction potential.\nTo sum things up, there is a polynomial in nB and NQ\namount of ans¨atze to check against the coefficients of (2),\nand the number of checks is overall bounded by 9N 2\nQ/4.\nAppendix B: Random shift of error levels\nEvery time (4) is employed to measure a (εsη, ⟨Qq⟩sη)\ndata point, a small random shift εsη →εsη + χ is per-\nformed, where χ is a realization of the normally dis-\ntributed random variable X ∼N(0, 1/NS). This is to\n\n\n8\navoid cases where two different noise levels η1 ̸= η2\nproduce the same error level, for example η1 = 1 and\nη2 = 1.5 leading to ε1η1 = ε1η2 = 3, thereby introducing\nartifacts in the LSP interpolation. The variance of X is\nchosen to be 1/NS to mimic the standard deviation es-\ntimator when NS →∞and also because, in that limit,\nthe χ shift shouldn’t affect εsη, as quantum errors had\nan infinite NS →∞amount of possibilities to arise.\nAppendix C: Example of an M matrix\nTo illustrate the construction of M with a simple yet\nnon-trivial example, consider the mitigation of l = Λ = 2\nquantities after N = 2 Trotter steps with the g = 2\nfictitious BBGKY equations\nd\ndt ⟨Q0⟩= 0\nand\nd\ndt ⟨Q1⟩= V ⟨Q0⟩,\n(C1)\nwhere V ̸= 0 is constant and Q0, Q1 are, respectively,\nn-point and (n + 1)-point correlators. Then, in this ex-\nample, the ⃗v vector is given by\n⃗v(⃗a) =\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nεd\n1η1\n1\nεd\n1ηm\n1\nεd\n2η1\n1\nεd\n2ηm\n1\nεd\n1η1\n1\nεd\n1ηm\n1\nεd\n2η1\n1\nεd\n2ηm\n1\nM1⃗η\nM2⃗η\nM1⃗η\nM2⃗η\nG\nβ12(0)\nβ22(0)\nβ12( 1\n2)\nβ22( 1\n2)\nβ12(1)\nβ22(1)\nβ12(0)\nβ22(0)\n−V\nβ12( 1\n2)\nβ22( 1\n2)\n−V\nβ12(1)\nβ22(1)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nQ0\nz\n}|\n{\nQ1\nz\n}|\n{\nt1\nz\n}|\n{\nt2\nz\n}|\n{\n|\n{z\n}\nt1\n|\n{z\n}\nt2\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n|\n{z\n}\nM\n·\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\na01d\n⟨Q∅\n0⟩1\na02d\n⟨Q∅\n0⟩2\na11d\n⟨Q∅\n1⟩1\na12d\n⟨Q∅\n1⟩2\n⃗a01\n⃗a02\n⃗a11\n⃗a12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n| {z }\n⃗a\n−\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n⟨Q0⟩1η1\n⟨Q0⟩1ηm\n⟨Q0⟩2η1\n⟨Q0⟩2ηm\n⟨Q1⟩1η1\n⟨Q1⟩1ηm\n⟨Q1⟩2η1\n⟨Q1⟩2ηm\n−β02(0) ⟨Q∅\n0⟩0\n−β02( 1\n2) ⟨Q∅\n0⟩0\n−β02(1) ⟨Q∅\n0⟩0\n(V −β02(0)) ⟨Q∅\n1⟩0\n−β02( 1\n2) ⟨Q∅\n1⟩0\n−β02(1) ⟨Q∅\n1⟩0\n⃗y01⃗η\n⃗y02⃗η\n⃗y11⃗η\n⃗y12⃗η\n⃗g\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n|\n{z\n}\n⃗y\n.\n(C2)\n[1] P. W. Shor, Scheme for reducing decoherence in quantum\ncomputer memory, Phys. Rev. A 52, R2493 (1995).\n[2] A. M. Steane, Error Correcting Codes in Quantum The-\nory, Phys. Rev. Lett. 77, 793 (1996).\n[3] A. R. Calderbank and P. W. Shor, Good quantum error-\ncorrecting codes exist, Phys. Rev. A 54, 1098 (1996).\n[4] M. A. Nielsen and I. L. Chuang, Quantum Computa-\ntion and Quantum Information: 10th Anniversary Edi-\ntion (Cambridge University Press, 2010).\n[5] A. Chatterjee,\nA. Ghosh, and S. Ghosh, Quantum\nPrometheus: Defying Overhead with Recycled Ancillas\nin Quantum Error Correction, (2024), arXiv:2411.12813\n\n\n9\n[quant-ph].\n[6] N. Ezzell, B. Pokharel, L. Tewala, G. Quiroz, and D. A.\nLidar, Dynamical decoupling for superconducting qubits:\nA performance survey, Phys. Rev. Appl. 20, 064027\n(2023).\n[7] J. J. Wallman and J. Emerson, Noise tailoring for scalable\nquantum computation via randomized compiling, Phys.\nRev. A 94, 052325 (2016).\n[8] E. van den Berg, Z. K. Minev, and K. Temme, Model-free\nreadout-error mitigation for quantum expectation values,\nPhys. Rev. A 105, 032620 (2022).\n[9] K. Temme, S. Bravyi, and J. M. Gambetta, Error Mit-\nigation for Short-Depth Quantum Circuits, Phys. Rev.\nLett. 119, 180509 (2017).\n[10] T. Giurgica-Tiron, Y. Hindy, R. LaRose, A. Mari, and\nW. J. Zeng, Digital zero noise extrapolation for quan-\ntum error mitigation, in 2020 IEEE International Con-\nference on Quantum Computing and Engineering (2020)\narXiv:2005.10921 [quant-ph].\n[11] S. Endo, S. C. Benjamin, and Y. Li, Practical Quantum\nError Mitigation for Near-Future Applications, Phys.\nRev. X 8, 031027 (2018).\n[12] A. Strikis, D. Qin, Y. Chen, S. C. Benjamin, and Y. Li,\nLearning-Based Quantum Error Mitigation, PRX Quan-\ntum 2, 040330 (2021).\n[13] C. Kim, K. Park, and J. Rhee, Quantum error mitiga-\ntion with artificial neural network, IEEE Access 8, 18853\n(2020).\n[14] Z. Cai, X. Xu, and S. C. Benjamin, Mitigating coherent\nnoise using Pauli conjugation, npj Quantum Inf. 6, 17\n(2020).\n[15] R. Takagi, S. Endo, S. Minagawa, and M. Gu, Funda-\nmental limits of quantum error mitigation, npj Quantum\nInformation 8, 114 (2022).\n[16] Y. Quek, D. Stilck Fran¸ca, S. Khatri, J. J. Meyer, and\nJ. Eisert, Exponentially tighter bounds on limitations\nof quantum error mitigation, Nature Physics 20, 1648\n(2024).\n[17] D. Pomarico, M. Pandey, R. Cioli, F. Dell’Anna, S. Pas-\ncazio, F. V. Pepe, P. Facchi, and E. Ercolessi, Quantum\nerror mitigation in optimized circuits for particle-density\ncorrelations in real-time dynamics of the Schwinger\nmodel, (2025), arXiv:2501.10831 [quant-ph].\n[18] Y. Suzuki, S. Endo, K. Fujii, and Y. Tokunaga, Quan-\ntum Error Mitigation as a Universal Error Reduction\nTechnique: Applications from the NISQ to the Fault-\nTolerant Quantum Computing Eras, PRX Quantum 3,\n010345 (2022).\n[19] Z. Zimbor´as et al., Myths around quantum computation\nbefore full fault tolerance: What no-go theorems rule out\nand what they don’t, (2025), arXiv:2501.05694 [quant-\nph].\n[20] A. Zhang et al., Demonstrating quantum error mitigation\non logical qubits, (2025), arXiv:2501.09079 [quant-ph].\n[21] X. Bonet-Monroig, R. Sagastizabal, M. Singh, and T. E.\nO’Brien, Low-cost error mitigation by symmetry verifi-\ncation, Phys. Rev. A 98, 062339 (2018).\n[22] S.\nE.\nSmart\nand\nD.\nA.\nMazziotti,\nQuantum-\nclassical hybrid algorithm using an error-mitigating\nN-representability\ncondition\nto\ncompute\nthe\nMott\nmetal-insulator transition, Phys. Rev. A 100, 022517\n(2019).\n[23] N. N. Bogoliubov, Kinetic Equations, Journal of Physics-\nUSSR 10, 265 (1946).\n[24] M. Born and H. S. Green, A General Kinetic Theory of\nLiquids. I. The Molecular Distribution Functions, Proc.\nRoy. Soc. Lond. A 188, 10 (1946).\n[25] J. G. Kirkwood, The Statistical Mechanical Theory of\nTransport Processes I. General Theory, The Journal of\nChemical Physics 14, 180 (1946).\n[26] J. Yvon, La th´eorie statistique des fluides et l’´equation\nd’´etat, Actualit´es scientifiques et industrielles : hydrody-\nnamique, acoustique: Th´eories m´ecaniques (Hermann &\ncie, 1935).\n[27] S. Chari, R. Inguva, and K. Murthy, A new truncation\nscheme for BBGKY hierarchy: conservation of energy\nand time reversibility, arXiv preprint arXiv:1608.02338\n(2016).\n[28] L. Pucci, A. Roy, and M. Kastner, Simulation of quantum\nspin dynamics by phase space sampling of Bogoliubov-\nBorn-Green-Kirkwood-Yvon trajectories, Phys. Rev. B\n93, 174302 (2016).\n[29] R. Paˇskauskas and M. Kastner, Equilibration in long-\nrange quantum spin systems from a BBGKY perspec-\ntive, Journal of Statistical Mechanics: Theory and Ex-\nperiment 2012, P02005 (2012).\n[30] D. Lacroix, Y. Tanimura, S. Ayik, and B. Yilmaz, A sim-\nplified BBGKY hierarchy for correlated fermions from a\nstochastic mean-field approach, The European Physical\nJournal A 52, 1 (2016).\n[31] Y. Li and S. C. Benjamin, Efficient Variational Quan-\ntum Simulator Incorporating Active Error Minimization,\nPhys. Rev. X 7, 021050 (2017), arXiv:1611.09301 [quant-\nph].\n[32] J. Schwinger, Gauge Invariance and Mass. II, Phys. Rev.\n128, 2425 (1962).\n[33] T. Angelides, P. Naredi, A. Crippa, K. Jansen, S. K¨uhn,\nI. Tavernelli, and D. S. Wang, First-order phase transi-\ntion of the Schwinger model with a quantum computer,\nnpj Quantum Inf. 11, 6 (2025), arXiv:2312.12831 [hep-\nlat].\n[34] M. Honda,\nE. Itou,\nY. Kikuchi,\nL. Nagano, and\nT. Okuda, Classically emulated digital quantum simu-\nlation for screening and confinement in the Schwinger\nmodel with a topological term, Phys. Rev. D 105, 014504\n(2022).\n[35] G. Pederiva, A. Bazavov, B. Henke, L. Hostetler, D. Lee,\nH.-W. Lin, and A. Shindler, Quantum State Prepara-\ntion for the Schwinger Model, PoS LATTICE2021, 047\n(2022).\n[36] A. Yamamoto, Toward dense QCD in quantum comput-\ners, PoS LATTICE2021, 122 (2022).\n[37] B. Chakraborty, M. Honda, T. Izubuchi, Y. Kikuchi, and\nA. Tomiya, Classically emulated digital quantum simula-\ntion of the Schwinger model with a topological term via\nadiabatic state preparation, Phys. Rev. D 105, 094503\n(2022).\n[38] D. Ghim and M. Honda, Digital Quantum Simulation for\nSpectroscopy of Schwinger Model, PoS LATTICE2023,\n213 (2024), arXiv:2404.14788 [hep-lat].\n[39] O. Kaikov, T. Saporiti, V. Sazonov, and M. Tamaazousti,\nPhase Diagram of the Schwinger Model by Adiabatic\nPreparation of States on a Quantum Simulator, (2024),\narXiv:2407.09224 [hep-lat].\n[40] M. D’Anna, M. Krstic Marinkovic, and J. C. P. Barros,\nAdiabatic state preparation for digital quantum simula-\ntions of QED in 1 + 1D, (2024), arXiv:2411.01079 [hep-\nlat].\n\n\n10\n[41] T. Cox and P. C. E. Stamp, Partitioned density matrices\nand entanglement correlators, Phys. Rev. A 98, 062110\n(2018).\n[42] H. F. Trotter, On the Product of Semi-Groups of Opera-\ntors, Proceedings of the American Mathematical Society\n10, 545 (1959).\n[43] D. W. Berry, G. Ahokas, R. Cleve, and B. C. Sanders,\nEfficient Quantum Algorithms for Simulating Sparse\nHamiltonians, Commun. Math. Phys. 270, 359 (2007),\narXiv:quant-ph/0508139.\n[44] N. Hatano and M. Suzuki, Finding Exponential Product\nFormulas of Higher Orders, Lect. Notes Phys. 679, 37\n(2005), arXiv:math-ph/0506007.\n[45] W. Magnus, On the exponential solution of differential\nequations for a linear operator, Commun. Pure Appl.\nMath. 7, 649 (1954).\n[46] We systematically add a small random O\n\u00001/√NS\n\u0001\nshift\nto εsη for reasons explained in appendix B.\n[47] M. S. Floater, On the convergence of derivatives of Bern-\nstein approximation, Journal of Approximation Theory\n134, 130 (2005).\n[48] S. Bernstein, D´emonstration du th´eor`eme de Weierstrass\nfond´ee sur le calcul des probabilit´es, Communications of\nthe Kharkov Mathematical Society XIII, 2 (1913).\n[49] J. B. Kogut and L. Susskind, Hamiltonian Formulation\nof Wilson’s Lattice Gauge Theories, Phys. Rev. D 11,\n395 (1975).\n[50] P. Jordan and E. P. Wigner, About the Pauli exclusion\nprinciple, Z. Phys. 47, 631 (1928).\n[51] A. Javadi-Abhari,\nM. Treinish,\nK. Krsulich,\nC. J.\nWood, J. Lishman, J. Gacon, S. Martiel, P. D. Nation,\nL. S. Bishop, A. W. Cross, B. R. Johnson, and J. M.\nGambetta, Quantum computing with Qiskit (2024),\narXiv:2405.08810 [quant-ph].\n[52] The simulations for P were conducted on February 4th\n2025 while those for Q on February 5th 2025.\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21159v1.pdf",
    "total_pages": 10,
    "title": "BBGKY hierarchy for quantum error mitigation",
    "authors": [
      "Theo Saporiti",
      "Oleg Kaikov",
      "Vasily Sazonov",
      "Mohamed Tamaazousti"
    ],
    "abstract": "Mitigation of quantum errors is critical for current NISQ devices. In the\ncurrent work, we address this task by treating the execution of quantum\nalgorithms as the time evolution of an idealized physical system. We use\nknowledge of its physics to assist the mitigation of the quantum noise produced\non the real device. In particular, the time evolution of the idealized system\nobeys a corresponding BBGKY hierarchy of equations. This is the basis for the\nnovel error mitigation scheme that we propose. Specifically, we employ a subset\nof the BBGKY hierarchy as supplementary constraints in the ZNE method for error\nmitigation. We ensure that the computational cost of the scheme scales\npolynomially with the system size. We test our method on digital quantum\nsimulations of the lattice Schwinger model under noise levels mimicking\nrealistic quantum hardware. We demonstrate that our scheme systematically\nimproves the error mitigation for the measurements of the particle number and\nthe charge within this system. Relative to ZNE we obtain an average reduction\nof the error by 18.2% and 52.8% for the respective above observables. We\npropose further applications of the BBGKY hierarchy for quantum error\nmitigation.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}