{
  "id": "arxiv_2502.20093v1",
  "text": "Electric-field control of photon indistinguishability\nin cascaded decays in quantum dots\nGabriel Undeutsch,∗,† Maximilian Aigner,† Ailton J. Garcia Jr.,† Johannes\nReindl,† Melina Peter,† Simon Mader,† Christian Weidinger,† Saimon F. Covre\nda Silva,†,‡ Santanu Manna,†,¶ Eva Sch¨oll,†,§ and Armando Rastelli∗,†\n†Institute of Semiconductor and Solid State Physics, Johannes Kepler University, Linz,\nAustria\n‡Instituto de F´ısica Gleb Wataghin, Universidade Estadual de Campinas, Campinas, Brazil\n¶Department of Electrical Engineering, Indian Institute of Technology Delhi, India\n§Institute for Integrated Circuits and Quantum Computing, Johannes Kepler University,\nLinz, Austria\nE-mail: gabriel.undeutsch@jku.at; armando.rastelli@jku.at\nAbstract\nPhoton indistinguishability, entanglement, and antibunching are key ingredients in quantum optics\nand photonics. Decay cascades in quantum emitters offer a simple method to create entangled-\nphoton-pairs with negligible multi-pair generation probability. However, the degree of indistin-\nguishability of the photons emitted in a cascade is intrinsically limited by the lifetime ratio of the\ninvolved transitions. Here we show that, for the biexciton-exciton cascade in a quantum dot, this\nratio can be widely tuned by an applied electric field. Hong-Ou-Mandel interference measurements\nof two subsequently emitted biexciton photons show that their indistinguishability increases with\nincreasing field, following the theoretically predicted behavior. At the same time, the emission\nlinewidth stays close to the transform-limit, favoring applications relying on the interference among\nphotons emitted by different sources.\n1\narXiv:2502.20093v1  [quant-ph]  27 Feb 2025\n\n\nIn the realm of quantum technologies, many\napplications require specialized quantum light\nsources that meet stringent criteria. Among the\nmost sought-after properties is the capability\nof “on demand” generation of simultaneously\nhighly indistinguishable and strongly entan-\ngled photon pairs.1–3 Epitaxial semiconductor\nquantum dots (QDs) have emerged as promis-\ning candidates for generating photons with\nhigh brightness,4–6 high single-photon purity,7\nnarrow linewidth,8–11 and near-unity indistin-\nguishability.5,12–15 Additionally, the biexciton\n(XX) - exciton (X) radiative cascade allows the\ndirect generation of on-demand polarization-\nentangled photon pairs with near-unity time-\naveraged fidelities.16–21 However, the cascade\nnature of the process to create entangled pho-\nton pairs causes an unwanted temporal entan-\nglement between the two photons, resulting in\na non-separable two-photon state.\nThis re-\nduces the state purity P, describing the indis-\ntinguishability of the emitted single photons in\nthe time-domain, to22–24\nP =\n1\nr + 1,\n(1)\nwith\nthe\nratio\nof\nthe\nradiative\nlifetimes\nr = τXX/τX. The purity is experimentally not\ndirectly accessible, but – for systems with neg-\nligible multi-photon probability, as is the case\nhere – it is identical to the two-photon inter-\nference visibility,25 which can be measured in\nHong-Ou-Mandel (HOM) type experiments.\nThe observed QD lifetime ratio is typically\nr ≈0.4 −0.7,9,16,24,26 resulting in a maximum\nachievable HOM interference visibility of 0.67.\nIt has been proposed and demonstrated that a\nsuitable optical cavity can selectively shorten\nthe XX state (|XX⟩) lifetime while keeping the\nX state (|X⟩) lifetime constant, and thereby\ndecrease the lifetime ratio.23 However, no in-\ncrease in photon indistinguishability has yet\nbeen shown. In this work, we take a different\napproach and demonstrate that the lifetime ra-\ntio r can be conveniently modified by applying\na vertical electric field to QDs embedded in\na p-i-n diode. The diode structure allows for\nthe charge control of the QD and its environ-\nment, enabling stabilization and tuning of the\nemission properties.8,10,15,27–31 In particular, it\nhas been demonstrated that an electric field\ninduces a non-monotonic variation in the |X⟩\nlifetime,32,33 but we are not aware of similar\nmeasurements for the |XX⟩.\nWe focus on GaAs QDs obtained by local\ndroplet etching epitaxy,9,34 as these QDs have\nrecently outperformed other systems in terms of\ndegree of polarization-entanglement,18,31,35 sin-\ngle photon purity,7 photon indistinguishabil-\nity,10,14,15 and spin properties.36 We find that\nan increasing electric field leads to a monoton-\nically increasing |X⟩lifetime, while the |XX⟩\nlifetime remains almost unchanged. This allows\nus for the first time to tune the lifetime ratio by\nan externally applied electric field. With that,\nwe decrease the ratio from 0.64(2) to 0.25(2)\nand thus increase the theoretically maximum\nindistinguishability from 0.61(1) to 0.794(8),\nwhich is significantly higher than the value typ-\nically achieved in non-diode structures. We ex-\nperimentally verify this by measuring the HOM\nvisibility for XX and X photons. At high fields,\nthe HOM visibility for X photons degrades,\nmost likely due to residual charge noise in the\nsample, as indicated by linewidth broadening.\nHowever, the XX visibility closely follows the\ntheoretical prediction, with its linewidth re-\nmaining close to the transform-limit even at\nhigh fields.\nThe GaAs QDs used in this work are embed-\nded into a p-i-n diode structure (see Fig. 1 a)\nand b)) and a weak planar cavity built up of\ndistributed Bragg reflectors, with ten pairs be-\nlow and four pairs above the QD layer (see sup-\nplementary).\nWhen an external voltage V is\napplied to the diode structure, an electric field\nFV ≃Vb−V\nD\nis generated, where Vb is the built-\nin voltage and D is the thickness of the in-\ntrinsic layer.33 (Note that the n-doped layer\nis grounded and V is the voltage applied to\nthe top p-doped layer.)\nIn our case, we ex-\npect Vb to be about +1.7 V as the Al15Ga85As\nband gap energy at low temperatures is about\n1.73 eV. A higher electric field (lower voltage)\nleads to a stronger bending of the conduction\n(CB) and valence band (VB) edges, as seen\nfrom the comparison between the calculation\n2\n\n\nFigure 1: Sample structure with simulated conduction band (CB) and valence band (VB) edges\nand CB quasi Fermi level (EF) for a) an applied voltage V = 0.9 V and b) V = −2.2 V. c) Spectra\nat three different voltages under π-pulse two-photon excitation (TPE). Depending on the voltage,\nseveral biexciton-exciton (XX-X) replicas (labeled 0-3) could be observed, sometimes simultane-\nously. This is most likely due to different numbers of holes trapped in the vicinity of the QD. For\nV = 0.9 V (orange) only replica 0 is visible. For V = −1.08 V (green) and V = −2.2 V (blue), three\nreplicas (1–3) and two replicas (2 and 3) are visible. For each spectrum, the laser energy (indicated\nwith arrows) was adjusted to match the TPE resonance. Small contributions from other replicas\ncome from phonon-assisted excitation. d) Fitted energy of the XX and X photons as a function of\nvoltage. Each data point is extracted from a spectrum under TPE of the respective replica.\nresults shown in Fig. 1 a) and b) for V = 0.9 V\nand V = −2.2 V, respectively. Since in the lat-\nter case the energy EF of the CB quasi-Fermi\nlevel lies below the CB edge in the QD region,\nthe QD is in a neutral state and theoretically\nonly neutral excitonic states can be excited.\nTo characterize the sample,\nwe perform\nvoltage-dependent photoluminescence measure-\nments of a single QD (QD 1) under resonant\nexcitation of |XX⟩via two-photon excitation\n(TPE). Representative spectra, collected at\ndifferent voltages and excitation energies are\nshown in Fig. 1 c). For positive voltages, we\nobserve the typical spectrum of GaAs QDs (see\nexample in orange for V = +0.9 V), with the\ndominant XX and X lines stemming from the\nradiative cascade.\nAt negative voltages, we\nfind several XX and X replicas with slightly\ndifferent emission energies, see green and blue\nspectra in Fig. 1 c). We attribute such replicas\nto variations in the electric field,37 caused by\ndifferent numbers of holes caught at the tunnel\nbarrier interface close to the QD layer (see sup-\nplementary). We study the three most promi-\nnent XX-X replicas (labeled as 1–3 according\nto their energy), which we address by tuning\nthe laser energy to resonantly excite the respec-\ntive |XX⟩. Additional small lines come from\nother cascades due to phonon-assisted TPE.\nFigure 1 d) shows the fitted emission energies\n3\n\n\nfor the XX and X photons for varying volt-\nage (similar data for another QD is shown in\nthe supplementary). In a first approximation,\nthe field dependence of the emission energy\ncan be described by a quadratic behavior,33\nsimilar to the potential energy of a polariz-\nable electric dipole in an external electric field\n(see supplementary). Most importantly, we see\nthat the X line red-shifts faster than the XX\nline with increasing electric field (decreasing\nvoltage). This observation, which is consistent\nwith previous results on InGaAs QDs,28,38 indi-\ncates that the |X⟩can be more easily polarized\nthan the |XX⟩. Intuitively, we attribute this\nobservation to the larger number of charge car-\nriers present in the biexciton complex, partly\nscreening the external field.\nAs a result, for\nsufficiently large negative voltages, the XX and\nX emission lines cross and swap their order, as\nillustrated by the spectra of replicas 2 and 3 at\nV = −2.2 V in Fig. 1 c).\nIn addition to charge and energy tuning, the\nelectric field influences the overlap of the elec-\ntron and hole wave functions ⟨Φe|Φh⟩.\nFrom\na quadratic fit of the X energy we find that,\nat an applied voltage of V ≈+1.1 V, the per-\nmanent dipole33,39–42 present at zero field can-\ncels with the induced dipole, leading to a near\nmaximum achievable wave function overlap, as\nshown by the schematic in Fig. 2 a).\n(Note\nthat in the studied device we cannot reach this\npoint, since for V ≳1 V X and XX lumines-\ncence is quenched due to single electron charg-\ning.) Any change in voltage from this point will\npull the wave functions in opposite directions,\nresulting in a reduced overlap, as sketched in\nFig. 2 b). In a single particle picture, we ex-\npect the decay rate to be proportional to the\noverlap integral of the electron and hole wave\nfunctions.43 The change in overlap in response\nto a change in electric field, in turn, depends\non the polarizability of the excitonic species.\nFrom the observation that the XX line shifts\nless than the X line for increasing electric field,\nwe can already anticipate that the |X⟩life-\ntime will increase more than the |XX⟩lifetime\nwith increasing field. This expectation is con-\nfirmed by measuring the dynamics of the XX\nand X emission following TPE, as shown in\nFigs. 2 c). Here and in the following measure-\nments, we always use the brightest replica at a\ngiven voltage (see supplementary). Figure 2 d)\nshows the lifetimes extracted from a fit of the\ndata (see supplementary) as a function of the\napplied voltage, as well as the resulting life-\ntime ratio r. For positive voltages, both life-\ntimes stay almost constant with τXX ≈110 ps\nand τX ≈175 ps.\nFor negative voltages, the\n|XX⟩lifetime increases by a factor of 1.5 to\n161(4) ps, while the lifetime of the |X⟩increases\nsignificantly by a factor of 3.5 to 619(27) ps at\nV = −2.04 V. Consequently, the lifetime ratio\ndecreases from 0.64(2) to 0.26(1), as shown in\norange in Fig. 2 d). Thus, from Eq. (1), the\ntheoretical limit for the indistinguishability in-\ncreases.\nTo experimentally investigate whether predic-\ntions are correct, we measure the two-photon\ninterference visibility for two sequentially emit-\nted XX or X photons in a HOM type inter-\nferometer (see supplementary for measurement\nand analysis details) with a time delay match-\ning the repetition rate of the excitation laser\nand for different applied voltages. To bench-\nmark the setup and the QDs, we measure the\nHOM visibility of the resonantly excited nega-\ntive trion from the same QD at a gate voltage\nof V = +1.03 V, since this is not intrinsically\nlimited by a cascaded emission. From such a\nmeasurement, a raw visibility of 0.944(4) and a\ncorrected visibility of 0.991(6) are obtained (see\nsupplementary). Representative photon coinci-\ndence histograms for the XX line at V = +0.9 V\nand −2.04 V are shown in Fig. 3 a) with a hori-\nzontal shift of 2 ns for better readability. A de-\ncreased central peak is clearly visible for V =\n−2.04 V in the inset, indicating an improved\nHOM visibility. The evaluated HOM visibili-\nties for different voltages are shown in Fig. 3 b)\nand d) for the XX and in Fig. 3 c) for the X to-\ngether with the theoretical limit for the indistin-\nguishability from Eq. (1). For positive voltages,\nboth the XX and the X show HOM visibilities\nof ≈0.6, consistent with the constant lifetime\nratio.\nFor negative voltages, the XX follows\nthe expected trend and almost reaches the the-\noretical limit. The highest measured raw (cor-\nrected) HOM visibility is 0.735(12) (0.769(13))\n4\n\n\nFigure 2: Schematic of electron ϕe and hole ϕh wave functions, showing a) a high overlap under\nsmall electric field vs. b) a reduced overlap under high electric field. c) Lifetime measurements\nof the |XX⟩and |X⟩for increasing electric fields (indicated by an arrow) in the specified voltage\nrange. d) Fitted lifetimes τ as a function of the gate voltage. For decreasing voltage, the relative\nincrease of τXX is much lower than that of τX, resulting in a decrease of the lifetime ratio.\nat V = −2.04 V (r = 0.26), which is close to\nthe theoretical limit of 0.794(8). Figure 3 d)\nshows the corrected HOM visibility of the XX\nagainst the lifetime ratio. Additionally, it also\nincludes data from a second QD, further sup-\nporting our observations. In contrast to the re-\nsults obtained for the XX and to the theoreti-\ncal expectations, the raw (corrected) HOM vis-\nibility for the X photons degrades to 0.404(18)\n(0.420(19)) with decreasing lifetime ratio.\nTo understand the origin of the indistin-\nguishability drop for X photons and provide a\nmore stringent measurement of the optical qual-\nity of the QD emitter at different electric fields,\nwe measure the coherence time of the XX and\nX lines using a Michelson interferometer (see\nsupplementary). In absence of noise, the up-\nper limit of the coherence time for an X photon\nis given by τc = 2τX, leading to a transform-\nlimited linewidth of Γ0,X =\nℏ\nτX . For the XX, we\nexpect instead Γ0,XX = ℏ\n\u0010\n1\nτX +\n1\nτXX\n\u0011\n.44 Fig-\nure 4 a) and b) show the first-order correlation\nfunction g(1)(t) for the XX and the X respec-\ntively for two voltages.\nAt a gate voltage of\nV = +0.9 V, the transform-limited linewidths\nfor the XX (X) are 9.88(12) µeV (3.78(4) µeV).\nThe linewidths from the Michelson measure-\nments are 11.0(17) µeV (5.4(4) µeV).\nThere-\nfore, the XX (X) transition is only a factor\nΓ/Γ0 = 1.1(2)(1.4(1)) away from the transform-\nlimit. At a gate voltage of V = −1.7 V, the\nmeasured linewidth of the XX is 7.0(11) µeV.\nTogether with the transform-limited linewidth\nΓ0 = 6.38(10) µeV, this yields the same fac-\ntor of 1.1(2) as for positive voltages. For the X,\nthe measured linewidth increases to 8.5(5) µeV,\nwhereas Γ0 decreases to 1.74(3) µeV.\nThe X\nlinewidth is therefore a factor 4.9(3) away from\nthe transform-limit. Figure 4 c) shows the ratio\nΓ/Γ0 for different gate voltages. It is interest-\ning to note that the XX linewidth stays close\nto the transform-limit over the whole voltage\nrange, suggesting that photon indistinguisha-\nbility is preserved over time separations ex-\ntending to several minutes (the typical dura-\ntion of a Michelson interferometry measure-\nment). In contrast, the X linewidth broadens\nsignificantly for decreasing voltages, in line with\nthe drop in HOM indistinguishability shown in\nFig. 3 b). We attribute these observations to\nresidual charge noise and the higher sensitiv-\nity of the X transition energy to noise because\nof its higher polarizability compared to the XX\ntransition energy.26\nIn summary, we have demonstrated that the\nlifetime of transitions in the decay cascade of\nQDs can be differentially tuned using an ex-\nternal electric field. This reduces the intrinsic\nlimitations on indistinguishability, as confirmed\n5\n\n\nFigure 3: a) Histograms of Hong-Ou-Mandel (HOM) measurements of the XX photons for the\ntwo indicated voltages, with one shifted by 2 ns for better readability. Raw and corrected HOM\nvisibilities for b) the XX and c) the X for different applied voltages, as well as the theoretical limit\ngiven by Eq. (1). Whereas the XX follows the expected trend, the X HOM visibility decreases with\nvoltage. d) Corrected HOM visibility of the XX as a function of lifetime ratio r = τXX/τX. In\naddition to QD 1, used for all measurements in the manuscript, we also show data obtained from\nanother QD (QD 2).\nexperimentally for the XX photons emitted by\nGaAs QDs. By operating a p-i-n diode with em-\nbedded QDs at negative voltages, strong band\nbending reduces the overlap of electron and\nhole wave functions, leading to an increased ex-\ncited state lifetime.\nThis effect is more pro-\nnounced for the |X⟩compared to the |XX⟩,\ndue to the higher sensitivity of the exciton to\nelectric field changes compared to the biexci-\nton complex.\nOur measurements show a re-\nduction in the lifetime ratio from 0.64(2) to\n0.26(1).\nThis results in an improved (cor-\nrected) HOM interference visibility of 0.769(13)\nfor the XX, approaching the theoretical limit\nof 0.794(8) – well beyond the values achiev-\nable in absence of an electric field. However,\nthe X HOM visibility decreases as the lifetime\nratio decreases, which we attribute to an in-\ncreased sensitivity to noise.\nAchieving a de-\ngree of indistinguishability well above 0.9 re-\nmains essential for quantum technology appli-\ncations. The tuning range of the lifetime ra-\ntio could be further increased by dedicated de-\nsign of the diode structure. Additionally, com-\nbining a diode structure with a tailored micro-\ncavity, can selectively shorten the |XX⟩life-\ntime through Purcell enhancement while main-\ntaining the |X⟩lifetime relatively unchanged.\nThese findings, which we expect to apply also\nto other material systems, may contribute to\nobtain a quantum light source that simulta-\nneously combines the emission of highly in-\n6\n\n\na)\nb)\nc)\nFigure 4: First-order correlation function g(1)(t) as a function of the relative delay t of a) XX\nand b) X for two different applied voltages, recorded using a Michelson interferometer. c) Fitted\nlinewidths relative to the respective Fourier transform limit as function of voltage, showing almost\nno line broadening for the XX but significant broadening for the X.\ndistinguishable photons with low multi-photon\nprobability, transform-limited linewidths and\nhigh degree of polarization-entanglement – all\nkey requirements for advancing quantum net-\nworks and other quantum technology applica-\ntions that have long been anticipated.\nAcknowledgement We thank Petr Klen-\novsk´y and Micha l Gawe lczyk for fruitful discus-\nsions. This project has received funding from\nthe European Union’s Horizon 2020 research\nand innovation program under Grant Agree-\nment No. 871130 (Ascent+) and the EU HE\nEIC Pathfinder challenges action under grant\nagreement No.\n101115575, from the Quan-\ntERA II program that has received funding\nfrom the European Union’s Horizon 2020 re-\nsearch and innovation program under Grant\nAgreement No. 101017733 via the projects QD-\nE-QKD and MEEDGARD (FFG Grants No.\n891366 and 906046) the Austrian Science Fund\nFWF via the Research Group FG5, I 4320, I\n4380, from the Austrian Science Fund FWF\n42through [F7113] (BeyondC), and from the\ncluster of excellence quantA [10.55776/COE1]\nas well as the Linz Institute of Technology\n(LIT), the LIT Secure and Correct Systems\nLab, supported by the State of Upper Austria.\nS.F.C. da Silva acknowledges S˜ao Paulo Re-\nsearch Foundation (FAPESP), Brasil, Process\nNumber 2024/08527-2 for financial support.\nSupporting Information Avail-\nable\nSample:\nSample structure, Band structure\nsimulations;\nMethods:\nCryogenic\nmicro-\nphotoluminescence setup, Autocorrelation mea-\nsurements, Lifetime measurement, Hong-Ou-\nMandel measurements, Michelson interferom-\netry; Quantum confined Stark effect:\nPolar-\nizability, Wave function overlap, Permanent\ndipole; Replicas of the XX-X paors: Origin of\nthe replicas, Photogeneration of the holes near\nQDs, Localization of the holes close to the QD,\nReplica intensities, Comparison of replicas at\nthe same voltage; Additional Data: Indistin-\nguishability of the resonantly excited negative\ntrion, Single-photon purity, Data on additional\nquantum dots.\nReferences\n(1) Lloyd, S.; Shahriar, M. S.; Shapiro, J. H.;\nHemmer, P. R. Long Distance, Uncondi-\ntional Teleportation of Atomic States via\nComplete Bell State Measurements. Phys-\nical Review Letters 2001, 87, 167903.\n(2) Kimble, H. J. The quantum internet. Na-\nture 2008, 453, 1023–1030.\n(3) Lu, C.-Y. Y.; Pan, J.-W. W. Quantum op-\n7\n\n\ntics: Push-button photon entanglement.\nNature Photonics 2014, 8, 174–176.\n(4) Liu, J.; Su, R.; Wei, Y.; Yao, B.; da\nSilva, S. F. C.; Yu, Y.; Iles-Smith, J.;\nSrinivasan,\nK.;\nRastelli,\nA.;\nLi,\nJ.;\nWang, X. A Solid-State Source of Strongly\nEntangled Photon Pairs with High Bright-\nness and Indistinguishability. Nature Nan-\notechnology 2019, 14, 586–593.\n(5) Tomm, N.; Javadi, A.; Antoniadis, N. O.;\nNajer, D.; L¨obl, M. C.; Korsch, A. R.;\nSchott, R.; Valentin, S. R.; Wieck, A. D.;\nLudwig, A.; Warburton, R. J. A Bright\nand Fast Source of Coherent Single Pho-\ntons. Nature Nanotechnology 2021, 16, 1–\n5.\n(6) Ding, X.; Guo, Y.-P.; Xu, M.-C.; Liu, R.-\nZ.;\nZou, G.-Y.;\nZhao, J.-Y.;\nGe, Z.-\nX.; Zhang, Q.-H.; Liu, H.-L.; Wang, L.-\nJ.;\nChen, M.-C.;\nWang, H.;\nHe, Y.-\nM.;\nHuo, Y.-H.;\nLu, C.-Y.;\nPan, J.-\nW. High-Efficiency Single-Photon Source\nabove the Loss-Tolerant Threshold for Ef-\nficient Linear Optical Quantum Comput-\ning. arXiv:2311.08347 2023,\n(7) Schweickert,\nL.;\nJ¨ons,\nK.\nD.;\nZe-\nuner, K. D.;\nCovre da Silva, S. F.;\nHuang, H.;\nLettner, T.;\nReindl, M.;\nZichi,\nJ.;\nTrotta,\nR.;\nRastelli,\nA.;\nZwiller, V. On-Demand Generation of\nBackground-Free Single Photons from a\nSolid-State Source. Applied Physics Let-\nters 2018, 112, 093106.\n(8) Kuhlmann,\nA.\nV.;\nPrechtel,\nJ.\nH.;\nHouel,\nJ.;\nLudwig,\nA.;\nReuter,\nD.;\nWieck,\nA.\nD.;\nWarburton,\nR.\nJ.\nTransform-Limited\nSingle\nPhotons\nfrom a Single Quantum Dot. Nature\nCommunications 2015, 6, 8204.\n(9) da\nSilva,\nS.\nF.\nC.;\nUndeutsch,\nG.;\nLehner, B.; Manna, S.; Krieger, T. M.;\nReindl, M.;\nSchimpf, C.;\nTrotta, R.;\nRastelli, A. GaAs quantum dots grown by\ndroplet etching epitaxy as quantum light\nsources. Applied Physics Letters 2021,\n119.\n(10) Zhai, L.; L¨obl, M. C.; Nguyen, G. N.;\nRitzmann, J.; Javadi, A.; Spinnler, C.;\nWieck, A. D.;\nLudwig, A.;\nWarbur-\nton, R. J. Low-Noise GaAs Quantum Dots\nfor Quantum Photonics. Nature Commu-\nnications 2020, 11, 4745.\n(11) Laferri`ere, P.; Yin, A.; Yeung, E.; Kus-\nmic, L.;\nKorkusinski, M.;\nRasekh, P.;\nNortheast,\nD.\nB.;\nHaffouz,\nS.;\nLa-\npointe, J.; Poole, P. J.; Williams, R. L.;\nDalacu,\nD.\nApproaching\ntransform-\nlimited photons from nanowire quantum\ndots using excitation above the band gap.\nPhysical Review B 2023, 107, 155422.\n(12) Huber, T.;\nPredojevi´c, A.;\nF¨oger, D.;\nSolomon, G.; Weihs, G. Optimal excita-\ntion conditions for indistinguishable pho-\ntons from quantum dots. New Journal of\nPhysics 2015, 17, 123025.\n(13) Ding,\nX.;\nHe,\nY.;\nDuan,\nZ.-C.;\nGregersen, N.; Chen, M.-C.; Unsleber, S.;\nMaier, S.;\nSchneider, C.;\nKamp, M.;\nH¨ofling, S.; Lu, C.-Y.; Pan, J.-W. On\nDemand\nSingle\nPhotons\nwith\nHigh\nExtraction\nEfficiency\nand\nNear-Unity\nIndistinguishability from a Resonantly\nDriven Quantum Dot in a Micropillar.\nPhysical\nReview\nLetters\n2016,\n116,\n020401.\n(14) Sch¨oll, E.; Hanschke, L.; Schweickert, L.;\nZeuner, K. D.; Reindl, M.; Covre Da\nSilva, S. F.;\nLettner, T.;\nTrotta, R.;\nFinley, J. J.; M¨uller, K.; Rastelli, A.;\nZwiller, V.; J¨ons, K. D. Resonance Flu-\norescence of GaAs Quantum Dots with\nNear-Unity Photon Indistinguishability.\nNano Letters 2019, 19, 2404–2410.\n(15) Zhai, L.; Nguyen, G. N.; Spinnler, C.;\nRitzmann, J.; L¨obl, M. C.; Wieck, A. D.;\nLudwig, A.; Javadi, A.; Warburton, R. J.\nQuantum interference of identical photons\nfrom remote GaAs quantum dots. Nature\nNanotechnology 2022, 17, 829–833.\n8\n\n\n(16) M¨uller, M.; Bounouar, S.; J¨ons, K. D.;\nGl¨assl, M.; Michler, P. On-demand gen-\neration of indistinguishable polarization-\nentangled photon pairs. Nature Photonics\n2014, 8, 224–228.\n(17) J¨ons,\nK.\nD.;\nSchweickert,\nL.;\nVer-\nsteegh, M. A. M.; Dalacu, D.; Poole, P. J.;\nGulinatti, A.; Giudice, A.; Zwiller, V.;\nReimer, M. E. Bright nanoscale source of\ndeterministic entangled photon pairs vio-\nlating Bell’s inequality. Scientific Reports\n2017, 7, 1700.\n(18) Huber,\nD.;\nReindl,\nM.;\nCovre\nda\nSilva,\nS.\nF.;\nSchimpf,\nC.;\nMart´ın-\nS´anchez, J.;\nHuang, H.;\nPiredda, G.;\nEdlinger, J.;\nRastelli, A.;\nTrotta, R.\nStrain-Tunable GaAs Quantum Dot:\nA\nNearly Dephasing-Free Source of Entan-\ngled Photon Pairs on Demand. Physical\nReview Letters 2018, 121, 033902.\n(19) Shang, X.; Li, S.; Liu, H.; Ma, B.; Su, X.;\nChen, Y.; Shen, J.; Hao, H.; Liu, B.;\nDou, X.; Ji, Y.; Sun, B.; Ni, H.; Niu, Z.\nSymmetric Excitons in an (001)-Based\nInAs/GaAs Quantum Dot Near Si Dopant\nfor Photon-Pair Entanglement. Crystals\n2021, 11.\n(20) Schimpf, C.; Basset, F. B.; Aigner, M.; At-\ntenender, W.; Gin´es, L.; Undeutsch, G.;\nReindl, M.;\nHuber, D.;\nGangloff, D.;\nChekhovich,\nE.\nA.;\nSchneider,\nC.;\nH¨ofling, S.; Predojevi´c, A.; Trotta, R.;\nRastelli, A. Hyperfine interaction limits\npolarization\nentanglement\nof\nphotons\nfrom\nsemiconductor\nquantum\ndots.\nPhysical Review B 2023, 108, L081405.\n(21) Chen, C.;\nYan, J.-Y.;\nBabin, H.-G.;\nWang, J.;\nXu, X.;\nLin, X.;\nYu, Q.;\nFang, W.; Liu, R.-Z.; Huo, Y.-H.; Cai, H.;\nSha, W. E. I.;\nZhang, J.;\nHeyn, C.;\nWieck, A. D.; Ludwig, A.; Wang, D.-W.;\nJin, C.-Y.; Liu, F. Wavelength-Tunable\nHigh-Fidelity Entangled Photon Sources\nEnabled by Dual Stark Effects. Nature\nCommunications 2024, 15, 5792.\n(22) Simon, C.; Poizat, J.-P. P. Creating Single\nTime-Bin-Entangled Photon Pairs. Physi-\ncal Review Letters 2005, 94, 030502.\n(23) Huber, T.;\nPredojevi´c, A.;\nZoubi, H.;\nJayakumar, H.; Solomon, G. S.; Weihs, G.\nMeasurement\nand\nmodification\nof\nbiexciton-exciton\ntime\ncorrelations.\nOptics Express 2013, 21, 9890.\n(24) Sch¨oll, E.; Schweickert, L.; Hanschke, L.;\nZeuner, K. D.; Sbresny, F.; Lettner, T.;\nTrivedi,\nR.;\nReindl,\nM.;\nCovre\nDa\nSilva, S. F.; Trotta, R.; Finley, J. J.;\nVuˇckovi´c, J.;\nM¨uller, K.;\nRastelli, A.;\nZwiller, V.; J¨ons, K. D. Crux of Using\nthe Cascaded Emission of a Three-Level\nQuantum Ladder System to Generate In-\ndistinguishable Photons. Physical Review\nLetters 2020, 125, 1–7.\n(25) Fischer, K. A.; Trivedi, R.; Lukin, D.\nParticle emission from open quantum\nsystems. Physical Review A 2018, 98,\n023853.\n(26) Schimpf, C.; Reindl, M.; Klenovsk´y, P.;\nFromherz, T.; Da Silva, S. F. C.; Hofer, J.;\nSchneider, C.; H¨ofling, S.; Trotta, R.;\nRastelli, A. Resolving the temporal evolu-\ntion of line broadening in quantum emit-\nters. Optics Express 2019, 27, 35290.\n(27) Warburton, R. J.; Sch¨aflein, C.; Haft, D.;\nBickel, F.; Lorke, A.; Karrai, K.; Gar-\ncia, J. M.; Schoenfeld, W.; Petroff, P. M.\nOptical emission from a charge-tunable\nquantum ring. Nature 2000, 405, 926–\n929.\n(28) Patel, R. B.; Bennett, A. J.; Farrer, I.;\nNicoll, C. A.; Ritchie, D. A.; Shields, A. J.\nTwo-Photon Interference of the Emission\nfrom Electrically Tunable Remote Quan-\ntum Dots. Nature Photonics 2010, 4, 632–\n635.\n(29) Kaniber, M.; Huck, M. F.; M¨uller, K.;\nClark, E. C.; Troiani, F.; Bichler, M.;\nKrenner, H. J.; Finley, J. J. Electrical\nControl of the Exciton–Biexciton Splitting\n9\n\n\nin Self-Assembled InGaAs Quantum Dots.\nNanotechnology 2011, 22, 325202.\n(30) Bennett, A. J.; Pooley, M. A.; Steven-\nson, R. M.; Ward, M. B.; Patel, R. B.;\nde la Giroday, A. B.; Sk¨old, N.; Farrer, I.;\nNicoll, C. A.; Ritchie, D. A.; Shields, A. J.\nElectric-Field-Induced Coherent Coupling\nof the Exciton States in a Single Quantum\nDot. Nature Physics 2010, 6, 947–950.\n(31) Schimpf, C.; Manna, S.; da Silva, S. F. C.;\nAigner, M.; Rastelli, A. Entanglement-\nbased quantum key distribution with a\nblinking-free quantum dot operated at a\ntemperature up to 20 K. Advanced Pho-\ntonics 2021, 3, 065001.\n(32) Polland, H. J.; Schultheis, L.; Kuhl, J.;\nG¨obel, E. O.; Tu, C. W. Lifetime Enhance-\nment of Two-Dimensional Excitons by the\nQuantum-Confined Stark Effect. Physical\nReview Letters 1985, 55, 2610–2613.\n(33) Fry,\nP.\nW.;\nItskevich,\nI.\nE.;\nMow-\nbray, D. J.; Skolnick, M. S.; Finley, J. J.;\nBarker, J. A.;\nO’Reilly, E. P.;\nWil-\nson, L. R.; Larkin, I. A.; Maksym, P. A.;\nHopkinson, M.; Al-Khafaji, M.; David, J.\nP. R.; Cullis, A. G.; Hill, G.; Clark, J. C.\nInverted\nElectron-Hole\nAlignment\nin\nInAs-GaAs\nSelf-Assembled\nQuantum\nDots. Physical Review Letters 2000, 84,\n733–736.\n(34) Heyn, C.; Stemmann, A.; K¨oppen, T.;\nStrelow, C.; Kipp, T.; Grave, M.; Men-\ndach, S.; Hansen, W. Highly uniform and\nstrain-free GaAs quantum dots fabricated\nby filling of self-assembled nanoholes. Ap-\nplied Physics Letters 2009, 94, 183113.\n(35) Keil, R.; Zopf, M.; Chen, Y.; H¨ofer, B.;\nZhang, J.; Ding, F.; Schmidt, O. G. Solid-\nstate ensemble of highly entangled photon\nsources at rubidium atomic transitions.\nNature Communications 2017, 8, 15501.\n(36) Appel, M. H.; Ghorbal, A.; Shofer, N.; Za-\nporski, L.; Manna, S.; da Silva, S. F. C.;\nHaeusler, U.; Le Gall, C.; Rastelli, A.;\nGangloff, D. A.; Atat¨ure, M. A many-\nbody quantum register for a spin qubit.\nNature Physics 2025,\n(37) Houel, J.; Kuhlmann, A. V.; Greuter, L.;\nXue, F.; Poggio, M.; Gerardot, B. D.; Dal-\ngarno, P. A.; Badolato, A.; Petroff, P. M.;\nLudwig, A.; Reuter, D.; Wieck, A. D.;\nWarburton, R. J. Probing Single-Charge\nFluctuations at a GaAs/AlAs Interface\nUsing Laser Spectroscopy on a Nearby In-\nGaAs Quantum Dot. Physical Review Let-\nters 2012, 108, 107401.\n(38) Trotta,\nR.;\nZallo,\nE.;\nMagerl,\nE.;\nSchmidt, O. G.; Rastelli, A. Independent\ncontrol of exciton and biexciton energies\nin single quantum dots via electroelas-\ntic fields. Physical Review B 2013, 88,\n155312.\n(39) Barker, J. A.; O’Reilly, E. P. Theoreti-\ncal Analysis of Electron-Hole Alignment in\nInAs-GaAs Quantum Dots. Physical Re-\nview B 2000, 61, 13840–13851.\n(40) Jin,\nP.;\nLi,\nC.\nM.;\nZhang,\nZ.\nY.;\nLiu, F. Q.;\nChen, Y. H.;\nYe, X. L.;\nXu, B.; Wang, Z. G. Quantum-Confined\nStark Effect and Built-in Dipole Moment\nin Self-Assembled InAs/GaAs Quantum\nDots. Applied Physics Letters 2004, 85,\n2791–2793.\n(41) Finley, J. J.;\nSabathil, M.;\nVogl, P.;\nAbstreiter,\nG.;\nOulton,\nR.;\nTar-\ntakovskii, A. I.; Mowbray, D. J.; Skol-\nnick, M. S.; Liew, S. L.; Cullis, A. G.;\nHopkinson, M. Quantum-confined Stark\nshifts of charged exciton complexes in\nquantum dots. Physical Review B 2004,\n70, 201308(R).\n(42) Mar, J. D.; Baumberg, J. J.; Xu, X. L.;\nIrvine, A. C.; Williams, D. A. Precise\nMeasurements of the Dipole Moment and\nPolarizability of the Neutral Exciton and\nPositive Trion in a Single Quantum Dot.\nPhysical Review B 2017, 95, 201304.\n(43) Bastard, G.; Mendez, E. E.; Chang, L. L.;\nEsaki, L. Variational calculations on a\n10\n\n\nquantum well in an electric field. Physical\nReview B 1983, 28, 3241–3245.\n(44) Chiang,\nY.\nC.;\nDemekhin,\nP.\nV.;\nKuleff, A. I.; Scheit, S.; Cederbaum, L. S.\nLinewidth and lifetime of atomic levels\nand the time evolution of spectra and\ncoincidence spectra. Physical Review A -\nAtomic, Molecular, and Optical Physics\n2010, 81, 032511.\n11\n\n\nSupporting Information:\nElectric-field control of photon indistinguishability\nin cascaded decays in quantum dots\nGabriel Undeutsch,∗,† Maximilian Aigner,† Ailton J. Garcia Jr.,† Johannes\nReindl,† Melina Peter,† Simon Mader,† Christian Weidinger,† Saimon F. Covre\nda Silva,†,‡ Santanu Manna,†,¶ Eva Sch¨oll,†,§ and Armando Rastelli∗,†\n†Institute of Semiconductor and Solid State Physics, Johannes Kepler University, Linz,\nAustria\n‡Instituto de F´ısica Gleb Wataghin, Universidade Estadual de Campinas, Campinas, Brazil\n¶Department of Electrical Engineering, Indian Institute of Technology Delhi, India\n§Institute for Integrated Circuits and Quantum Computing, Johannes Kepler University,\nLinz, Austria\nE-mail: gabriel.undeutsch@jku.at; armando.rastelli@jku.at\n1\nSample\n1.1\nSample structure\nThe GaAs quantum dots (QDs) studied in this paper were fabricated using molecular beam\nepitaxy with local droplet etching (LDE). The schematic sample structure is shown in\nFig. S1. First, a semi-insulating GaAs (001) substrate undergoes in-situ deoxidation, fol-\nlowed by the deposition of a GaAs buffer layer and the growth of a superlattice (30× (2.5 nm\nS-1\narXiv:2502.20093v1  [quant-ph]  27 Feb 2025\n\n\nAlAs/2.5 nm GaAs)) to planarize the surface and bury any surface impurities. A second\nGaAs buffer layer and a planar distributed Bragg reflector (DBR) composed of 10 pairs of\nAl0.95Ga0.05As/Al0.15Ga0.85As are then grown. An additional Al0.95Ga0.05As layer is incorpo-\nrated to match the QD position with the electric field antinode of the planar 5λ/2 cavity,\nwhich is formed by four additional DBR pairs to improve the extraction efficiency. The QDs\nare embedded in a p-i-n diode structure. On the n-side, below the QDs, the diode features\na 78 nm thick Al0.15Ga0.85As layer doped with Si (nn = 7.4 · 1017 cm−3), serving as an elec-\ntron reservoir for the QDs. The lower 15% Al concentration prevents the formation of deep\ndonor levels (DX centers).S1,S2 A tunneling barrier between the n-doped layer and the QDs\nis formed by a 5 nm Al0.15Ga0.85As layer grown at low temperature to reduce Si segregation,\nfollowed by a 10 nm Al0.15Ga0.85As layer grown at higher temperature, as well as a 15 nm\nAl0.33Ga0.67As layer. For the QD growth, Al is evaporated onto the Al0.33Ga0.67As layer with-\nout an As background, forming droplets that etch approximately 8 nm deep nanoholes in the\nsurface during exposure to a reduced As flux. These nanoholes are subsequently filled with\nGaAs to form the QDs, which are then capped with an Al0.33Ga0.67As layer. Further details\nare provided in.S3 The QDs are positioned about 275 nm below the carbon-doped p+-type\nlayer of the diode, which consists of a 65.6 nm thick Al0.15Ga0.85As layer with low doping\nconcentration (np+ = 5 · 1018 cm−3), followed by a 13 nm thick highly doped Al0.15Ga0.85As\nlayer (np++ = 9 · 1018 cm−3). The top DBR is capped with 4 nm of GaAs to protect the\nAlGaAs layers from oxidation. To contact the n-layer, trenches are etched using sulfuric\nacid, followed by deposition of Ni/AuGe/Ni/Au and an annealing step at 420 ◦C for two\nminutes in a forming gas environment. For the p-contacts, Pt/Ti/Pt/Au is used, annealed\nat 400 ◦C for two minutes.\n1.2\nBand structure simulation\nThe simulation results in this work were obtained with nextnano++, a software for semicon-\nductor nanodevices for the self-consistent solution of the Schr¨odinger, current, and Poisson\nS-2\n\n\nFigure S1: Schematics of the sample structure, including the simulation box.\nequation.S4,S5 For the simulation, the temperature was set to 5 K. Fig. S1 shows an illustra-\ntion of the contacted diode, including the region over which the simulation was performed\n(simulation box).\nContacts:\nThe layer thicknesses and doping concentrations defined in the simulation were\ntaken from the growth protocol.\nFor the intrinsic layer, a background carbon-doping of\n1·1015 cm−3 was assumed to account for the carbon background in the growth chamber. For\nthe donor and acceptor energy, realistic values of 5.8 meV and 27 meV were used.S6,S7 As a\nresult, the free charge carriers in the structure freeze out when running simulations at low\ntemperatures.\nThe n- and p-type contacts were defined as Fermi contact, which results in a pinning of the\nelectron and hole quasi Fermi level to the bias applied to the contact. At voltages well below\nthe built-in voltage, the electric field within the intrinsic region is high enough to saturate\nthe electron and hole drift velocity. Therefore, a high field mobility model was used to limit\nthe electron and hole drift velocity to 0.5 · 107 cm/s and, 0.7 · 107 cm/s respectively.S8,S9\nS-3\n\n\nEnergy levels and wave functions:\nBy solving the Schr¨odinger equation numerically,\nnextnano++ provides solutions for the energy levels and wave functions within a pre-defined\nquantum region. At the boundaries of the quantum region, Dirichlet boundary conditions\nwere applied. In the one-dimensional simulation, the GaAs QD was included by a quantum\nwell with a thickness of 7.5 nm. The thickness was chosen such that the calculated transition\nenergy between the lowest electron and heavy hole state roughly matches the measured\nexciton (X) emission energy.\nObservations:\nThe simulated Stark shift of the quantum well is a symmetric function\nof the electric field, i.e. the emission energy reaches its maximum at zero field, when the\napplied voltage is equal to the built-in voltage of the diode (≈1.7 V). In reality, we observe\nan asymmetric Stark shift for the quantum dots in our diode structures, i.e. the maximum\nemission energy is reached at voltages well below the built-in voltage. We attribute this\nbehavior to the existence of a permanent dipole moment of the charge complexes in the\nquantum dot.\nFor negative voltages, the intrinsic region is fully depleted, and the bands are strongly\ntilted. For positive voltages, the bands become flatter and the charge carrier density in the\nintrinsic region increases. When the electron density is sufficiently high in the vicinity of the\nQD, the electron quasi Fermi level is stable in this region and becomes insensitive to small\nvoltage changes. At negative voltages, the electron and heavy hole wave functions are pulled\nto opposite sides of the quantum well, leading to a reduced overlap.\n2\nMethods\n2.1\nCryogenic micro-photoluminescence setup\nOur cryogenic micro photoluminescence spectroscopy setup is shown in Fig. S2 a).\nThe\nsample is cooled to 4.5 K in a dry closed-cycle cryostat and can be moved in x, y and z\nS-4\n\n\nSNSPDs\nCorrelator\n1\n2\n3\n3.9K\n4.5K\nx\ny\nz\nPositioners\nSample\n0.77NA\nPBS\nQWP\nPol\nPBS\nQWP\nPol\n50:50 \nBS\n50:50 \nFBS\n50:50 FBS\nGlan-Thompson Pol\nCollection\nInput\nOutput\nInput\nOutput\nRR\nRR\nRR\nRR\nN\nN\nPol\nHWP\nHWP\nHWP\nInput\ndirect path\ndelayed path\nDelay\nAdjustment\nLinear\nStage\nPiezo\nStage\nOutput 1\nOutput 2\nDelay\nNIR pulsed\nTiSa Laser\n80MHz\nPulse\nshaper\na) µ-Photoluminescence\nd) Single Photon Detection\nHanbury-Brown-\nTwiss Setup\ne) Michelson Interferometer\nc) Hong-Ou-Mandel Setup\nb) Spectral Filter Setup\nFigure S2: Sketch of the used setup. The parts are separated as indicated and are connected\nduring the measurements using optical fibers. a) cryogenic micro Photoluminescence setup b)\nspectral filter setup based on volumetric Bragg grating notch filters (N), c) Hong-Ou-Mandel\nsetup to measure the two-photon interference. d) Single photon detection with supercon-\nducting nanowire single-photon detectors (SNSPD) and correlator, as well as the Hanbury\nBrown and Twiss setup to measure the single-photon purity. e) Michelson interferometer\nto measure the coherence length of the photons. Pol: (linear) polarizer, PBS: polarizing\nbeam splitter, Q(H)WP: quarter (half) wave plate, RR: retro reflector, (F)BS: (fiber) beam\nsplitter\nS-5\n\n\ndirections using nano positioners. The QD is excited using a pulsed titanium-sapphire laser\nwith a repetition rate of 80 MHz, which is shaped to a pulse length of about 5 ps using a\n4f pulse shaper. The laser is sent through a Glan-Thompson polarizer to set a well-defined\ns-polarized state, which is then reflected at the subsequent polarizing beam splitter cube\n(PBS). This directs the beam into the cryostat, where it is focused onto the sample using\na NA=0.77 cold lens. The same lens is used in our setup with confocal geometry to collect\nthe emission and back reflected laser. The laser is filtered by cross-polarization, and only\nthe p-polarized emission of the sample passes the PBS and an additional linear polarizer\n(Pol). The detected signal is coupled into a single mode (SM) fiber and can be flexibly\nsent to different filtering and analysis setups. A quarter wave plate (QWP) between the\nPBS and cryostat compensates small birefringence effects to improve the laser suppression.\nThe spectra are recorded using a CCD camera connected to a spectrometer (not shown).\nFor all correlation measurements described below, spectral filtering of the single photons is\nnecessary. We use volumetric Bragg grating notch filters (N), which reflect a narrow spectral\nrange of about 200 pm, while transmitting the rest. The central wavelength of reflection can\nbe adjusted by changing the incidence angle and can be tuned by roughly 15 nm. The setup\nshown in Fig. S2 b) features one N on a rotation stage reflecting the desired wavelength and\ntwo to four further N for additional filtering of unwanted spectral components. This filtering\nsetup has a fiber-to-fiber efficiency of ≈50%.\n2.2\nAutocorrelation measurements\nThe measurement of the second-order autocorrelation function g(2)(t) is realized in a Hanbury\nBrown and Twiss experiment. After spectral filtering, the QD emission is sent into a fiber-\ncoupled 50:50 beam splitter (BS) (input 3 in Fig. S2 d)). The BS outputs are connected to\ntwo superconducting nanowire single photon detectors (SNSPDs). The detection events are\nrecorded as time tags by a time tagger, which are then correlated using a PC, to build a\nhistogram of coincidences as a function of time delay between the events. The detectors have\nS-6\n\n\ntime jitters of 13-14 ps. Together with the time jitter of the time tagger, this results in a total\njitter of about 15 ps for single events and about 21 ps for correlations between two detectors.\nThe single-photon purity can be extracted by evaluating the number of coincidences in the\ncentral peak at t = 0 relative to the average number of coincidences in the 5 side peaks on\nboth sides.\n2.3\nLifetime measurements\nLifetime measurements of the exciton and biexciton states (|X⟩, |XX⟩) are performed by\ntime-correlated single photon counting. The filtered QD emission is sent to one SNSPD. A\nsecond output of the pulse shaper setup is used to tap off the roughly 5 ps long excitation laser\npulses and send it to another SNSPD. The arrival time of the QD photons with respect to the\nexcitation laser pulse is extracted by correlating the time tags of both detectors. The finite\nrise time of the laser and finite setup timing resolution are taken into account by measuring\nthe instrument response function (IRF). For the XX decay, we assume a monoexponential\ndecay with the |XX⟩lifetime τXX. The X decay follows a biexponential decay, with the\n|XX⟩and |X⟩lifetimes as time constants. Both formulas are convoluted with the IRF to\nfit the obtained histograms.\n2.4\nHong-Ou-Mandel measurements\nAccording to the Hong-Ou-Mandel (HOM) effect, if two indistinguishable photons simulta-\nneously impinge on the two different entry ports of a 50:50 beam splitter (BS), they will\ninterfere and will always exit the BS together at the same output port. The measurement\nof the HOM visibility is therefore a good measure for the photon indistinguishability.\n2.4.1\nSetup\nThe HOM interference visibility of subsequent photons from one source is usually measured\nusing an unbalanced Mach-Zehnder-interferometer, as shown in Fig. S2 c). The stream of\nS-7\n\n\nfiltered single photons is sent into the setup using a SM fiber (Input). To correct for the\nrandom unitary transformation of the polarization by the fiber, a combination of half-wave\nplate (HWP) and quarter-wave plate (QWP) is used to maximize the transmission through\nthe following polarizer (Pol). The HWP in front of the PBS is set to send 50% of the intensity\nin each interferometer arm. The arms have different lengths to introduce a delay of 12.5 ns\nin one arm, which matches the 80 MHz repetition rate of the excitation laser. This delay\nis achieved by a combination of a 2 m-long fiber and an adjustable free-space delay. Each\npath contains a HWP and Pol before a polarization maintaining (PM) fiber connected to a\nfiber-coupled 50:50 BS, where the interference will take place. The Pols set the polarization\nof the photons entering the BS and are set to the same (perpendicular) polarization for co\n(cross)-polarized measurements. Furthermore, they are aligned along one polarization axis\nof the fiber. The HWPs compensate for the different efficiencies in the two arms and are\nadjusted such that the total transmitted intensity from each arm is equal. The two exits\n(Output 1 and Output 2) are connected to two SNSPDs (1 and 2 in Fig. S2 d)) and correlated\nas described in Sec. 2.2.\n2.4.2\nMeasurements and data evaluation\nTo determine the HOM visibility, correlation measurements with co- and cross-polarization\nhave to be carried out. In the case of the co-polarized measurement, the photons are ide-\nally indistinguishable, interfere, and thus always leave the BS together. This leads to no\ncoincidences at zero time delay after correlation of the two outputs. For the cross-polarized\nmeasurement, the photons are fully distinguishable, and therefore leave the BS at opposite\noutputs with a probability of 50%. The expected relative intensities of the central histogram\npeaks are therefore ... 1, 1, 0.75, 0(0.5), 0.75, 1, 1 ... for fully indistinguishable (distinguish-\nable) photons.\nTo analyze the data, first, the center peak area Acenter, j for each measurement (j ∈\n{co, cross}) is normalized with the average side peak area for absolute delays ≥2 · 12.5 ns:\nS-8\n\n\naj = Acenter, j\nAside, j . The raw HOM visibility can then be determined by\nVHOM,raw = 1 −aco\nacross\n.\n(1)\nThe analysis described here is only valid for a perfect interference BS with splitting ratio\nR : T = 50 : 50, perfect classical interference visibility ν = 1, and perfect single photons\n(g(2)(0) = 0). For deviations, the obtained raw HOM visibility can be corrected by:S10,S11\nVHOM,corr = VHOM,raw\n1 + 2g(2)(0)\nν2\n.\n(2)\nBy sending a narrow cw laser through our setup we measured a classical visibility of ν =\n0.985. The multi-photon emission probability values for each measurement are listed below\nin Sec 5.2.\n2.5\nMichelson interferometry\nMichelson interferometry, i.e., the measurement of the first-order coherence g(1)(t), is used to\ndetermine the coherence properties of a light source and, thereby, further quantify its optical\nquality. A sketch of a Michelson interferometer is given in Fig. S2e). The incoming signal\nis evenly divided into two interferometer arms using a 50:50 beam splitter cube (BS). Each\narm contains a retroreflector (RR) mounted on a linear motorized stage (travel range 30 cm)\nand a linear piezo stage (travel range 2 mm) respectively, to redirect the signal back to the\nBS, where the two beams interfere. One output of the BS is coupled into a multimode fiber\nand sent to the spectrometer to record the intensity. The integrated intensity of the selected\nemission line is recorded as a function of the piezo stage position in steps of 20 nm. This\nchanges the relative path length, causing a phase shift that generates an interference pattern.\nThe resulting sinusoidal intensity profile is fitted with a cosine function. This allows us to\nS-9\n\n\nextract the interference fringe visibility by\nv = Imax −Imin\nImax + Imin\n.\n(3)\nThis measurement is repeated for increasing path length of the second arm (i.e. different\npositions of the linear stage) until the interference fringes disappear and therefore v ≈0.\nHere, we assume that the path length difference introduced by the piezo stage is negligible\nin comparison to the path length difference introduced by the linear stage. The visibility as\na function of the relative delay time, i.e. the path length difference divided by the speed of\nlight, is fitted using the Fourier-transform (FT) of a Voigt function, which is the convolution\nof a Gaussian and a Lorentzian. From the fit we extract an approximate linewidthS12 Γ ≈\n0.5346fL+\np\n0.2166f 2\nL + f 2\nG, with the FWHM widths in energy domain fL,G of the Lorentzian\nand Gaussian contribution.\n3\nQuantum confined Stark effect\nFigure S3 a) shows a 2D plot with spectra of several replicas of QD 1 under two-photon\nexcitation at different voltages. The pump laser energy was tuned to the resonance of each\nreplica pair. In order to present the data more clearly, only the replicas are shown, whereas\nresidual laser and other small emission lines are cut out. This is done by showing only a\nfew pixels around each emission line for each spectrum. Each emission line is fitted with a\nGaussian function to obtain the energy. The results are shown as dashed lines as well as\nisolated in Fig. S3 b). We fitted these curves using the quadratic equationS13\nE(F) = E0 −αF −βF 2,\n(4)\ndescribing the quantum confined Stark effect. E0 is the transition energy at zero field, α\ncan be interpreted as the permanent dipole of the |X⟩and β its polarizability. Here we\nS-10\n\n\na)\nb)\nc)\nFigure S3: a) Spectra under two-photon excitation of several XX-X replicas of QD 1 as a\nfunction of the voltage. See text for the reconstruction of the plot. All emission lines are\nfitted using Gaussian functions. The fitted energies are plotted as dashed lines and displayed\nin b). Note that b) corresponds to Fig. 1 c) in the main paper. c) Intensities of the XX and\nX replicas as well as total XX and X intensity independent of replicas. The gray dash-dotted\nline indicates −1.08 V, where we compared replicas 1–3 (table S2).\nS-11\n\n\nsubstituted F =\nVb−V\nD , with the built-in voltage Vb = +1.7 V and the thickness of the\nintrinsic layer D = 305 nm. Figure S3 c) shows the integrated intensity of the emission lines,\ncorresponding to the XX and X replicas in Fig. S3 b). The XX0 and X0 are most prominent\naround 0.8 V. Towards lower voltages, the emission is quenched due to charging of the QD.\nAround −0.8 V, the replicas appear, with XX2 and X2 being the brightest for almost the\nentire range. The maximum of the summed up intensities of all replicas is similar to the\nintensity of the XX0 and X0, where the QD is blinking-free. From this, one can argue that\nthe total emission efficiency of all the replicas together is as high as around 0.8 V. At even\nhigher negative voltages, additional replicas appear, which are not studied here.\nTable S1: Fit values for XX and X of each replica of QD 1 from Fig. S3\nReplica\n0\n1\n2\n3\nE0,XX (eV)\n1.589018(8)\n1.5904(6)\n1.59217(8)\n1.59136(13)\nE0,|XX⟩(eV)\n3.181929(10)\n3.1811(7)\n3.17913(12)\n3.1783(2)\nαXX (eV·nm\nV\n)\n-0.142(4)\n0.21(12)\n0.629(16)\n0.53(3)\nα|XX⟩(eV·nm\nV\n)\n-0.335(6)\n-0.61(15)\n-1.03(3)\n-1.20(4)\nβXX (eV·nm2\nV2\n)\n58.2(6)\n35(7)\n13.6(7)\n18.0(11)\nβ|XX⟩(eV·nm2\nV2\n)\n125.2(7)\n149(8)\n181.5(11)\n202.0(19)\nβ|XX⟩\n2e\n(nm2\nV )\n62.6(4)\n75(4)\n90.8(5)\n101.0(10)\nE0,|X⟩(eV)\n1.592911(7)\n1.5906(4)\n1.58697(9)\n1.58700(15)\nα|X⟩(eV·nm\nV\n)\n-0.193(4)\n-0.83(8)\n-1.66(17)\n-1.73(3)\nβ|X⟩(eV·nm2\nV2\n)\n67.0(4)\n114(5)\n167.9(8)\n184.0(15)\nβ|X⟩\ne\n(nm2\nV )\n67.0(4)\n114(5)\n167.9(8)\n184.0(15)\nTable S1 shows the fit parameters of the zero field energy E0, the permanent dipole α\nand the polarizability β for XX and XX photons for the replicas 0–3 in the data shown in\nFig. S3 b). In addition to the values obtained for the XX and X lines, it is interesting to\nevaluate also the values of E0, α and β for the excitonic states giving rise to these emission\nS-12\n\n\nlines.\nFor the |X⟩, these directly correspond to the fit parameters.\nFor the |XX⟩, the\nrespective fit parameters of both photons have to be summed up: E0,|XX⟩= E0,XX + E0,X,\nα|XX⟩= αXX + αX and β|XX⟩= βXX + βX. Although we used a quadratic fit function,\nwe expect the real function for E(F) to be slightly asymmetric, as the QD potential is\nasymmetric in the growth direction.\n3.1\nPolarizability\nSince the |XX⟩comprises the double number of charges compared to the |X⟩, we introduce\nβ\nq ≡\n∂d\n∂F to better compare both states. This quantity describes the change of the average\ndistance d of the charges in the dipole under electric field changes. We use this to characterize\nthe change in wave function overlap. For the |X⟩, the charge of the dipole is q = e, whereas\nit is q = 2e for the |XX⟩. As seen in table S1 β\nq is higher for the |X⟩than for |XX⟩for\nall replicas. Whereas for positive voltages (replica 0), the values are similar, the difference\nincreases with increasing field and\nβ|X⟩\ne\nbecomes more than 1.5× higher than\nβ|XX⟩\n2e . This is\nvisible in Fig. S3 b), as the XX energies show much lower curvatures compared to the X\nenergies.\n3.2\nWave function overlap\nThe lower polarizability of the |XX⟩can be qualitatively interpreted as a partial screening\nof the external electric field. Correlation effects, which are more pronounced for the |XX⟩\ncompared to the |X⟩, will tend to minimize Coulomb repulsion among carriers of the same\nsign and maximize electron-hole attraction for any given external field, thus reducing the\neffect of the external perturbation. This leads to a higher sensitivity of the |X⟩to changes in\nthe electric field. In addition to the higher tunability of the X emission energy, higher fields\nalso lead to a lower wave function overlap compared to the |XX⟩. This results in tunability\nof the |X⟩lifetime by a factor of 3.5. Furthermore, the |X⟩also shows a higher sensitivity to\ncharge noise, leading to increased linewidth broadening. For the |XX⟩, on the other hand,\nS-13\n\n\nthe lifetime increases less and the linewidth remains transform limited.\n3.3\nPermanent dipole\nThe shortest |X⟩lifetime we measured is ≈175 ps at an applied voltage of V ≃1 V. Unfortu-\nnately, we cannot access the neutral X in the zero electric field region (V = Vb ≃1.7 V), since\nthe QD emission is dominated by highly negatively-charged excitonic states in this regime.\nFor comparison, GaAs QDs in non-diode samples exhibit |X⟩lifetimes of ≈200 −250 ps.S3\nThis suggests that the electron-hole wave function overlap is not maximal in non-diode sam-\nples (zero external electric field). Specifically, from the quadratic fit of the data for QDs\nmeasured in this work, we find that the permanent electric dipole at zero field is negative\n(see negative values of αX in Table S1), indicating that the barycenter of the hole wave func-\ntion is located below the electron in growth direction. Interestingly, this result is different\nfrom that obtained in Ref.,S14 where a dipole with opposite sign was observed, possibly due\nto strain-induced effects due to bonding on a different substrate in the QDs studied there\nor to differences in the structural properties of the QDs. A permanent dipole has previ-\nously been observed in several works on InGaAs QDsS13,S15–S18 and its sign manipulated by\nstrain.S19 With increasing fields (V ≈1 −0.5 V), the charge carriers are first pushed closer\ntogether (increasing the wave function overlap and thus shortening the lifetime) until they\nswap positions and the electron is located in the tip of the nanohole. Now, with increasing\nfields, the charge carriers are pulled apart, leading to decreasing wave function overlap and\ntherefore increasing lifetime.\n4\nReplicas of the XX-X pairs\n4.1\nOrigin of the replicas\nSince we observe discrete replicas in our spectra, we make discrete changes in the electrical\nfield responsible, which we attribute to discrete numbers of charges in the vicinity of the\nS-14\n\n\nVB\nϕh\nδ0\nδ\nAl0.15\nAl0.33\nQD\nDistance (arb. units)\nEnergy (arb. units)\na)\nb)\nFigure S4: Inset: Zoom in from Fig. 1 b) in the main manuscript: the valence band edge\nforms a triangular potential below the QD, where holes can be trapped. δ0 = 11.5 nm is the\ndistance between the Al0.33Ga0.67As/Al0.15Ga0.85As interface and the center of the QD. δ is\nthe field-dependent distance of the trapped hole to the interface. a) Calculated distance δ\nbetween the barycenter of the hole wave function in the triangular potential well and the\nAl0.33Ga0.67As layer, indicated in the inset as a function of the electric field Fv given by the\napplied voltage. b) Emission energy of the QD 1 replicas as a function of the total electric\nfield F resulting from the applied voltage, and the field created by one, two or three positive\ncharges (and their mirror image at the n-doped layer) at distance δ0 + δ.\nQD. All investigated QDs show red shifted replicas (see Fig. S3 a,b)), indicating that the\nadditional charge carriers enhance the applied field. Consequently, we expect either electrons\nabove the quantum dot (toward the p-contact) or holes below the quantum dot (on the n-side\nof the diode). Since the band structure lacks a potential structure to trap electrons, we infer\nthat holes are likely trapped in the triangular-shaped potential within the Al0.15Ga0.85As\nlayer (see Fig. S4 a, inset)).S20 In order to find out whether these holes could lead to the\nobserved shift in energy, we first examine the situation of a point charge located right below\nthe QD and reduce the situation to a one-dimensional problem. In this scenario, we calculate\nthe field with the contribution of the applied voltage Fv = Vb−V\nD , the contribution from a\npoint charge Fc at distance δ + δ0 from the center of the QD and its mirror charge in the n\ndoped layer Fm. As indicated in the inset of Fig. S4 a), δ0 = 11.5 nm is the distance between\nthe center of the QD and the interface between the Al0.15Ga0.85As and Al0.33Ga0.67As layers.\nδ is the distance between the barycenter of the trapped additional hole wave function and the\ninterface. Since the triangular well changes with the applied field, δ is also voltage dependent.\nS-15\n\n\nThis is calculated by solving the Schr¨odinger equation for a triangular well resulting in Airy\nfunctions, as plotted in Fig. S4 a). δ is determined by the expectation value. From this, the\nresulting electric field F is calculated to be:\nF = Fv + n\n1\n(δ(Fv) + δ0)2 · 4πϵ0ϵ + Fm\n(5)\nwith n being the number of holes (1 for X1/XX1, 2 for X2/XX2, 3 for X3/XX3), ϵ0 being\nthe vacuum permittivity and ϵ being the permittivity in Al0.33Ga0.67As at 4 K, extrapolated\nfrom literature.S21,S22 Figure S4 b) shows the emission energies of QD 1 as a function of the\ncorrected field F. It shows that the XX and X emission lines of all replicas now nicely follow\nthe same behavior. We thus conclude that the discrete jumps observed in the spectra are\nconsistent with the presence of a number of n holes at the interface between the two AlGaAs\nlayers, right below the QD.\nWhat remains to be explained is how holes are generated and why they seem to get\ntrapped right below the QD rather than at an arbitrary location in the plane of the interface.\n4.2\nPhotogeneration of holes near QDs\nAs discussed above, we expect holes being confined at the triangular potential due to the\nband bending in the Al0.15Ga0.85As layer. The explanation of the presence of these holes is\nnot trivial, since (i) the electric field leads to full depletion of holes close to the n-region of\nthe diode; (ii) the laser energy (Eph ≈1.59 eV) is smaller than the band gap (Eg ≈1.73 eV),\nprohibiting direct optical excitation of electron-hole pairs; and (iii) possible tunneling of\nholes from the QD to the triangular potential is blocked by the large tilt of the bands at\nhigh electric fields. Instead, we ascribe the generation of these holes to the absorption of laser\nphotons in the undoped Al0.15Ga0.85As layer via the Franz-Keldysh effect, which describes\nthe appearance of an absorption tail below the bandgap energy at high electric fields.S23\nSpecifically, a laser photon can generate an electron-hole pair, as illustrated in Fig. S5. The\nS-16\n\n\nelectron wave function is extended over the n-type region with an exponential tail leaking\ninto the Al0.15Ga0.85As layer and the hole is trapped at the triangular potential well. The\nfinite extension of the Al0.15Ga0.85As barrier (thickness: d = 15.1 nm) does not allow for the\nabsorption of photons at too low electric fields. Instead, we expect an onset of the Franz-\nKeldysh, when the electric field F in the diode is high enough so that the potential difference\ne·F ·d across the Al0.15Ga0.85As layer compensates the energy difference Eg −Eph ≈0.14 eV.\nIn our diode structure, this condition is fulfilled for a voltage of V ≈−1.16 V. Starting from\nhere, the absorption coefficient of the layer increases with decreasing voltage. Indeed, we see\nthe maximum intensity of the replica lines in the voltage range of about −1.0 V to −1.8 V,\nas visible in Fig. S3 c). We expect these holes to be long-lived compared to the excitonic\nlifetimes, since electrons from the n-doped layer are pushed away from the interface by the\nlarge electric field.\nGrowth direction (nm)\nEnergy (eV)\n𝜙𝑒\nBelow-bandgap\nabsorption process\nCB\nVB\n𝜙ℎ\nFigure S5: Schematics of the absorption of laser photons via the Franz-Keldysh effect. After\nabsorption, electrons and holes are separated by the electric field with electrons drifting to\nthe n-doped layer and holes getting trapped at the Al0.33Ga0.67As/Al0.15Ga0.85As interface\nS-17\n\n\n4.3\nLocalization of the holes close to the QD\nWhile the confinement of the holes in the triangular well along the growth direction is\nstraightforward, this only serves to trap them in plane. The fact that we observe discrete\nemissions from the replicas, together with the energy shift observed, leads us to conclude that\nthe holes are trapped directly below (in growth direction) the QD. This requires a lateral\nconfinement potential, and we explored several possible explanations: (i) the electric dipole\nof a polarized |X⟩or |XX⟩in the QD, producing an attractive potential on holes located at\nthe interface; (ii) the local strain caused by the QD itself due to the small lattice mismatch\nbetween GaAs and surrounding barrier; (iii) local interface roughness. Both contributions\n(i) and (ii) induce an attractive potential well below 1 meV, so that the discrete jumps in\nemission should disappear at temperatures well above 1 meV/kB ≃12 K. To test these ideas,\nwe examined the emission at 30 K to see if the holes would be thermally excited and the\nreplicas would disappear. Since this was not the case, these contributions can not solely\nexplain the lateral localizations of the holes.\nConcerning (iii) we note that the rate of formation of Al droplets in the LDE method\nincreases with the roughness of the substrate.S24 We speculate that an area of increased\nroughness at the interface between the 15% and 33% Al layers might transfer to the overlying\nlayer for LDE growth and favor the formation of droplets there. This could lead to trapping\nof holes, specifically directly below the QD.\n4.4\nReplica intensities\nFigure S3 c) shows the integrated intensity of the XX and X replicas separated, as well as\nthe sum of all XX and X emission lines. For almost all voltages, the XX intensity is roughly\nequal to the X intensity for each replica. From V = 0 V to V = −0.7 V the overall intensity\nis very low, since positively charged states are dominant in this region. For lower voltages,\nreplicas 1–3 start to appear, while the initial replica 0 disappears. Replica 2 is predominant\nfor the largest voltage range, namely from V = −1.08 V to −1.7 V. It is therefore used for\nS-18\n\n\nalmost all measurement points in the main paper. Only at V = −2.04 V replica 3 is chosen,\nas it is brighter. After the crossing of the XX and X emission energies, the intensity of the\nX decreased faster than the XX. This, together with the appearance of even more replicas,\nlimits the maximum tuning range.\n4.5\nComparison of replicas at the same voltage\nIn order to prove that replicas behave similarly, we compare the three replicas (replicas 1-–3)\nobserved at an applied voltage of −1.08 V, where all replicas show a reasonable brightness.\nThe summarized results in Tab. S2 show that all replicas exhibit similar behavior.\nWe\ntherefore focus on the most prominent replica for each voltage in the main paper, mostly\nreplica 2 (see. Fig. S3 c) ). Only at the last data point at −2.04 V replica 3 dominated. These\nfindings and the energy shift behavior shown in Fig. S4 makes us confident that replicas are\nnot necessary to tune the ratio between |XX⟩and |X⟩lifetime and that a device featuring\nno trap for holes would still be suitable to this aim.\nTable S2: Lifetimes, lifetime ratio r, linewidths Γ, also with respect to their transform limited\nlinewidth Γ0, g(2)(0), and HOM visibilities of the XX and X for the replicas 1-3, which are\npresent at a voltage of −1.08 V.\nReplica\n1\n2\n3\nXX τ (ps)\n119(4)\n133(3)\n122(3)\nX τ (ps)\n227(7)\n227(4)\n252(3)\nr\n0.52(3)\n0.59(2)\n0.484(13)\nXX Γ (µeV)\n10(2)\n9.4(12)\n7.7(2)\nXX\nΓ\nΓ0\n1.2(3)\n1.2(2)\n1.0(4)\nX Γ (µeV)\n4.9(6)\n4.6(5)\n5.6(4)\nX\nΓ\nΓ0\n1.7(3)\n1.6(2)\n2.1(2)\nXX g(2)(0)\n0.0035(10)\n0.0069(10)\n0.0120(5)\nX g(2)(0)\n0.006(6)\n0.0070(5)\n0.008(1)\nraw XX VHOM\n0.607(10)\n0.617(12)\n0.568(14)\ncorr XX VHOM\n0.625(10)\n0.638(12)\n0.594(15)\nraw X VHOM\n0.535(12)\n0.536(10)\n0.501(12)\ncorr X VHOM\n0.553(12)\n0.555(12)\n0.519(13)\nS-19\n\n\n5\nAdditional Data\n5.1\nIndistinguishability of the resonantly excited negative trion\n1.588\n1.590\nIntensity (arb. units)\nEnergy (eV)\na)\nb)\n−25\n0\n25\n0\n500\n1000\nCoincidence counts\nTime delay (ns)\nFigure S6: a) Spectrum of the negative trion of QD 1 at a voltage of 1.03 V under resonant\nfluorescence conditions. b) Histogram of the corresponding HOM measurement.\nTo assess whether our sample suffers from noise sources or the HOM setup is not well\naligned, we measure the HOM interference visibility of photons emitted by a negative trion\nunder resonance fluorescence conditions. The unfiltered spectrum of this transition is shown\nin Fig. S6 a) and the corresponding coincidence histogram is shown in Fig. S6 b). The\nmeasured raw HOM visibility is 0.944(4). Correction for a small multi-photon contribution\n(g(2)(0) = 0.009(2)) and imperfect beam overlap at the beam splitter yield a corrected HOM\nvisibility of 0.991(6).\n5.2\nSingle-photon purity\nWe measure the second-order autocorrelation function for the XX and X, as described in\nSec. 2.2, to verify good filtering of the emission line of interest and for the possibility to correct\nthe measured HOM visibilities for remaining multi-photon contributions.\nThe analyzed\ng(2)(0) values are listed in Table S3. An example measurement is shown in Fig. S7.\nS-20\n\n\n−25\n0\n25\n100\n101\n102\n103\n104\nCoincidence counts\nTime delay (ns)\nFigure S7: Second-order autocorrelation histogram of the XX at an applied voltage of\n−1.08 V yielding g(2)(0) = 0.0035(10).\nTable S3: Single-photon purity g(2)(0) of the XX and X for different voltages.\nVoltage (V)\nReplica\nXX g(2)(0)\nX g(2)(0)\n0.9\n0\n0.008(1)\n0.015(2)\n0.8\n0\n0.006(1)\n0.004(1)\n0.7\n0\n0.012(6)\n0.0070(3)\n0.6\n0\n0.010(7)\n0.010(1)\n-1.08\n1\n0.0035(10)\n0.006(6)\n-1.08\n2\n0.0069(10)\n0.0070(5)\n-1.08\n3\n0.0120(5)\n0.008(1)\n-1.4\n2\n0.0151(12)\n0.0106(11)\n-1.6\n2\n0.0180(16)\n0.0105(6)\n-1.7\n2\n0.039(4)\n0.1140(14)\n-2.04\n3\n0.0187(17)\nS-21\n\n\n5.3\nData on additional quantum dots\nAll other QDs consistently show replicas, however, with different replicas being more or less\npronounced. In the following, we present the data of QD 2, included in Fig. 3 d) in the main\nmanuscript, as well as replicas of QD 3.\n5.3.1\nData of QD 2\nVoltage (V)\n0.85\n-1.55\n-1.8\n-2.1\n-2.2\nReplica\n1\n3\n3\n4\n4\nXX τ (ps)\n104(4)\n138(3)\n154(3)\n168(4)\n155(5)\nX τ (ps)\n175(4)\n287(5)\n351(8)\n536(30)\n569(26)\nr\n0.59(4)\n0.27(2)\n0.31(3)\n0.44(2)\n0.48(2)\nXX g(2)(0)\n0.007(1)\n0.010(1)\n0.019(2)\n0.006(1)\n0.006(1)\nX g(2)(0)\n0.005(1)\nraw XX VHOM\n0.608(30)\n0.655(17)\n0.662(12)\n0.701(11)\n0.694(12)\ncorr XX VHOM\n0.636(31)\n0.688(17)\n0.708(13)\n0.733(11)\n0.724(12)\nraw X VHOM\n0.581(18)\ncorr X VHOM\n0.605(19)\n5.3.2\nReplicas of QD 3\nIn Fig. S8 we show a graph similar to Fig. 1 c) and d) from the main text but for QD 3.\nRecording and reconstruction of the graphs was explained above and in the main manuscript.Figure S8 a)\nshows spectra of every replica pair under TPE for a certain voltage, whereas b) shows the\nenergy shift of each emission line as a function of the voltage. Compared to QD 1 of the\nmain paper, the first replica is much more pronounced, while especially the third replica is\nonly visible in a narrow voltage range. For V = 0.90 V (orange) only replica 0 is visible. For\nV = −1.60 V (green) and V = −3.00 V (blue), three (replica 1-3) and one (replica 2, 10×\nenhanced in brightness) replicas are visible. Figure S9 shows that the energy shifts of the\nreplicas can also be explained by the field contribution from additional holes, as discussed\nabove.\nS-22\n\n\n0\n1\n2\n3\n2\nX\nXX\nXX\nX\nXX\nX\n-3.00V\nx10\n-1.60V\n0.90V\na)\nb)\nFigure S8: a) Spectra of QD 3 at three different voltages under π-pulse two-photon excitation.\nDepending on the voltage, several XX-X replicas (labeled 0–3) could be observed, sometimes\nsimultaneously. For each spectrum, the laser energy was adjusted to match the two-photon\nresonance. Small contributions from other replicas come from phonon-assisted excitation.\nThe wavelength of the excitation laser is indicated with arrows. b) fitted energies of the XX\nand X photons as a function of the applied voltage are shown. Each data point is extracted\nfrom a spectrum under two-photon excitation of the respective replica.\nFigure S9: Emission energy as a function of the total electric field F for QD 3. The electric\nfield contains the contribution of one, two or three positive charges located at a distance\nδ0 + δ from the QD center, where δ is the distance of the hole to the interface below the QD\nlayer. The δ0 is set to 11.5 nm, which is roughly the distance from the interface between the\nAl0.15Ga0.85As and the Al0.33Ga0.67As layers to the center of the QD.\nS-23\n\n\nReferences\n(S1) Mooney, P. M. Deep donor levels (DX centers) in III-V semiconductors. Journal of\nApplied Physics 1990, 67, R1–R26.\n(S2) Mu˜noz, E.; Calleja, E.; Izpura, I.; Garc´ıa, F.; Romero, A. L.; S´anchez-Rojas, J. L.;\nPowell, A. L.; Castagn´e, J. Techniques to minimize DX center deleterious effects in\nIII-V device performance. Journal of Applied Physics 1993, 73, 4988–4997.\n(S3) da Silva, S. F. C.; Undeutsch, G.; Lehner, B.; Manna, S.; Krieger, T. M.; Reindl, M.;\nSchimpf, C.; Trotta, R.; Rastelli, A. GaAs quantum dots grown by droplet etching\nepitaxy as quantum light sources. Applied Physics Letters 2021, 119.\n(S4) Trellakis, A.; Zibold, T.; Andlauer, T.; Birner, S.; Smith, R. K.; Morschl, R.; Vogl, P.\nThe 3D nanometer device project nextnano: Concepts, methods, results. Journal of\nComputational Electronics 2006, 5, 285–289.\n(S5) Birner, S.; Zibold, T.; Andlauer, T.; Kubis, T.; Sabathil, M.; Trellakis, A.; Vogl, P.\nnextnano: General Purpose 3-D Simulations. IEEE Transactions on Electron Devices\n2007, 54, 2137–2142.\n(S6) Wolfe, C.; Korn, D.; Stillman, G. Silicon as a residual donor in high-purity GaAs.\nApplied Physics Letters 1974, 24, 78–80.\n(S7) Ferreira da Silva, A.; Pepe, I.; Sernelius, B. E.; Persson, C.; Ahuja, R.; De Souza, J.;\nSuzuki, Y.; Yang, Y. Electrical resistivity of acceptor carbon in GaAs. Journal of\nApplied Physics 2004, 95, 2532–2535.\n(S8) Hava, S.; Auslender, M. Velocity-field relation in GaAlAs versus alloy composition.\nJournal of Applied Physics 1993, 73, 7431–7434.\n(S9) Brennan, K.; Hess, K. Theory of high-field transport of holes in Al0.45Ga0.55As.\nJournal of Applied Physics 1986, 59, 964–966.\nS-24\n\n\n(S10) Santori, C.; Fattal, D.; Vuˇckovi´c, J.; Solomon, G. S.; Yamamoto, Y. Indistinguishable\nphotons from a single-photon device. Nature 2002, 419, 594–597.\n(S11) Zhai, L.; Nguyen, G. N.; Spinnler, C.; Ritzmann, J.; L¨obl, M. C.; Wieck, A. D.;\nLudwig, A.; Javadi, A.; Warburton, R. J. Quantum interference of identical photons\nfrom remote GaAs quantum dots. Nature Nanotechnology 2022, 17, 829–833.\n(S12) Olivero, J. J.; Longbothum, R. L. Empirical fits to the Voigt line width: A brief review.\nJournal of Quantitative Spectroscopy and Radiative Transfer 1977, 17, 233–236.\n(S13) Fry, P. W.; Itskevich, I. E.; Mowbray, D. J.; Skolnick, M. S.; Finley, J. J.; Barker, J. A.;\nO’Reilly, E. P.; Wilson, L. R.; Larkin, I. A.; Maksym, P. A.; Hopkinson, M.; Al-\nKhafaji, M.; David, J. P. R.; Cullis, A. G.; Hill, G.; Clark, J. C. Inverted Electron-\nHole Alignment in InAs-GaAs Self-Assembled Quantum Dots. Physical Review Letters\n2000, 84, 733–736.\n(S14) Huang, H.; Csontosov´a, D.; Manna, S.; Huo, Y.; Trotta, R.; Rastelli, A.; Klenovsk´y, P.\nElectric field induced tuning of electronic correlation in weakly confining quantum\ndots. Physical Review B 2021, 104, 165401.\n(S15) Barker, J. A.; O’Reilly, E. P. Theoretical Analysis of Electron-Hole Alignment in\nInAs-GaAs Quantum Dots. Physical Review B 2000, 61, 13840–13851.\n(S16) Jin, P.; Li, C. M.; Zhang, Z. Y.; Liu, F. Q.; Chen, Y. H.; Ye, X. L.; Xu, B.;\nWang, Z. G. Quantum-Confined Stark Effect and Built-in Dipole Moment in Self-\nAssembled InAs/GaAs Quantum Dots. Applied Physics Letters 2004, 85, 2791–2793.\n(S17) Finley, J. J.; Sabathil, M.; Vogl, P.; Abstreiter, G.; Oulton, R.; Tartakovskii, A. I.;\nMowbray, D. J.; Skolnick, M. S.; Liew, S. L.; Cullis, A. G.; Hopkinson, M. Quantum-\nconfined Stark shifts of charged exciton complexes in quantum dots. Physical Review\nB 2004, 70, 2–5.\nS-25\n\n\n(S18) Mar, J. D.; Baumberg, J. J.; Xu, X. L.; Irvine, A. C.; Williams, D. A. Precise Measure-\nments of the Dipole Moment and Polarizability of the Neutral Exciton and Positive\nTrion in a Single Quantum Dot. Physical Review B 2017, 95, 201304.\n(S19) Aberl, J.; Klenovsk´y, P.; Wildmann, J. S.; Mart´ın-S´anchez, J.; Fromherz, T.; Zallo, E.;\nHuml´ıˇcek, J.; Rastelli, A.; Trotta, R. Inversion of the exciton built-in dipole moment\nin In(Ga)As quantum dots via nonlinear piezoelectric effect. Physical Review B 2017,\n96, 045414.\n(S20) Houel, J.; Kuhlmann, A. V.; Greuter, L.; Xue, F.; Poggio, M.; Gerardot, B. D.;\nDalgarno, P. A.; Badolato, A.; Petroff, P. M.; Ludwig, A.; Reuter, D.; Wieck, A. D.;\nWarburton, R. J. Probing Single-Charge Fluctuations at a GaAs/AlAs Interface Using\nLaser Spectroscopy on a Nearby InGaAs Quantum Dot. Physical Review Letters 2012,\n108, 107401.\n(S21) Adachi, S. GaAs, AlAs, and Alx Ga1-x As: Material parameters for use in research\nand device applications. Journal of Applied Physics 1985, 58, R1–R29.\n(S22) Strzalkowski, I.; Joshi, S.; Crowell, C. R. Dielectric Constant and Its Temperature\nDependence for GaAs, CdTe, and ZnSe. Applied Physics Letters 1976, 28, 350–352.\n(S23) Chuang, S. Physics of Photonic Devices; Wiley Series in Pure and Applied Optics;\nWiley, 2009.\n(S24) Kruck, T.; Babin, H. G.; Wieck, A. D.; Ludwig, A. Critical Aluminum Etch Material\nAmount for Local Droplet-Etched Nanohole-Based GaAs Quantum Dots. Crystals\n2024, 14.\nS-26\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.20093v1.pdf",
    "total_pages": 37,
    "title": "Electric-field control of photon indistinguishability in cascaded decays in quantum dots",
    "authors": [
      "Gabriel Undeutsch",
      "Maximilian Aigner",
      "Ailton J. Garcia Jr.",
      "Johannes Reindl",
      "Melina Peter",
      "Simon Mader",
      "Christian Weidinger",
      "Saimon F. Covre da Silva",
      "Santanu Manna",
      "Eva Schöll",
      "Armando Rastelli"
    ],
    "abstract": "Photon indistinguishability, entanglement, and antibunching are key\ningredients in quantum optics and photonics. Decay cascades in quantum emitters\noffer a simple method to create entangled photon-pairs with negligible\nmulti-pair generation probability. However, the degree of indistinguishability\nof the photons emitted in a cascade is intrinsically limited by the lifetime\nratio of the involved transitions. Here we show that, for the biexciton-exciton\ncascade in a quantum dot, this ratio can be widely tuned by an applied electric\nfield. Hong-Ou-Mandel interference measurements of two subsequently emitted\nbiexciton photons show that their indistinguishability increases with\nincreasing field, following the theoretically predicted behavior. At the same\ntime, the emission linewidth stays close to the transform-limit, favoring\napplications relying on the interference among photons emitted by different\nsources.",
    "published_date": "2025-02-27",
    "source": "arxiv"
  }
}