{
  "id": "arxiv_2502.21293v1",
  "text": "On the role of 5-wave resonances in the nonlinear dynamics of the\nFermi-Pasta-Ulam-Tsingou lattice\nTiziana Comitoa, Matteo Lotrigliaa, Miguel D. Bustamantea,*\naSchool of Mathematics and Statistics, University College Dublin, Belfield, Dublin 4, Ireland\nAbstract\nWe study the dynamics of the (α + β) Fermi-Pasta-Ulam-Tsingou lattice (FPUT lattice, for short) for an arbitrary\nnumber N of interacting particles, in regimes of small enough nonlinearity so that a Birkhoff-Gustavson type of\nnormal form can be found using tools from wave-turbulence theory. Specifically, we obtain the so-called Zakharov\nequation for 4-wave resonant interactions and its extension to 5-wave resonant interactions by Krasitskii, but we\nintroduce an important new feature: even the generic terms in these normal forms contain resonant interactions only,\nvia a unique canonical transformation. The resulting normal forms provide an approximation to the original FPUT\nlattice that possesses a significant number of exact quadratic conservation laws, beyond the quadratic part of the\nHamiltonian. We call the new equations ”exact-resonance evolution equations” and examine their properties: (i)\nHeisenberg representation’s slow evolution allows us to implement numerical methods with large time steps to obtain\nrelevant dynamical information, such as Lyapunov exponents. (ii) We introduce tests, such as convergence of the\nnormal form transformation and truncation error verification, to successfully validate our exact-resonance evolution\nequations. (iii) The systematic construction of new quadratic invariants (via the resonant cluster matrix) allows us to\nuse finite-time Lyapunov exponent calculations to quantify the level of nonlinearity at which the original FPUT lattice\nis well approximated by the exact-resonance evolution equations. We show numerical experiments in the case N = 9,\nbut the theory and numerical methods are valid for arbitrary values of N. We conclude that, when 3 divides N, at\nsmall enough nonlinearity the FPUT lattice’s dynamics and nontrivial hyperchaos are governed by 5-wave resonant\ninteractions.\nKeywords: FPUT resonant dynamics, Zakharov equations, Normal form transformations, Lyapunov exponents\n1. Introduction\nThe Fermi-Pasta-Ulam-Tsingou (FPUT) lattice considers a one-dimensional chain made out of N identical masses\nconnected by nonlinear springs, where the elastic forcing is modelled as power series that include anharmonic terms\nup to cubic order in the displacement: the name (α + β) FPUT is commonly used for this model, to refer to quadratic\nterms (α) and cubic terms (β) in the elastic forcing. Allowing interactions between first neighbours triggers complex\nenergy exchanges that reverberate across various space and time scales. In the original problem [1], the chain has\nfixed boundary conditions (BCs) and displays the phenomenon of recurrence in contrast with Fermi’s assumption\nthat the presence of nonlinearity would be enough to bring the system to equipartition. This incongruity took the\nname of “FPU paradox” and triggered the interest of the scientific community, eventually leading to fundamental\ndiscoveries such as the birth of the theory of integrable systems [2, 3]. Later it was shown analytically in [4] that there\nexists a critical energy threshold above which equipartition is reachable. Further mathematical [5, 6, 7] and numerical\nresults [8, 9] followed right after and several theories have been presented to explain why equipartition should occur\neventually. One of the first ones, still controversial, is based on considerations of resonances and finite-amplitude\neffects. The legacy this problem carries is vast, and attempts to provide an exhaustive summary of its history is a hard\ntask. References [10, 11, 12] can be consulted for a concise pipeline of FPUT’s chronicle.\nOur work focuses on the role of resonances in the dynamics of the FPUT system, from a fresh viewpoint in the\ncontext of low degrees of freedom (low number of masses N), where the chain has periodic boundary conditions, so\n*Corresponding author. E-mail: miguel.bustamante@ucd.ie\nPreprint submitted to Physica D\nMarch 3, 2025\narXiv:2502.21293v1  [nlin.CD]  28 Feb 2025\n\n\nthat exact wave-wave resonant interactions appear: namely, particular linear combinations of wavenumbers and akin\nin frequencies add up to zero. The state of the art in this subject provides a clear but incomplete picture: it has been\nknown for a while that 3−wave resonances do not exist, whereas 4−wave resonances are admitted for N even only, but\nthey turn out to be completely integrable [13]. Thus, one must look at the next orders of interaction, namely 5-wave\nresonances (admitted when 3 divides N) and 6-wave resonances, in order to get mixing across the energy spectrum.\nIn the context of surface water waves with non-integrable dynamics, the question regarding the existence of quintets\nwas undertaken in [14] and [15] using a diagram scheme. More recently [16] tackled the same problem for the FPUT\nmodel using cyclotomic polynomials from number theory, providing an exhaustive technique to find all possible exact\nwave-wave interactions of the sort. As underlined in a recent report [17], validation of the Wave Turbulence theory to\ndiscrete systems is still an open question. One aim of this work concerns the validation of the canonical transformation\nand its relation with integrability.\nTo remove non-resonant terms in the FPUT system, a set of quasi-identity transformations is introduced as a power\nseries expansion with unknown coefficients to be determined. Substituting this into the evolution equations leads to\nthe so-called Birkhoff-Gustavson normal form [18], containing only resonant contributions up to the 5-wave order.\nWe follow the approach proposed by Krasitskii in [19], validating his kernels at all necessary orders. At difference\nwith Gustavson’s and Krasitskii’s works, which keep some ambiguity in the canonical transformations, we introduce\nnew tensors to implement unique canonical transformations and normal forms so that, instead of generic terms, the\nequations contain exact resonant interactions only. We call the new equations “exact-resonance evolution equations”.\nIn section 2 the problem is tackled mathematically. The pivotal changes of coordinates leading to the exact-\nresonance evolution equations for the FPUT lattice are defined, along with the derivation of each evolution equation\nat every relevant order up to and including 5-wave resonances. Section 3 is devoted to validation techniques. We\npropose two distinct methodologies to corroborate numerically the analytical results, namely the relation between\nthe original and approximated models arising after the transformation. One approach is based on the truncation\nerror of the mapped equations at each order. The other approach is based on the convergence of the normal form\ntransformation. In addition, we look at time series to clearly demonstrate energy exchanges due to 5-wave resonant\ninteractions. Following up, the dynamical characteristics of 5-wave interactions becomes the main topic of section 4:\nlinks between resonances, hyperchaos, and constants of motion are addressed from a theoretical and constructive\nstandpoint based on the resonant cluster matrix and Lyapunov exponents, to culminate with a proposed method that\ndemonstrates numerically how the original FPUT lattice is well approximated by the 5-wave exact-resonance evolution\nequations. Finally, in section 5 we present conclusions, a synopsis of results, and future research venues.\n2. FPUT equations of motion, normal modes, resonances and normal-form transformation\nThe (α+β)-FPUT model is a lattice of N identical point-like particles of mass m joined together by elastic springs,\ninteracting via first neighbors, with a force derived from an anharmonic potential. Let qj be the displacement of the\nj-th particle with respect to its equilibrium position, and let pj be its linear momentum, where j = 0, .., N −1. The\nequations of motion for the (α + β)-FPUT model are derived from the Hamiltonian\nH =\nN−1\nX\nj=0\n\u0010 1\n2m p2\nj + κ\n2\n\u0000qj+1 −qj\n\u00012 + α\n3\n\u0000qj+1 −qj\n\u00013 + β\n4\n\u0000q j+1 −qj\n\u00014\u0011\n(1)\nvia the canonical Hamilton equations\n˙q j = ∂H\n∂pj\n= p j\nm ,\n˙pj = −∂H\n∂q j\n= κ(qj−1 −2qj + qj+1) + α\u0000(qj+1 −qj)2 −(q j −qj−1)2\u0001 + β\u0000(qj+1 −q j)3 −(qj −qj−1)3\u0001 ,\n(2)\nwhere κ, α, and β are non-negative prefactors that weigh the contribution of the linear (κ) and nonlinear terms (α, β).\nFrom dimensional analysis we note that there are only 2 arbitrary parameters: ¯α ∝ϵα and ¯β ∝ϵ2β, where ϵ is the\ninitial energy provided to the system. In other words we can set m = κ = 1, but we will keep using these constants in\nthe formulas for bookkeeping purposes.\n2\n\n\n2.1. Periodic boundary conditions and normal modes\nAssuming periodic boundary conditions, q0(t) := qN−1(t) ∀t ∈R, one can apply a discrete Fourier transform\nin space to diagonalise the quadratic part of the Hamiltonian (1) through a canonical transformation, obtaining the\nso-called normal modes:\nak\n=\n1\nN √2mωk\nN−1\nX\nj=0\n\u0010\nmωkq j + ip j\n\u0011\ne−i 2π jk\nN ,\n(3)\na∗\nN−k\n=\n1\nN √2mωk\nN−1\nX\nj=0\n\u0010\nmωkq j −ip j\n\u0011\ne−i 2π jk\nN ,\nk = 1, . . . , N −1 ,\n(4)\nwhere we have introduced the dispersion relation\nωk = 2\nr\nκ\nm sin(πk/N),\nk = 1, 2, ..., N −1.\n(5)\nPhysically, these variables represent “waves”, i.e. oscillatory patterns with wavenumber k and natural frequency ωk.\nAs detailed in reference [16], the Hamiltonian becomes\nH\nN =\nX\n0\nω0a∗\n0a0 +\nX\n0,1,2\n 1\n3V0,1,2a0a1a2δ0,1,2 + V−0,1,2a∗\n0a1a2δ1,2\n0 + c.c.\n!\n+\nX\n0,1,2,3\n 1\n4T0,1,2,3a0a1a2a3δ0,1,2,3 + 3\n4T−0,−1,2,3a∗\n0a∗\n1a2a3δ2,3\n0,1 + T−0,1,2,3a∗\n0a1a2a3δ1,2,3\n0\n+ c.c.\n!\n,\n(6)\nwhere the numerical subscript refers to wavenumber indices (e.g. T0,1,2,3 := T(k0, k1, k2, k3), 1 ≤k j ≤N −1, and\na0 := ak0), whereas the Kronecker delta’s sub/superscripts encode momentum conditions (e.g. δ1,2,3\n0\n= δ(k0−k1−k2−k3\nmod N)). The tensors V, T encode the interactions between normal modes in the Hamiltonian. Explicitly,\nV0,1,2 = −\niα\n(mκ)3/4 eiπ(k0+k1+k2)/N\nr\nsin πk0\nN sin πk1\nN sin πk2\nN\n(7)\nand\nT0,1,2,3 = β\nmκeiπ(k0+k1+k2+k3)/N\nr\nsin πk0\nN sin πk1\nN sin πk2\nN sin πk3\nN ,\n(8)\nwhereas negative indices indicate that the corresponding wavenumber ki is replaced with N −ki. For example, V−0,1,2\nis equal to the RHS of equation (7) where k0 is replaced with N −k0. The Hamilton equations are simply\ni˙ak = 1\nN\n∂H\n∂a∗\nk\n,\ni˙a∗\nk = −1\nN\n∂H\n∂ak\n,\nk = 1, . . . , N −1 ,\nand explicitly, using the short-hand notation a0 := ak0, a1 := ak1, etc., we have\ni˙a0 = ω0a0 +\nX\n1,2\n\u0000V−0,1,2a1a2δ1,2\n0 −2V0,1,−2a∗\n1a2δ2\n0,1 −V0,1,2a∗\n1a∗\n2δ0,1,2\n\u0001+\n+\nX\n1,2,3\n\u0000T−0,1,2,3a1a2a3δ1,2,3\n0\n+ 3T−0,−1,2,3a∗\n1a2a3δ2,3\n0,1 + 3T0,1,2,−3a∗\n1a∗\n2a3δ3\n0,1,2 + T0,1,2,3a∗\n1a∗\n2a∗\n3δ0,1,2,3\n\u0001 .\n(9)\nThis equation carries the same dynamical information as Eq. (2). It shows three- and four-wave interactions (respec-\ntively coming from the terms involving the V and the T tensors), inherited from the quadratic and cubic nonlinearity\nin the original equations (2). In fact, V0,1,2 ∝α and T0,1,2,3 ∝β and these tensors must respect specific symmetries\nunder index exchanges, implied in the multiple summations in equation (6).\nThe presence of Kronecker delta terms in equation (9) means that not every arrangement of wavenumbers is\nallowed to interact and, therefore, some terms contribute more meaningfully than others to the dynamics. A heuristic\n3\n\n\nmotivation of our rigorous analytical treatment in the next section is as follows: irreversible (i.e., chaotic) energy\nexchanges can occur only if those interactions allowed by the Kronecker deltas in wavenumber space satisfy extra\nconditions based on the resonance of their frequencies. In such a case, an exact resonance is present, involving S (≥0)\nincoming waves and T(≥0) outgoing waves:\n\nk1 + . . . + kS = kS +1 + . . . + kS +T\n(mod N) ,\nω(k1) + . . . + ω(kS ) = ω(kS +1) + . . . + ω(kS +T) ,\n1 ≤ki ≤N −1,\ni = 1, . . . , S + T ,\n(10)\nwhere, as before, the dispersion relation is ω(k) = 2 √κ/m sin(πk/N). System (10) is a Diophantine system of equa-\ntions, namely it is a set of equations for a total of S + T integer unknowns. No solutions exist when one of (S, T) is\ngreater than one and the other is equal to 1 or 0. This includes the case S + T = 3, which means that there are no triad\nexact resonances. Trivial solutions exist when S = T. Remarkably, nontrivial solutions exist when S = T = 2 and N\nis even (resonant quartets), when S = 2, T = 3 (or S = 3, T = 2) and N is divisible by 3 (resonant quintets), when\nS + T = 6 (resonant sextuplets), and so on. See [16] for details on explicit parameterisations of these solutions.\n2.2. Resonances and near-identity canonical transformations to normal-form variables\nOne objective of this paper is to arrive, via canonical transformations, to equivalent equations driven by exact reso-\nnances only, and show that the lowest relevant order to obtain chaos in FPUT necessitates five-wave exact resonances.\nWe achieve this by using classical tools from turbulence theory: via successive near-identity transformations, it is\npossible to remove non-resonant terms order by order and recover a reduced equation driven by exact resonances. The\nprocedure was successfully applied by Zakharov [20] and afterwards revised by Krasitskii [21, 19] in the Hamiltonian\ntheory of weakly nonlinear surface waves where they postulated a canonical transformation in the form of an integral\npower series. This change of variables aims to remove unimportant terms from the evolution equation by setting the\ntensors of the transformation appropriately. The transformations are carried out iteratively, allowing us to retrieve the\nevolution equations truncated at each relevant order. In our context, we will introduce three such transformations,\ncorresponding respectively to the elimination of non-resonant triads, quartets and quintets:\na0 = b0 +\nX\n1,2\n\u0000A(1)\n0,1,2b1b2δ1,2\n0 + A(2)\n0,1,2b∗\n1b2δ2\n0,1 + A(3)\n0,1,2b∗\n1b∗\n2δ0,1,2\n\u0001 ,\n(11)\na0 = c0 +\nX\n1,2\n\u0000A(1)\n0,1,2c1c2δ1,2\n0 + A(2)\n0,1,2c∗\n1c2δ2\n0,1 + A(3)\n0,1,2c∗\n1c∗\n2δ0,1,2\n\u0001\n+\nX\n1,2,3\n\u0000B(1)\n0,1,2,3c1c2c3δ1,2,3\n0\n+ B(2)\n0,1,2,3c∗\n1c2c3δ2,3\n0,1 + B(3)\n0,1,2,3c∗\n1c∗\n2c3δ3\n0,1,2 + B(4)\n0,1,2,3c∗\n1c∗\n2c∗\n3δ0,1,2,3\n\u0001 ,\n(12)\na0 = d0 +\nX\n1,2\n\u0000A(1)\n0,1,2d1d2δ1,2\n0 + A(2)\n0,1,2d∗\n1d2δ2\n0,1 + A(3)\n0,1,2d∗\n1d∗\n2δ0,1,2\n\u0001\n+\nX\n1,2,3\n\u0000B(1)\n0,1,2,3d1d2d3δ1,2,3\n0\n+ B(2)\n0,1,2,3d∗\n1d2d3δ2,3\n0,1 + B(3)\n0,1,2,3d∗\n1d∗\n2d3δ3\n0,1,2 + B(4)\n0,1,2,3d∗\n1d∗\n2d∗\n3δ0,1,2,3\n\u0001\n+\nX\n1,2,3,4\n\u0000C(1)\n0,1,2,3,4d1d2d3d4δ1,2,3,4\n0\n+ C(2)\n0,1,2,3,4d∗\n1d2d3d4δ2,3,4\n0,1 + C(3)\n0,1,2,3,4d∗\n1d∗\n2d3d4δ,3,4\n0,1,2\n+ C(4)\n0,1,2,3,4d∗\n1d∗\n2d∗\n3d4δ4\n0,1,2,3 + C(5)\n0,1,2,3,4d∗\n1d∗\n2d∗\n3d∗\n4δ0,1,2,3,4\n\u0001 ,\n(13)\nwhere A(i)\n0,1,2, B(i)\n0,1,2,3, and C(i)\n0,1,2,3,4 are unknown tensor coefficients to be determined as follows. Substituting\nEqs. (11)–(13) into Eq. (9) makes higher powers of the new variables appear, via combinations of the lower orders\nones in the original equations. After the substitutions, common terms are collected together and suitably symmetrised.\nRemarkably, in this process, factors of the form\n∆1+2−0 := ω1 + ω2 −ω0 ,\n∆1+2+3−0 := ω1 + ω2 + ω3 −ω0 ,\n∆2+3−0−1 := ω2 + ω3 −ω0 −ω1\n(14)\nappear, as well as other similar factors such as ∆2+3+4−0−1 := ω2 + ω3 + ω4 −ω0 −ω1 and so on. Notice that a simple\ncomparison with the resonant conditions (10) shows that, for a given (S + T)-wave resonance, the corresponding\ncoefficient ∆kS +1...kS +T\nk1...kS\nis equal to zero.\n4\n\n\nNext, within these equations of motion, non-resonant terms are eliminated, order by order, by setting the coeffi-\ncients A(i)\n0,1,2, B(i)\n0,1,2,3, and C(i)\n0,1,2,3,4 appropriately. The detailed procedure is well explained in the above-cited papers\n[20, 21, 19], so in this exposition we will be brief, leaving some of the details involving long expressions to Appendix\nA, while commenting here on the new ideas we introduce.\n2.2.1. Eliminating non-resonant triad interactions\nFormulas for the coefficients A(i)\n0,1,2 are easy to obtain, because they arise at the lowest order of interaction: triads,\nwhich are never resonant in the FPUT case. We have:\nA(1)\n0,1,2 = \u0000∆1+2−0\n\u0001−1V−0,1,2 ,\nA(2)\n0,1,2 = 2\u0000∆0+1−2\n\u0001−1V0,1,−2 ,\nA(3)\n0,1,2 = \u0000∆0+1+2\n\u0001−1V0,1,2 ,\n(15)\nand we stress that these formulas are always valid, as the factors ∆1+2−0 and so on are never equal to zero in FPUT\nbecause the dispersion relation is subadditive (see [16] for details). As a result of the canonical transformation (11),\nthe variables b satisfy the approximate equations of motion\ni ˙b0 = ω0b0 + O(b3) ,\n(16)\nwith a truncation error O(b3) representing a homogeneous polynomial of degree 3 in the b- and b∗-variables.\n2.2.2. Eliminating non-resonant quartet interactions\nFormulas for the coefficients B(i)\n0,1,2,3 are classified into two types: “always non-resonant” type, producing formulas\nfor B(1)\n0,1,2,3, B(3)\n0,1,2,3 and B(4)\n0,1,2,3, and “potentially resonant” type, producing a formula for B(2)\n0,1,2,3. This distinction is\nmade because the only potential 4-wave resonance occurs when S = T = 2, namely only ∆0+1−2−3 can possibly be\nequal to zero at a resonance. This follows again from the subadditivity of the FPUT dispersion relation and we refer\nto [16] for details. The “always non-resonant” case gives:\nB(1)\n0,1,2,3 = −\u0000∆0−1−2−3\n\u0001−1\u0010\nT−0,1,2,3 + Z(1)\n0,1,2,3\n\u0011\n,\nB(3)\n0,1,2,3 = −\u0000∆0+1+2−3\n\u0001−1\u0010\n3T0,1,2,−3 + Z(3)\n0,1,2,3\n\u0011\n,\nB(4)\n0,1,2,3 = −\u0000∆0+1+2+3\n\u0001−1\u0010\nT0,1,2,3 + Z(4)\n0,1,2,3\n\u0011\n,\n(17)\nwhere T is given in equation (8), while Z(1), Z(3) and Z(4) are given in equations (A.1)–(A.3) in Appendix A. In\ncontrast, the “potentially resonant” case distinguishes two subcases: the resonant subcase (when ∆0+1−2−3 = 0) and\nthe non-resonant subcase (when ∆0+1−2−3 , 0), as follows:\nB(2)\n0,1,2,3 = Λ0,1,2,3 + λ0,1,2,3 ,\n(18)\nwith\nΛ0,1,2,3 := −A(3)\n0,1,−0−1A(3)\n−2−3,2,3+A(1)\n0,2,0−2A(1)\n3,1,3−1+A(1)\n0,3,0−3A(1)\n2,1,2−1+A(1)\n0+1,0,1A(1)\n2+3,2,3−A(1)\n1,2,1−2A(1)\n3,3−0,0−A(1)\n1,3,1−3A(1)\n2,2−0,0 (19)\nand\nλ0,1,2,3 :=\n\n0\nif\n∆0+1−2−3 = 0 ,\n−\u0000∆0+1−2−3\n\u0001−1 \u0010\n3T−0,−1,2,3 + 1\n4\n\u0010\nZ(2)\n0,1,2,3 + Z(2)\n1,0,2,3 + Z(2)\n2,3,0,1 + Z(2)\n3,2,0,1\n\u0011\u0011\nif\n∆0+1−2−3 , 0 ,\n(20)\nwhere A(1), A(3) are given in equation (15), T is given in equation (8), and Z(2) is given in equation (A.4) in Appendix\nA. It is important to remark here that, at difference with Krasitskii [19] (where the tensor λ is set to be identically zero),\nin our approach the tensor takes non-zero values precisely at places where the quartets are not resonant. Our choice\nof λ in equation (20) satisfies the required symmetries under the permutations 0 ↔1 and 2 ↔3, and antisymmetry\nunder the permutation {0, 1} ↔{2, 3}, and is chosen so that the equations of motion for the c-variables contain only\nnon-resonant terms. Explicitly, as a result of the canonical transformation (12), the variables c satisfy the approximate\nequations of motion\ni ˙c0 = ω0c0 +\nX\n1,2,3\neT0,1,2,3c∗\n1c2c3δ2,3\n0,1 + O(c4) ,\n(21)\n5\n\n\nthis time with a truncation error O(c4) representing a homogeneous polynomial of degree 4 in the c-variables, and\nwith\neT0,1,2,3 =\n\n3T−0,−1,2,3 + 1\n4\n\u0000Z(2)\n0,1,2,3 + Z(2)\n1,0,2,3 + Z(2)\n2,3,0,1 + Z(2)\n3,2,0,1\n\u0001\nif\n∆0+1−2−3 = 0 ,\n0\nif\n∆0+1−2−3 , 0 ,\n(22)\nwhere again Z(2) is given in equation (A.4) in Appendix A. At this level of approximation, the Hamiltonian (1) is\nH\nN =\nX\n0\nω0c∗\n0c0 +\nX\n0,1,2,3\neT0,1,2,3c∗\n0c∗\n1c2c3δ2,3\n0,1 + O(c5)\n(23)\nand the equations of motion (21) are canonical:\ni˙ck = 1\nN\n∂H\n∂c∗\nk\n+ O(c4) ,\ni˙c∗\nk = −1\nN\n∂H\n∂ck\n+ O(c4) ,\nk = 1, . . . , N −1 .\n2.2.3. Eliminating non-resonant quintet interactions\nFinally, formulas for the coefficients C(i)\n0,1,2,3,4 are obtained in a similar way. Again there is a distinction between\n“always non-resonant” and “potentially resonant” types, because the only possible FPUT 5-wave resonances occur\nwhen {S, T} = {2, 3}, namely only ∆0+1+2−3−4 or ∆0+1−2−3−4 can possibly equal zero at a resonance. The “always\nnon-resonant” case gives\nC(1)\n0,1,2,3,4 = \u0000∆0−1−2−3−4\n\u0001−1 \u0010\n−i X(1)\n0,1,2,3,4\n\u0011\n,\nC(4)\n0,1,2,3,4 = \u0000∆4−0−1−2−3\n\u0001−1 \u0010\n−i X(4)\n0,1,2,3,4\n\u0011\n,\nC(5)\n0,1,2,3,4 = \u0000∆0+1+2+3+4\n\u0001−1 \u0010\n−i X(5)\n0,1,2,3,4\n\u0011\n,\n(24)\nwhere the tensors X(1), X(4), X(5) are given in equations (A.5)–(A.7) in Appendix A. In contrast, the “potentially\nresonant” case is separated in two subcases: the resonant subcases (when ∆0+1+2−3−4 = 0 or ∆0+1−2−3−4 = 0) and the\nnon-resonant subcases (when ∆0+1+2−3−4 , 0 or ∆0+1−2−3−4 , 0), as follows:\nC(2)\n0,1,2,3,4 =\n\nC(2,Krasitskii)\n0,1,2,3,4\n+ C(2,λ)\n0,1,2,3,4\nif\n∆0+1−2−3−4 = 0 ,\n\u0000∆0+1−2−3−4\n\u0001−1 \u0010\ni X(2)\n0,1,2,3,4\n\u0011\nif\n∆0+1−2−3−4 , 0 ,\n(25)\nC(3)\n0,1,2,3,4 =\n\nC(3,Krasitskii)\n0,1,2,3,4\n+ C(3,λ)\n0,1,2,3,4\nif\n∆0+1+2−3−4 = 0 ,\n\u0000∆0+1+2−3−4\n\u0001−1 \u0010\n−i X(3)\n0,1,2,3,4\n\u0011\nif\n∆0+1+2−3−4 , 0 ,\n(26)\nwhere: X(2), X(3) are given in equations (A.8)–(A.9) in Appendix A; C(2,Krasitskii),C(3,Krasitskii) are the usual resonant-\ncase Krasitskii tensors [19, equations (3.30) and (3.35)], given by\nC(2,Krasitskii)\n0,1,2,3,4\n= −i \u0000p0,1,2,3,4 + p0,1,3,2,4 + p0,1,4,2,3 −p1,0,2,3,4 −p1,0,3,2,4 −p1,0,4,2,3\n\u0001 ,\nC(3,Krasitskii)\n0,1,2,3,4\n= i\n2\n\u0000Q0,1,2,3,4 + Q0,2,1,3,4 + Q0,1,2,4,3 + Q0,2,1,4,3\n\u0001 ,\n(27)\nwith p0,1,2,3,4 and Q0,1,2,3,4 given in equations (A.10) in Appendix A; finally, C(2,λ),C(3,λ) are new tensors that we\nobtain from the contribution of the tensor λ to these Krasitskii resonant tensors, which we have calculated explicitly,\nand present here for the first time, because there was no such contribution in Krasitskii [19] due to the fact that λ was\ntaken to be identically zero there. We have:\nC(2,λ)\n0,1,2,3,4 = −1\n3\n\u0010\nA(1)\n0,2,0−2λ0−2,1,3,4 + A(1)\n0,3,0−3λ0−3,1,2,4 + A(1)\n0,4,0−4λ0−4,1,2,3\n−A(1)\n1,2,1−2λ1−2,0,3,4 −A(1)\n1,3,1−3λ1−3,0,2,4 −A(1)\n1,4,1−4λ1−4,0,2,3\n\u0011\n,\nC(3,λ)\n4,3,2,1,0 = −1\n2\n\u0010\nA(1)\n0,2,0−2λ0−2,1,3,4 + A(1)\n1,2,1−2λ1−2,0,3,4 + A(1)\n0,3,0−3λ0−3,1,2,4 + A(1)\n1,3,1−3λ1−3,0,2,4\n−A(1)\n0,4,0−4λ0−4,1,2,3 −A(1)\n1,4,1−4λ1−4,0,2,3 −2A(1)\n2+4,4,2λ2+4,3,0,1 −2A(1)\n3+4,4,3λ3+4,2,0,1\n\u0011\n.\n(28)\n6\n\n\nWith our choice (25)–(26) of tensors C(2) and C(3), the equations of motion for the d-variables contain only non-\nresonant terms. Explicitly, as a result of the canonical transformation (13), the d-variables satisfy the approximate\nequations of motion\ni ˙d0 = ω0d0 +\nX\n1,2,3\neT0,1,2,3d∗\n1d2d3δ2,3\n0,1 +\nX\n1,2,3,4\n\u0000eW0,1,2,3,4d∗\n1d2d3d4δ2,3,4\n0,1 −3\n2\neW4,3,2,1,0d∗\n1d∗\n2d3d4δ3,4\n0,1,2\n\u0001 + O(d5) ,\n(29)\nthis time with a truncation error O(d5) representing a homogeneous polynomial of degree 5 in the d-variables, with eT\ngiven in equation (22) and with eW given by\neW0,1,2,3,4 =\n\n−i X(2)\n0,1,2,3,4\nif\n∆0+1−2−3−4 = 0 ,\n0\nif\n∆0+1−2−3−4 , 0 ,\n(30)\nwhere X(2) is given in equation (A.8) in Appendix A. The Hamiltonian in terms of the d-variables becomes\nH\nN =\nX\n0\nω0d∗\n0d0 +\nX\n0,1,2,3\neT0,1,2,3d∗\n0d∗\n1d2d3δ2,3\n0,1 +\nX\n0,1,2,3,4\n1\n2\neW0,1,2,3,4\n\u0000d∗\n0d∗\n1d2d3d4 −d0d1d∗\n2d∗\n3d∗\n4\n\u0001δ2,3,4\n0,1 + O(d6)\n(31)\nand the equations of motion (29) are canonical:\ni ˙dk = 1\nN\n∂H\n∂d∗\nk\n+ O(d5) ,\ni ˙d∗\nk = −1\nN\n∂H\n∂dk\n+ O(d5) ,\nk = 1, . . . , N −1 .\nNotice that, because of the identities\neW0,1,2,3,4 = −i X(2)\n0,1,2,3,4 + ∆0+1−2−3−4C(2)\n0,1,2,3,4 ,\n−2\n3\neW4,3,2,1,0 = i X(3)\n0,1,2,3,4 + ∆0+1+2−3−4C(3)\n0,1,2,3,4 ,\n(32)\nwhen ∆0+1−2−3−4 = 0 we have X(2)\n0,1,2,3,4 = 2\n3X(3)\n4,3,2,1,0 and all the symmetries of eW hold, namely: X(2)\n0,1,2,3,4 = X(2)\n1,0,2,3,4 =\nX(2)\n0,1,3,2,4 = X(2)\n0,1,2,4,3.\n2.2.4. Exact-resonance evolution equations\nNote how non-resonant triads, quartets and quintets do not completely disappear, as their presence rests within\nthe canonical transformation (13). In contrast, the equations of motion (29) are “exact” from a resonance point of\nview: the right-hand side of these equations contains exact-resonance contributions only, namely each nonzero term\nis parameterised by wavenumbers that satisfy equations (10). Because of this, we will call these equations “exact-\nresonance evolution equations”. The associated weights of the nonlinear terms are collected in the compact tensors\neT, eW defined in equations (22), (30), which are sparse in the sense that most of these coefficients are zero except when\nthe wavenumbers are in exact resonance. We reserve the “tilde” notation for such tensors. Eq.(21) is known as the\nZakharov equation [22] and is extensively used in several works, including FPUT [23]. Eq. (29) instead is somewhat\nnew (due to the fact that we perform extra elimination of non-resonant terms both for 4-wave and 5-wave interactions)\nand has never been explored before in the context of FPUT.\nAnother very important aspect, from both conceptual and numerical points of view, is that the “exact-resonance\nevolution equations” (29) can be mapped to the so-called Heisenberg representation, via the linear (but non-autonomous)\ntransformation d0(t) = D0(t) exp(−iω0t), which gives the equations of motion\ni ˙D0 =\nX\n1,2,3\neT0,1,2,3D∗\n1D2D3δ2,3\n0,1 +\nX\n1,2,3,4\n\u0000eW0,1,2,3,4D∗\n1D2D3D4δ2,3,4\n0,1 −3\n2\neW4,3,2,1,0D∗\n1D∗\n2D3D4δ3,4\n0,1,2\n\u0001 + O(D5) ,\n(33)\nnamely the D-variables satisfy an autonomous system, containing only resonances, but the leading term in the equa-\ntions of motion is cubic (as opposed to linear, as in the case of the d-variables), so the D-variables are very slow when\ncompared with the d-variables. Numerically, this allows us to apply numerical forward-integration methods with very\n7\n\n\nlarge time steps, obtaining very accurate solutions while reducing the wall time required for long-time studies such as\nequipartition/thermalisation and hyperchaos characterisation. Conceptually, the fact that these new equations are still\nautonomous follows directly from the fact that each term in these equations correspond to an exact resonance. For\nexample, terms like exp(−i(ω2 +ω3 +ω4 −ω1)t)δ2,3,4\n0,1\nreduce to exp(iω0t)δ2,3,4\n0,1 , which allows for this result. Moreover,\nwhile the transformation from the d-variables to the D-variables is not canonical, one can verify that system (33) is\nindeed canonical:\ni ˙Dk = 1\nN\n∂HD\n∂D∗\nk\n+ O(D5) ,\ni ˙D∗\nk = −1\nN\n∂HD\n∂Dk\n+ O(D5) ,\nk = 1, . . . , N −1 ,\nwith Hamiltonian\nHD\nN =\nX\n0,1,2,3\neT0,1,2,3D∗\n0D∗\n1D2D3δ2,3\n0,1 +\nX\n0,1,2,3,4\n1\n2\neW0,1,2,3,4\n\u0000D∗\n0D∗\n1D2D3D4 −D0D1D∗\n2D∗\n3D∗\n4\n\u0001δ2,3,4\n0,1 + O(D6) .\nIn the next section we will verify the validity of the approximate equations (16), (21) and (29) via direct compar-\nisons with the original system (9).\n3. Validation of the exact-resonance evolution equations for b, c and d\nIn order to validate the exact-resonance evolution equations (16)–(29), we will consider the following approach.\nBy truncating these equations, namely by discarding their respective truncating errors, we obtain a family of models.\nNumerical simulations of these models for the b, c and d variables are evolved using a mixed Runge-Kutta time\nscheme [24]. Tensor multiplication is employed to update the expressions by building multi-dimensional array-like\nobjects so that element-wise multiplication is systematically applied without the need for nested loops. As for the\nevolution equations (9) for the a variables, we use the same Runge-Kutta scheme, with the same parameters and time\nsteps, as for the b, c and d variables, so the comparison described below depends only on the “size” of the solution\nand not on extra parameters such as the time step chosen.\n3.1. Preliminary definitions: energy norm and generic initial condition\nIn the validation studies below we will use the following definitions. First, given a state in the a-variables, namely\nthe vector a := (a1, . . . , aN−1)T ∈CN−1, we define the energy norm of a by\n∥a∥:=\nv\nu\ntN−1\nX\nk=1\nωka∗\nkak .\n(34)\nSecond, we define a type of “generic” initial condition that we will be using for the scaling method and for the study\nof Lyapunov exponents:\nfk =\nN\n(N −1) (N −1 + k) √ωk\n,\nk = 1, . . . , N −1 ,\n(35)\nThe idea is that the “energy” at wavenumber k, ωk | fk|2, is not symmetric under k →N −k, which makes the system’s\ndynamics more interesting. We have ωk | fk|2 ∝(1 + (k −1)/N)−2, so the energy is preferentially distributed at low\nwavenumbers: at k = 1 the energy is about 4 times larger than at k = N −1.\n3.2. The scaling method to check the exact-resonance evolution equation’s truncation error\nWe introduce the “scaling method” to verify numerically the truncation error present in the exact-resonance evo-\nlution equations (16)–(29). We illustrate the method via an example. After discarding the truncation error in equation\n(16) we get the simple model i˙b0 = ω0b0, which has simple solutions (notice that, because exact solutions are gener-\nally not available in the case of the c- and d-variables, we will always refer to accurate numerical solutions rather than\nexact solutions). Then, applying the transformation (11) will produce, by definition, a solution to equation (9), but\nwith a RHS consisting of just the linear and quadratic terms in it, plus a cubic truncation error O(a3), inherited from\nthe O(b3) truncation error in equation (16) that we had discarded. Thus, we can compare the “reference” numerical\n8\n\n\nsolution a(t) of the original system (9) against the “mapped” solution ab(t) obtained by mapping, via the transforma-\ntion (11), the solution to the truncated version of equation (16). These two time series should differ by a quantity of\nO(a3) as per the above analysis. In terms of the norm defined in equation (34), this is\n∥a(t) −ab(t)∥∝∥a(t)∥3\nfor all\nt ∈[0, T) ,\n(36)\nwhere T is reasonably small (but finite), such that ∥a(t)∥remains small enough so that the transformation (11) remains\nbeing a near-identity transformation. Now, to test quantitatively the scaling (36), we impose the following initial\ncondition for the b-variables:\nbk(0) = ϵ fk ,\nk = 1, . . . , N −1 ,\n(37)\nwhere ϵ is a positive parameter and fk is defined in (35). Then, the scaling (36) becomes\n∥a(t) −ab(t)∥∝ϵ3gb(t)\nfor all\nt ∈[0, T) ,\n(38)\nwhere gb(t) is an unspecified positive function that does not depend on the parameter ϵ. We perform three numerical\ntests of relation (38), taking N = 9 (so there will be non-trivial resonant quintets in the d-variables), using the initial\nconditions (37) with three respective values ϵ = 0.1, 0.2, 0.4, clearly related by factors of 2. The resulting distances\n∥a(t)−ab(t)∥are plotted in figure 1(a), in a log-log plot for ease of visualisation. These clearly verify the relation (38),\nas graphically supported by the vertical lines in the plot corresponding to a scaling factor of 8, namely corresponding\nto 23, which is the expected scaling as per the RHS of the relation (38). The apparent linear growth in time of these\ndistances is basically due to the fact that this distance is obtained from the time integral of the O(a3) terms that were\ndiscarded.\nWe repeat this study for the more complicated equation (21), which includes the resonant quartet interactions but\ndiscards higher orders. The scaling method in this case compares the numerical solution a(t) of the original system (9)\nagainst the mapped solution ac(t), obtained by mapping via the transformation (12) the solution c(t) to the truncated\nversion of equation (21). These two time series should differ by a quantity of O(a4) as per the above analysis, namely\nif we take the initial conditions\nck(0) = ϵ fk ,\nk = 1, . . . , N −1 ,\n(39)\nthen we expect the following scaling:\n∥a(t) −ac(t)∥∝ϵ4gc(t)\nfor all\nt ∈[0, T) ,\n(40)\nwhere gc(t) is a positive function that does not depend on ϵ. We perform three numerical tests of relation (40), taking\nN = 9 again, using the initial conditions (39) with three respective values ϵ = 0.1, 0.2, 0.4. The resulting distances\n∥a(t)−ac(t)∥are plotted in figure 1(b), clearly verifying the relation (40), as graphically supported by the vertical lines\nin the plot corresponding to a scaling factor of 16, namely corresponding to 24, as predicted by the RHS of (40).\nFinally, we repeat the study for the even more complicated equation (29), which includes all resonant quintets and\nquartets. The scaling method in this case compares the numerical solution a(t) of the original system (9) against the\nmapped solution ad(t), obtained by mapping via the transformation (13) the solution d(t) to the truncated version of\nequation (29). These two time series should differ by a quantity of O(a5) as per the above analysis, so if we take the\ninitial conditions\ndk(0) = ϵ fk ,\nk = 1, . . . , N −1 ,\n(41)\nthen we expect the following scaling:\n∥a(t) −ad(t)∥∝ϵ5gd(t)\nfor all\nt ∈[0, T) ,\n(42)\nwhere gd(t) is a positive function that does not depend on ϵ. We perform three numerical tests of relation (42), taking\nN = 9 again, using the initial conditions (41) with three respective values ϵ = 0.1, 0.2, 0.4. The resulting distances\n∥a(t)−ad(t)∥are plotted in figure 1(c), clearly verifying the relation (42), as graphically supported by the vertical lines\nin the plot corresponding to a scaling factor of 32, namely corresponding to 25, as predicted by the RHS of (42).\nWith these studies, the evolution equations (16), (21) and (29), along with the transformations (11), (12) and (13),\ncan be considered validated. This means that both the analytical formulae for the tensors involved and their numerical\nimplementation are validated.\n9\n\n\nFigure 1: Numerical implementation of the scaling method, case N = 9. (a) Time series of the energy norm of the difference between the mapped\nsolution ab (based on truncated equations (16) and mapping (11)) and the solution a of equations (9), for initial conditions (37), (35), with ϵ = 0.1\n(lighter plot), ϵ = 0.2 (dark plot), ϵ = 0.4 (darker plot). The vertical bars start at their low end from one of these curves, and go upwards to a value\n23 times the value of the abscissa at their low end. (b) Similar to panel (a), but comparing a with ac (based on truncated equations (21) and mapping\n(12)), with initial conditions (39), (35), and the vertical lines going up a factor of 24 times the value of the abscissa at their low end. (c) Similar to\npanel (a), but comparing a with ad (based on truncated equations (29) and mapping (13)), with initial conditions (41), (35), and the vertical lines\ngoing up a factor of 25 times the value of the abscissa at their low end.\n10\n\n\n3.3. Convergence of the normal-form transformation\nFocusing now on the deepest model, namely the evolution equation (29) for the d-variables, one of the pivotal\ngoals of our work is to show that this model, via its 4-wave and 5-wave resonant interactions, is able to capture\nthe dynamics of the original FPUT system (9). In order to do this, the first question we need to answer is whether\nthe normal-form transformation (13) keeps the order between the terms involved, at the amplitudes that the system\nexplores throughout its dynamics. We will say that the normal-form transformation (13) converges if the sizes of the\nsubsequent terms are ordered. Namely, let us write (13) in the form\na = d + Y(2)(d) + Y(3)(d) + Y(4)(d)\nwhere, for each j = 2, 3, 4, Y(j)(d) is a vector of homogeneous polynomials of degree j in the d-variables, explicitly\ngiven by\nY(2)\n0 (d) =\nX\n1,2\n\u0000A(1)\n0,1,2d1d2δ1,2\n0 + A(2)\n0,1,2d∗\n1d2δ2\n0,1 + A(3)\n0,1,2d∗\n1d∗\n2δ0,1,2\n\u0001 ,\n(43)\nY(3)\n0 (d) =\nX\n1,2,3\n\u0000B(1)\n0,1,2,3d1d2d3δ1,2,3\n0\n+ B(2)\n0,1,2,3d∗\n1d2d3δ2,3\n0,1 + B(3)\n0,1,2,3d∗\n1d∗\n2d3δ3\n0,1,2 + B(4)\n0,1,2,3d∗\n1d∗\n2d∗\n3δ0,1,2,3\n\u0001 ,\n(44)\nY(4)\n0 (d) =\nX\n1,2,3,4\n\u0000C(1)\n0,1,2,3,4d1d2d3d4δ1,2,3,4\n0\n+ C(2)\n0,1,2,3,4d∗\n1d2d3d4δ2,3,4\n0,1 + C(3)\n0,1,2,3,4d∗\n1d∗\n2d3d4δ,3,4\n0,1,2\n+C(4)\n0,1,2,3,4d∗\n1d∗\n2d∗\n3d4δ4\n0,1,2,3 + C(5)\n0,1,2,3,4d∗\n1d∗\n2d∗\n3d∗\n4δ0,1,2,3,4\n\u0001 .\n(45)\nThen, we say that (13) converges if the order relations ∥d∥> ∥Y(2)(d)∥> ∥Y(3)(d)∥> ∥Y(4)(d)∥hold, where ∥·∥is the\nenergy norm defined in (34).\nIt goes without saying that if the normal-form transformation (13) does not converge under this definition then\nthe models (9) and (29) are expected to provide divergent results. Thus, it is important to quantify the relative sizes\ninvolved in the above order relations. Clearly, in the 2(N −1)-dimensional space where the d-variables evolve, this\nconvergence will be worse far from the origin and better close to the origin. We introduce a practical method to\nnumerically assess the quality of this convergence, based on ideas from [25]. Denoting Y(1)(d) := d, it is natural to\nattempt a fit of the form\n∥Y(j)(d)∥fit = exp(L j + M) ,\nj = 1, 2, 3, 4,\n(46)\nand the relevant fit parameter is L: convergence, in the sense defined above, requires L < 0. Notice that, by looking\nat the above fit, the quantity exp(L) can be thought of as the “level of nonlinearity”, namely a dimensionless measure\nof how large the amplitudes are. In practice, using least squares on the logarithm of the above fit, we obtain a running\nestimate of L as a function of the state d:\nL(d) :=\n4\nX\nj=1\n( j/5 −1/2) ln∥Y(j)(d)∥.\n(47)\nA value of L(d) = −1 indicates, via the fit (46), that the size of the last term ∥Y(4)(d)∥is about 5% of the size of\nthe first term ∥d∥. In figure 2(a), we show running estimates of this convergence exponent L(d), using again N = 9\nand the initial condition (41) but for other three values of the scaling parameter: ϵ = 0.3, 0.4, 0.5. This time we\nrun the simulations until t = 5000, to show how the exponent varies over time. It is evident that the case ϵ = 0.3\nhas a very good convergence exponent, well below −1.2, which implies, via the fit (46), a relative-error relation\n∥Y(4)(d)∥< 3%∥d∥throughout the simulation. As the initial condition increases in size, the convergence exponent\nworsens. For ϵ = 0.4 it reaches maximum values of about −0.89, which corresponds to ∥Y(4)(d)∥< 7%∥d∥. This\nrelative error rises to 12% in the case ϵ = 0.5. In figure 2(b) we show, at the final time t = 5000, the actual values of\nln∥Y( j)(d)∥used to get the slopes L(d). It is evident from the plot that the case ϵ = 0.5 (and also the case ϵ = 0.4 to\nsome extent) shows a more wild behaviour, not a clean linear decay like the ϵ = 0.3 case.\nAlthough technically a negative exponent above −1 could still indicate convergence if we had higher-order terms\nto verify it, at this level of approximation an error of 7% obviously matters, and more so when it compounds over\ntime. However, the question about the amplitudes (represented by the prefactor ϵ) at which the behaviour of the d-\nsystem begins to be different in nature from the behaviour of the original a-system will be tackled when we study the\nLyapunov spectrum of the respective systems in section 4.\n11\n\n\nFigure 2: For the case N = 9, for initial conditions (41), (35) with ϵ = 0.3 (lower curve), ϵ = 0.4 (middle curve) and ϵ = 0.5 (upper curve). (a)\nTime series of the convergence exponent L(d), equation (47). (b) At t = 5000, values of the logarithms of the energy norms of the successive terms\n(43)–(45) in the normal-form transformation from d- to a-variables.\n3.4. Time series analysis: time scales of resonant quartets and quintets\nIn this subsection we want to show in more detail the dynamical signature of 4-wave and 5-wave resonances. The\nfocus of this article is on 5-wave resonances, as 4-wave resonances alone are known to be integrable, so we look at\nthe case N = 9, where only resonant quintets are able to exchange energy.\nTo begin with, we present the time evolution of the solution to equation (29), focusing on the individual mode\nenergies ωk|dk(t)|2, k = 1, . . . , 8, in terms of two of the initial conditions considered in the last subsection: initial\ncondition (41), (35) with ϵ = 0.3 (figure 3(a)) and ϵ = 0.4 (figure 3(b)). Qualitatively, it is apparent from these\nplots that there is chaos in the system (to be quantified thoroughly in section 4) and some modes’ energies can have\nhigh-amplitude variations. All these features are enhanced when the initial condition is larger (ϵ = 0.4) (i.e. when the\nlevel of nonlinearity, or simply “nonlinearity”, is larger).\nFigure 3: Time evolution of individual energies in the d-variables for initial conditions (41), (35) with ϵ = 0.3 (a) and ϵ = 0.4 (b).\nThe above analysis is based on too generic initial conditions. To provide a more heuristic proof that 5-wave\nresonances have an effect on the dynamics of this system, we resort to more specific initial conditions (still in the\ncase N = 9), based on a single resonant quintet, and initialise the system so only modes in that quintet have energy\ninitially. In this way the energy transfer will be clearly due to the resonant interaction. In this case, we focus on the\n12\n\n\nresonant quintet {2, 2, 8; 5, 7} (one of the eight accessible quintets in the Single Octahedron cluster [16]) and explore\nthe situation when energy is initially distributed uniformly, but only to modes with k = 2, 5 and 7:\nω2|d2(0)|2 = ω5|d5(0)|2 = ω7|d7(0)|2 = 0.06 ,\n(48)\nwhile dk(0) = 0 for k = 1, 3, 4, 6, 8. In this way, the 5-wave resonance should produce a sustained energy growth in\nthe mode k = 8. That is exactly what we observe in figure 4. That figure shows the energies ωk|dk|2 of the modes\nk = 2, 5, 7, 8 (involved in the selected quintet resonance), as a result of the simulation of system (29). It is evident that\na quasi-periodic behaviour is observed, characterised by energy exchanges amongst the modes in the quintet, and as\npredicted the mode with k = 8 receives a significant share of the energy in any of the other modes. To this plot are\nsuperimposed on the same plot the corresponding energies ωk|ak|2 of the same modes, but as a result of simulating the\nsystem (9) with the mapped initial conditions via (13). This illustrates two things: first, a hierarchy of time scales is\nevident in the form of envelopes, going from the slowest one (quintets, of period T5 ≈900) to the quartet-interaction\ntime scale (of period T4 ≈90), to the triad-interaction time scale (period T3 ≈9). Second, the fact that the a-variables\nfollow the d-variables indicates that the nonlinearity is relatively small: in fact, the convergence exponent L achieves\na maximum value of −1.34 throughout the simulation.\nFigure 4: (a) Time evolution of individual energies in a resonant quintet (case N = 9) stemming from initial conditions (48). The simulations used\ntime steps dt = 0.1 for the a-variables and dt = 1 for the d-variables. (b) Zoom-in of (a) over the time range [310, 580].\nTo illustrate that the above ideas are independent of the number of particles (as long as it is divisible by 3), we now\nshow results for N = 12 and N = 15. Although these systems have quintets with non-repeated modes, for simplicity\nof presentation we prefer to consider quintets that have a repeated mode, just like the quintet we considered in the case\nN = 9. For N = 12 we choose the resonant quintet {2, 2, 7; 5, 6} with “target” mode k = 7 so the initial conditions are\nω2|d2(0)|2 = ω5|d5(0)|2 = ω6|d6(0)|2 = 0.0053 ,\n(49)\nall other modes being initially zero, leading to the plot in figure 5(a) showing again the main quintet interaction in a\nlow-nonlinearity scenario (maximum convergence exponent −1.17). For N = 15 the chosen quintet is {3, 3, 13; 7, 12}\nwith “target” mode k = 13 so the initial conditions are\nω3|d3(0)|2 = ω7|d7(0)|2 = ω12|d12(0)|2 = 0.0025 ,\n(50)\nagain in a low-nonlinearity scenario (maximum convergence exponent −1.34).\n4. Chaos characterization: Lyapunov exponents, resonances and constant of motion\nWe now focus on the relation between the original variables a and the mapped variables d, having validated\nthe exact-resonance evolution equations (29) for the variables d (or equations (33) for the slow variables D) in the\n13\n\n\nFigure 5: Time evolution of individual energies in a resonant quintet: (a) N = 12 resonant quintet, initial conditions (49). (b) N = 15 resonant\nquintet, initial conditions (50).\nprevious section, where we showed that these exact-resonance evolution equations will produce meaningful solutions\nwith regards to the original variables a if and only if the transformation from a to d converges. Unfortunately, a\ncomplete and definitive test of convergence would require us to go beyond the variables d, which contain up to 5-\nwave resonances: one would have to formally continue the process up to M-wave interactions, and check whether the\ntransformation converges as M goes to infinity. Such a calculation is beyond the scope of this paper and we do not\nclaim that it would converge (see [26, 27, 28, 29] for a discussion and further references on the asymptotic character\nof the normal form transformation).\nHowever, what we do know from the previous section is that the truncated system (29) for the variables d (or (33)\nfor the slow variables D) indeed represents the original system (9), with an arbitrary accuracy that can be controlled\nby reducing the amplitudes of the modes. This will be true for any subsequent truncation up to M-wave interactions,\nwhere M is fixed. This is the same idea as in the theory of asymptotic expansions: a function’s asymptotic expansion\ntruncated at any given order M will be as close as desired to the original function, if the domain is appropriately\nrestricted.\nIt is in this sense of restricted domains, namely of “small amplitudes” or “weak nonlinearity”, that we can draw\nquite strong conclusions when comparing the original system of equations (9) for the variables a against the truncated\nsystems (29) (resp. (33)) for the mapped variables d (resp. D).\nMotivated by the above discussion, a pivotal idea that we want to introduce in this section is to quantify numer-\nically, in terms of Lyapunov exponents, the accuracy at which the truncated models describe the original ones. We\nbelieve Lyapunov exponents can be a strong tool to compare different dynamical systems, such as system (9) for the\nvariables a and system (33) for the mapped “slow” variables D: if these systems are related by a one-to-one mapping\nthat is accurate numerically, then their Lyapunov spectra must coincide. Thus, comparing these Lyapunov spectra\nwill allow us to establish unequivocally the level of nonlinearity at which the two systems behave in a truly different\nmanner.\nA second powerful idea, to be combined with the previous one, is that system (29) for the mapped variables d\nis amenable to analytical calculations: because it is based exclusively on resonant interactions, one can apply the\n“resonant cluster matrix” method introduced by Harper et al. [30] to construct explicitly a number of independent\nconstants of motion that are quadratic in the amplitudes |dk|, k = 1, . . . , N −1. Thus, the effective number of degrees of\nfreedom can be explicitly reduced, and thus the maximum number of positive Lyapunov exponents can be calculated.\nThis result can then be used to validate a numerical calculation of Lyapunov exponents: we will take the case study\nN = 9, which according to this method has a maximum of 4 positive Lyapunov exponents. On the one hand, this\nnumber is verified numerically for system (29) in the variables d. On the other hand, this number can be used to\nestablish at which level of nonlinearity the original system (9) for the variables a departs from the d system, by looking\nat the fifth largest Lyapunov exponent as a function of the system’s nonlinearity: while it should be equal to zero at\n14\n\n\nall levels of nonlinearity for the d system, in the a system it suffers a transition from zero (at weak nonlinearity) to\nnon-zero at larger nonlinearity. The threshold occurs at a level of nonlinearity that is related to the loss of convergence\nof the normal form transformation.\n4.1. Integrability and chaos of the exact-resonance evolution equations for the d variables\n4.1.1. Canonical Poisson bracket (commutator)\nThe exact-resonance evolution equations (29) are Hamiltonian and canonical. It is useful to introduce the Poisson\nbracket (a.k.a. commutator), a bi-linear operation that takes two scalar functions F and G of the d-variables and gives\nanother scalar function, via\n{F,G} := −i\nN−1\nX\nk=1\n∂F\n∂dk\n∂G\n∂d∗\nk\n−∂F\n∂d∗\nk\n∂G\n∂dk\n.\n(51)\nIt is useful here to recall the basic commutation relations\n{dk, dk′} = {d∗\nk, d∗\nk′} = 0 ,\n{dk, d∗\nk′} = −iδk,k′,\n(52)\nwhere δ denotes the Kronecker delta symbol. In this way, a given scalar function F of the d-variables satisfies\ndF\ndt = 1\nN {F, H} ,\nwhere as usual dF\ndt is calculated using the chain rule and the equations of motion (29).\n4.1.2. Finding quadratic constants of motion\nFollowing the method introduced by Harper et al. [30], we look for constants of motion that are quadratic in the\nd-variables, namely, functions of the form\nI =\nN−1\nX\nk=1\nΩkdkd∗\nk ,\n(53)\nwhere Ωk , k = 1, . . . , N −1, are constants to be found so that dI/dt = 0 under the evolution (29), that is, so that\n{I, H} = 0 (in words, I commutes with H). While it is somewhat evident that the quadratic part of the Hamiltonian,\nPN−1\nk=1 ωkdkd∗\nk, is a constant of motion, where ωk is given by the FPUT dispersion relation (5), there are usually more\nthan one independent quadratic invariants for a given N.\nBecause of the bi-linearity of the Poisson bracket, the condition {I, H} = 0 can be separated into smaller problems.\nIn fact, regarding the Hamiltonian H defined in equation (31), we will now show that, in order for I to commute with\nH, I must commute with every term in every sum in the definition of H. First, notice that the quadratic part of H\ntrivially commutes with I, because {dkd∗\nk, dk′d∗\nk′} = 0 for all k, k′. Next, the remaining terms in the Hamiltonian (31)\nare of two types: (i) monomial of degree 4 in the amplitudes, corresponding to a resonant quartet, and (ii) monomial\nof degree 5 in the amplitudes, corresponding to a resonant quintet. Clearly, these monomials are independent when\nconsidered as functions of the 2(N −1) variables {dk}N−1\nk=1 and {d∗\nk}N−1\nk=1 . Now, let us study the commutator between I\nand a given monomial representing a resonant term. A useful identity is easily derived from equation (51):\n{d∗\nkdk,G} ≡i\n \ndk\n∂G\n∂dk\n−d∗\nk\n∂G\n∂d∗\nk\n!\n.\n(54)\nFrom the above identity, it follows that the operator {d∗\nkdk, ·} preserves the degree of a monomial, and moreover,\nmonomials are eigenfuctions of the operator, for any k. Thus, from bi-linearity of the commutator, monomials are\neigenfunctions of the operator {I, ·}. Therefore, {I, H} is a linear combination of the independent monomials appearing\nin equation (31), and hence, {I, H} = 0 if and only if {I,G} = 0 for every single monomial G in equation (31).\nStarting with the resonant quartets in (31), let us use the more explicit notation d∗\nk0d∗\nk1dk2dk3 for the monomial,\nwhere k0 + k1 = k2 + k3 (mod N) and ω0 + ω1 = ω2 + ω3. We have, using (53) and (54),\n{I, d∗\nk0d∗\nk1dk2dk3} = i\nN−1\nX\nk=1\nΩk\n\u0010\n−δk\nk0 −δk\nk1 + δk\nk2 + δk\nk3\n\u0011\nd∗\nk0d∗\nk1dk2dk3 .\n15\n\n\nWe conclude that for each resonant quartet the above commutator must be equal to zero. In equations,\nΩk0 + Ωk1 = Ωk2 + Ωk3\nwhen\n\nk0 + k1 = k2 + k3\n(mod N) ,\nω0 + ω1 = ω2 + ω3 .\n(55)\nAs for resonant quintets, we use the explicit notation d∗\nk0d∗\nk1dk2dk3dk4 for the monomial, where k0 + k1 = k2 + k3 + k4\n(mod N) and ω0 + ω1 = ω2 + ω3 + ω4. We obtain, similarly,\n{I, d∗\nk0d∗\nk1dk2dk3dk4} = i\nN−1\nX\nk=1\nΩk\n\u0010\n−δk\nk0 −δk\nk1 + δk\nk2 + δk\nk3 + δk\nk4\n\u0011\nd∗\nk0d∗\nk1dk2dk3dk4 ,\nso we conclude\nΩk0 + Ωk1 = Ωk2 + Ωk3 + Ωk4\nwhen\n\nk0 + k1 = k2 + k3 + k4\n(mod N) ,\nω0 + ω1 = ω2 + ω3 + ω4 .\n(56)\n4.1.3. Resonant cluster matrix\nIn summary, I as given by equation (53) is a constant of motion for our system (29) if and only if, for every\nsingle exact resonance (quartet or quintet), equations (55) and (56) are satisfied. These equations are linear and\nhomogeneous in the set of unknowns {Ωk}N−1\nk=1 , which can be understood as null vectors of the so-called resonant\ncluster matrix A, constructed algorithmically as follows: each resonance will constitute a row. The order of the rows\ndoes not matter. For a quartet resonance of the form (55), assign an arbitrary row label r. The components of this row\nare Ar,k := −δk\nk0 −δk\nk1 + δk\nk2 + δk\nk3 , k = 1, . . . N −1 . For a quintet resonance of the form (56), assign an arbitrary row\nlabel r′. The components of this row are Ar′,k := −δk\nk0 −δk\nk1 + δk\nk2 + δk\nk3 + δk\nk4 , k = 1, . . . N −1 . The resulting matrix A\nwill thus have N −1 columns and R4 + R5 rows, where R4 is the total number of quartet resonances, namely the total\nnumber of independent terms in the quartic sum in equation (31), and R5 is the total number of quintet resonances,\nnamely the total number of independent terms in the quintic sum in equation (31). In this way, equations (55)–(56)\nfor the variables {Ωk}N−1\nk=1 become the null-space equations\nAΩ= 0 ,\nΩ:= (Ω1, . . . , ΩN−1)T .\n4.1.4. Independent quadratic constants of motion\nThus, the number of independent quadratic constants of motion of system (29) is given by the dimension of the\nnull space of the resonant cluster matrix A. We denote this dimension by JN, as it depends on the number of particles\nN. To get an idea of how JN depends on N, notice that when N is odd all quartet resonances are trivial (namely,\nk0 = k2 and k1 = k3), so equations (55) are satisfied identically. Also, when N is not divisible by 3 there are no quintet\nresonances. Thus, when N is odd and not divisible by 3, the cluster matrix vanishes (this means that one should go\nto higher orders of wave-wave interactions in order to find nontrivial resonances) and therefore JN = N −1: all the\nindividual energies |d1|2, . . . , |dN−1|2 are constants of motion. A less trivial case is when N is even (but not divisible\nby 3, so it has no quintets). This case has nontrivial resonant quartets, which are all of pair-off form: a basis for the\nresonant cluster matrix rows is given by the rows (0, . . . , 0, k, 0, . . . , 0, N −k, 0, . . . , 0), with k = 1, . . . , N/2. Thus,\nJN = N/2. In this case, all ⌊N/4⌋monomials commute with each other so the system is integrable (see [31, 32]).\nThe only truly nontrivial case is when N is divisible by 3 and N > 6: resonant quintets exist. In addition, if N\nis even then nontrivial resonant quartets exist. Table 1 shows the number of quadratic invariants as a function of N\nfor selected cases. The apparent wild behaviour of JN is due to the nontrivial dependence of the number of resonant\nquartets and quintets on the divisors of N (see [16] for details).\n4.1.5. Effective number of degrees of freedom\nA priori, system (29) has 2(N−1) degrees of freedom, as there are N−1 complex variables {dk}N−1\nk=1 . It is instructive\nto introduce the so-called amplitude-phase representation, as follows: dk := |dk| exp(iϕk), d∗\nk := |dk| exp(−iϕk), where\nnow |dk| (amplitudes) and ϕk (phases) are two independent real variables, so the number of degrees of freedom is\nstill 2(N −1). However, in the Hamiltonian (31) we see that only certain combinations of these variables appear. In\n16\n\n\nN\n9\n12\n15\n18\n21\n24\n27\n30\nJN\n3\n6\n5\n8\n9\n11\n9\n13\nPN = N −2 −JN\n4\n4\n8\n8\n10\n11\n16\n15\nTable 1: Number of independent quadratic constants of motion JN and maximum number of positive Lyapunov exponents PN of system (29) for\nselected values of N divisible by 3.\nfact, we can make use of the resonant cluster matrix to construct precisely all the combinations of phases that appear\nin the Hamiltonian. By inspection, these combinations are simply the rows in AΦ, where Φ := (ϕ1, . . . , ϕN−1)T.\nWhile in general there will be many rows (as many rows as the number of nontrivial quartet and quintet resonances),\nmost of these combinations are dependent. To calculate the number of independent rows of A, namely the number\nof independent phase combinations that appear in the Hamiltonian, we make use of the rank-nullity theorem, which\nstates\n# independent rows of A = (# columns of A) −(dimension of null-space of A) ,\nwhich is equal to N −1 −JN. So, the number of independent phase combinations appearing in the Hamiltonian is\nequal to N −1 −JN. This is to be interpreted as the effective number of dynamical phases. As for the real amplitudes\n|dk|, there are a total of N −1, but the fact that there are JN independent constants of motion that depend on these\namplitudes allows us to fix these constants and thus reduce the effective number of dynamical amplitudes to N−1−JN.\nFinally, if we now recall that the Hamiltonian is a constant of motion and along with it we have the time translation\ninvariance, this gives us a reduction of 2 degrees of freedom. In summary, we have a total of 2(N −2 −JN) effective\ndegrees of freedom.\n4.2. Lyapunov exponents\nLyapunov exponents constitute the natural quantifiers of chaos or hyperchaos in any system, because they define\nthe perturbation growth (or decay) rates in a system. For the FPUT system of N particles (be it the original system\n(9) in the a-variables, or the truncated system of exact-resonance evolution equations (29) in the d-variables), the\nnumber of degrees of freedom is 2(N −1) and therefore there are 2(N −1) Lyapunov exponents. We order them\nfrom largest to smallest: λ1 ≥λ2 ≥. . . ≥λ2(N−1). The set of Lyapunov exponents is called the Lyapunov spectrum.\nBecause the FPUT system is Hamiltonian, the Lyapunov spectrum is symmetric around zero: λ2(N−1)−(n−1) = −λn, for\nn = 1, . . . , N −1. Thus, the first (N −1) Lyapunov exponents are non-negative and we have λ1 ≥. . . ≥λN−1 ≥0.\nFurthermore, as the Hamiltonian is a constant of motion, we necessarily have λN−1 = 0. In fact, any independent\nconstant of motion of the system will have an associated Lyapunov exponent that is equal to zero.\n4.2.1. Maximum number of positive Lyapunov exponents of the exact-resonance evolution equations (29) in the d-\nvariables\nIn the d-variables, in section 4.1.5 we found that, after considering the JN independent quadratic invariants and\nthe Hamiltonian H, the number of effective degrees of freedom reduced to 2(N −2 −JN). In terms of the Lyapunov\nspectrum, this is equivalent to λN−1 = λN−2 = . . . = λN−1−JN = 0. Therefore, calling PN the maximum number\nof positive Lyapunov exponents, we have PN = N −2 −JN. Table 1 shows this quantity as a function of N, for\nselected values of N divisible by 3. The lowest value PN takes is 4 (for N = 9 or N = 12), suggesting the presence of\nhyperchaos. Whether this number of positive Lyapunov exponents is attained in reality can be checked by a numerical\ncalculation of Lyapunov exponents, as we will do in section 4.3.2 for the case N = 9.\n4.2.2. Using Lyapunov exponents to compare the original FPUT system (9) (a-variables) with the exact-resonance\nevolution equations (29) (d-variables)\nIn the past, analysis of the largest positive Lyapunov exponent (λ1 in our notation) has been extensively used to\naddress the FPUT paradox. For example, in [33] Benettin et al. investigate the asymptotic behaviour of λ1 for a set of\nFPUT-like models and recover its dependence on the energy and number of particles.\nOur plan is to use numerical computations of Lyapunov spectra to provide evidence that 5-wave resonances are\nresponsible for the hyperchaos observed in the original FPUT system, at least for small nonlinearity. To this end, we\npropose a method to compare the original system (9) with the mapped equations (29), truncated up to and including\n17\n\n\nquintet resonances. The basic idea is that, if two given systems of evolution equations S 1 and S 2 are related via a\none-to-one smooth mapping, and no truncation is performed in either system, then the calculation of their respective\nLyapunov spectra should give the same results. One way to see this is by noting that a Lyapunov exponent is calculated\nas the limit as time goes to infinity of the ratio (logarithm of the distance between two nearby solution trajectories) /\n(time). When a smooth map relates two systems, then the distance in one system is equal to the distance in the other\nsystem times a sub-determinant of the Jacobian of the mapping. The latter is finite, so in the limit the logarithms of\nthe respective distances converge asymptotically and the respective ratios have the same limit.\nNow, we are trying to compare the original FPUT system (9) in the a-variables with the exact-resonance evolution\nequations (29) in the d-variables. Although the mapping from d to a is one-to-one and smooth, system (29) is truncated\nup to and including resonant quintets, so, at high nonlinearity, the solutions to the respective evolution equations\nare not necessarily related by a one-to-one mapping, and we expect the Lyapunov spectra in the a-variables to be\ndifferent from the Lyapunov spectra in the d-variables. Here we recall the idea of convergence of the normal-form\ntransformation, which we discussed extensively in section 3.3. There, we demonstrated that when the amplitudes are\nsmall enough (weak nonlinearity regime) the mapping from d to a should converge and the solutions of the respective\nequations should be mapped in a one-to-one fashion. Based on this convergence, in that section we found a reasonable\n(but admittedly ad-hoc) criterion to decide at which level of nonlinearity we should expect the original system and the\nexact-resonance evolution equations to truly depart, in terms of the nature of their respective solutions.\nHere we propose a more quantitative method, devoid of ad-hoc assumptions, to decide on this very same question:\nAt which level of nonlinearity do the original system and the exact-resonance evolution equations truly depart? Let\n{λ(d)\nn }N−1\nn=1 be the non-negative Lyapunov exponents in the d-system (29) and let {λ(a)\nn }N−1\nn=1 be the non-negative Lyapunov\nexponents in the a-system (9). Our comparison method makes use of our result that the exact-resonance evolution\nequations possess a number of constants of motion apart from the Hamiltonian, so λ(d)\nN−1−JN = 0 must hold (see table 1\nfor representative values of JN). Thus, if λ(a)\nN−1−JN > 0 then we can assert that the a-system (9) and the d-system (29)\ntruly depart.\nHow do we determine numerically whether λ(a)\nN−1−JN > 0 with enough confidence? In a numerical calculation\nof Lyapunov exponents in the d-system, knowing a priori that λ(d)\nN−1−JN = 0 is a great advantage, as it allows us to\nreduce the computational time to get these exponents, focusing on the first N −1 −JN exponents. We will use the\nmethod of cloned trajectories [34], which is particularly well suited to this situation. Another advantage of knowing\nthat λ(d)\nN−1−JN = 0 is that the numerically computed exponent λ(d),num\nN−1−JN will always have a non-zero value (because the\ncomputation is done using a finite-time signal), and thus this value can be used as the “error” in the estimation of this\nand any other exponent, being somehow a measure of the inherent error of the method and the system of equations.\nUsually, this error is larger than the standard deviation estimate of the error based on an average over the Lyapunov\nexponent time signal. Thus, if we find numerically that λ(a)\nN−1−JN > 0 even after allowing for error bars based on these\nerrors, then we can assert with confidence that the two systems truly differ. In section 4.3.2 we implement such a\nstudy as a function of the nonlinearity in the case N = 9, and obtain a sharp, quantitative transition in terms of the\nnonlinearity level: the systems are close at small nonlinearity and truly different at large nonlinearity.\n4.3. A case study: The FPUT lattice with N = 9, α = 1, β = 0.05\nTo showcase the potential of these combined methods, let us work with the FPUT system carrying N = 9 masses,\nwith interaction coefficients α = 1, β = 0.05. We first analyse the system in the d-variables. Here, the relevant degrees\nof freedom are d1, . . . , d8 and their complex conjugates. The Hamiltonian (31) reduces to H(d) = H(d)\n2\n+ H(d)\n4\n+ H(d)\n5 ,\nwith:\nH(d)\n5\n= 3eW5,7,2,2,8(d∗\n7d∗\n5d2d8d2 −d∗\n2d∗\n4d7d1d7) + 3eW5,8,1,1,2(d∗\n8d∗\n5d2d1d1 −d∗\n1d∗\n4d8d8d7)\n+ 6eW3,4,2,6,8(d∗\n3d∗\n4d6d8d2 −d∗\n6d∗\n5d3d1d7) + 3eW4,4,1,2,5(d∗\n4d∗\n4d5d1d2 −d∗\n5d∗\n5d4d8d7) + c.c.\n(57)\nwhere c.c. indicates complex conjugates, and the interaction coefficients are given numerically by\neW5,7,2,2,8 = −i 2.8909506487978,\neW5,8,1,1,2 = −i 1.7415459095483 ,\neW3,4,2,6,8 = i 2.4446465948986,\neW4,4,1,2,5 = −i 2.1433819261863 .\nBecause H(d)\n4\ncontains so-called trivial resonant terms only, which depend on the amplitude squares |dk|2 only, its\nexplicit form is not needed to analyse the constants of motion. The form of H(d)\n2\nis the usual one, H(d)\n2\n= PN−1\nk=1 ωk|dk|2.\n18\n\n\n4.3.1. Resonant cluster matrix for the N = 9 case (d-variables)\nThe resonant cluster matrix A is constructed by looking at the 8 monomials in equation (57): for each monomial,\na row of A of length N −1 is formed by recording, from k = 1 to k = N −1, the multiplicities of the factors dk (positive\nmultiplicities) and d∗\nk (negative multiplicities). For example, the first monomial d∗\n7d∗\n5d2d8d2 indicates that the first row\nof A is (0, 2, 0, 0, −1, 0, −1, 1). The resulting matrix and its null space are:\nA =\n\n0\n2\n0\n0 −1 0 −1 1\n2\n1\n0\n0 −1 0\n0 −1\n0\n1 −1 −1 0\n1\n0\n1\n1\n1\n0 −2 1\n0\n0\n0\n0\n0\n0\n1 −2 0\n1\n1\n1\n0\n1\n0 −1 −1 1\n0\n−1 0\n0 −1 0\n0\n1\n2\n1 −1 0 −1 0\n0\n2\n0\n\n,\nNul(A) = Span\n\n\n1\n0\n0\n1\n1\n0\n0\n1\n\n,\n\n0\n1\n0\n1\n1\n0\n1\n0\n\n,\n\n0\n0\n1\n0\n0\n1\n0\n0\n\n\n.\n(58)\nNote that A is not necessarily a square matrix (it is a coincidence here). From the null-space in (58) we infer that\nJ9 = 3 is the number of independent quadratic constants of motion. These can be read off directly from the generating\nvectors given:\nI1 = |d1|2 + |d4|2 + |d5|2 + |d8|2 ,\nI2 = |d2|2 + |d4|2 + |d5|2 + |d7|2 ,\nI3 = |d3|2 + |d6|2 .\n(59)\nIt is instructive to remark that the quadratic part of the Hamiltonian is given by H(d)\n2\n= ω1I1 + ω2I2 + ω3I3 . This is\neasy to show, by recalling the trigonometric identity ω1 + ω2 = ω4, namely sin(π/9) + sin(2π/9) = sin(4π/9).\n4.3.2. Lyapunov spectra for the N = 9 case: establishing the nonlinearity level below which 5-wave resonances\naccurately describe the hyperchaos of the original FPUT system\nHaving just found that the d-system has J9 = 3 independent quadratic constants of motion, we conclude that the\nd-system has a maximum of 9−2−J9 = 4 positive Lyapunov exponents. We thus turn to the numerical calculation of\n(finite-time) Lyapunov exponents, to compare the dynamics of the d-system versus that of the a-system. For this study\nwe will use a generic type of initial conditions d(0)\nk\n= ϵ fk with fk given in equation (35), and a(0)\nk is calculated from d(0)\nk\nvia the mapping in equation (13). The parameter ϵ is the same scaling parameter used in the numerical experiments\nin section 3.3 and is a proxy for the level of nonlinearity. Admittedly, the study we propose of a system’s behaviour\nalong a fixed ray in the state space parameterised by ϵ does not provide the full picture of bifurcations, islands of order\nand stochastic webs, that we would expect to find in a thorough study. However, our study allows us to quantify the\nidea of convergence of the normal form transformation by looking at the behaviour of the Lyapunov exponents in the\nd-system versus the a-system. In fact, in section 3.3 it was apparent that the normal form transformation converges\n(according to our ad-hoc criterion) when ϵ < 0.4, at least for small times. We want to quantify this by measuring the\nLyapunov exponents.\nTo calculate Lyapunov exponents we use the method of cloned trajectories [34]. The basic idea of the method\nis as follows. We consider the given initial condition and let the system evolve over long times, producing the so-\ncalled ‘fiducial’ (or reference) trajectory. In parallel, we consider a slightly separated initial condition (by a distance\nδ := 10−5, this value being arbitrarily chosen) and let it evolve as well, producing a ‘cloned’ trajectory. Due to\nthe existence of positive Lyapunov exponents, the trajectories will separate exponentially. Thus, after a certain time\n(called Tcycle, whose value must not be too large but it must be large enough so that the exponential separations\nbetween trajectories can be measured) one has to ‘reset’ the position of the cloned trajectory, so the vector joining\nthe two trajectories is rescaled to have length δ. Then, the trajectories continue to be calculated numerically for an\nextra time Tcycle, to be reset again at the end. Each such step is called an ‘iteration’. In this process, the exponential\ngrowth factors and the directions are recorded at each iteration and used to compute the Lyapunov exponents after\nseveral iterations. In fact, combining this with the use of multiple independent cloned trajectories and a Gram-Schmidt\northonormalisation procedure it is possible to construct recursively the whole spectrum of Lyapunov exponents.\nFigure 6 shows the running values of Lyapunov spectra obtained for both the a-system (left panels) and d-system\n(right panels), and for two representative values of the scaling parameter: ϵ = 0.4 (top panels; Tcycle = 100) and\nϵ = 0.75 (bottom panels; Tcycle = 2). First, we notice that the spectra are symmetric around zero, which is expected\nas the systems are Hamiltonian. Second, looking at the d-systems (right panels) we see that, as the theory predicts,\n19\n\n\nFigure 6: For FPUT in the case N = 9, α = 1, β = 0.05, Lyapunov spectra comparison between the original a-system (left panels) and exact-\nresonance evolution equations, d-system (right panels), for two selected values of the scaling parameter ϵ: ϵ = 0.4 (top panels) and ϵ = 0.75\n(bottom panels). Initial conditions are d(0)\nk\n= ϵ fk with fk given in equation (35), and a(0)\nk\nis calculated from d(0)\nk\nvia the mapping in equation (13).\nIn all these panels, the abscissa n denotes the ‘resetting’ or ‘iteration’ number. At the beginning of each iteration, the distance from the clone\ntrajectories to the fiducial trajectory is reset to 10−5, and the trajectories are evolved during a time Tcycle, at which the information on the separation\nbetween trajectories is recorded to update the Lyapunov exponent calculation, and a new resetting or iteration begins. Tcycle = 100 for ϵ = 0.4 and\nTcycle = 2 for ϵ = 0.75. Notice that for the d-system only the first 4 and the last 4 Lyapunov exponents are supposed to be different from zero,\nand thus the measured value of λ(d)\n5\nserves as a proxy for the error bars in all calculations of Lyapunov exponents (cf. figure 7). To this error, the\nstandard deviation from the running Lyapunov exponent data from the last quarter of the iterations is added, but this extra error is quite small in\ncomparison.\n20\n\n\nof the non-negative Lyapunov exponents only 4 of them are clearly positive, while the others seem to tend to zero.\nDue to the fact that these exponents are calculated in a finite time, the numerical result for the fifth exponent λ(d)\n5\nis\nnever exactly zero (while it is zero theoretically), and this allows us to use λ(d)\n5\nas an uncertainty (error bars) for all\nother numerically calculated exponents (cf. figure 7). Third, the case ϵ = 0.4 (top panels) seems to indicate that the\nspectra for the a-system is quite close to the spectra for the d-system: in particular, it appears that only 4 positive\nLyapunov exponents exist, whereas the case ϵ = 0.75 shows at least 7 positive Lyapunov exponents, demonstrating a\nclear departure from the d-system, which always has 4 positive Lyapunov exponents.\nMore quantitatively, in either a-system or d-system with initial-condition scaling parameter values of ϵ = 0.3, 0.4, 0.5, 0.75,\nwe perform simulations over several iterations and calculate numerically the average of the running values of a given\nLyapunov exponent over the last quarter of the iterations. We plot these Lyapunov exponent averages in figure 7. The\nsuccessive panels from left to right and from top to bottom correspond to the Lyapunov exponents λ1, . . . , λ5. We see\nthat for the first 4 Lyapunov exponents it seems that at nonlinearities below or at ϵ = 0.5 the two systems a and d\ncoincide, within the error bars. However, this would lead to the wrong conclusion, as the decider is the fifth exponent\n(last panel), which shows that the systems diverge at ϵ = 0.5 already. So, from the perspective of the Lyapunov\nexponents, one can conclude that at around ϵ = 0.3 −0.4 the original system develops a sharp transition, when going\nfrom small to large nonlinearity: at small nonlinearity it is a system dominated by 5-wave resonances and with a con-\ntrolled number of positive Lyapunov exponents, obtained from the theory of the exact-resonance equations of motion,\nand the normal form transformation from d- to a-variables appears to converge; at large nonlinearities, the system\ntruly departs from the simple picture based on 5-wave resonances, and develops hyperchaos at higher dimensions. In\nparticular, the normal form transformation from d- to a-variables definitely does not converge anymore at this level of\nnonlinearity, and the concept of M-wave resonances loses meaning.\n5. Conclusions\nIn this paper we have presented an all-round assessment of the approximate models arising from a weakly-\nnonlinear mathematical treatment of the FPUT lattice, using tools from wave-turbulence theory, starting from the\nZakharov equation and Krasitskii’s extension to 5-wave resonances, and further improving the theory to eliminate all\nnon-resonant terms, producing a unique transformation of coordinates that ‘distils’ the equations to exact resonant\nterms only (section 2). The main tools presented in section 3 to support this construction are: (i) We validated the\nhypermatrices containing the nonlinear coefficients appearing in the normal-form transformation (obtained when elim-\ninating all non-resonant terms while keeping up to and including 5-wave resonances), via a scaling approach based on\nthe error introduced by the truncation of the mapped equations in the normal-form variables. (ii) We demonstrated the\nconcept of convergence of the normal-form transformation and introduced an ad-hoc method of assessment of such\na convergence. (iii) We generalised our previous results [30] to construct a number of quadratic constants of motion\nbased on the resonant interactions in the FPUT system. Our results resemble the general results of Gustavson [18],\nbut in our case there is a clear advantage in using and extending Zakharov’s method: our normal form transformations\nare unique (as we eliminate all non-resonant terms) and conserve momentum, and all resonances are clearly classified\nin terms of cyclotomic polynomials [16] so the quadratic constants of motion can be constructed a priori.\nIn order to obtain nontrivial 5-wave resonances, the number of particles N must be divisible by 3. From our results\nobtained in Sec. 4 we can draw some important considerations: the number of quadratic constants of motion, while\ndepending on the number of divisors of N, grows linearly overall with the number of particles N in the system (as\nshown in Table 1). While in future work we will show how this number of invariants (and the condition on divisibility\nof N) changes as 6-wave resonances, 7-wave resonances, and so on, are included in the normal form transformation,\nwe can state the following results:\n• The theory gives us an upper limit to the chaotic directions expected in the truncated system.\n• If the number of maximum chaotic directions is equal to the number of positive finite-time Lyapunov exponents,\nthen we have found all possible constants of motion.\n• We can understand up to which order of the normal-form transformation the system is almost completely rep-\nresented by its approximated representation.\n21\n\n\nFigure 7: For FPUT in the case N = 9, α = 1, β = 0.05, study of convergence, towards a regime of small amplitude, of the five largest Lyapunov\nexponents calculated separately for the a-system (circle markers) and the d-system (triangle markers), as a function of the scaling parameter ϵ\n(same definition and same initial conditions as in the caption of Fig. 7). The values of the exponents plotted are calculated as the average over the\nlast quarter of the iterations of long-time running exponents as in figure 6. The error bars are defined as the numerically calculated value of λ(d)\n5 ,\nwhich in theory should be equal to zero, plus a small correction from the standard deviation of the last quarter of the running data of Lyapunov\nexponents (cf. figure 6).\n22\n\n\nFinally, in the same section we proposed a method based on the numerical calculation of finite-time Lyapunov ex-\nponents to estimate the level of nonlinearity at which the original FPUT system is well approximated by our 5-wave\nexact-resonance equations (which generalise Zakharov equations). While the theory is valid for any N divisible by 3\nand greater than 6, we focused on the case study N = 9, and compared our numerical calculations of the Lyapunov\nexponents to establish that at high enough nonlinearity the dynamics of the original FPUT system is clearly different\nfrom that of the exact-resonance equations, while at small enough nonlinearity the dynamics of these systems are\nindistinguishable (see Fig. 6 and Fig. 7). We found that the exact-resonance equations are a good approximation of\nthe original problem when the time scales are separable.\nThe main conclusion of this study applies to any N divisible by 3 and greater than 6 and is very optimistic: for\nsmall enough nonlinearity the 5-wave exact-resonance equations of motion constitute an excellent approximation to\nthe original FPUT system, and this can be quantified by looking at a particular Lyapunov exponent (specifically, the\none at position N −1 −JN, where JN is the number of independent quadratic constants of motion), which must be\nequal to zero if these two systems are well approximated.\nIn future work we will study the implications of our results on the question of equipartition in FPUT, in particular\nin the case of fixed boundary conditions.\n6. Acknowledgements\nThis publication has emanated from research conducted with the financial support of Taighde ´Eireann – Research\nIreland under Grant number 18/CRT/6049. For the purpose of Open Access, the authors have applied a CC BY public\ncopyright licence to any Author Accepted Manuscript version arising from this submission.\nAppendix A. Supplementary material\nThis paper extends Krasitskii’s results [21] and shows their applicability in the FPUT context. The mathematical\ntreatment has been adapted to the specific problem at hand. In this appendix, we provide backup material to the ana-\nlytical tensor calculations presented in the main text of the paper.\nAlways non-resonant case of 4-wave interactions:\nZ(1)\n0,1,2,3 = 2\n3\n\u0000V−0,1,0−1A(1)\n2+3,2,3 + V−0,2,0−2A(1)\n1+3,1,3 + V−0,3,0−3A(1)\n1+2,1,2\n−V−1,1−0,0A∗(3)\n−2−3,2,3 −V−2,2−0,0A∗(3)\n−1−3,1,3 −V−3,3−0,0A∗(3)\n−1−2,1,2\n\u0001 .\n(A.1)\nZ(3)\n0,1,2,3 = −2\u0000V−0,0−3,3A∗(3)\n−1−2,1,2 + V−3,3−0,0A∗(1)\n1+2,1,2 + V−(0+1),1,0A(1)\n3,2,3−2\n+ V−(0+2),2,0A(1)\n3,1,3−1 + V0,1,−0−1A∗(1)\n2,3,2−3 + V0,2,−0−2A∗(1)\n1,3,1−3\n\u0001 .\n(A.2)\nZ(4)\n0,1,2,3 = −2\n3\n\u0000V−(0+1),1,0A(3)\n−2−3,2,3 + V−(0+2),2,0A(3)\n−1−3,1,3 + V−(0+3),3,0A(3)\n−1−2,1,2\n+ V0,1,−0−1A∗(1)\n2+3,2,3 + V0,2,−0−2A∗(1)\n1+3,1,3 + V0,3,−0−3A∗(1)\n1+2,1,2\n\u0001 .\n(A.3)\nPotentially resonant case (non-resonant subcase) of 4-wave interactions:\nZ(2)\n0,1,2,3 = 2\u0000V−0,0−2,2A(1)\n3,1,3−1 + V−0,0−3,3A(1)\n2,1,2−1 −V0,1,−0−1A∗(3)\n−2−3,2,3\n−V−2,2−0,0A∗(1)\n1,3,1−3 −V−3,3−0,0A∗(1)\n1,2,1−2 −V−(0+1),1,0A(1)\n2+3,2,3\n\u0001 .\n(A.4)\nAlways non-resonant case of 5-wave interactions:\n23\n\n\n−i X(1)\n0,1,2,3,4 =1\n3\n\u0000 −V−0,1+2,3+4A(1)\n1+2,1,2A(1)\n3+4,3,4 −V−0,1+3,2+4A(1)\n1+3,1,3A(1)\n2+4,2,4\n−V−0,3+2,1+4A(1)\n1+4,1,4A(1)\n2+3,3,2 + V−(3+4),−1−2,0A(1)\n3+4,3,4A∗(3)\n−1−2,1,2\n+ V−(2+4),−1−3,0A(1)\n2+4,2,4A∗(3)\n−1−3,1,3 + V−(2+3),−1−4,0A(1)\n2+3,2,3A∗(3)\n−1−4,1,4\n+ V−(1+4),−2−3,0A(1)\n1+4,1,4A∗(3)\n−2−3,2,3 + V−(1+3),−2−4,0A(1)\n1+3,1,3A∗(3)\n−2−4,2,4\n+ V−(1+2),−4−3,0A(1)\n1+2,1,2A∗(3)\n−3−4,3,4 + V0,−1−2,−3−4A∗(3)\n−1−2,1,2A∗(3)\n−3−4,3,4\n+ V0,−1−3,−2−4A∗(3)\n−1−3,1,3A∗(3)\n−2−4,2,4 + V0,−1−4,−2−3A∗(3)\n−1−4,1,4A∗(3)\n−2−3,2,3\n\u0001\n−1\n2\n\u0000T−0,2,3,1+4A(1)\n1+4,1,4 + T−0,1,3,2+4A(1)\n2+4,2,4 + T−0,1,2,3+4A(1)\n3+4,3,4\n+ T−0,3,4,1+2A(1)\n1+2,1,2 + T−0,2,4,1+3A(1)\n1+3,1,3 + T−0,1,4,2+3A(1)\n2+3,2,3\n+ T−0,−(−1−2),3,4A∗(3)\n−1−2,1,2 + T−0,−(−1−3),2,4A∗(3)\n−1−3,1,3 + T−0,−(−1−4),2,3A∗(3)\n−1−4,1,4\n+ T−0,−(−2−4),1,3A∗(3)\n−2−4,2,4 + T−0,−(−3−4),1,2A∗(3)\n−3−4,3,4 + T−0,−(−2−3),1,4A∗(3)\n−2−3,2,3\n+ V−0,1,0−1B(1)\n0−1,2,3,4 + V−0,2,0−2B(1)\n0−2,1,3,4 + V−0,3,0−3B(1)\n0−3,1,2,4\n+ V−0,4,0−4B(1)\n0−4,1,2,3 −V−1,1−0,0B∗(4)\n1−0,2,3,4 −V−2,2−0,0B∗(4)\n2−0,1,3,4\n−V−3,3−0,0B∗(4)\n3−0,1,2,4 −V−4,4−0,0B∗(4)\n4−0,1,2,3\n\u0001 .\n(A.5)\n−i X(4)\n0,1,2,3,4 =4\n3\n\u0000V−0,4−3,−1−2A(1)\n4,3,4−3A(3)\n−2−1,1,2 + V−0,4−2,−1−3A(1)\n4,2,4−2A(3)\n−3−1,1,3\n+ V−0,4−1,−2−3A(1)\n4,1,4−1A(3)\n−2−3,2,3 + V−(4−3),1+2,0A∗(1)\n1+2,1,2A∗(1)\n4,3,4−3\n+ V−(4−2),1+3,0A∗(1)\n1+3,1,3A∗(1)\n4,2,4−2 + V−(4−1),2+3,0A∗(1)\n2+3,2,3A∗(1)\n4,1,4−1\n−V−(−1−2),3−4,0A∗(1)\n3,4,3−4A(3)\n−1−2,1,2 −V−(−1−3),2−4,0A∗(1)\n2,4,2−4A(3)\n−1−3,1,3\n−V−(−2−3),1−4,0A∗(1)\n1,4,1−4A(3)\n−2−3,2,3 −V0,1+2,3−4A∗(1)\n1+2,1,2A∗(1)\n3,4,3−4\n−V0,1+3,2−4A∗(1)\n1+3,1,3A∗(1)\n2,4,2−4 −V0,2+3,1−4A∗(1)\n2+3,2,3A∗(1)\n1,4,1−4\n\u0001\n+2\u0000 −T−0,−1,−2−3,4A(3)\n−2−3,2,3 −T−0,−2,−1−3,4A(3)\n−1−3,1,3 −T−0,−3,−1−2,4A(3)\n−1−2,1,2\n+ T0,1+2,3,−4A∗(1)\n1+2,1,2 + T0,1+3,2,−4A∗(1)\n1+3,1,3 + T0,2+3,1,−4A∗(1)\n2+3,2,3\n+ T0,1,2,−(4−3)A(1)\n4,3,4−3 + T0,1,3,−(4−2)A(1)\n4,2,4−2 + T0,2,3,−(4−1)A(1)\n4,1,4−1\n−T0,1,2,3−4A(1)\n3,4,3−4 −T0,1,3,2−4A(1)\n2,4,2−4 −T0,2,3,1−4A(1)\n1,4,1−4\n\u0001\n−2\n3\n\u0000V−(0+1),1,0B(3)\n0+1,2,3,4 + V−(0+2),2,0B(3)\n0+2,1,3,4 + V−(0+3),3,0B(3)\n0+3,1,2,4\n+ V0,1,−0−1B∗(2)\n−0−1,4,2,3 + V0,2,−0−2B∗(2)\n−0−2,4,1,3 + V0,3,−0−3B∗(2)\n−0−3,4,1,2\n\u0001\n+2\u0000V−0,0−4,4B(4)\n0−4,1,2,3 −V−4,4−0,0B∗(1)\n4−0,1,2,3\n\u0001\n+2\n3\n\u0000A(3)\n0,1,−0−1eT ∗\n−0−1,4,2,3 + A(3)\n0,2,−0−2eT ∗\n−0−2,4,1,3 + A(3)\n0,3,−0−3eT ∗\n−0−3,4,1,2\n\u0001 .\n(A.6)\n24\n\n\n−i X(5)\n0,1,2,3,4 =1\n3\n\u0000 −V−0,−1−2,−3−4A(3)\n−1−2,1,2A(3)\n−3−4,3,4 −V−0,−1−3,−2−4A(3)\n−1−3,1,3A(3)\n−2−4,2,4\n−V−0,−1−4,−2−3A(3)\n−1−4,1,4A(3)\n−2−3,2,3 + V0,1+2,3+4A∗(1)\n1+2,1,2A∗(1)\n3+4,3,4\n+ V0,1+3,2+4A∗(1)\n1+3,1,3A∗(1)\n2+4,2,4 + V0,1+4,2+3A∗(1)\n1+4,1,4A∗(1)\n2+3,2,3\n+ V−(−3−4),1+2,0A∗(1)\n1+2,1,2A(3)\n−3−4,3,4 + V−(−2−4),1+3,0A∗(1)\n1+3,1,3A(3)\n−2−4,2,4\n+ V−(−2−3),1+4,0A∗(1)\n1+4,1,4A(3)\n−2−3,2,3 + V−(−1−2),3+4,0A∗(1)\n3+4,3,4A(3)\n−1−2,1,2\n+ V−(−1−3),2+4,0A∗(1)\n2+4,2,4A(3)\n−1−3,1,3 + V−(−1−4),2+3,0A∗(1)\n2+3,2,3A(3)\n−1−4,1,4\n\u0001\n−1\n2\n\u0000T0,1,2,−(−3−4)A(3)\n−3−4,3,4 + T0,1,3,−(−2−4)A(3)\n−2−4,2,4 + T0,1,4,−(−2−3)A(3)\n−2−3,2,3\n+ T0,2,3,−(−1−4)A(3)\n−1−4,1,4 + T0,2,4,−(−1−3)A(3)\n−1−3,1,3 + T0,3,4,−(−1−2)A(3)\n−1−2,1,2\n+ T0,1,2,3+4A∗(1)\n3+4,3,4 + T0,1,3,2+4A∗(1)\n2+4,2,4 + T0,1,4,2+3A∗(1)\n2+3,2,3\n+ T0,2,3,1+4A∗(1)\n1+4,1,4 + T0,2,4,1+3A∗(1)\n1+3,1,3 + T0,3,4,1+2A∗(1)\n1+2,1,2\n−V−(0+1),1,0B(4)\n0+1,2,3,4 −V−(0+2),2,0B(4)\n0+2,1,3,4 −V−(0+3),3,0B(4)\n0+3,1,2,4\n−V−(0+4),4,0B(4)\n0+4,1,2,3 −V0,1,−0−1B∗(1)\n−0−1,2,3,4 −V0,2,−0−2B∗(1)\n−0−2,1,3,4\n−V0,3,−0−3B∗(1)\n−0−3,1,2,4 −V0,4,−0−4B∗(1)\n−0−4,1,2,3\n\u0001 .\n(A.7)\n25\n\n\nPotentially resonant case (non-resonant subcase) of 5-wave interactions:\ni X(2)\n0,1,2,3,4 = −4\n3\n\u0000V−0,2+3,4−1A(1)\n2+3,2,3A(1)\n4,1,4−1 + V−0,2+4,3−1A(1)\n2+4,2,4A(1)\n3,1,3−1\n+ V−0,3+4,2−1A(1)\n3+4,3,4A(1)\n2,1,2−1 −V−(3+4),1−2,0A(1)\n3+4,3,4A∗(1)\n1,2,1−2\n−V−(2+4),1−3,0A(1)\n2+4,2,4A∗(1)\n1,3,1−3 −V−(2+3),1−4,0A(1)\n2+3,2,3A∗(1)\n1,4,1−4\n−V−(2−1),−3−4,0A(1)\n2,1,2−1A∗(3)\n−3−4,3,4 −V−(3−1),−2−4,0A(1)\n3,1,3−1A∗(3)\n−2−4,2,4\n−V−(4−1),−2−3,0A(1)\n4,1,4−1A∗(3)\n−2−3,2,3 −V0,1−2,−3−4A∗(1)\n1,2,1−2A∗(3)\n−3−4,3,4\n−V0,1−3,−2−4A∗(1)\n1,3,1−3A∗(3)\n−2−4,2,4 −V0,1−4,−2−3A∗(1)\n1,4,1−4A∗(3)\n−2−3,2,3\n\u0001\n−2\u0000T−0,2,3,4−1A(1)\n4,1,4−1 + T−0,2,4,3−1A(1)\n3,1,3−1 + T−0,3,4,2−1A(1)\n2,1,2−1\n+ T−2,−3,0,1−4A∗(1)\n1,4,1−4 + T−2,−4,0,1−3A∗(1)\n1,3,1−3 + T−3,−4,0,1−2A∗(1)\n1,2,1−2\n+ T−0,−1,2,3+4A(1)\n3+4,3,4 + T−0,−1,3,2+4A(1)\n2+4,2,4 + T−0,−1,4,2+3A(1)\n2+3,2,3\n+ T−2,1,0,−3−4A∗(3)\n−3−4,3,4 + T−3,1,0,−2−4A∗(3)\n−2−4,2,4 + T−4,1,0,−2−3A∗(3)\n−2−3,2,3\n\u0001\n−2\n3\n\u0000V−0,2,0−2B(2)\n0−2,1,3,4 + V−0,3,0−3B(2)\n0−3,1,2,4 + V−0,4,0−4B(2)\n0−4,1,2,3\n−V−2,0,2−0B∗(3)\n2−0,3,4,1 −V−3,0,3−0B∗(3)\n3−0,2,4,1 −V−4,0,4−0B∗(3)\n4−0,2,3,1\n−3V−(0+1),0,1B(1)\n0+1,2,3,4 −3V0,1,−0−1B∗(4)\n−0−1,2,3,4\n\u0001\n+2\n3\n\u0000A(1)\n0,2,0−2eT3,4,1,0−2 + A(1)\n0,3,0−3eT2,4,1,0−3 + A(1)\n0,4,0−4eT2,3,1,0−4\n\u0001 .\n(A.8)\n−i X(3)\n0,1,2,3,4 = −2\u0000V−0,3+4,−1−2A(1)\n3+4,3,4A(3)\n−1−2,1,2 + V−0,3−1,4−2A(1)\n3,1,3−1A(1)\n4,2,4−2\n+ V−0,4−1,3−2A(1)\n3,2,3−2A(1)\n4,1,4−1 −V−(3+4),1+2,0A(1)\n3+4,3,4A∗(1)\n1+2,1,2\n−V−(−1−2),−3−4,0A(3)\n−1−2,1,2A∗(3)\n−3−4,3,4 −V−(3−1),2−4,0A(1)\n3,1,3−1A∗(1)\n2,4,2−4\n−V−(4−1),2−3,0A(1)\n4,1,4−1A∗(1)\n2,3,2−3 −V−(3−2),1−4,0A(1)\n3,2,3−2A∗(1)\n1,4,1−4\n−V−(4−2),1−3,0A(1)\n4,2,4−2A∗(1)\n1,3,1−3 + V0,1+2,−3−4A∗(1)\n1+2,1,2A(3)\n−3−4,3,4\n−V0,1−4,2−3A∗(1)\n1,4,1−4A∗(1)\n2,3,2−3 −V0,1−3,2−4A∗(1)\n1,3,1−3A∗(1)\n2,4,2−4\n\u0001\n−3\u0000T−0,3,4,(−1−2)A(3)\n1,2,−1−2 + T−(1+2),−0,3,4A∗(1)\n1+2,1,2 + T−(3+4),2,1,0A(1)\n3+4,3,4\n+ T−0,−1,3,4−2A(1)\n4,2,4−2 + T−0,−1,4,3−2A(1)\n3,2,3−2 + T−0,−2,3,4−1A(1)\n4,1,4−1\n+ T−0,−2,4,3−1A(1)\n3,1,3−1 + T−3,2,0,1−4A∗(1)\n1,4,1−4 + T−3,1,0,2−4A∗(1)\n2,4,2−4\n+ T−4,2,0,1−3A∗(1)\n1,3,1−3 + T−4,1,0,2−3A∗(1)\n2,3,2−3 −T0,1,2,−3−4A(3)\n3,4,−3−4\n\u0001\n−\u0000V−0,3,0−3B∗(3)\n0−3,1,2,4 + V−0,4,0−4B∗(3)\n0−4,1,2,3 −V−3,0,3−0B∗(2)\n3−0,4,1,2\n−V−4,0,4−0B∗(2)\n4−0,3,1,2 −V−(0+1),0,1B(2)\n0+1,2,3,4 −V−(0+2),0,2B(2)\n0+2,1,3,4\n−V0,1,−0−1B∗(3)\n−0−1,3,4,2 −V0,2,−0−2B∗(3)\n−0−2,3,4,1\n\u0001\n−\u0000eT1,2,4,3−0A(1)\n3,0,3−0 + eT1,2,3,4−0A(1)\n4,0,4−0 −eT3,4,2,0+1A(1)\n0+1,0,1 −eT3,4,1,0+2A(1)\n0+2,0,2\n\u0001 .\n(A.9)\n26\n\n\nPotentially resonant case (resonant subcase) of 5-wave interactions:\n−i p0,1,2,3,4 = 1\n3A(1)\n0,2,0−2\n\u0010\nA(1)\n3,1,3−1A(1)\n0−2,3−1,4 + A(1)\n4,1,4−1A(1)\n0−2,4−1,3 + A(1)\n3+4,3,4A(1)\n3+4,0−2,1 −A(3)\n3,4,−3−4A(3)\n0−2,−3−4,1\n\u0011\n−2\n3\nA(1)\n2,0,2−0\nω2−0 + ω3 + ω4 −ω1\n\u0010\n−A(1)\n1,3,1−3V−(1−3),2−0,4 −A(1)\n1,4,1−4V−(1−4),2−0,3 + A(1)\n3+4,3,4V−1,2−0,3+4\n+A(3)\n3,4,−3−4V−(2−0),−3−4,1 + A(1)\n3,1,3−1V4,2−0,3−1 + A(1)\n4,1,4−1V3,2−0,4−1 + 3\n2T−1,3,4,2−0\n!\n,\ni Q0,1,2,3,4 = A(1)\n3,0,3−0\n \nA(1)\n2,4,2−4A(1)\n3−0,2−4,1 + 1\n2A(1)\n1+2,1,2A(1)\n1+2,3−0,4 −1\n2A(3)\n1,2,−1−2A(3)\n4,3−0,−1−2\n!\n+ A(1)\n4,2,4−2\n\u0010\nA(1)\n3,1,3−1A(1)\n0,4−2,3−1 + A(3)\n0,1,−0−1A(3)\n3,4−2,−0−1 −A(1)\n1,3,1−3A(1)\n4−2,1−3,0 −A(1)\n0,3,0−3A(1)\n4−2,0−3,1\n\u0011\n+ A(1)\n0+2,0,2\n\u0010\nA(1)\n3,1,3−1A(1)\n0+2,3−1,4 + A(1)\n3+4,3,4A(1)\n3+4,0+2,1 −A(1)\n1,3,1−3A(1)\n4,0+2,1−3\n−A(1)\n1,4,1−4A(1)\n3,0+2,1−4 −A(3)\n3,4,−3−4A(3)\n1,0+2,−3−4\n\u0011\n+ 2\nA(1)\n2,4,2−4\nω2−4 + ω1 + ω0 −ω3\n\u0010\nA(1)\n0,3,0−3V1,0−3,2−4 + A(1)\n1,3,1−3V1−3,2−4,0 −A(1)\n3,0,3−0V−(3−0),2−4,1\n−A(1)\n3,1,3−1V−(3−1),2−4,0 + A(1)\n0+1,0,1V−3,0+1,2−4 + A(3)\n0,1,−0−1V−(2−4),−0−1,3 + 3\n2T−3,0,1,2−4\n!\n−2\nA(1)\n0,3,0−3\nω0−3 + ω1 + ω2 −ω4\n\u0010\n−A(1)\n4,2,4−2V−(4−2),0−3,1 + A(1)\n2,4,2−4V1,0−3,2−4 + (1/2) ∗A(1)\n1+2,1,2V−4,1+2,0−3\n+1\n2A(3)\n1,2,−1−2V−(0−3),−1−2,4 + 3\n4T−4,1,2,0−3\n!\n−2\nA(3)\n0,2,−0−2\nω0+2 + ω3 + ω4 −ω1\n\u0010\n−A(1)\n1,3,1−3V−(1−3),−0−2,4 −A(1)\n1,4,1−4V−(1−4),−0−2,3 + A(1)\n3,1,3−1V4,3−1,−0−2\n+A(1)\n4,1,4−1V3,4−1,−0−2 + A(1)\n3+4,3,4V−1,3+4,−0−2 + A(3)\n3,4,−3−4V−(−0−2),−3−4,1 + 3\n2T−1,3,4,−0−2\n!\n+ 2\nA(1)\n3+4,3,4\nω3+4 −ω0 −ω1 −ω2\n \nA(1)\n0+2,0,2V−(3+4),0+2,1 + 1\n2A(1)\n1+2,1,2V−(3+4),1+2,0 + A(3)\n0,2,−0−2V−1,3+4,−0−2\n+1\n2A(3)\n1,2,−1−2V−0,3+4,−1−2 + 3\n4T−3+4,2,1,0\n!\n+ 2\nA(3)\n3,4,−3−4\nω3+4 + ω0 + ω1 + ω2\n \nA(1)\n0+2,0,2V−3−4,0+2,1 + 1\n2A(1)\n1+2,1,2V−3−4,1+2,0 −A(3)\n0,2,−0−2V−(−0−2),−3−4,1\n−1\n2A(3)\n1,2,−1−2V−(−1−2),−3−4,0 + 3\n4T0,1,2,−3−4\n!\n.\n(A.10)\n27\n\n\nReferences\n[1] E. Fermi, P. Pasta, S. Ulam, M. Tsingou, Studies of the nonlinear problems, Tech. rep., Los Alamos National Lab.(LANL), Los Alamos, NM\n(United States) (1955).\n[2] V. Zakharov, E. Schulman, Integrability of nonlinear systems and perturbation theory, in: What is integrability?, Springer, 1991, pp. 185–250.\n[3] N. J. Zabusky, M. D. Kruskal, Interaction of “solitons”’ in a collisionless plasma and the recurrence of initial states, Physical Review Letters\n15 (6) (1965) 240.\n[4] F. Israiljev, B. V. Chirikov, The statistical properties of a non-linear string, Tech. rep., SCAN-9908053 (1965).\n[5] D. Shepelyansky, Low-energy chaos in the Fermi-Pasta-Ulam problem, Nonlinearity 10 (5) (1997) 1331.\n[6] D. Bambusi, A. Ponno, On metastability in FPU, Communications in Mathematical Physics 264 (2006) 539–561.\n[7] F. Fucito, F. Marchesoni, E. Marinari, G. Parisi, L. Peliti, S. Ruffo, A. Vulpiani, Approach to equilibrium in a chain of nonlinear oscillators,\nJournal de Physique 43 (5) (1982) 707–713.\n[8] L. Berchialla, L. Galgani, A. Giorgilli, Localization of energy in FPU chains, Discrete and Continuous Dynamical Systems 11 (4) (2004)\n855–866.\n[9] S. Paleari, T. Penati, Numerical methods and results in the FPU problem, in: The Fermi-Pasta-Ulam Problem: A Status Report, Springer,\n2007, pp. 239–282.\n[10] G. Berman, F. Izrailev, The Fermi-Pasta-Ulam problem: fifty years of progress, Chaos: An Interdisciplinary Journal of Nonlinear Science\n15 (1) (2005) 015104.\n[11] G. Gallavotti, The Fermi-Pasta-Ulam Problem: A Status Report, Vol. 728, Springer, 2007.\n[12] P. G. Kevrekidis, Non-linear waves in lattices: past, present, future, IMA Journal of Applied Mathematics 76 (3) (2011) 389–423.\n[13] A. Henrici, T. Kappeler, Results on normal forms for FPU chains, Communications in Mathematical Physics 278 (1) (2008) 145–177.\n[14] Y. Lvov, Effective five-wave Hamiltonian for surface water waves, Physics Letters A 230 (1-2) (1997) 38–44.\n[15] A. Dyachenko, Y. Lvov, V. Zakharov, Five-wave interaction on the surface of deep fluid, Physica D: Nonlinear Phenomena 87 (1-4) (1995)\n233–261.\n[16] M. D. Bustamante, K. Hutchinson, Y. V. Lvov, M. Onorato, Exact discrete resonances in the Fermi-Pasta-Ulam-Tsingou system, Communi-\ncations in Nonlinear Science and Numerical Simulation 73 (2019) 437–471.\n[17] M. Onorato, Y. V. Lvov, G. Dematteis, S. Chibbaro, Wave turbulence and thermalization in one-dimensional chains, Physics Reports 1040\n(2023) 1–36.\n[18] F. Gustavson, On constructing formal integrals of a Hamiltonian system near an equilibrium point, Astronomical Journal, Vol. 71, p. 670\n(1966) 71 (1966) 670.\n[19] V. P. Krasitskii, On reduced equations in the Hamiltonian theory of weakly nonlinear surface waves, Journal of Fluid Mechanics 272 (1994)\n1–20.\n[20] V. Zakharov, The Hamiltonian formalism for waves in nonlinear media having dispersion, Radiophysics and Quantum Electronics 17 (4)\n(1974) 326–343.\n[21] V. Krasitskii, On the canonical transformation of the theory of weakly nonlinear waves with nondecay dispersion law, Sov. Phys. JETP 98\n(1990) 1644–1655.\n[22] V. E. Zakharov, Stability of periodic waves of finite amplitude on the surface of a deep fluid, Journal of Applied Mechanics and Technical\nPhysics 9 (2) (1968) 190–194.\n[23] L. Pistone, S. Chibbaro, M. D. Bustamante, Y. V. Lvov, M. Onorato, Universal route to thermalization in weakly-nonlinear one-dimensional\nchains, Mathematics in Engineering 1 (4) (2019) 672–698.\n[24] Z. J. Grant, Perturbed Runge-Kutta methods for mixed precision applications, Journal of Scientific Computing 92 (1) (2022) 6.\n[25] S. G. Walsh, M. D. Bustamante, On the convergence of the normal form transformation in discrete Rossby and drift wave turbulence, Journal\nof Fluid Mechanics 884 (2020) A28.\n[26] E. Bogomol’nyi, Higher orders of perturbation theory in classical mechanics, Soviet Journal of Experimental and Theoretical Physics 59 (5)\n(1984) 917.\n[27] W. R. Wood, M. Ali, On the limitations of the Birkhoff-Gustavson normal form approach, Journal of Physics A: Mathematical and General\n20 (2) (1987) 351.\n[28] M. Kaluza, M. Robnik, Improved accuracy of the Birkhoff-Gustavson normal form and its convergence properties, Journal of Physics A:\nMathematical and General 25 (20) (1992) 5311.\n[29] M. Robnik, On the Pad´e approximations to the Birkhoff-Gustavson normal form, Journal of Physics A: Mathematical and General 26 (24)\n(1993) 7427.\n[30] K. L. Harper, M. D. Bustamante, S. V. Nazarenko, Quadratic invariants for discrete clusters of weakly interacting waves, Journal of Physics\nA: Mathematical and Theoretical 46 (24) (2013) 245501.\n[31] B. Rink, Proof of Nishida’s conjecture on anharmonic lattices, Communications in Mathematical Physics 261 (3) (2006) 613–627.\n[32] B. Rink, An Integrable Approximation for the Fermi-Pasta-Ulam Lattice, in: The Fermi-Pasta-Ulam Problem: A Status Report, Springer,\n2007, pp. 283–301.\n[33] G. Benettin, S. Pasquali, A. Ponno, The Fermi-Pasta-Ulam problem and its underlying integrable dynamics: an approach through Lyapunov\nexponents, Journal of Statistical Physics 171 (4) (2018) 521–542.\n[34] D. C. Soriano, F. I. Fazanaro, R. Suyama, J. R. de Oliveira, R. Attux, M. K. Madrid, A method for Lyapunov spectrum estimation using\ncloned dynamics and its application to the discontinuously-excited FitzHugh-Nagumo model, Nonlinear Dynamics 67 (2012) 413–424.\n28\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21293v1.pdf",
    "total_pages": 28,
    "title": "On the role of 5-wave resonances in the nonlinear dynamics of the Fermi-Pasta-Ulam-Tsingou lattice",
    "authors": [
      "Tiziana Comito",
      "Matteo Lotriglia",
      "Miguel D. Bustamante"
    ],
    "abstract": "We study the dynamics of the $(\\alpha+\\beta)$ Fermi-Pasta-Ulam-Tsingou\nlattice (FPUT lattice, for short) for an arbitrary number $N$ of interacting\nparticles, in regimes of small enough nonlinearity so that a Birkhoff-Gustavson\ntype of normal form can be found using tools from wave-turbulence theory.\nSpecifically, we obtain the so-called Zakharov equation for $4$-wave resonant\ninteractions and its extension to $5$-wave resonant interactions by Krasitskii,\nbut we introduce an important new feature: even the generic terms in these\nnormal forms contain $resonant$ $interactions$ $only$, via a $unique$ canonical\ntransformation. The resulting normal forms provide an approximation to the\noriginal FPUT lattice that possesses a significant number of exact quadratic\nconservation laws, beyond the quadratic part of the Hamiltonian. We call the\nnew equations \"exact-resonance evolution equations\" and examine their\nproperties: (i) Heisenberg representation's slow evolution allows us to\nimplement numerical methods with large time steps to obtain relevant dynamical\ninformation, such as Lyapunov exponents. (ii) We introduce tests, such as\nconvergence of the normal form transformation and truncation error\nverification, to successfully validate our exact-resonance evolution equations.\n(iii) The systematic construction of new quadratic invariants (via the resonant\ncluster matrix) allows us to use finite-time Lyapunov exponent calculations to\nquantify the level of nonlinearity at which the original FPUT lattice is well\napproximated by the exact-resonance evolution equations. We show numerical\nexperiments in the case $N=9$, but the theory and numerical methods are valid\nfor arbitrary values of $N$. We conclude that, when $3$ divides $N$, at small\nenough nonlinearity the FPUT lattice's dynamics and nontrivial hyperchaos are\ngoverned by $5$-wave resonant interactions.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}