{
  "id": "arxiv_2502.21178v1",
  "text": "Prospection and dispersal in metapopulations: a\nperspective from opinion dynamics models\nDaniela Molas and Daniel Campos\nAbstract Dispersal is often used by living beings to gather information from con-\nspeciﬁcs, integrating it with personal experience to guide decision-making. This\nmechanism has only recently been studied experimentally, facilitated by advance-\nments in tracking animal groups over extended periods. Such studies enable the\nanalysis of the adaptive dynamics underlying sequential decisions and collective\nchoices. Here, we present a theoretical framework based on the Voter Model to\ninvestigate these processes. The model, originally designed to study opinion or\nbehavioral consensus within groups through imitation, is adapted to include the\nprospection of others’ decisions as a mechanism for updating personal criteria. We\ndemonstrate that several properties of our model—such as average consensus times\nand polarization dynamics—can be analytically mapped onto those of the classical\nVoter Model under simplifying assumptions. Finally, we discuss the potential of this\nframework for studying more complex scenarios.\n1 Introduction\nThe scientiﬁc study of decision-making in living beings poses a signiﬁcant challenge\nacross multiple disciplines. Traditionally associated with psychology and sociology,\nthis ﬁeld has recently garnered growing interdisciplinary interest, driven by advance-\nments in experimental techniques and theoretical insights from ecology, mathemat-\nics, and physics. These developments have enabled more integrative approaches to\nunderstanding decision-making processes. Notable examples include the study of\nDaniela Molas\nPhysics Dept, Universitat Autonoma de Barcelona, 08193 Cerdanyola del Vall`es, e-mail:\ndaniela.molas@autonoma.cat\nDaniel Campos\nPhysics Dept, Universitat Autonoma de Barcelona, 08193 Cerdanyola del Vall`es, e-mail:\ndaniel.campos@uab.cat\n1\n\n\n2\nDaniela Molas and Daniel Campos\ncollective movement in animal groups through the frameworks of complexity sci-\nence [1] and ﬂuid dynamics [2, 3, 4], as well as the analysis of cooperative behavior\namong rational agents in evolutionary game theory scenarios, such as the prisoner’s\ndilemma [5, 6], or via decentralized communication systems, as observed in eusocial\nspecies [7, 8].\nA particularly important aspect within this context concerns how groups of indi-\nviduals prospect for information from peers to guide their decisions during extended\ndecision-making processes. Information sharing and prospection serve as essential\nmechanisms for fostering behavioral and/or opinion consensus. This is of intrinsic\ninterest for understanding collective phenomena in ecological and social systems,\nincluding positive outcomes (e.g., cooperation) and negative consequences (e.g., the\ntragedy of the commons).\nThe Voter Model [9] is one of the most prominent mathematical frameworks for\nstudying opinion consensus in such contexts. In its simplest form, the Voter Model\nassumes that individuals (voters) make sequential choices from a discrete set of\noptions (e.g., political parties) by imitating the decisions of their peers. Despite its\nsimplicity, the Voter Model and its numerous extensions [10, 11, 12, 13, 14, 15, 16,\n17, 18, 19, 20] have attracted sustained theoretical interest over the past decades.\nThis model plays a central role in the statistical physics of social systems [10, 11],\nproviding a robust framework for exploring the dynamics of consensus formation in\nboth natural and artiﬁcial populations.\n1.1 The Voter Model in Biology\nWhile copying and imitation are common mechanisms in living systems, most stud-\nies on the Voter Model have been restricted to theoretical contexts, with real-life\napplications remaining relatively unexplored [21]. This is somewhat surprising, as\nnatural selection itself can be viewed as a copying mechanism, where diﬀerent op-\ntions (genotypes) spread and compete, leading to either consensus (survival of the\nﬁttest) or polarization (coexistence through specialization or resource partitioning).\nSeveral factors may explain the limited application of Voter-like models to exper-\nimental biology:\n(i) Most versions of the Voter Model are restricted to populations with a ﬁxed\nnumber of individuals, which is often unrealistic in biological systems.\n(ii) Opinion consensus in biological populations typically arises through local\nand dynamic interactions. However, spatially explicit versions of the Voter Model\nremain scarce. The Sznajd model provides some notable exceptions; see [22, 23] for\ndetails.\n(iii) As highlighted in [21], consensus among sepparate individuals is not always\nmeaningful in biological systems. Instead, population-level or site-level descriptions\nare more relevant, yet extending Voter Models to these scales is nontrivial.\nDespite these challenges, Voter-like models have been successfully applied to\ngenetic drift and evolutionary dynamics, starting with Moran’s pioneering work [24]\n\n\nProspection and dispersal in metapopulations\n3\nand extending to more recent studies [25, 26, 27, 28, 29, 30]. Applications to ﬁelds\nlike behavioral and movement ecology, however, remain rare (but see [31, 32, 33,\n34]).\nImitation and majority rules, central to many Voter Models, are recognized as\npowerful drivers of both individual and social decision-making in animal groups\n[35, 36, 37]. A particularly relevant case involves seasonal species that annually\nselect breeding sites. In such cases, individual experience is often complemented\nby social information gathered from the decisions of conspeciﬁcs, a process known\nas “prospection” [38]. The eﬀect of prospection on ﬁtness and reproductive success\nhas only recently been explored, as it requires tracking animal movements over\nlarge temporal and spatial scales. Some datasets, particularly for seabirds [39], have\nbecome available recently through advances in GPS technology and other tracking\nmethods, allowing a notable expansion of the ﬁeld.\nIn this work, we explore how Voter-like models can be adapted to study the role\nof prospection in metapopulation dynamics [40], where diﬀerent sites or patches\nrepresent the options available to “voters.” Breeding decisions based solely on prior\nexperience correspond to “stubborn voters,” who repeatedly choose the same option,\nwhile prospection introduces an imitation dynamic within the model.\nOur primary objective is to investigate how prospection inﬂuences opinion con-\nsensus, a typical outcome in classical Voter Models. Speciﬁcally, we examine: (i)\nhow the time to achieve consensus varies with prospection rates or eﬃciency, and\n(ii) the emergence of alternative outcomes, such as polarization or stalemates. In the\ncase of polarization, individuals coexist within distinct subpopulations, each main-\ntaining diﬀerentiated opinions or preferences. Consequently, the system ceases to\nevolve, ultimately leading to an absorbing state. On the other hand, stalemates refer to\nstationary scenarios where these subpopulations coexist and interact by exchanging\nindividuals but without reaching a uniﬁed consensus so, unlike polarization, system\nﬂuctuations hinder the attainment of an absorbing state.\nTo this end, we propose a version of the Voter Model where individuals accumulate\npersonal information through prospection (Fig. 1). Similar approaches incorporating\npersonal information have recently been explored, revealing mechanisms that can\npromote polarized states [12, 16]. In our adaptation, individuals base their decisions\non personal/internal criteria, which, in a biological context, could represent attributes\nsuch as proximity to food or predation pressure. These criteria are updated through\nprospection visits to neighboring patches. Spatially explicit eﬀects are expected to\nplay a signiﬁcant role, and we analyze these under two idealized scenarios: global\nprospection (where individuals can prospect for any patch) and local prospection\n(restricted to neighboring patches).\nThe structure of this work is as follows. In Section 2, we introduce the Voter-\nlike model with personal criteria and describe its parameters. Section 3 examines\nthe eﬀects of personal information in the mean-ﬁeld case, where all patches are\nequally accessible (global prospection). Section 4 addresses spatially explicit eﬀects\nby considering local prospection. Finally, in Section 5, we summarize the main\nﬁndings and propose ideas for future research.\n\n\n4\nDaniela Molas and Daniel Campos\nFig. 1 Model schematics. Each individual in the group has personal information based on 푁퐶\ncriteria, each supporting a speciﬁc patch or breeding site (indicated by colors). Individual choices at\neach time step are inﬂuenced by these criteria, which are updated either by prospection (probability\n푞) or by reinforcing the individual’s current option (reassertion, probability 1 −푞). See the main\ntext for further details.\n2 Model\nWe consider a system of 푁individuals which at each time step have to choose one\nfrom a set of 퐾diﬀerent options available (with 퐾≥2). In the classical Voter\nModel such decisions are simply taken by imitating what the other individuals do,\nthough several variants exist which take into account diﬀerent aspects of animal\nor human decision making. One such aspect, not much studied previously, is the\nidea that observing others’ decisions might not necessarily lead to instantaneous\nimitation, but it just provides an external source of information thats adds to the\nbackground knowledge of the individual. To take into account this aspect, we assume\nthat decisions are based on a set of 푁퐶personal criteria, which represent relevant\nfeatures of the options. So that, the decision is expected to be the result of combining\nor prioritizing such features/criteria.\nLet us illustrate this with the speciﬁc example of birds selecting a suitable patch\nannually for nesting (Fig. 1). To make their decision, the birds consider their indi-\nvidual preferences based on a set of 푁퐶criteria, such as proximity to food sources,\npredation risk, competition with conspeciﬁcs, availability of resting areas, etc.\nEach individual has its own preferences (or personal information) regarding these\ncriteria. If we denote individuals by the index 푖= 1, 2, . . . , 푁, where 푁is the total\nnumber of individuals, and criteria by the index 푗= 1, 2, . . . , 푁퐶, where 푁퐶is the\ntotal number of criteria considered, then the 푗-th criterion of the 푖-th individual,\n\n\nProspection and dispersal in metapopulations\n5\ndeﬁned as 푐푖, 푗, can take possible values from {1, 2, . . . , 퐾}, where 퐾is the number\nof available options.\nThe values of these criteria are updated based on either prior experience or\ninformation acquired by the individual through exploring other patches. At each\ntime step, (i) one criterion from each individual (say 푖1) is chosen at random, (ii)\na neighboring individual 푖2 is selected randomly, and (iii) the chosen criterion 푐푖1, 푗\nis updated such that it adopts the option (patch) held by the neighboring individual\n푖2 with probability 푞, or with probability 1 −푞, it retains the option chosen by the\nindividual푖1 itself. Hence, 푞represents the probability that individual 푖1 acquires new\ninformation from its neighbors, and updates its preferences accordingly; otherwise,\nthe individual reaﬃrms its current preferences.\nNext, following these personal preferences, the corresponding decisions are made\nas follows. At each time step, (i) we choose one individual at random, (ii) we choose\none of its personal criteria at random, and (iii) the choice made by the individual is\nupdated to the option supported by the selected criterion. So, the agent is assumed\nto be prioritizing such particular criterion/feature at that moment.\nBy introducing this dual dynamics (a dynamics for taking decisions, and another\none for updating criteria) we dissociate what individuals “do” from what individuals\n“think”. Of course, if criteria are updated at a rate fast enough then they will reﬂect\nthe real options chosen by the population, and then individuals decisions and criteria\nwill be aligned. But there are also mechanisms (e.g. noisy or uncertain prospection)\nthat could lead the individuals to “behave” and “think” diﬀerently. While this is a\nvery attractive possibility to explore, in the present contribution we will rather focus\nfor simplicity on simple situations where individuals are expected on average to\n“think” and “behave” similarly.\nWe deﬁne 푛훼(푡) as the amount of individuals which are holding option 훼at time\nstep 푡, and 푛훼,훽(푡) as the total number of criteria for these individuals that give\nsupport to option 훽. As a result, 푁= Í\n훼푛훼and 푁퐶= Í\n훽푛훼,훽hold, and the case\n푛훼,훼= 푁퐶would represent a situation in which all the criteria for the individuals\nholding option 훼give support to that option.\nFrom the deﬁnitions above, we can deﬁne a set of magnetizations as\n푚훼≡푛훼−\nÕ\n훽≠훼\n푛훼,훽= 2푛훼−푁,\n(1)\nfor 훼= 1, 2, . . . , 퐾. This magnetization explicitly depends on the fraction of indi-\nviduals holding option 훼and reﬂects the level of prevalence of this option over the\nothers. Deﬁned in this way, the consensus of the population, where all individuals\nsupport the same option 훼, satisﬁes 푚훼= 푁, and 푚훼′ = −푁for 훼′ ≠훼.\nFollowing the usual guidelines from the classical Voter Model with multiple op-\ntions (see, e.g., [14, 16]), a Master equation for the evolution of these magnetizations\ncan be written in the mean-ﬁeld approximation. By introducing 푃(푚훼, 푡) as the\nprobability that the magnetization 푚훼takes a particular value at time step 푡, the\nMaster equation reads\n\n\n6\nDaniela Molas and Daniel Campos\n푃(푚훼, 푡+ 1) =\n퐾\nÕ\n훽≠훼\n\u0014푛훽\n푁\n푛훼,훽\n푁퐶\n푃(푚훼−2, 푡) + 푛훼\n푁\n푛훽,훼\n푁퐶\n푃(푚훼+ 2, 푡)\n\u0015\n+\n+\n \n푛훼\n푁\n푛훼,훼\n푁퐶\n+\nÕ\n훽≠훼\n푛훽\n푁\nÍ\n훾≠훼푛훾,훽\n푁퐶\n!\n푃(푚훼, 푡).\n(2)\nLet us analyze each term one by one:\n1. The ﬁrst term represents the probability that an individual holding option 훽is\nchosen at random at time 푡(푛훽/푁), and that the criterion assigned randomly\nsupports option 훼(푛훼,훽/푁퐶), causing the individual to switch from 훽to 훼. As a\nresult, 푛훼increases by 1, which causes 푚훼to increase by 2.\n2. The second term represents the possibility that the individual chosen at random\nholds option 훼, but the assigned criterion supports option 훽, causing the individ-\nual’s option to change from 훼→훽. As a result, 푛훼decreases by 1, which causes\n푚훼to decrease by 2.\n3. The third term stands for the situation where individuals do not switch their\noption. The expression 푛훼\n푁\n푛훼,훼\n푁퐶represents the case where the option held by the\nindividual and that supported by the criteria are both 훼, so nothing changes.\nSimilarly, Í\n훽≠훼\n푛훽\n푁\nÍ\n훾≠훼푛훾,훽\n푁퐶\nstands for those cases where both the option of the\nindividual and the option supported by the criterion are diﬀerent from 훼, for\nwhich the value of 푚훼remains the same.\nIn our particular model, the imitation rule is not explicitly included in the dynamics\nabove of how the individuals take options, but on how the criteria are updated. For\nthis reason, it is more convenient and instructive to work with magnetizations deﬁned\nat the level of the criteria. These can be deﬁned as\n휎훼≡푛훼,훼−\nÕ\n훽≠훼\n푛훼,훽\n(3)\nsince the criteria are part of a set of options. It follows that 휎훼= 푁퐶whenever\n푛훼,훼= 푁퐶, which implies that the set of criteria is aligned with the same option 훼.\nThe Master equation associated with 휌(휎훼, 푡), which represents the probability\ndensity of 휎훼at time 푡, takes a form similar to that above for 푃(푚훼, 푡). However, this\nequation consists of two distinct terms: the ﬁrst represents the reassertion mechanism,\nwith probability (1−푞), and the second describes the dynamics induced by imitation\nrules, with complementary probability 푞:\n\n\nProspection and dispersal in metapopulations\n7\n휌(휎훼, 푡+ 1) = (1 −푞)\n퐾\nÕ\n훽≠훼\n\u0014푛훽\n푁\n푛훼,훽\n푁퐶\n휌(휎훼−2, 푡) + 푛훼\n푁\n푛훽,훼\n푁퐶\n휌(휎훼+ 2, 푡)\n\u0015\n+\n+ 푞\nÕ\n훽≠훼\n\"\n푛훽\n푁\nÍ퐾\n훾=1 푛훼,훾\n퐾푁퐶\n휌(휎훼−2, 푡) + 푛훼\n푁\nÍ퐾\n훾=1 푛훽,훾\n퐾푁퐶\n휌(휎훼+ 2, 푡)\n#\n+\n+\n \n푛훼\n푁\n푛훼,훼\n푁퐶\n+\nÕ\n훽≠훼\n푛훽\n푁\nÍ\n훾≠훼푛훾,훽\n퐾푁퐶\n!\n휌(휎훼, 푡),\n(4)\nwhere the quotient\nÍ퐾\n훾=1 푛훼,훾\n퐾푁퐶\nrepresents the fraction of criteria supporting option 훼\nfor the whole population, and similarly,\nÍ퐾\n훾=1 푛훽,훾\n퐾푁퐶\nrepresents the fraction of criteria\nsupporting option 훽. Note that in the particular case 퐾= 2 (only two options\navailable) the previous expression simpliﬁes to\n휌(휎, 푡+ 1) = (1 −푞)\n\u0014푛2\n푁\n푛1,2\n푁퐶\n휌(휎−2, 푡) + 푛1\n푁\n푛2,1\n푁퐶\n휌(휎+ 2, 푡)\n\u0015\n+\n+ 푞\n\u0014푛2\n푁\n푛1,1 + 푛1,2\n2푁퐶\n휌(휎−2, 푡) + 푛1\n푁\n푛2,1 + 푛2,2\n2푁퐶\n휌(휎+ 2, 푡)\n\u0015\n+\n+\n \n푛1\n푁\n푛1,1\n푁퐶\n+\nÕ\n훽≠훼\n푛훽\n푁\nÍ\n훾≠훼푛훾,훽\n2푁퐶\n!\n휌(휎, 푡),\n(5)\nwith 휎≡(푛2,1 + 푛2,2) −(푛1,1 + 푛1,2). While this equation does not admit a simple\nsolution, this simpliﬁed case allows us to gain some understanding about the eﬀect\nthat each mechanism plays on the dynamics of the system. For this, in the following\nwe consider separately the eﬀect of the prospection and the reassertion mechanisms.\n2.1 Adiabatic approximation\nBefore interpreting the system dynamics, let us introduce a key concept to understand\nthe arguments and conclusions that we present below. As mentioned, our model\ndistinguishes between what individuals “do” (the options they take) and what they\n“think” (the options supported by their criteria). When imitation is highly eﬀective\nand criteria are updated rapidly, these criteria faithfully reﬂect the options chosen by\nindividuals in the group. In this situation, individuals’ decisions mimic what others\nare doing, as in the classical Voter Model. We refer to this situation as an adiabatic\napproximation, as it allows us to separate the timescale of criteria updates (fast scale)\nfrom that of individual decisions (slow scale). From this perspective, the classical\nVoter Model can be seen as an adiabatic approximation of our model with personal\ncriteria. Mathematically, this approximation is expressed as:\n\n\n8\nDaniela Molas and Daniel Campos\n푛훼\n푁= 푛훼,훽\n푁퐶\n(6)\nfor any 훼and 훽.\nIn this context, the statistics of our model can be directly derived from the classical\nmodel whenever the adiabatic approximation holds. In particular, the times required\nto reach consensus or for an option to disappear in the classical model with multiple\noptions are deﬁned as follows:\n- The consensus time, represented by 푇푐, is deﬁned as the time it takes for all\nindividuals within the system to reach the same option (푛훼= 푁for some 훼).\n- Extinction time, represented by 푇푒, is deﬁned as the time required for one of the\noptions to disappear completely from the system (푛훼= 0 and 푛푖,훼= 0 for any 푖, for\noption 훼).\nUnder these deﬁnitions, the average (computed over the diﬀerent stochastic real-\nizations of the system) of the consensus and extinction times in the classical model\nis known to satisfy [15]:\n⟨푇푐⟩= 퐾−1\n퐾\n푁\n⟨푇푒⟩=\n푁\n퐾(퐾−1) ,\n(7)\nwhere 퐾is the number of available options and 푁the total number of individuals.\nUnder simpliﬁed conditions, we will verify in the following Sections how these exact\nresults also apply to our model with personal criteria.\n2.2 Prospection mechanism (case 풒= 1)\nWe consider the case 푞= 1 in Eq. (5). Using a Kramers-Moyal expansion in time\nand space, one obtains the following Fokker-Planck equation:\n휕휌\n휕푡=\n\u0014푛2,1 + 푛2,2 −푛1,1 −푛1,2\n푁푁퐶\n\u0015 휕휌\n휕휎+\n\u0014 (푛2,1 + 푛2,2)2 + (푛1,1 + 푛1,2)2\n2푁푁퐶\n\u0015 휕2휌\n휕휎2 , (8)\nwhere the explicit dependences in 휌(휎, 푡) have been omitted for ease of notation.\nAfter some algebraic manipulations, it is possible to rewrite this equation in terms\nof 휎and 푚≡푛2 −푛1, leading to:\n휕휌\n휕푡=\n\u0014푚−휎\n푁푁퐶\n\u0015 휕휌\n휕휎+\n\u0014\n1 −푚휎\n푁푁퐶\n\u0015 휕2휌\n휕휎2 .\n(9)\nFrom this, the eﬀects of the drift and diﬀusion terms in (9) on the system can be\nanalyzed. The drift term drives the system toward the condition 푚= 휎, aligning the\noptions with the criteria. This eﬀectively brings the system into a regime where the\nadiabatic approximation (6) holds.\nThe diﬀusion term determines the magnitude of the ﬂuctuations around the\ncondition 푚= 휎, as promoted by the drift term. Similarly to the classical Voter\n\n\nProspection and dispersal in metapopulations\n9\nModel, cases with vanishing magnetization (푚≈휎≈0) produce larger ﬂuctu-\nations. Conversely, as consensus is approached, with either 푚≈푁, 휎≈푁퐶or\n푚≈−푁, 휎≈−푁퐶, ﬂuctuations tend to diminish. Consequently, system ﬂuctua-\ntions favor departures from the homogeneous state 푚= 0, where both options 1 and\n2 coexist, and promote the consensus state where only one option prevails, resulting\nin extreme magnetization values.\n2.3 Reassertion mechanism (case 풒= 0)\nBy carrying out the same analysis as in the previous section (using the Kramers-\nMoyal expansion), the resulting Fokker-Planck equation for the dynamics of 푚is\ngiven by:\n휕휌\n휕푡=\n\u0014푛2,1 −푛1,2\n푁푁퐶\n\u0015 휕휌\n휕휎+\n\u0014 (푛2,1 + 푛2,2)2 + (푛1,1 + 푛1,2)2\n2푁푁퐶\n\u0015 휕2휌\n휕휎2 .\n(10)\nIn this case, it is not possible to express the drift and diﬀusion coeﬃcients in\nterms of 푚and 휎, as the update of an individual’s option depends solely on their\npersonal criteria, which introduces local eﬀects into the model.\nFrom (10), we observe that the drift term has a rather neutral eﬀect, promoting\nthe symmetry condition 푛2,1 = 푛1,2 between the two options, which aligns with\nthe adiabatic approximation. Meanwhile, the diﬀusion term remains the same as\nin Eq. (9), ensuring that consensus is eventually reached through random changes\nin individuals’ decisions driven by imitation (alternatively, consensus can also be\ninﬂuenced by an imbalance in the initial conditions or in the update rules, favoring\none of the two options).\nIn conclusion, the dynamics of the system are largely governed by the imitation\ndynamics in the criteria update, which promote the emergence of the adiabatic\napproximation conditions if such imitation eﬀects are suﬃciently fast or strong. In\nthe next section, we explore these ideas numerically.\n3 Global prospection (mean-ﬁeld case)\nIn previous studies [16], two possible outcomes were identiﬁed in the voter model\nwith personal information: consensus and population polarization. Our main objec-\ntive is to identify possible mechanisms by which these two outcomes can emerge\nor be promoted, and to analyze their characteristic timescales. Exact analytical so-\nlutions are generally unattainable for our model, so we focus on numerical results.\nHowever, in cases where the adiabatic approximation mentioned above is fulﬁlled,\nwe ﬁnd that most of our results can be explained using the classical Voter Model.\n\n\n10\nDaniela Molas and Daniel Campos\nIf the imitation rule allows all criteria to be updated by imitating any individual\nin the population, the only possible equilibrium state of the system is consensus,\ndeﬁned by\n푛훽= 훿훽훼푁\n푛훽,훾= 훿훽훼훿훾훼푁퐶,\n(11)\nwhere 훿훼,훽represents the Kronecker delta function, and 훼is the option reached after\nconsensus. Essentially, condition (11) implies that (i) all individuals in the system\nshare the same option, and (ii) all their criteria support that option.\nOne of the most interesting questions concerns how the diﬀerent parameters in\nthe system aﬀect the consensus time, 푇푐, required to reach this unique equilibrium\nstate. For multi-option imitation models, consensus is reached through a cascade of\nevents [14], in which one of the 퐾available options ﬁrst disappears (as soon as there\nare no criteria supporting it), leaving the system in a steady situation. Subsequently,\na second option disappears, and so on, until only one option remains. The ﬁrst\nextinction time, 푇푒, refers to the time required for the ﬁrst of the 퐾initial options to\ndisappear completely from the system, thereby reducing it to a (퐾−1)-option model.\nIn other words, it marks the ﬁrst event in which an option becomes entirely absent\nfrom the system. This quantity is of particular interest as it represents the onset of\nthe cascade of option eliminations that eventually leads to consensus.\nIn Figure 2, we present numerical results for the mean-ﬁeld case, showing both the\naverage ﬁrst extinction times (left column) and consensus times (right column) for\ndiﬀerent values of 퐾(the number of available options) and imitation probabilities\n푞, as a function of the number of personal criteria 푁퐶. In this case, instead of\nconsidering local interactions between neighbors, it is assumed that each individual\nis equally inﬂuenced by the global average of opinions in the population.\nThe results reveal that in the regime 푁퐶≪푁, extinction and consensus dynamics\nare largely governed by prospection. This is evident as the average times for both\nprocesses are inversely proportional to 푞in this regime. When imitation operates at\na fast rate, it accelerates the consensus dynamics and promotes convergence to the\nequilibrium state at a rate proportional to the imitation rate.\nFor 푁퐶≫푁, a more complex eﬀect emerges. In this case, extinction and consen-\nsus times converge slowly for all values of 푞(complete convergence is not observed\nnumerically in Figure 2, as computation times scale with 푁2\n퐶, limiting simulations\nfor large 푁퐶). Here, imitation dynamics alone is insuﬃcient to achieve consensus; it\nalso requires alignment between individual options and the criteria. While this align-\nment is nearly instantaneous for small 푁퐶, it requires signiﬁcantly long times for\nlarge 푁퐶, introducing a new timescale into the model. Speciﬁcally, when 푞is large,\nimitation is faster but this causes criteria to change frequently, slowing the alignment\nprocess. Conversely, small 푞values slow imitation but accelerate alignment.\nWe ﬁnd that ﬁrst extinction dynamics occur more rapidly in systems with a larger\nnumber of options, as expected from (7). This conﬁrms that extinction of each\nparticular option occurs with independent probability, meaning that the greater the\nnumber of options, the shorter the time required for at least one to become extinct.\n\n\nProspection and dispersal in metapopulations\n11\nFig. 2 Average extinction (left) and consensus (right) times as a function of the number of criteria\n푁퐶. Dashed and horizontal dotted lines correspond to predictions from the classical model in Eq.\n(7) after parameter reinterpretation (see main text for details).\n\n\n12\nDaniela Molas and Daniel Campos\nFinally, we observe two distinct regimes inﬂuenced by the number of criteria, 푁퐶,\ncorresponding to the conditions 푁퐶≪푁and 푁퐶≫푁. In the former, consensus\nfor all criteria of a single individual is achieved much faster than consensus among\nindividuals. The bottleneck for reaching the equilibrium condition (11) is therefore\nachieving consensus among individuals. This implies that while criteria for a single\nindividual can align quickly, the overall alignment of all individuals becomes the\nlimiting factor. In other words, the time required for the entire population to agree\non a single option dictates the pace of the system’s approach to equilibrium. As\na result, the classical prediction (7) applies in this regime (see horizontal dotted\nlines). Furthermore, extinction and consensus times remain nearly constant in this\nregime, though numerical simulation data admit power-law ﬁts for ⟨푇푒⟩∼푁ℎ1\n퐶and\n⟨푇푐⟩∼푁ℎ2\n퐶, with exponents ℎ1 and ℎ2 taking values between 0 and 0.1 for the range\nof parameters explored here.\nFor the regime 푁퐶≫푁, the bottleneck for reaching consensus is determined by\nthe second condition in (11). In this case, the classical result (7) still applies, but 푁\nshould be replaced by 푁× 푁퐶(the total number of criteria in the system), so both\nextinction and consensus times satisfy the scaling ⟨푇⟩∼푁· 푁퐶.\nInterestingly, modifying the rate at which criteria are updated does not signiﬁ-\ncantly aﬀect ﬁrst extinction and consensus times, provided the imitation probability\n푞remains constant. To test this, we modiﬁed the model algorithm so that at each\ntime step, only a fraction 푓of the personal criteria of each individual were updated\non average. The initial model corresponds to 푓= 1/푁퐶(i.e., only one criterion is\nupdated per time step). The value of 푓has a minor impact on extinction and con-\nsensus dynamics for both 푁퐶≪푁and 푁퐶≫푁(not shown). This conﬁrms that\nequilibrium is governed primarily by the imitation rate 푞. Rapid updates of personal\ncriteria are ineﬀective unless imitation is suﬃciently eﬀective.\n4 Local prospection\nIn this section, we address the question: “How can prospection dynamics be mod-\niﬁed to allow the coexistence of multiple options?” Note that complete consensus\nis the only possible state under global prospection. However, from an ecological\nperspective, consensus can lead to practical issues, such as the tragedy of the com-\nmons or ineﬃcient resource exploitation, due to the entire population converging on\na single option. In contrast, the stable coexistence of options or species, referred to\nas polarization in the context of the Voter Model, requires alternative mechanisms\nto counteract imitation and prospection dynamics, as explored in [16].\nAs a potential mechanism to promote polarization, we consider that in real sys-\ntems, prospection predominantly occurs within a local context. For example, birds or\nother animals primarily prospect neighboring patches to extract information, while\nvisits to distant patches are infrequent or nonexistent. To simplify, we consider a\nscenario where options (or breeding places) are arranged in a one-dimensional lat-\n\n\nProspection and dispersal in metapopulations\n13\ntice (labeled again from 1 to 퐾), and prospection is restricted to consecutive or\nneighboring places.\nRestricting prospection to local vicinity causes the imitation dynamics to lead\nto random extinction of diﬀerent options at diﬀerent regions. Consequently, the\nsystem can fragment into small subgroups of patches isolated from each other, with\nconsensus dynamics operating independently within each subgroup. Over time, only\na discrete set of isolated options survive; this corresponds to the polarized state.\nOne key question is how the number of available options, 퐾, inﬂuences polar-\nization dynamics. When fewer options are available, isolated populations are less\nlikely to form because the available options are strongly connected, allowing a single\noption to dominate and absorb the others, resulting in consensus. Conversely, as 퐾\nincreases, the probability of isolated populations emerging becomes signiﬁcantly\nhigher.\nFigure 3 illustrates the numerical results, showing how the probability of reach-\ning polarization (i.e., stable coexistence of isolated subpopulations) exhibits a phase\ntransition for 퐾between approximately 6 and 8. Remarkably, this behavior is largely\nindependent of the model parameters (푞, 푁퐶). It is primarily driven by the number\nof available options and the likelihood of isolation during the cascade of succes-\nsive extinctions. This conﬁrms that local prospection alone can drive the system\ntoward polarized states. This ﬁnding opens avenues for exploring more realistic dy-\nnamics in future work, such as prospection governed by speciﬁc dispersal kernels,\nto better understand metapopulation dynamics and coexistence in real habitats or\nenvironments.\nFor completeness, Figure 4 shows the distribution of subpopulation sizes after\nthe system reaches its ﬁnal state. In cases of consensus, the size always corresponds\nto 푁, whereas in polarized states, diﬀerent sizes are observed. The size distribution\nexhibits a peak at 푁that decreases as 퐾increases, indicating that polarization\nbecomes more likely. For suﬃciently large 퐾, the population fragments into smaller\nsubpopulations, and the distribution skews toward smaller sizes.\nFig. 3 Polarization probability as a function of the number of options 퐾. All data were obtained\nby considering 푁= 100 individuals and averaging over 10000 realizations of the process.\n\n\n14\nDaniela Molas and Daniel Campos\nFig. 4 Population size distribution. Data were obtained by considering 푁= 100, 푞= 1, and\naveraging over 10000 realizations of the process.\nFinally, in Figure 5, we examine how extinction times decay with the number of\noptions 퐾, conﬁrming that the extinction of any option occurs with constant and\nindependent probability. This dependence is related to the number of connections\nbetween patches. In the one-dimensional lattice considered, the number of initial\nconnections is 퐾−1. Thus, the extinction time scales approximately as ⟨푇푒⟩∼\n⟨푇푒⟩∗/(퐾−1), where ⟨푇푒⟩∗represents the extinction time for 퐾= 2. This theoretical\nprediction, represented by dashed lines in Figure 5, aligns well with numerical\nresults, particularly in the thermodynamic limit where 푁, 푁퐶, and 퐾are very large,\nensuring that the adiabatic approximation holds.\nThe colors in the ﬁgure correspond to diﬀerent values of 푞, while the parameter\n푓represents the fraction of personal criteria updated at each time step, expressed as\na value between 0 and 1.\n5 CONCLUSIONS\nIn this work, we have introduced an extension of the classical Voter Model by in-\ncorporating the concept that prospecting information from others does not result in\nimmediate imitation but instead contributes to an accumulation process that eventu-\nally leads to such behavior. Speciﬁcally, we considered a dual dynamics framework\nin which individuals make decisions based on internal personal criteria, while these\ncriteria are updated through an imitation rule akin to that in the classical model. The\ndynamics of these criteria act as an intermediate process that delays the system’s\nconvergence to consensus, requiring alignment between individuals’ actual choices\nand their criteria.\nWe have demonstrated that our model with personal criteria can be eﬀectively\nunderstood in terms of the classical Voter Model, provided the alignment process\noccurs rapidly and does not become a signiﬁcant bottleneck for consensus. This\n\n\nProspection and dispersal in metapopulations\n15\nFig. 5 Average extinction time as a function of the number of options 퐾. Dashed lines represent the\ntheoretical approximation ⟨푇푒⟩∼⟨푇푒⟩∗/(퐾−1) (see main text for details). The colors correspond\nto diﬀerent values of 퐾, while the parameter 푓represents the fraction of personal criteria updated\nat each time step, expressed as a value between 0 and 1. All data were obtained by considering\n푁= 100 individuals and averaging over 10000 realizations of the process.\nscenario corresponds to the adiabatic approximation, which we have used as a sim-\npliﬁed regime to illustrate the model’s applicability. Extending the model to the\nmulti-option case (퐾> 2), we have also shown how a local prospection mechanism\ncan naturally lead to polarized states, characterized by the coexistence of isolated\npopulations reaching each a particular consensus locally. The existence of this po-\nlarized regime is seen to be essentially a consequence of the number of options\navailable, 퐾, while the other parameters in the model (푞, 푁퐶) simply rescale the\ntime required to reach that state.\nFuture work should explore scenarios where the duality between (i) decision-\nmaking and (ii) criteria updating becomes more complex and less straightforward,\npotentially breaking the adiabatic approximation, as a consequence of memory ef-\nfects, biased/persistent dynamics in the choice of the criteria, etc. This could lead\nto intriguing phenomena, such as populations that ”act” and ”think” diﬀerently, or\nscenarios where consensus is unattainable due to noisy or uncertain prospection.\nSuch cases represent promising avenues for further research.\nAdditionally, experimental testing and calibration of the model appear feasible\nusing large-scale tracking datasets (e.g., GPS) for seasonal birds, as in [38, 39]. In\nthis context, the criteria in the model could be linked to relevant ﬁtness metrics,\nand individuals’ visits to neighboring patches could serve as a measurable proxy\nfor prospection. These extensions illustrate the broader applicability and potential\ninterest of the approach presented here.\nAcknowledgements DC acknowledges the organizers of the Isaac Newton Institute program on\nMathematics of movement: an interdisciplinary approach to mutual challenges in animal ecology\nand cell biology for their kind invitation to the program and for discussions, which have substantially\ncontributed to the present work. DM acknowledge ﬁnancial support from the Coordination of the\n\n\n16\nDaniela Molas and Daniel Campos\nNational Scholarship Program Carlos Antonio L´opez (BECAL). The Authors acknowledge the\nﬁnancial support of the Spanish government under grant PID2021-122893NB-C22.\nCompeting Interests The authors have no conﬂicts of interest to declare that are relevant to the\ncontent of this chapter.\nReferences\n1. Ioannou C.C., Laskowski K.L. (2023) A multi-scale review of the dynamics of collec-\ntive behaviour: from rapid responses to ontogeny and evolution. Phil. Trans. Roy. Soc. B\n378:20220059.\n2. Vicsek T., Czir´ok A, Farkas I.J, Helbing D. (1999) Application of statistical mechanics to\ncollective motion in biology. Physica A 274, 182-189.\n3. Fodor E, Marchetti M.C. (2018) The statistical physics of active matter: From self-catalytic\ncolloids to living cells. Physica A 504, 106-120.\n4. Ouellette N.T. (2019) The Most Active Matter of All. Matter 2, 297.299.\n5. Roca C.P., Cuesta J.A., S´anchez A. (2009) Evolutionary game theory: Temporal and spatial\neﬀects beyond replicator dynamics. Phys. Life Rev. 6(4), 208-249.\n6. McAvoy A., Allen B., Nowak M.A. (2020) Social goods dilemmas in heterogeneous societies.\nNature Hum. Behav. 4(8), 819-831.\n7. Gordon D.M. (2010) Ant encounters: Interaction Networks and Colony Behavior. Cambridge\nUniv. Press, Cambridge.\n8. Pi˜nero J., Sol´e R. (2019) Statistical physics of liquid brains. Phil. Trans. R. Soc. B\n374:20180376.\n9. Holley, R. A., Liggett, T. M.(1975). Ergodic theorems for weakly interacting inﬁnite systems\nand the voter model. The annals of probability, 643-663.\n10. Redner, S. (2019). Reality-inspired voter models: A mini-review. Comptes Rendus Physique,\n20(4), 275-292.\n11. Jedrzejewski A., Sznajd-Weron, K. (2019) Statistical Physics Of Opinion Formation: Is it a\nSPOOF? Comptes Rendus Physique, 20(4), 244-261.\n12. G. De Marzo, A. Zaccaria, C. Castellano. (2020) Emergence of polarization in a voter model\nwith personalized information. Phys. Rev. Res. 2, 043117.\n13. Liggett, T. M. (1985). Interacting particle systems (Vol. 2). New York: Springer.\n14. Ramirez, L., San Miguel, M., Galla, T. , (2022) Local and global ordering dynamics in\nmultistate voter models. (Phys. Rev. E, 106(5): 054307).\n15. Starnini, M., Baronchelli, A., Pastor-Satorras, R. (2012). Ordering dynamics of the multi-state\nvoter model. J. Stat. Mech.: Theor. Exp., 2012(10), P10027.\n16. Iannelli, G., De Marzo, G., Castellano, C. (2022). Filter bubble eﬀect in the multistate voter\nmodel. Chaos, 32(4), 043103.\n17. Littler, R. A. (1975). Loss of variability at one locus in a ﬁnite population. Math. Biosci.,\n25(1-2), 151-163.\n18. Kimura, M. (1955). Random genetic drift in multi-allelic locus. Evolution, 419-435.\n19. Mobilia, M. (2003). Does a single zealot aﬀect an inﬁnite group of voters?. Phys. Rev. Lett.,\n91(2), 028701.\n20. Herrer´ıas-Azcu´e, F., Galla, T. (2019). Consensus and diversity in multistate noisy voter models.\nPhys. Rev. E, 100(2), 022304.\n21. B. Oborny. (2023) Lost in translation? - Caveat to the application of the voter model in ecology\nand evolutionary biology. Sci. Prog. 106(2):368504231175324.\n22. K. Sznajd-Weron, J. Sznajd. (2000) Opinion evolution in closed community. Int. J. Mod. Phys.\nC 11(6), 1157–1165.\n\n\nProspection and dispersal in metapopulations\n17\n23. K. Sznajd-Weron, J. Sznadj, T. Weron. (2021) A review on the Sznajd model — 20 years after.\nPhysica A 565, 125537.\n24. P.A.P. Moran. (1958) Random processes in genetics. Math. Proc. Camb. Philos. Soc. 54:\n60–71.\n25. G.W.A. Constable, A.J. McKane. (2015) Stationary solutions for metapopulation Moran\nmodels with mutation and selection. Phys. Rev. E 91(3), 032711.\n26. G.W.A. Constable, A.J. McKane. (2015) Models of Genetic Drift as Limiting Forms of the\nLotka-Volterra Competition Model. Phys. Rev. Lett. 114(3), 038101.\n27. D.M. Schneider, A.B. Martins, M.A.M. de Aguiar. (2016) The mutation–drift balance in\nspatially structured populations. J. Theor. Biol. 402, 9-17.\n28. C. Molina, D.J.D. Earn. (2018) The mutation-drift balance in spatially structured populations.\nJ. Math. Biol. 76(3), 645-678.\n29. L. Heinrich, J. M¨uller, A. Teller, D. Zivkovic. (2018) Eﬀects of population- and seed bank\nsize ﬂuctuations on neutral evolution and eﬃcacy of natural selection. Theor. Pop. Biol. 123,\n45-69.\n30. J. Svoboda, S. Joshi, K. Chatterjee. (2024) Ampliﬁers of selection for the Moran process with\nboth Birth-death and death-Birth updating. PLoS Comput Biol 20(3): e1012008.\n31. J. Chave. (2001) Spatial patterns and persistence of woody plant species in ecological com-\nmunities. Am. Nat. 157(1), 51-65.\n32. J. Hidalgo, S. Suweis, A. Maritan. (2017) Species coexistence in a neutral dynamics with\nenvironmental noise. J. Theor. Biol. 413, 1-10.\n33. C. Tu, S. Suweis, J. Grilli, M. Formentin, A. Maritan. (2019) Reconciling cooperation, biodi-\nversity and stability in complex ecological communities. Sci. Rep. 9, 5580.\n34. R. Mart´ınez-Garc´ıa, C. L´opez, F. V´azquez. (2021) Species exclusion and coexistence in a\nnoisy voter model with a competition-colonization tradeoﬀ. Phys. Rev. E 103, 032406.\n35. C. Wang et al. (2020) Decision-making process during collective movement initiation in golden\nsnub-nosed monkeys (Rhinopithecus roxellana). Sci. Rep. 10, 480.\n36. C. Winklmayr, A.B. Kao, J.B. Bak-Coleman, P. Romanczuk. (2020) The wisdom of stalemates:\nconsensus and clustering as ﬁltering mechanisms for improving collective accuracy. Proc. R.\nSoc. B 287:20201802.\n37. H. Rajendran, A. Haluts, N.S. Gov, O. Feinerman. (2022) Ants resort to majority concession\nto reach democratic consensus in the presence of a persistent minority. Curr. Biol. 32(3),\n645-653.\n38. D. Oro, J. Becares, F. Bartumeus, J.M. Arcos. (2021) High frequency of prospecting for\ninformed dispersal and colonisation in a social species at large spatial scale. Oecologia 197,\n395-409.\n39. J. Kralj et. al. (2023) Active breeding seabirds prospect alternative breeding colonies. Oe-\ncologia 201, 341-354.\n40. I. Hanski. (1998) Metapopulation dynamics. Nature 396, 41-49.\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21178v1.pdf",
    "total_pages": 17,
    "title": "Prospection and dispersal in metapopulations: a perspective from opinion dynamics models",
    "authors": [
      "Daniela Molas",
      "Daniel Campos"
    ],
    "abstract": "Dispersal is often used by living beings to gather information from\nconspecifics, integrating it with personal experience to guide decision-making.\nThis mechanism has only recently been studied experimentally, facilitated by\nadvancements in tracking animal groups over extended periods. Such studies\nenable the analysis of the adaptive dynamics underlying sequential decisions\nand collective choices. Here, we present a theoretical framework based on the\nVoter Model to investigate these processes. The model, originally designed to\nstudy opinion or behavioral consensus within groups through imitation, is\nadapted to include the prospection of others' decisions as a mechanism for\nupdating personal criteria. We demonstrate that several properties of our model\n(such as average consensus times and polarization dynamic) can be analytically\nmapped onto those of the classical Voter Model under simplifying assumptions.\nFinally, we discuss the potential of this framework for studying more complex\nscenarios.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}