{
  "id": "arxiv_2502.21138v1",
  "text": "PREDICTING CLINICAL OUTCOMES\nFROM PATIENT CARE PATHWAYS\nREPRESENTED WITH TEMPORAL KNOWLEDGE GRAPHS\nJONG HO JHEE1, ALBERTO MEGINA1, PACÔME CONSTANT DIT BEAUFILS2,3,\nMATILDE KARAKACHOFF3,4, RICHARD REDON2, ALBAN GAIGNARD2, AND ADRIEN COULET1\nAbstract.\nBackground: With the increasing availability of healthcare data, predictive modeling finds\nmany applications in the biomedical domain, such as the evaluation of the level of risk for\nvarious conditions, which in turn can guide clinical decision making. However, it is unclear\nhow knowledge graph data representations and their embedding, which are competitive in\nsome settings, could be of interest in biomedical predictive modeling. Method: We simu-\nlated synthetic but realistic data of patients with intracranial aneurysm and experimented\non the task of predicting their clinical outcome. We compared the performance of various\nclassification approaches on tabular data versus a graph-based representation of the same\ndata. Next, we investigated how the adopted schema for representing first individual data\nand second temporal data impacts predictive performances.\nResults: Our study illus-\ntrates that in our case, a graph representation and Graph Convolutional Network (GCN)\nembeddings reach the best performance for a predictive task from observational data. We\nemphasize the importance of the adopted schema and of the consideration of literal values\nin the representation of individual data. Our study also moderates the relative impact of\nvarious time encoding on GCN performance.\nKeywords: Temporal knowledge graph, Knowledge graph embedding, Graph convolu-\ntional networks, Clinical data, Outcome prediction.\n1. Introduction\nIntracranial aneurysms are abnormal bulges in the blood vessels of the brain that pose sig-\nnificant health risks particularly when they rupture, leading to severe neurological damage\nor death [24]. The ability to predict the evolution, and the best management of intracranial\naneurysms, especially in the context of their various treatments, is crucial for improving pa-\ntient outcomes. This predictive capability is particularly important in a clinical setting where\nunderstanding the relationship between patient features, the treatments they receive, and their\nsubsequent outcomes can serve as a basis for early or preventive interventions. In this context,\nwe aim at establishing a method for identifying patients who are at a higher risk of adverse\noutcomes following intracranial aneurysm rupture. By combining patients’ personal features\nand the treatments observed during their hospital stays, we hope to uncover patterns that lead\nto more accurate predictions of patient outcomes. This would not only enhance the under-\nstanding of the effectiveness of different disease management, but also provides a foundation\nfor the development of targeted intervention strategies that could mitigate adverse outcomes.\nGraph embeddings are mapping of the nodes and edges that compose a graph into a con-\ntinuous vector space [16]. This transformation allows for such complex relational data to be\nrepresented in a form that is more amenable to computational analysis. In particular, it allows\n1\narXiv:2502.21138v1  [cs.LG]  28 Feb 2025\n\n\nto apply machine learning algorithms to perform tasks such as link prediction, node classifica-\ntion or clustering with high performance [34]. In this work, we especially consider embeddings\non Knowledge Graphs (KGs), as defined in the context of the Semantic Web [19]. The atomic\nelements composing those are triples of the form of ⟨subject, predicate, object⟩, where the subject\nand object are nodes of the graph, representing entities; and the predicate is a labelled and\noriented edge, representing that a particular relationship stands between the subject and object\n[18]. KG can be encoded in Resource Description Framework (RDF) a standard where entities\nand predicates are uniquely identified with a Uniform Resource Identifier (URI), facilitating\ninteroperability across different datasets and ontologies.\nHowever, it is unclear how KG representations and KG embeddings may be of interest in\nnode classification task to predict clinical outcomes [8], and in particular to predict outcomes of\nintracranial aneurysm management. We propose in this work to advance some initial answers,\nby exploring three key scientific questions that guided our investigation. First, we wonder if\nthe use of various graph embedding approaches is competitive with regard to classical pre-\ndictive approaches on tabular data. Second, we wonder how these approaches are impacted\nby modeling choices made for representing individual data in the form of a graph. Third, we\nwonder about the impact of various possible representation of time, i.e. timestamps, sequential\nrelations or both on predictive performances.\nThe contributions of this article are: (i) A publicly shared synthetic but realistic dataset\nof pathways of patients treated for a ruptured intracranial aneurysm; along with scripts that\ntransform data from a tabular form to various graph representations; (ii) Elements of answer\nto our three questions, illustrating that, in our context, graph embeddings learned with Graph\nConvolutional Network (GCN) outperform other approaches, that the more compact represen-\ntation of patient features is associated with better performance and that the representation of\ntime does not impact prediction performances.\nThe remainder of this article introduces related works in section 2, material and methods in\nsection 3, empirical results and their interpretation in section 4 and finally presents a discussion\nin section 5.\n2. Related work\n2.1. Standard schema for clinical data. Several data schema have been proposed to model,\nharmonize and facilitate the exchange of clinical data. For example, FHIR [28] and the OMOP\nCDM [33] are standards proposed to tackle clinical data interoperability.\nFHIR is loosely\nspecified, which makes it hard to associate this schema with precisely defined semantics. Even\nif RDF transformations of FHIR [29] and OMOP CDM have been proposed, none has been\nwidely adopted yet [6, 35]. Similarly, Phenopackets [20] is a uniform data structure to ease\nthe combination and exchange of genomic data and clinical observations. If some works have\nbeen proposed to align Phenopackets with semantic web technologies [21], it is insufficient to\nrepresent the full spectrum of clinical data.\nBeside, two ontologies have recently been proposed to represent individual clinical data in\nthe form of knowledge graphs. The first is the SPHN (Swiss Personalized Health Network)\nontology [32], which has been adopted by the five Swiss academic hospitals for better data\nsharing and integration. As illustrated in Figure 1, in this semantic model, patient is a central\nentity, that can be associated with diagnoses, drug administrations and procedures, each of\nwhich can potentially be associated with starting and ending times with literals.\nThe second is the CARE-SM (Care and Registry Semantic Model) ontology [22]. It was\ninitially designed to represent clinical data in the context of rare diseases and largely relies on\n2\n\n\nPatient#1\ndrugAdmin#1\nrdf:type\nsphn:DrugAdministrationEvent\nrdfs:label\nNimodipine\nsphn:hasStartDateTime\nsphn:hasSubjectPseudoIdentifier\nsphn:hasDrug\ndrug#1\ndiagnosis#1\nrdf:type\nsphn:Diagnosis\nsphn:hasSubjectPseudoIdentifier\nrdfs:label\nHTA\nsphn:hasCode\nNCIT:C3117\ndate#1\nFigure 1. Example of individual clinical data represented in a SPHN knowl-\nedge graph. Temporal information is specified with RDF literals associated to\nevents through sphn:hasStartDateTime properties.\nthe reuse of the Semantic Science Integrated Ontology (SIO) [11]. As depicted in Figure 2, it\nprovides fine-grained representations for the multiple roles with which a person can participate\nin the context of a care procedure or a research study. The originality of CARE-SM resides in its\nuse of RDF quads. They are used to associate a semantic context to each data element through\nRDF named graph. This particularly enables the representation of provenance metadata for\nclinical observations or diagnosis.\nNotably, these named graphs can be used to represent\ntimelines of clinical events.\nTimeline#1\nOutput#1\nPatient#1\nsio:has-role\nRole#1\ndate#1\nrdf:type\nOBI_0000093\n(Patient role)\nsio:Person\nrdf:type\nsio:is-part-of\ndate#2\nsio:has-start-time\nsio:has-end-time\nDiagnosis#1\nContext#1\nsio:is-realized-in\nrdf:type\nsio:Process\nsio:has-output\nsio:InformationContentEntity\nrdf:type\nobo:NCIT_C2985\nrdf:type\nsio:is-about\ndate#1\ndate#2\nsio:has-value\nsio:has-value\nFigure 2. Example of individual clinical data represented in a CARE-SM\nKG. Temporal information is directly linked to the Context#1 named graph\nwith start and end dates. Multiple events can be associated to a given timeline\nthrough the sio:is-part-of property.\n3\n\n\nIn this work, we focus on SPHN and CARE-SM first because both of them provide sufficiently\nprecise specification to let one represent an arbitrary clinical dataset in the terms of their\nontologies, which is not the case of FHIR-RDF; second because they propose very different\nmodeling choices to represent individual clinical data; and third because they are adopted in\nlarge scale projects.\n2.2. Time in knowledge graphs. The OWL-Time is a standard ontology that provides\nclasses, predicates and patterns to represent time, duration and intervals [7]. In particular, it\nenables one to instantiate relations between events with the Allen’s interval algebra and can\nbe associated with time reasoning mechanisms [1, 37].\nBoth SPHN and CARE-SM enable\nvarious way to represent time, including the use of OWL-Time and Allen’s interval algebra. In\npractice, one may want to restrict themselves to absolute time by only associating timestamps\nto events, whereas another might want relative time by instantiating relationships such as “is\nbefore” between events, or even to use both absolute and relative relationships. In addition, if\none choose relative time, they also have to decide on a level of saturation between events going\nfrom a simple sequence, where only directly subsequent events are related, to a fully saturated\nlevel where each event is timely related to every other event. Even if it is clear that a fully\nsaturated graph is associated with several drawbacks (e.g., the high connectivity of temporal\nnodes makes the exploration of the graph complex), the most adapted modeling of time to\nadopt for a particular task is not always clear [37].\n2.3. KG embeddings and node classification. Many approaches for representing entities\nof a KG within a latent space exist, and categorisations of them have been proposed in [4]. As\nan illustration, TransE [2] is an embedding approach that works at the triple level as it aims\nat minimizing the following scoring function:\nfr(h, t) = ∥h + r −t∥1,\nwhere h, r, and t are the embedding vectors of the head entity, relation, and tail entity, respec-\ntively. Here the relationship between the head and the tail (i.e., the subject and object) can\nbe seen as a translation r in the embedding space. RDF2Vec follows a very different approach\nthat works at the sequence level [30]. It uses random walks drawn from the knowledge graph.\nThese sequences of either edges, nodes, or subtrees are used to feed a word2vec model that\noutputs embeddings for each node in a sequence, for example, by maximizing the probability\nof a node given the previous nodes of the sequence. For instance, the Continuous Bag-of-Words\nmodel (CBOW), one of the algorithms associated with word2vec, maximizes the average log\nprobability of the target node given a sequence of nodes:\n1\nT\nT\nX\nt=1\nlog p(et|et−c, ..., et+c),\nwhere et is a target node and c denotes the context window. In contrast with TransE and\nRDF2Vec, which work at the triple and sequence levels, GCNs [26] work at the level of the\nneighborhood of nodes. They have been introduced for classification over graphs and extended\nfor node classification and link prediction in knowledge graphs [31]. GCNs compute the em-\nbeddings of a node by considering its neighborhood in the graph. GCNs can be seen as a\nmessage-passing framework of multiple layers, in which the embedding h(l+1)\ni\nof a node i at\n4\n\n\nlayer (l + 1) depends on the embeddings of its neighbors at layer (l), as follows:\nh(l+1)\ni\n= σ\n X\nj∈Ni\n1\nci\nW (l)h(l)\nj\n|\n{z\n}\nNeighborhood\n+\nW (l)h(l)\ni\n|\n{z\n}\nSelf-connection\n!\n.\nThe convolution over the neighboring nodes j of i is computed with a learnable weight matrix\nW (l) and each layer (l); and is normalized by a constant ci. The last term enables self-connection\ni.e., the fact that the embeddings of the node i at a particular layer (l + 1) also depends on\nits embeddings at the layer (l).\nRelational Graph Convolutional Networks (RGCN) [31] is\na particular type of GCNs that takes into consideration multi-relational data, i.e., considers\ndifferently a same neighbor node when related through different labelled edges to i.\nThis\nis particularly adapted to the semantic web KGs since they encompass various predicates to\nrepresent relations associated with different semantics. To this aim, RGCNs incorporate entity\nembeddings with multi-relations in the neighborhood aggregation scheme, as follows:\nh(l+1)\ni\n= σ\n X\nr∈R\nX\nj∈N r\ni\n1\nci,r\nW (l)\nr h(l)\nj\n+ W (l)\n0 h(l)\ni\n!\n.\nwhere the convolution over the neighbor nodes is computed using a specific weight matrix\nW (l)\nr\nfor each predicate (relation type) r ∈R; and ci,r is a normalizing constant such as the\nnumber of neighboring nodes |N r\ni |. The parameter sharing and sparsity constraints using basis-\ndecomposition allow RGCN to deal with the large number of relations. In the following, we\nconsider TransE, RDF2Vec as two baseline approaches for KG embedding (KGE) models and\nRGCN as it seems a well adapted candidate to take into consideration the variety of relationship\ntypes of our clinical KG.\nValues associated with entities through the use of literals are generally disregarded by KGE\napproaches. However various works investigates the interest of incorporating them to node\nrepresentations. To this aim LiteralE [27], proposes an approach where two vectors represent\na single node, the first representing the node embedding itself, and the second containing each\nof the numerical literal it is associated with. Both vectors are then combined before to be\npassed to a scoring function. Knowledge Embedding with Numbers (KEN) [9] uses an encoder,\na single neural network, to inject the literal values into the same vector space with entities.\nOther approaches have been proposed to consider textual literals or combinations of various\ntype of literals [15].\nOne of the main interest of graph embedding is to facilitate the application of machine learn-\ning algorithms on complex relational data to perform a variety of tasks such as link prediction,\nnode classification, graph classification or node clustering [19]. In this work we consider three\nembedding approaches, but only one subsequent task that is node classification. This learn-\ning task can be defined as the estimation of the likelihood that a given entity, not explicitly\nasserted in a KG, is assigned to a specific type [34]. Using KG embeddings, this task relies\non the assumption that the embedding space effectively captures the inherent characteristics\nand structural properties of the original graph. In practice, the spatial configuration of vectors\nshould reflect the relational information observed in the KG, thus allowing predictions about\nnode labels. This task is formally described in the Materials and Methods section of this article.\n2.4. Temporal knowledge graph embeddings. A temporal knowledge graph (TKG) ex-\ntends existing KG by incorporating temporal information in a specific time or interval. This\naddition poses significant challenges because it requires integrating the temporal validity of\n5\n\n\nfacts into the models in order to accurately capture the dynamics of entities and relations over\ntime [10]. Effectively modeling the temporal aspect is crucial for applications where the evolu-\ntion of relations is significant, such as in clinical data where the time of treatments, procedures\nand the patient state can critically influence outcomes. Temporal knowledge graph embedding\nmodels use triples tagged with each timestamp, which are quadruples, and this is considered\nas learning the representation of each time-snapshot graph. However, the time interval could\nbe critical information, or the graph might not be compatible with quadruple forms, as not\nall triples necessarily possess temporal information. Encoding or transforming temporal in-\nformation in the form of vectors of literals or relations can be applied in this type of graph\n[3].\n3. Materials and Methods\n3.1. Synthetic data generation. We built a synthetic data set of 10,000 patients with 30\nclinical features and 1 outcome variable. Out of the 30 clinical features, 8 are associated with\na timestamp and for this reason are hereafter named events, to distinguish from demographic\nor historical features not associated with a particular time. In our dataset, events have the\nparticularity of being associated with only one timestamp, which is the time between hospital\nadmission and the first occurrence of the event during the patient’s stay. Table 4 in Appendix\nlists the 22 clinical features (non-temporal) and 8 events of our synthetic dataset.\nTo make our synthetic dataset as realistic as possible, patient features and care events\nwere generated according to observations made on a real-world clinical dataset of 552 patients\ndiagnosed with a ruptured intracranial aneurysm, provided by the Nantes University Hospital.\nAccess to this dataset has been granted under an IRB agreement.\nFirst we estimated the closest distribution for each feature of the real-world dataset using\na Kolmogorov–Smirnov test. For instance, we observed that the duration of patients’ hospi-\ntal stay was following a generalized extreme value distribution. Second, after performing a\nfactorization for categorical variables, we computed correlations across each possible pair of\nfeatures, and computed the transition probabilities across types of events. We observed that\nthe duration of hospital stay was highly correlated with the number of medical procedures\nreceived; and a high probability for Paracetamol to be administered subsequently to Nimodip-\nine. Figure 3 shows a Sankey diagram built from the observed transition probabilities, which\nvisually summarizes the possible care pathways. To simplify the representation of time in our\ndataset, the 8 events were binarized by a transformation into pairs of events set to one if the\npatient observed a transition between the first and second event, and to zero otherwise. After\nvalidation by clinical experts of the consistency of the distributions, correlations and transition\nprobabilities, we used them to constrain the generation of our synthetic dataset.\nFinally, we generated the patient outcome feature with one of the three distinct values\n{BackHome, Rehabilitation, Death} associated with the following proportions in the synthetic\ndataset: 44.14%, 43.33% and 12.53%, respectively, mirroring the real-word distribution.\n3.2. Graph representation of clinical data. We developed transformations of our syn-\nthetic tabular dataset using various modeling choices. By using RDF templates and rules, we\ngenerated a set of graphs that instantiate the SPHN ontology:\n• SPHN-nl (no literals) where all the literals were removed;\n• SPHN-nt (no time) where temporal information were removed;\n• SPHN-ts (timestamps) with timestamps only;\n6\n\n\nFigure 3. A visual representation of care pathways where the larger connec-\ntions between care events correspond to the higher transition probabilities.\nmorphine: morphine use, paracetamol: paracetamol use, corotrop: milri-\nnone use, ATL: percutaneous transluminal angioplasty, NAD: norepinephrin use,\nnimodipine: nimodipine use, IOT: orotracheal intubation, and DVE: external\nventricular drainage.\n• SPHN-tr (time relations) with a single time:before predicate between directly subse-\nquent events;\n• SPHN-tsr (timestamps and relations) with both timestamps and relations between\nsubsequent events;\n• SPHN-sat1 (saturation level 1) where SPHN-tr is enriched with additional time:before\npredicates obtained by applying once the following transitivity rule time:before ◦\ntime:before ⊑time:before;\n• SPHN-sat2 (saturation level 2) by applying the same transitivity twice.\nFigure 4 illustrates timestamps and time relation between events, at three level of saturation\ncorresponding to SPHN-tr, SPHN-sat1 and SPHN-sat2.\nBy using RDF templates, we also generated a graph that instantiate CARE-SM ontology.\nIn this case, we performed an additional step where quads were transformed into triples, in\nparticular by using a nvasc:hasTimePoint link to associate directly instances such as diagnoses\nor drug administrations to their absolute time. This step was motivated by the fact that KGE\napproaches do not support quads, but only triples.\nThe resulting graph is named CARE-\nSM∗. We generated the same variants of graphs as we did for SPHN, but report only here\nabout CARE-SM∗-ts that is the version with timestamps only. Table 5 in Appendix shows the\nstatistics of SPHN and CARE-SM∗graphs.\nWe make two last transformations to each variant of our graphs: first, to ensure that the\norientation of predicates do not influence our experiments, inverse relationships were systemati-\ncally asserted; we encoded timestamp literals into continuous numbers in the range of [0, 1] using\na quantile transformation. This spreads out the most frequent values thus reduces the impact of\noutliers [12]. Scripts for these various transformation are provided at https://anonymous.4open.\nscience/r/Predicting-clinical-outcomes-with-TKG-B2B9/.\n3.3. KG embedding and patient outcome prediction. The objective of our prediction\ntask is to forecast patient outcomes based on their clinical features and experienced events. In\n7\n\n\nFigure 4. Examples of temporal information: (a) two event associated with\na timestamp; (b) sequence of events related with time:before relations. In\nplain lines are relations between directly subsequent events. Applying a tran-\nsitivity rule once, add 2 relations in dashed doted line (saturation 1) and twice,\nadd the last relation depicted with the dash-dotted line (saturation 2). iot:\norotracheal intubation, dve: external ventricular drainage, nad: nicotinamide\nadenine dinucleotide.\nthe case of the graph dataset, we model this task as a node classification problem aiming at\nassociating patient nodes with the class that corresponds to their correct outcome.\n3.3.1. RGCN for patient outcome prediction. In this section, we describe in detail the graph\nembedding model, RGCN+Literals for the outcome prediction.\nThe overall architecture is\nillustrated in Figure 5. Given a graph G = (V, E, R, X), where V denotes the set of nodes\n(entities), E the set of edges, R the set of relations (predicates), and X ∈Rn×d0 denotes\nthe initial input embeddings of dimension d0. The representation of a target node (patient)\nh(1)\ni\n∈Rd1 for i ∈|V| after passing a first RGCN layer is defined as:\nh(1)\ni\n= σ\n X\nr∈R\nX\nj∈N r\ni\n1\nci,r\nW (0)\nr\nxj + W (0)\n0\nxi\n!\n,\nwhere xi ∈X is an initial patient embedding, Wr ∈Rdo×d1 denotes a weight matrix for each\nrelation r and σ is a non-linear activation function. Additionally, the number of parameters\nincreases with the number of relations, which can lead to overfitting on some of the rare\nrelations. Thus we apply basis-decomposition method for the regularization of the model [31].\nThe final patient node embedding is extracted after passing L stacks of RGCN-layers and\nthe softmax function is applied to output the probability of outcomes. The model is trained\n8\n\n\nFigure 5. An illustration of the model denoted RGCN+lit for patient out-\ncome prediction.\nby minimizing the cross-entropy loss on the patient nodes:\nL = −\nX\np∈P\nK\nX\nk=1\nypk log zpk,\nwhere P is the set of patient nodes in the training set, K the number of outcomes and zpk the\nprobability of the outcome.\n3.3.2. RGCN with Literals. In our clinical KG, some clinical features are in the form of literals\n(e.g., the age of a patient). However, RGCN model only consider entity nodes and relations,\nand thus do not take literals into account. To mitigate this problem, we propose a model\ndenoted RGCN+Literals (or RGCN+lit for short) that employs an additional function for\nthe literals. Before the input of initial embeddings to RGCN, the function of a multi-layer\nperceptron (MLP) is used to transform the value of the literal into embeddings:\nxliteral = σ(Wv + b),\nwhere v denotes the attribute value, σ the non-linear activation function, W the weight matrix\nand b the bias. Note that other encoding functions could be applied instead of the MLP.\n4. Experimental setting and results\nIn the experiments, we compare various outcome prediction approaches along three distinct\nexperiments on our synthetic dataset. Each experiment is repeated ten times for each model\nto assess the variability of the performance. Each time the 10,000 patients are randomly split\ninto train (80%), validation (10%) and test (10%) set. Datasets and codes are available at\nhttps://anonymous.4open.science/r/Predicting-clinical-outcomes-with-TKG-B2B9. The three\nexperiments compare:\n• Tabular vs.\nGraph data.\nWe compare the performance of standard predictive\napproaches applied on tabular data with those of various KGE approaches to examine\nwhether the multi-relational information within the graph would benefit the predictive\ntask.\n• SPHN vs. CARE-SM ontology. We compare the impact on the prediction of using\neither one schema or another to evaluate whether the structure of the graph affects the\nperformance.\n9\n\n\n• Various time modeling. We compare the impact on the prediction of using various\ntime modeling, such as no time data, absolute time only, relative time only, both abso-\nlute and relative time and different levels of saturation of the relative time relationships\nthat connect temporal events.\n4.1. Tabular vs. Graph data. We considered the following methods to establish baseline\nperformance from tabular data, Logistic Regression (LR), Random Forest (RF), Feed-forward\nNeural Network (NN) to compare to KGE approaches. RF were set up with 100 trees, and NN\nwith three layers with hidden dimension sizes of [100, 50, 10] and hyperbolic tangent was used\nas an activation function.\nFor this first comparison with various KGE approaches, we arbitrarily chose to only con-\nsider the SPHN ontology. In addition, to enable a fair comparison with tabular data (which\nencode only the sequence of event), SPHN-tr is considered as the comparative SPHN graph.\nTo represent three main families of KGE we considered TransE, RDF2Vec and RGCN+lit.\nAll models used an initial embedding dimension of 100. For TransE, 1-norm is applied for\nthe regularization of the scoring function. For RDF2Vec, ten walks of a maximum depth of\nthree for each node was applied using the random walk strategy. The patient representations\nobtained from the first two KGE approaches are input to a NN model as a classifier. For\nRGCN+lit, three RGCN layers are applied to aggregate the information within the three-hop\nneighborhood of patient nodes and Parametric Rectified Linear Unit (PReLU) [17] is used as a\nnon-linear activation function. And all models were optimized using Adam optimizer [25] with\nthe learning rate of 1e-3 and the weight decay of 5e-4.\nThe obtained performance is shown in Table 1. All three baseline approaches from tabular\ndata reach poor performances (F1-score = [0.44,0.49], AUC=[0.63, 0.71]). RF showed the best\nperformance (AUC=0.71), closely followed by LR. Especially, the two models showed decent\nF1-score for BackHome outcome, compare to other models. For graph data, neither TransE nor\nRDF2Vec seem to succeed in predicting outcomes (AUC=[0.49,0.5]). However, the RGCN+lit\nmodel showed the overall best result (F1=0.78, AUC=0.91).\nTable 1. The patient outcome prediction comparison on Tabular and Graph\n(SPHN-tr). RGCN3+lit refers to RGCN+lit with 3 layers.\nType\nModel\nF1-score\nAccuracy\nAUC\nBackHome\nRehab\nDeath\nMacro\nWeighted\nTabular\nLR\n0.63±0.02\n0.55±0.02\n0.25±0.05\n0.47±0.03\n0.55±0.02\n0.56±0.02\n0.70±0.02\nRF\n0.63±0.01\n0.55±0.02\n0.28±0.04\n0.49±0.02\n0.55±0.01\n0.56±0.01\n0.71±0.01\nNN\n0.58±0.03\n0.48±0.03\n0.26±0.04\n0.44±0.02\n0.50±0.02\n0.50±0.02\n0.63±0.02\nGraph\n(SPHN-tr)\nTransE\n0.49±0.04\n0.40±0.10\n0.02±0.04\n0.30±0.03\n0.40±0.03\n0.43±0.02\n0.50±0.01\nRDF2Vec\n0.50±0.05\n0.39±0.14\n0.01±0.02\n0.30±0.03\n0.39±0.04\n0.44±0.02\n0.49±0.01\nRGCN3+lit\n0.84±0.01\n0.76±0.02\n0.64±0.08\n0.75±0.03\n0.75±0.02\n0.78±0.01\n0.91±0.01\n4.2. SPHN vs. CARE-SM ontologies. Similarly to the first experiment, TransE, Rdf2Vec\nand RGCN+lit are considered, but here applied to a KG instantiating either the SPHN or\nCARE-SM ontology. The model configuration and hyperparameter settings are the same as\nthe first experiment. Because CARE-SM uses more predicates thus longer paths to connect\npatients with their features, we conducted an additional experiment on CARE-SM KG that\n10\n\n\nconsists in using RGCN with five layers. This aims to check if five-hop neighbors enable to\ncapture enough information to predict the outcome. The obtained performance is reported in\nTable 2. TransE and RDF2Vec showed relatively weak performance on both KG. RGCN on\nSPHN showed the best performance (AUC=0.91). For CARE-SM, all models have difficulty\non predicting the outcomes. Using this ontology, we note that RGCN with three layers is not\nperforming better than TransE or RDF2Vec (AUC=0.50). Increasing the number of layers to\n5 did not improve the performance (AUC=0.50).We note that all the models barely predict the\nDeath outcome.\nTable 2. The performance comparison of SPHN (SPHN-ts) and CARE-SM\n(CARESM∗-ts). RGCN3+lit and RGCN5+lit refers to RGCN+lit with 3 and 5\nlayers, respectively. CARESM∗is the variant of CARE-SM. See Section 3.2 for\nmore details.\nKG\nModel\nF1-score\nAccuracy\nAUC\nBackHome\nRehab\nDeath\nMacro\nWeighted\nSPHN-ts\nTransE\n0.51±0.07\n0.33±0.16\n0.02±0.04\n0.29±0.04\n0.37±0.05\n0.43±0.02\n0.50±0.01\nRDF2Vec\n0.49±0.04\n0.42±0.09\n0.01±0.03\n0.30±0.02\n0.40±0.02\n0.44±0.01\n0.50±0.02\nRGCN3+lit\n0.83±0.02\n0.76±0.02\n0.66±0.08\n0.75±0.03\n0.78±0.02\n0.78±0.02\n0.91±0.01\nCARESM∗-ts\nTransE\n0.47±0.04\n0.44±0.04\n0.02±0.03\n0.31±0.01\n0.40±0.01\n0.43±0.01\n0.49±0.01\nRDF2Vec\n0.51±0.07\n0.38±0.11\n0.00±0.00\n0.29±0.02\n0.39±0.03\n0.44±0.02\n0.50±0.01\nRGCN3+lit\n0.53±0.08\n0.30±0.17\n0.00±0.00\n0.28±0.04\n0.37±0.05\n0.44±0.01\n0.50±0.02\nRGCN5+lit\n0.48±0.08\n0.30±0.19\n0.00±0.00\n0.26±0.04\n0.34±0.05\n0.44±0.05\n0.50±0.01\n4.3. Various time modeling. In this experiment, we compare predictive performance of\ngraphs associated with various modeling of time as listed in Section 3.2. All experiments are\nconducted using the RGCN+lit model, except with no literals where it uses RGCN. Without\nliterals, the model performs poorly, and under the standard approach from tabular data. The\nAUC increases about 33% on average when the literals are added. This increase mainly come\nfrom a better prediction of the Death outcome. When the timestamps are added to SPHN-nt,\nthe AUC increases of 7% on average. Adding the time relations also increases AUC of a 7%.\nAdding both temporal information showed similar results as well. With saturation, we observe\na slight incrase of performance for the Death outcome, though the overall performance is similar\nto SPHN-tsr. Eventually, adding temporal information give the model better prediction, but\nthe type of time modelling and the level of saturation did not make a significant difference.\n5. Discussion\nThe comparative analysis reveals first that the RGCN+lit model outperforms baseline meth-\nods on tabular data, or other KGE approaches in terms of accuracy and F1-score. We hypoth-\nesis that the multi-relational modeling associated with the multiple RGCN-layers makes the\nmodel capable of aggregating information from multiple hop of neighbors to the patient node,\nwhat cannot be achieved from single relational modeling with tabular data, or with TransE or\nRDF2Vec which only partially consider the multi-hop neighbors. Second, we observed that the\nchoice of the schema for individual KG impacts the performance. In particular in our setting,\nthe more compact and patient-oriented schema of SPHN is more favorable than the one of\nCARE-SM KGE approaches. This could be explained by the longer distance between patient\n11\n\n\nTable 3. The Performance of RGCN+lit on SPHN with various temporal\ninformation and modeling. RGCN without literals is applied to SPHN-nl.\nKG\nF1-score\nAccuracy\nAUC\nBackHome\nRehab\nDeath\nMacro\nWeighted\nSPHN-nl\n0.64±0.03\n0.46±0.11\n0.05±0.07\n0.38±0.06\n0.49±0.06\n0.53±0.04\n0.64±0.06\nSPHN-nt\n0.75±0.02\n0.65±0.02\n0.55±0.06\n0.65±0.02\n0.68±0.01\n0.68±0.01\n0.85±0.01\nSPHN-ts\n0.83±0.02\n0.76±0.02\n0.66±0.08\n0.75±0.03\n0.78±0.02\n0.78±0.02\n0.91±0.01\nSPHN-tr\n0.84±0.01\n0.76±0.02\n0.64±0.08\n0.75±0.03\n0.75±0.02\n0.78±0.01\n0.91±0.01\nSPHN-tsr\n0.83±0.02\n0.76±0.02\n0.66±0.04\n0.75±0.02\n0.78±0.01\n0.78±0.01\n0.91±0.01\nSPHN-sat1\n0.83±0.01\n0.76±0.02\n0.64±0.06\n0.75±0.02\n0.78±0.01\n0.78±0.01\n0.91±0.01\nSPHN-sat2\n0.83±0.01\n0.76±0.02\n0.68±0.05\n0.76±0.02\n0.78±0.02\n0.78±0.02\n0.91±0.01\nand feature nodes in CARE-SM, however, increasing the size of the neighbor to five-hops did\nnot solve the issue. However, we note that we did not expend further the number of hops\nfor computational cost. A limitation to the conclusion relies on the fact that we considered\nonly SPHN and CARE-SM as two prototypical ontologies. A more complete study would have\nconsidered concurrent models such as RDF-FHIR, PhenoPackets and others. Third, adding\ntime information helps RGCN+lit in classifying properly patient nodes, but we were enable to\nobserve any difference in performance associated with various time modeling choices. Here we\nacknowledge that we focus on rather simple time modeling and that more complex scenarios\nexist such as those associated with dynamic graphs.\nOverall, our study illustrates that KGE such as RGCN+lit represents a promising approach\nfor predictive modeling in healthcare. However we note a strong class disbalance in our dataset\n(44.14%, 43.33% and 12.53% for BackHome, Rehabilitation, Death, respectively), reflecting the\nreal world. This might explain to some extent the difficulty for most of the approaches to predict\nthe Death class. It is further possibly mitigated by over-sampling techniques, such as Synthetic\nMinority Over-sampling [5]. Also our study considers solely the task of node classification,\nwhereas prediction could have been modeled as a link prediction or triple classification problem.\nMore investigation would be necessary to assess if our conclusions stand in the context of\nother learning tasks. This could necessitate the consideration of problem classically associated\nwith KGE such as negative sampling [23].\nAdditionally, we observed that including literal\nembeddings in the model improved the performance. In this study, our model focused on the\nsimple embedding of numerical literals, including timestamps. However, we plan to develop a\nmodel capable of handling multi-modal literals, such as a combination of text and numerical\nliterals [15].\nAnother important position we took is between transductive and inductive learning ap-\nproaches [36]. We follow a transductive learning approach, which mean that node classification\nis made on the basis of the set of entities that has potentially been seen during training. Most\nof the KGE models are based on a transductive learning approach, because the model learns\nthe complex relational information within a whole large graph. In contrast, inductive learning\nattempts to generalize the model to new entities and relations not presented in the training\ngraph. For instance, it is representing the entities or relations based on the combination of\nobserved entities or relations in the training graph [13]. Inductive approach can be adapted\n12\n\n\nto the scenario where new patient information and medical events continuously emerges. This\nremains a future work of our study.\nThe effective evaluation of KG embedding models is crucial for advancing the field and\nensuring that the models developed are robust, accurate, and useful in practical applications\n[14]. But it suffers from a lack of standardized benchmarks and reference representations of\nthe temporal dimension. In this study, we particularly aimed at advancing this agenda, by\nproposing a real-word task, a shared dataset and well documented baseline experiment, which\nwill serve as a baseline for prediction modeling with graph data.\nAn important area for future research is evaluating the impact of individual patient features\non prediction outcomes. By analyzing the relative importance of different features, such as\nspecific medical conditions or demographic factors, researchers can refine their models to focus\non the most predictive attributes. This targeted approach can enhance the model’s efficiency\nand ensure that the most relevant clinical information is prioritized in decision-making. While\nat the moment, efforts are underway to obtain a small subset of a real dataset to test these\nmodels and generate predictions based on real patient data thanks to the collaboration with\nthe Nantes Hospital, in the longer term, the ultimate goal is to achieve clinical validation of the\npredictive models. This step involves applying the models to actual patient data and rigorously\nassessing their performance in a clinical setting. Clinical validation is critical for ensuring that\nthe models are theoretically sound and practically useful in improving patient outcomes. This\nresearch phase will require close collaboration with healthcare providers and institutions to test\nthe models in real-world environments and to gather feedback for further refinement.\nIn conclusion, while this study has made significant strides in demonstrating the potential\nof knowledge graph embeddings for predicting patient outcomes, a substantial amount of work\nremains to be done. By continuing to refine the models, enhance the realism of synthetic data,\nand pursue clinical validation, future research can build on these foundations to develop precise\nand clinically relevant predictive tools that ultimately enhance patient care and treatments.\nCredits\nAcknowledgments. This work is supported by CombO (Health Data Hub) project and the\nAgence Nationale de la Recherche under the France 2030 program, ANR-22-PESN-0007 Share-\nFAIR, and ANR-22-PESN-0008 NEUROVASC.\nCompeting interests. The authors have no competing interests to declare that are relevant to\nthe content of this article.\nReferences\n[1] Batsakis, S., Petrakis, E.G., Tachmazidis, I., Antoniou, G.: Temporal representation and reasoning in owl\n2. Semantic Web 8(6), 981–1000 (2017)\n[2] Bordes, A., Usunier, N., Garcia-Duran, A., Weston, J., Yakhnenko, O.: Translating embeddings for mod-\neling multi-relational data. In: Advances in Neural Information Processing Systems. vol. 26 (2013)\n[3] Cai, B., Xiang, Y., Gao, L., Zhang, H., Li, Y., Li, J.: Temporal knowledge graph completion: a survey. In:\nProceedings of the Thirty-Second International Joint Conference on Artificial Intelligence. pp. 6545–6553\n(2023)\n[4] Cai, H., Zheng, V.W., Chang, K.C.C.: A comprehensive survey of graph embedding: Problems, techniques,\nand applications. IEEE transactions on knowledge and data engineering 30(9), 1616–1637 (2018)\n[5] Chawla, N.V., Bowyer, K.W., Hall, L.O., Kegelmeyer, W.P.: Smote: synthetic minority over-sampling\ntechnique. Journal of artificial intelligence research 16, 321–357 (2002)\n[6] Chytas, A., Bassileiades, N., Natsiavas, P.: Mapping omop-cdm to rdf: Bringing real-world-data to the\nsemantic web realm. In: Digital Health and Informatics Innovations for Sustainable Health Care Systems,\npp. 1406–1410. IOS Press (2024)\n13\n\n\n[7] Cox, S.J.D., et al.: Time ontology in owl. W3C Candidate Recommendation (November 2022), https:\n//www.w3.org/TR/owl-time/, accessed: 2024-12-18\n[8] Cui, H., Lu, J., Wang, S., Xu, R., Ma, W., Yu, S., Yu, Y., Kan, X., Fu, T., Ling, C., Ho, J., Wang, F.,\nYang, C.: A survey on knowledge graphs for healthcare: Resources, application progress, and promise. In:\nICML 3rd Workshop on Interpretable Machine Learning in Healthcare (IMLH) (2023)\n[9] Cvetkov-Iliev, A., Allauzen, A., Varoquaux, G.: Relational data embeddings for feature enrichment with\nbackground information. Machine Learning 112(2), 687–720 (2023)\n[10] Dall’Amico, L., Barrat, A., Cattuto, C.: An embedding-based distance for temporal graphs. Nature Com-\nmunications 15(1), 9954 (2024)\n[11] Dumontier, M., Baker, C.J.O., Baran, J., Callahan, A., Chepelev, L.L., Cruz-Toledo, J., Rio, N.R.D.,\nDuck, G., Furlong, L.I., Keath, N., Klassen, D., McCusker, J., Queralt-Rosinach, N., Samwald, M.,\nVillanueva-Rosales, N., Wilkinson, M.D., Hoehndorf, R.: The semanticscience integrated ontology (sio)\nfor biomedical research and knowledge discovery. Journal of Biomedical Semantics 5 (2014), https:\n//api.semanticscholar.org/CorpusID:17652831\n[12] Ehm, W., Gneiting, T., Jordan, A., Krüger, F.: Of quantiles and expectiles: consistent scoring functions,\nchoquet representations and forecast rankings. Journal of the Royal Statistical Society Series B: Statistical\nMethodology 78(3), 505–562 (2016)\n[13] Galkin, M., Denis, E., Wu, J., Hamilton, W.L.: Nodepiece: Compositional and parameter-efficient rep-\nresentations of large knowledge graphs. In: International Conference on Learning Representations (2022),\nhttps://openreview.net/forum?id=xMJWUKJnFSw\n[14] Gastinger, J., Sztyler, T., Sharma, L., Schuelke, A.: On the evaluation of methods for temporal knowledge\ngraph forecasting. In: NeurIPS 2022 Temporal Graph Learning Workshop. New Orleans, United States\n(2022)\n[15] Gesese, G.A., Biswas, R., Alam, M., Sack, H.: A survey on knowledge graph embeddings with literals:\nWhich model links better literal-ly? Semantic Web 12(4), 617–647 (2021)\n[16] Hamilton, W.L., Ying, R., Leskovec, J.: Representation learning on graphs: Methods and applications.\narXiv preprint arXiv:1709.05584 (2017)\n[17] He, K., Zhang, X., Ren, S., Sun, J.: Delving deep into rectifiers: Surpassing human-level performance\non imagenet classification. In: Proceedings of the IEEE international conference on computer vision. pp.\n1026–1034 (2015)\n[18] Hitzler, P., Krötzsch, M., Rudolph, S.: Foundations of Semantic Web Technologies. Chapman & Hall/CRC\n(2009)\n[19] Hogan, A., Blomqvist, E., Cochez, M., D’amato, C., Melo, G.D., Gutierrez, C., Kirrane, S., Gayo, J.E.L.,\nNavigli, R., Neumaier, S., Ngomo, A.C.N., Polleres, A., Rashid, S.M., Rula, A., Schmelzeisen, L., Sequeda,\nJ., Staab, S., Zimmermann, A.: Knowledge graphs. ACM Computing Surveys 54(4) (July 2021)\n[20] Jacobsen, J.O., Baudis, M., Baynam, G.S., Beckmann, J.S., Beltran, S., Buske, O.J., Callahan, T.J., Chute,\nC.G., Courtot, M., Danis, D., et al.: The ga4gh phenopacket schema defines a computable representation\nof clinical data. Nature biotechnology 40(6), 817–820 (2022)\n[21] Kaliyaperumal, R., Singh, G., Queralt-Rosinach, N., Bayjanov, J.R., ’t Hoen, P.B., Roos, M.: Phenopackets\nfor the semantic web. In: SWAT4HCLS (2022), https://api.semanticscholar.org/CorpusID:248397161\n[22] Kaliyaperumal, R., Wilkinson, M.D., Moreno, P.A., Benis, N., Cornet, R., dos Santos Vieira, B., Dumon-\ntier, M., Bernabé, C.H., Jacobsen, A., Cornec, C.M.A.L., Godoy, M.P., Queralt-Rosinach, N., Kool, L.J.S.,\nSwertz, M.A., van Damme, P., van der Velde, K.J., Lalout, N., Zhang, S., Roos, M.: Semantic modelling\nof common data elements for rare disease registries, and a prototype workflow for their deployment over\nregistry data. Journal of Biomedical Semantics (March 15 2022)\n[23] Kamigaito, H., Hayashi, K.: Comprehensive analysis of negative sampling in knowledge graph representa-\ntion learning. In: International Conference on Machine Learning. pp. 10661–10675. PMLR (2022)\n[24] Keedy, A.: An overview of intracranial aneurysms. McGill Journal of Medicine: MJM 9(2), 141 (2006)\n[25] Kingma, D.P.: Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980 (2014)\n[26] Kipf, T.N., Welling, M.: Semi-supervised classification with graph convolutional networks. In: 5th Interna-\ntional Conference on Learning Representations, ICLR 2017, Toulon, France, April 24-26, 2017, Conference\nTrack Proceedings. OpenReview.net (2017), https://openreview.net/forum?id=SJU4ayYgl\n[27] Kristiadi, A., Khan, M.A., Lukovnikov, D., Lehmann, J., Fischer, A.: Incorporating literals into knowledge\ngraph embeddings. In: The Semantic Web–ISWC 2019: 18th International Semantic Web Conference,\nAuckland, New Zealand, October 26–30, 2019, Proceedings, Part I 18. pp. 347–363. Springer (2019)\n14\n\n\n[28] Lehne, M., Luijten, S., Vom Felde Genannt Imbusch, P., Thun, S.: The use of fhir in digital health–a\nreview of the scientific literature. German Medical Data Sciences: Shaping Change–Creative Solutions for\nInnovative Medicine pp. 52–58 (2019)\n[29] Prud’hommeaux, E., Collins, J., Booth, D., Peterson, K.J., Solbrig, H.R., Jiang, G.:\nDevelopment\nof a fhir rdf data transformation and validation framework and its evaluation. Journal of Biomed-\nical Informatics 117, 103755 (2021). https://doi.org/https://doi.org/10.1016/j.jbi.2021.103755, https:\n//www.sciencedirect.com/science/article/pii/S1532046421000848\n[30] Ristoski, P., Paulheim, H.: Rdf2vec: Rdf graph embeddings for data mining. In: International semantic\nweb conference. pp. 498–514. Springer (2016)\n[31] Schlichtkrull, M., Kipf, T.N., Bloem, P., Van Den Berg, R., Titov, I., Welling, M.: Modeling relational\ndata with graph convolutional networks. In: The semantic web: 15th international conference, ESWC 2018,\nHeraklion, Crete, Greece, June 3–7, 2018, proceedings 15. pp. 593–607. Springer (2018)\n[32] Touré, V., Krauss, P., Gnodtke, K., Buchhorn, J., Unni, D., Horki, P., Raisaro, J.L., Kalt, K., Teixeira, D.,\nCrameri, K., Österle, S.: Fairification of health-related data using semantic web technologies in the swiss\npersonalized health network. Scientific Data 10 (2023), https://api.semanticscholar.org/CorpusID:\n257433763\n[33] Voss, E.A., Makadia, R., Matcho, A., Ma, Q., Knoll, C., Schuemie, M., DeFalco, F.J., Londhe, A., Zhu,\nV., Ryan, P.B.: Feasibility and utility of applications of the common data model to multiple, disparate\nobservational health databases. Journal of the American Medical Informatics Association 22(3), 553–564\n(2015)\n[34] Wang, Q., Mao, Z., Wang, B., Guo, L.: Knowledge graph embedding: A survey of approaches and appli-\ncations. IEEE transactions on knowledge and data engineering 29(12), 2724–2743 (2017)\n[35] Xiao,\nG.,\nPfaff,\nE.,\nPrud’hommeaux,\nE.,\nBooth,\nD.,\nSharma,\nD.K.,\nHuo,\nN.,\nYu,\nY.,\nZong,\nN.,\nRuddy,\nK.J.,\nChute,\nC.G.,\nJiang,\nG.:\nFhir-ontop-omop:\nBuilding clinical knowledge\ngraphs in fhir rdf with the omop common data model. Journal of Biomedical Informatics 134,\n104201 (2022). https://doi.org/https://doi.org/10.1016/j.jbi.2022.104201, https://www.sciencedirect.\ncom/science/article/pii/S1532046422002064\n[36] Xu, D., Ruan, C., Korpeoglu, E., Kumar, S., Achan, K.: Inductive representation learning on temporal\ngraphs. In: International Conference on Learning Representations (2020), https://openreview.net/forum?\nid=rJeW1yHYwH\n[37] Zhang, F., Li, Z., Peng, D., Cheng, J.: Rdf for temporal data management–a survey. Earth science infor-\nmatics 14, 563–599 (2021)\n15\n\n\nAppendix\nAppendix A. List of features of our synthetic dataset\nThe list of clinical features in our synthetic data is shown in Table 4. It includes 22 non-\ntemporal features (4 numerical, 6 categorical, 12 binary) and 8 temporal features (named events\nin this manuscript). Note that events correspond to the time between hospital admission and\nthe first occurrence of the event (e.g., the first administration of Nimodipine).\nTable 4. List of clinical features.\nType\nName\nDescription\nNumerical\nhospital_stay_length\nNumber of days in the hospital\ngcs\nGlasgow coma score\nact_nb\nNumber of medical acts\nage\nPatient’s age\nCategorical\ngender\nGender\nentry\nMode of entry (e.g., emergency room)\nentry_code\nCode of entry\nica.y\nIntracranial aneurysm (ICA) location and size\nica_treatment\nICA treatment (e.g., endovascular or surgical)\nica_therapy\nCalcium channel blockers therapy\nBinary\nfever\nFever\no2_clinic\nDecrease of oxygen, indirect measure\no2\nDeacrease of oxygen, blood measure\nhta\nHypertension\nhct\nHypercholesterolemia\nsmoking\nSmoking\netOH\nAlcohol consumption\ndiabetes\nDiabetes\nheadache\nHeadache\nunstable_ica\nHemodynamic instability\nvasospasm\nVasospasm\nivh\nIntraventricular hemorrhage\nEvent\nnimodipine\nNimodipine\nparacetamol\nParacetamol use\nnad\nNorepinephrin use\ncorotrop\nMilrinone use\nmorphine\nMorphine use\ndve\nExternal ventricular drainage\natl\nPercutaneous transluminal angioplasty\niot\nOrotracheal intubation\nAppendix B. Statistics of Datasets\nThe statistics of KGs, SPHN and CARE-SM.\n16\n\n\nTable 5. Statistics of Datasets\nDataset\n# Entities\n# Relations\n# Literals\n# Triples\nSPHN\n295,307\n15\n36,415\n1,127,467\nCARE-SM∗\n576,733\n13\n24,766\n1,754,505\nAffiliations:\n1.\nInria, Inserm, Université Paris Cité, HeKA, UMR 1346, Paris, France, –\n2. CNRS, Inserm, Université de Nantes, Institut du Thorax, UMR 1087, Nantes, France, – 3.\nUniversité de Nantes, CHU Nantes, Nantes, France, – 4.\nInserm, Clinique des données, CIC\n1413, Nantes, France,\nEmail address:\n1.\n{jong-ho.jhee, alberto.megina, adrien.coulet}@inria.fr, – 2.\n{richard.redon,\nalban.gaignard}@univ-nantes.fr, – 3.\n{pacome.constantditbeaufils, matilde.karakachoff}@chu-nantes.fr\n17\n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21138v1.pdf",
    "total_pages": 17,
    "title": "Predicting clinical outcomes from patient care pathways represented with temporal knowledge graphs",
    "authors": [
      "Jong Ho Jhee",
      "Alberto Megina",
      "Pacôme Constant Dit Beaufils",
      "Matilde Karakachoff",
      "Richard Redon",
      "Alban Gaignard",
      "Adrien Coulet"
    ],
    "abstract": "Background: With the increasing availability of healthcare data, predictive\nmodeling finds many applications in the biomedical domain, such as the\nevaluation of the level of risk for various conditions, which in turn can guide\nclinical decision making. However, it is unclear how knowledge graph data\nrepresentations and their embedding, which are competitive in some settings,\ncould be of interest in biomedical predictive modeling. Method: We simulated\nsynthetic but realistic data of patients with intracranial aneurysm and\nexperimented on the task of predicting their clinical outcome. We compared the\nperformance of various classification approaches on tabular data versus a\ngraph-based representation of the same data. Next, we investigated how the\nadopted schema for representing first individual data and second temporal data\nimpacts predictive performances. Results: Our study illustrates that in our\ncase, a graph representation and Graph Convolutional Network (GCN) embeddings\nreach the best performance for a predictive task from observational data. We\nemphasize the importance of the adopted schema and of the consideration of\nliteral values in the representation of individual data. Our study also\nmoderates the relative impact of various time encoding on GCN performance.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}