{
  "id": "arxiv_2502.21300v1",
  "text": "DISTRIBUTION STATEMENT A: Approved for public release: distribution unlimited. \n \nHybrid Team Tetris: A New Platform For \nHybrid Multi-Agent, Multi-Human \nTeaming \nKaleb MCDOWELLa,1, Nick WAYTOWICH a, Javier GARCIAa, Stephen GORDONb, \nBryce BARTLETTb, and Jeremy GASTON a \na\n Army Research Laboratory \nb\n DCS Corporation \nAbstract. Metcalfe et al (1) argue that the greatest potential for human-AI \npartnerships lies in their application to highly complex problem spaces. Herein, we \ndiscuss three different forms of hybrid team intelligence and posit that across all \nthree forms, the hybridization of man and machine intelligence can be effective \nunder the right conditions. We foresee two significant research and development \n(R&D) challenges underlying the creation of effective hybrid intelligence. First, \nrapid advances in machine intelligence and/or fundamental changes in human \nbehaviors or capabilities over time can outpace R&D. Second, the future conditions \nunder which hybrid intelligence will operate are unknown, but unlikely to be the \nsame as the conditions of today. Overcoming both of these challenges requires a \ndeep understanding of multiple human-centric and machine-centric disciplines that \ncreates a large barrier to entry into the field. Herein, we outline an open, shareable \nresearch platform that creates a form of hybrid team intelligence that functions under \nrepresentative future conditions. The intent for the platform is to facilitate new forms \nof hybrid intelligence research allowing individuals with human-centric or machine-\ncentric backgrounds to rapidly enter the field and initiate research. Our hope is that \nthrough open, community research on the platform, state-of-the-art advances in \nhuman and machine intelligence can quickly be communicated across what are \ncurrently different R&D communities and allow hybrid team intelligence research \nto stay at the forefront of scientific advancement.  \nKeywords. Hybrid Intelligence, Team Intelligence, Human-Machine Teaming, \nResearch Platform, Research Environment \n1. Introduction \nIncreased hybridization of intelligence between humans and artificial capabilities is \nenvisioned arising from decades of rapid, pervasive, and disruptive technological \nevolution (see 2,3). Herein, we focus on hybrid team intelligence, which we define as the \nability to learn or use skilled reasoning (intelligence) that arises from multi-agent, multi-\n \n1 Kaleb McDowell, Army Research Laboratory, FCDD-RLH 7101 Mulberry Point Rd., Aberdeen \nProving Ground, Maryland 21005, United States; E-mail: kaleb.g.mcdowell.civ@army.mil \n \nMcDowell, K., Waytowich, N. Garcia, J. Gordon, S., Bartlett, B., & Gaston, J. (2022). “Hybrid Team Tetris: \nA New Platform for Hybrid Multi-Agent, Multi-Human Teaming.” Paper presented at Human-Centered \nDesign of Symbiotic Hybrid Intelligence Workshop. Hybrid Human-Artificial Intelligence Conference. \nAmsterdam, The Netherlands. June 13-17.  \n\n\nDISTRIBUTION STATEMENT A: Approved for public release: distribution unlimited. \n \nhuman systems (teams) where there is a deliberate blending of the processing between \nat least two disparate disciplines, cultures, or entities (hybridization). In this definition, \nany specific entity does not need to be intelligent. Rather, the mixed human-agent system \noverall must present the ability to learn or use skilled reasoning.  \nNumerous scientific and commercial breakthroughs point to disruptive \ntechnological evolution already forming the basis for hybrid team intelligence.  We give \nexamples of three forms of human-technology interaction: technology as a tool, \ntechnology as a human decision enhancer, and human-guided artificial learning.  Initial \ndisruptions came in the form of humans using tools that solve complex problems. The \ncreation of consumer Global Positioning System (GPS) navigation devices pioneered by \nGarmin in the 1990s exemplifies how complex problem-solving tool use can reduce, but \nnot eliminate, human cognitive demand associated with specifics aspects of navigation \n(see 4).  Extending this form of hybrid intelligence to teams, the development of weather \nforecasting models has led to a dramatically altered approach to weather forecasting \ninvolving numerous complex models with numerous human users to generate hybrid \nforecasts with less errors than models or humans alone can produce (e.g., see National \nHurricane Center). Technological advances have gone beyond human use of tools to \nrelationships where technologies integrate, modify, and extend human decisions. The \ncreation of Foldit for predicting protein structures provides an example of this form of \nrelationship by merging crowdsourcing with intelligent technologies for ideation and \ndiscovery (5). The creation of cortically coupled computer vision technologies provides \nanother example of integrated human inputs by combining brain-computer interfaces \n(BCI) along with computer vision algorithms to achieve extremely fast object detection \nat human-level performance, allowing for the triage of large image databases (e.g., 6,7).  \nMost recently, human-guided machine learning techniques have evolved that shift \nhumans from the roles of actors to that of technology teachers.  Warnell et al (8) \ndemonstrate this form of human-machine interaction via having a human trainer teach a \ndeep learning agent to play Atari games using evaluative human feedback called \nTAMER (Teaching Agents Manually through Evaluative Reinforcement).  Using Deep \nTAMER, Atari games can be taught in less than 15 mins; a task that has proven difficult \nfor state-of-the-art reinforcement learning methods. At a group level, this form of \ninteraction is also observed in the commercial sector in selector systems that use inputs, \nsuch as thumbs up or thumbs down, to prioritize playlists, advertisements, etc. A key \nfinding across all three forms of human-technology relationship described herein is the \ndemonstration that hybrid intelligence can outperform a machine-only or human-only \napproaches under the right conditions.  \nFocusing on future human-AI ecosystems, Metcalfe et al. (1) argue that the greatest \npotential for human-AI partnerships lies in their application to highly complicated \nproblem spaces. Herein, we embrace a vision of hybrid team intelligence applied in such \ncomplex problem spaces. Our first aim is to articulate three factors driving the types of \nproblem spaces hybrid team intelligence may solve.  Our second aim is to present a vision \nfor enabling community research with a novel hybrid team intelligence research platform \nto enable that vision.   \n\n\nDISTRIBUTION STATEMENT A: Approved for public release: distribution unlimited. \n \n2. A Complex Problem Space for the Future Hybrid Team Intelligence \nThe rapid evolution of machine intelligence presents fundamental challenges to the \nresearch and development community. First, advances in machine intelligence can \noutpace the rate at which the community develops its understanding of relationship \nbetween intelligent technologies and humans; that is, the interactions or relationships \nbetween humans and technology studied for a particular state-of-the-art technology can \nquickly be rendered irrelevant by either the significant advancement of the technology \nor the rise of a superior machine intelligence. Second, the advances in intelligent \ntechnologies are correlated with changes in human behaviors and potentially human \ncapabilities; for example, there are numerous negative short- and long-term effects on \nhuman spatial reasoning resulting from GPS device use (4,9) as well as changes in human \nroles (human knowledge, skills, and behavior requirements) in the aforementioned \nweather forecasting and human-guided machine learning examples. This correlation \neffectively points to the potential for human-machine intelligence research to be studying \nthe “wrong people,” which can directly impact overall performance as well as underlying \nissues such as system usability and trust (see 10). We posit that overcoming these \nchallenges will require the combined expertise of multidisciplinary teams (of humans \nand technology) with an emphasis on combining human-centric and technology-centric \nexpertise.  \nConsistent with the literature on multidisciplinary teaming (see 1, 11, 12), we have \nobserved that specialized perspectives, communications, priorities, and assumptions of \nhuman-centric versus intelligent technology-centric researchers and developers can \nmake it quite difficult for teams to function effectively together.  Our approach to \novercoming the challenges of developing high performing mixed human- and machine \nintelligence-centric research and development teams starts with attempting to create a \nshared vision for the future. While numerous future environments are plausible, we \nconstrain our vision through three “driving factors” that we extract from current \ntechnological and sociotechnical trends:  \n \nAdvanced Intelligence: Machine intelligence technologies that sense, perceive, \nreason, and/or learn are expected to continue to become increasingly capable, \nmore pervasive in society, and potentially more “alien” to humans. These \ntechnologies will adapt to and learn from a variety of sources including humans, \nother technologies, as well as the environment. While not as dramatic, human \nintelligence and its application is also expected to become refined with the \ncontinued development of cognitive enhancement technologies, training \napproaches, and continued exposure to advanced sociotechnical ecosystems. \nSample Challenge: Create future human-technology interactions for human \nand machine intelligence that does not yet exist. \n \n“Superhuman” Capabilities: The continued evolution and growth of \ninterconnected sociotechnical ecosystems combined with more capable data \nprocessing and interpretation capabilities will continue to create conditions \nwhere decisions are made faster and/or on more data than humans can \neffectively process through traditional means. Sample Challenge: Create future \nhuman-technology interactions that allow for humans to influence \n“superhuman” decisions and actions without limiting overall performance. \n \nRapid Technological Change: Continued decreases in the time from ideation \nto fielding of new technologies combined with the fact that these technologies \n\n\nDISTRIBUTION STATEMENT A: Approved for public release: distribution unlimited. \n \nhave become increasingly pervasive in society has created an environment of \nconstant and rapid technological change. Sample Challenge: Enable humans \nand machines to have effective and stable in-field adaptations to predicted and \nunforeseen changes in the sociotechnical environment. \nCombined, these three interrelated “driving factors” constrain the complex problem \nspace in which we expect hybrid team intelligence to be critical. However, we have \nobserved that this level of constraint is still insufficient to bring together high performing \nmixed human- and intelligent technology-centric research and development teams. To \nhelp multidisciplinary teams further create a shared vision, we have attempted to \ninstantiate this future problem space in the simplified, toy research platform of Hybrid \nTeam Tetris. \n3. Hybrid Team Tetris \nThe primary aim of Hybrid Team Tetris is to create hybrid team intelligence within the \nenvisioned complex problem space described above and to do so in a manner that \nmakes the platform easily accessible to a broad community of human-centric and \nmachine intelligence-centric researchers and developers. Hybrid Team Tetris is a \nfunctional multi-agent, multi-human open-source research platform that allows for \nusers with different knowledge, skills and behaviors to experience key elements of \nhybrid team intelligence as outlined below. The intent of the platform is to enable \nproductive multidisciplinary discussions through the creation of critical technical and \nresearch challenges and ongoing community contributions.  While this paper provides \nonly a brief introduction to Hybrid Team Tetris, downloadable software, as well as, a \ndescription of an upcoming open community Hybrid Team Tetris-based hack-a-thon \n(see ‘Human System Adaptation Paradigm Challenge 2022’) can be found on the \nGitHub website as of Jun 17, 2022 (https://github.com/DCSHGAI/HGAITetris).  \n3.1. Why Tetris \nWhile numerous experimental and gaming paradigms could serve as the basis for our \ncommunity platform (see ‘Human System Adaptation Paradigm Challenge 2022’ for \nopportunities to present alternative platforms), the choice to use Tetris as a basis for the \nplatform arose from three primary reasons: \n \nTetris has been successfully deployed as a basic form of hybrid intelligence in \nthe past (13, 14) \n \nTetris is well-defined and has been used as a platform for both human-centric \nand machine intelligence-centric research and development for over two \ndecades (15-17; Current Tetris AI Record set by G Cannon in 2021) \n \nTetris offers experimental flexibility and accessibility (for multiple versions and \nconfigurations see 18-20). \nIn addition, Tetris is one the of the best-selling games of all time (>100M copies \nsold), although we acknowledge that Hybrid Team Tetris has very different game play \nthan that originally designed by Alexey Pazhitnov in 1984.  \n\n\nDISTRIBUTION STATEMENT A: Approved for public release: distribution unlimited. \n \n3.2. Basic Multi-Agent, Multi-Player Gameplay \nAt its core, Hybrid Team Tetris uses a human-guided machine learning approach similar \nto Knox & Stone’s (13), but updated with Deep TAMER (see 8). That is, as the machine \nagent drops a “tetrimino” into a row, a human has an option to press or not press “ENTER” \nto indicate what they view as a “positive” move.  The Deep TAMER uses the reward \nsignal to relate the tetrimino shape and dropped position to the state of the game board \nand update its game play.  This basic mechanism allows humans, who may have no \nsubject matter expertise in intelligent technologies, to train agents to play the game.  \nTo extend the game to multi-agent, multi-player gameplay, three mechanisms are \nemployed.  First, a single player is presented with multiple games simultaneously.  That \nis, the player can use keystrokes (“1-2”) to toggle between games and then, press \n“ENTER” to indicate a positive move in the selected game.  This allows the player to \ndevelop independent agents.  Second, a multi-player mode allows additional players to \nalso play simultaneous games and develop other independent agents, using the \naforementioned mechanism.  Third, to develop interactions across the team, additional \ngames are played by machine agents that learn from all or a sub-set of the player directed \ngames. This creates agent learning that is dependent on team decisions.  A functional \nversion of the game with 2 players each guiding 2 agents with one dependent agent \nlearning from the 4 player-guided games is depicted in figure 1 and is located on the \nGitHub website (see Base platform). \n \n \nFigure 1. Basic Hybrid Team Tetris gameplay.  Human Player A guides machine Agents 1 & 2. Human \nPlayer B guides machine Agents 3 & 4.  Machine Agent 5 learns from machine Agents 1, 2, 3, and 4. \nThe number of total numbers of players, agents, and the network interconnectivity \nof players and agents can be manipulated to study issues that range from team \ncollaboration to distributed learning.  \n3.3. Advanced Intelligence Gameplay \nA critical challenge for studying future human-technology hybridization is to create a \nresearch environment that is representative of the advances in human and machine \n\n\nDISTRIBUTION STATEMENT A: Approved for public release: distribution unlimited. \n \nintelligence that do not yet exist. Hybrid Team Tetris approaches this challenge through \nthe use of “Hidden Rules” that are only initially presented to a single or a sub-set players \nor agents. For example, if the “Hidden Rule” is that anytime a row is cleared with >3 \nyellow squares, a “favorable” tetrimino is presented as the next piece (see Spiel et al \n2017 for adapting Tetris difficulty via adjusting the next available Tetrimino) and the \nagent receives a “positive” reward even if the human-player does not actively press \n“ENTER”. Alternatively, whenever the row with >3 yellow squares is cleared, a \n“10*bonus score” could be awarded immediately on screen if the player is being \npresented the rule or as an end of game bonus if the agent is being presented the rule.  A \nfunctional version of the basic game with the later “Hidden Rule” is located on the \nGitHub website (See Advanced_Intelligence platform). \n3.4. “Superhuman” Gameplay \nA second critical challenge for human-technology hybridization is effectively allowing \nhumans to influence “superhuman” decisions and actions. The original game of Tetris \nnaturally generates this challenge by ramping up the speed at which Tetriminos are \ndropped. Hybrid Team Tetris ramps up this challenge by adding multiple simultaneous \ngames per player (up to 10 selected via keystrokes “0-9”) in addition to speed \nmodifications. Extending the Knox & Stone (2009) version of human-guided machine \nlearning Tetris allows players to overcome this challenge by granting access to discrete \nmoments in time rather than continuously making decisions. A functional version of the \nbasic game with “superhuman” challenges is located on the GitHub website (See \nSuperhuman platform). \n3.5. Rapid Technological Change Gameplay \nA third critical challenge for human-technology hybridization is to enable humans and \nmachines to have effective and stable in-field adaptations to predicted and unforeseen \nchanges in the sociotechnical environment. Hybrid Team Tetris allows for this challenge \nby introducing in-game changes that require substantive changes in strategy to maintain \ngameplay and serves as a proxy for rapid technological change.  For example, the version \non GitHub combines the introduction of novel Tetrimino pieces and alters the rules \nawarding points as game time elapses (see Rapid_Technological_Change platform).  \n3.6. Overall Gameplay \nWhile all the above examples of Hybrid Team Tetris are functional, our goal is to \ndemonstrate a hybrid intelligence suitable research platform that represents our \nenvisioned future complex problem space, which combines advanced intelligence, \n“superhuman” capabilities, and rapid technological change. A functional version of the \ncombined platform is also available on GitHub (See Integrated platform).  \n4. Conclusions \nHybrid Team Tetris is an open, shareable research platform that aims to lower the bar \nfor entry into hybrid intelligence by allowing individuals to rapidly experience hybrid \n\n\nDISTRIBUTION STATEMENT A: Approved for public release: distribution unlimited. \n \nteams and lowers the multidisciplinary knowledge requirement to initiate research. \nMoreover, community contribution on this open-source platform allows for increasing \nsophistication of both human-centric and machine-centric interactions.  This \nsophistication across R&D communities allows for effective cross-community state-of-\nthe-art collaboration and advancement of hybrid intelligence principles and insights. \nReferences \n[1]  Metcalfe JS, Perelman BS, Boothe DL, & McDowell K. Systemic oversimplification limits the potential \nfor human-AI partnerships. IEEE Access 2021; 9: 70242-60. \n[2]    Kurzweil R. The Singularity Is Near: When Humans Transcend Biology. 2005 Sep; Menlo Park, CA. \n[3]    Pelton JN. Preparing for Next Cyber Revolution: How Our World Will Be Radically Transformed Again. \n2019; Cham, Switzerland: Springer, 2019 [online] Available: http://link.springer.com/10.1007/978-3-\n030-02137-5. \n[4]    Dahmani L, & Bohbot VD. Habitual use of GPS negatively impacts spatial memory during self-guided \nnavigation. Scientific Reports 2020;10: 6310. \n[5]  Cooper S, Khatib F, Treuille A, Barbero J, Lee J, Beenen M, Leaver-Fay A, Baker D, Popović Z, &  \nFoldit players. Predicting protein structures with a multiplayer online game. Nature 2010; 466, 756-760. \nURL http://dx.doi.org/10.1038/nature09304 \n[6]    Gerson AD, Parra LC, Sajda P. Cortically coupled computer vision for rapid image search. IEEE Trans \nNeural Syst Rehabil Eng 2006 Jun; 14(2):174-9.    \n[7]    Pohlmeyer EA, Wang J, Jangraw DC, Lou B, Chang SF, Sajda P. Closing the loop in cortically-coupled \ncomputer vision: a brain–computer interface for searching image databases. Jour of Neural Eng 2011; \n8(3): 036025. \n[8]    Warnell G, Waytowich N, Lawhern V, & Stone P. Deep tamer: Interactive agent shaping in high-\ndimensional state spaces. Proceedings of the AAAI Conference on Artificial Intelligence; 2018: 32 (1). \n[9]    Gardony AL, Brunyé TT, Mahoney CR, & Taylor HA. How navigational aids impair spatial memory: \nEvidence for divided attention. Spat. Cognition Computation 2013; 13:319–50. \n[10] de Winter JCF. Pitfalls of automation: a faulty narrative? Commentary on Hancock (2019) Some pitfalls \nin the promises of automated and autonomous vehicles. Ergonomics 2019; 62(4): 505-8.  \n[11] Aagaard-Hansen J, The challenges of cross-disciplinary research. Social Epistemol., 2007; 21 (4): 425-\n8. \n[12] Monteiro M & Keating E. Managing misunderstandings: The role of language in interdisciplinary \nscientific collaboration. Sci. Commun 2009 Sep; 31 (1): 6-28. \n[13] Knox WB & Stone P. Interactive Shaping of a Tetris Agent Using the TAMER Framework. Technical \nreport. In Proceedings of the IJCAI Robot Workshop, 2009 Jul. \n[14] Lin J, Zhang Q, Gomez R, Nakamura K, He B, & Li G. Human Social Feedback for Efficient Interactive \nReinforcement Agent Learning. In 2020 29th IEEE International Conference on Robot and Human \nInteractive Communication (RO-MAN) 2020 Aug-Sep; 706-12. \n[15] Haier RJ, Siegel B, Tang C, Abel L, Buchsbaum MS. Intelligence and changes in regional cerebral \nglucose metabolic rate following learning. Intelligence Jul 1992 Jul 1;16(3-4):415-26. \n[16] Burgiel H. How to lose at Tetris. The Mathematical Gazette. 1997 Jul;81(491):194-200. \n[17] Agren T, Hoppe JM, Singh L, Holmes EA, & Rosén J. The neural basis of tetris gameplay: implicating \nthe role of visuospatial processing. Current Psychology 2021 Aug; 1-8. \n[18] Lindstedt JK, Gray WD. Meta-T: TetrisⓇ as an experimental paradigm for cognitive skills research. \nBehavior research methods. 2015 Dec;47(4):945-65. \n[19] Spiel K, Bertel S, Kayali F. \" Not another Z piece!\" Adaptive Difficulty in TETRIS. In Proceedings of \nthe 2017 CHI Conference on Human Factors in Computing Systems 2017 May 2; 5126-31. \n[20] Pires G, Torres M, Casaleiro N, Nunes U, Castelo-Branco M. Playing Tetris with non-invasive BCI. In \n2011 IEEE 1st international conference on serious games and applications for health 2011 Nov: 1-6. \nIEEE. \n \n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21300v1.pdf",
    "total_pages": 7,
    "title": "Hybrid Team Tetris: A New Platform For Hybrid Multi-Agent, Multi-Human Teaming",
    "authors": [
      "Kaleb Mcdowell",
      "Nick Waytowich",
      "Javier Garcia",
      "Stephen Gordon",
      "Bryce Bartlett",
      "Jeremy Gaston"
    ],
    "abstract": "Metcalfe et al (1) argue that the greatest potential for human-AI\npartnerships lies in their application to highly complex problem spaces.\nHerein, we discuss three different forms of hybrid team intelligence and posit\nthat across all three forms, the hybridization of man and machine intelligence\ncan be effective under the right conditions. We foresee two significant\nresearch and development (R&D) challenges underlying the creation of effective\nhybrid intelligence. First, rapid advances in machine intelligence and/or\nfundamental changes in human behaviors or capabilities over time can outpace\nR&D. Second, the future conditions under which hybrid intelligence will operate\nare unknown, but unlikely to be the same as the conditions of today. Overcoming\nboth of these challenges requires a deep understanding of multiple\nhuman-centric and machine-centric disciplines that creates a large barrier to\nentry into the field. Herein, we outline an open, shareable research platform\nthat creates a form of hybrid team intelligence that functions under\nrepresentative future conditions. The intent for the platform is to facilitate\nnew forms of hybrid intelligence research allowing individuals with\nhuman-centric or machine-centric backgrounds to rapidly enter the field and\ninitiate research. Our hope is that through open, community research on the\nplatform, state-of-the-art advances in human and machine intelligence can\nquickly be communicated across what are currently different R&D communities and\nallow hybrid team intelligence research to stay at the forefront of scientific\nadvancement.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}