{
  "id": "arxiv_2502.21005v1",
  "text": "1 \n \n28 Feb. 2025 \nThe Last Meridian Circles  \nErik Høg – Niels Bohr Institute, Copenhagen University, Copenhagen, Denmark \nehoeg@hotmail.dk \n \nAbstract: The aim is to document in some detail the last 35 years of meridian circles, a type of \ninstrument with a fundamental role in astronomy for a very long time, and to do so while witnesses \nare still alive and can contribute. This is about finding facts. Meridian circles provided fundamental \nstar positions for centuries. These positions were tied to a well-defined celestial coordinate system \nof right ascension and declination, and accurate proper motions ensured a transformation of the \npositions over long periods of time. This function of the meridian circles has been taken over by \nspace astrometry and VLBI. The Hipparcos astrometric satellite was approved by ESA in 1980 and \nlaunched to a successful 3-year mission in 1989, and the successor, Gaia, has in 2025 completed a \nmission of over 10 years. An account is given of the last 18 meridian instruments, which were active \nfor some part of the 35 years until 2015. This account is based on information found on the internet, \nand on input kindly supplied in correspondence with many colleagues. \nKeywords: Astrometry, Meridian circles, History of astronomy \n \n1 Introduction \nThe meridian circle (MC) was fundamental instrument for astrometry for over two hundred years. \nIt had first shown its great potential for measurement of star positions when Ole Rømer set it up in \n1704 near the village Vridsløsemagle 20 km west of Copenhagen. A classical meridian circle of Ole \nRømer’s design as shown in figure 1 is suited for accurate measurement of right ascension and \ndeclination of stars. Meridian instruments of four other designs are shown in some of the following \nfigures 2-6. Pictures of meridian circles are found in the figures 1, 2, 6, 8, and 10 of Høg (2024a), and \nin many figures of Yershov (2025).  \nOle Rømer had first set up a transit instrument in his house in Copenhagen in 1691, figure 2. It \nwas the first of its kind with a telescope mounted on an east-west axis so that the meridian transit \ntime could be measured accurately and provide the right ascension. The instrument had a scale (at \nF in the figure) which could be read with the microscope E. It was not yet a real meridian circle but \nboth coordinates were determined, and both coordinates needed help from other instruments for \nthe calibration. More information on meridian circles is given in Wikipedia (2025), including Ole \nRømer’s first real meridian circle shown in the section on the 17th century. \nObservations with meridian circles served many astronomical purposes during a long period, but \nsuch astrometric instruments became obsolete when ESA’s astrometry satellite Hipparcos delivered \nvery accurate positions, proper motions and parallaxes. The catalogue with 120,000 Hipparcos stars \npublished in 1997 gave reference stars so that MCs could be used to observe many fainter stars than \nHipparcos, but MCs became obsolete also for this aim when the Gaia satellite reached out for 20 \nmag stars. Ten years with Gaia observations of 1.8 billion stars were completed in January 2025, and \nthe first results for 1.1 billion sources were published already in 2016.  \n\n\n2 \n \nMeridian circles in La Palma, San Juan, USNO in Washington DC 2 instruments, Flagstaff, \nMykolaiv (formerly Nicolaev), Kyiv (formerly Kiev) 2 instruments, Moscow 2 instruments, \nPulkovo/Kislovodsk 4 meridian instruments, Tokyo, Bordeaux, Valinhos, and Cerro Calán were active \nin at least a part of the 35 years from 1980 to 2015 as shall be outlined in the following. Of these 18 \ninstruments, the six meridian circles in La Palma, San Juan, Flagstaff, Mykolaiv, Kyiv, and Bordeaux \nwere still active after the year 2000.  \nThis account is based on a study of the literature and on input received from many colleagues \non my request, and I have edited what I received in close correspondence, resulting in different \ndetails and styles. I prefer to keep some details if they could be of historical interest as time passes. \n \n \nFigure 1. The classical meridian circle of Lund Observatory is now in permanent exhibition. Lennart Lindegren \nand the present author are shaking hands in 2023. Astrometry and this instrument had fascinated Lennart in \n1973, just as had happened for me at the Brorfelde meridian circle 20 years before when I was as young as \nhe was, see more in Høg (2024a). - Figure from the private collection of Lennart Lindegren. \n\n\n3 \n \n \nFigure 2. Engraving of Ole Rømer using his transit instrument. – From Peder Horrebow’s Basis Astronomiæ. \n \n1.1 About methods and changing techniques \nA star is observed with a meridian circle while it crosses the meridian to obtain the right ascension \nand declination of the star. A micrometer at the focal plane measures the transit time needed for \nthe right ascension, and it measures the position in the field-of-view along the meridian needed for \nthe declination. The inclination of the telescope during this measurement is determined from \nreadings of a circle with very accurate division lines on the east-west axis, and this is used with the \nmeasurement of the star to finally give the celestial coordinate of declination. \nStars were observed one by one, perhaps 200 in a good night, with manual setting of the \ntelescope inclination before observation with the focal plane micrometer and reading of the circle. \nThese stars could then by calculation be connected to a set of reference stars for which positions \nand motions were known from observation with meridian circles for more than 100 years. This was \npossible because a meridian circle is very stable during the night as it can only turn about an east-\nwest axis resting in pivots on two solid columns. The net of reference stars since 1963 consisted of \n1535 fundamental stars on the whole sky listed in the FK4 catalogue, and the observer took care to \nobserve some of them every night.  \nThis situation changed completely with publication of the Hipparcos Catalogue, much more \naccurate than FK4, and in 2000 the Tycho-2 Catalogue appeared with data for 2.5 million stars also \n\n\n4 \n \nobserved with Hipparcos. At about the same time, CCD detectors had been installed at some \nmeridian circles so that stars in a small area in the sky were observed simultaneously instead of only \none star at a time. A strip of the sky was observed while the stars drifted across the CCD in so-called \ndrift-scan mode (Time Delayed Integration, TDI) while the telescope stayed fixed. Drift-scan was also \nused in the Gaia satellite as proposed for an astrometric satellite called Roemer at a symposium in \nShanghai in September 1992 (Høg 1993).  \nSome stars from Hipparcos or Tycho-2 were always present in the strip observed with the \nmeridian circle to which the other stars in the strip could be connected. For such “relative \nastrometry”, the great stability of a meridian circle during a night was no longer essential and an \naccurate reading of the circle was superfluous. Therefore, the name meridian circle was no longer \nfitting, and it was replaced by meridian telescope in some cases. \nFurthermore, a CCD is much more sensitive than a photomultiplier so that even fainter stars can \nbe observed. Some meridian circles or meridian telescopes were therefore dedicated to surveys of \nlarge parts of the sky for faint stars. That was the case for the instrument on La Palma until 2011 \nand similarly for some of the six meridian instruments in San Juan, Flagstaff, Nicolaev, Kiev, Tokyo, \nand Bordeaux. Thus, all meridian circles are decommissioned by 2015 because the Gaia mission does \nnot leave significant scientific tasks for these instruments, and this is rather the same time as the \ninvolved persons retire.  \n \n2 The 18 meridian instruments \n2.1 Brorfelde: The Copenhagen University Observatory, CUO, established a new Observatory near \nthe village Brorfelde 50 km to the west of Copenhagen where the main instrument was a meridian \ncircle built by Grupp Parsons in England and erected in 1953. A photographic micrometer was \ndeveloped and in use 1964-1976. \nFrom 1973 a photoelectric slit micrometer with photon counting was developed, and full \nautomation of the instrument was begun. Contact with the Royal Greenwich Observatory, RGO, in \nEngland from 1976 led to a collaboration where the automatic instrument should be set up on La \nPalma, one of the Canary Islands, where a large observatory was established in the following years \non a mountain top, Roque de los Muchachos. Soon also Spain joined this collaboration. Observations \nwith the MC on La Palma began in May 1984. \nA report in Danish about the development of astrometry and the Brorfelde Observatory has been \npublished by Høg (2024b).  \n \n2.2 La Palma: Leif Helmer has informed about the photoelectric observations. The observations on \nLa Palma in the 14 years from May 1984 to May ’98 were obtained with two photoelectric slit \nmicrometers, the first one being replaced with a new one after four years. The latter micrometer \nhad cooling of the photomultiplier, there were three pairs of inclined slits of different height \n(implemented by one pair of slits where a diaphragm could cover different parts) so that stars with \nuncertain positions could be measured, and there was a measuring rod engraved on the slit plate.  \nThe results were published annually in Carlsberg Meridian Catalogues Numbers 1 – 11, on CD-\nROM in 1999. The entire catalogue contained 180812 positions and magnitudes for 176,591 stars \nwith declination > -40⁰, 155,005 proper motions and 25,848 positions and magnitudes for 184 solar \n\n\n5 \n \nsystem objects. About 100,000 observations per year were obtained, so that the 181,000 positions \nare based on about 1.4 million observations with 8 observations/star. \nA link from a Cambridge website by Evans (2014) contains a reference to CMC14 of 2005. This is \na catalog observed with the CCD in drift-scan mode covering the sky from -30 to +50 degrees in \ndeclination, just completed and published before Copenhagen University left the project and Leif \nHelmer retired in 2006. It contains astrometry and photometry catalogue of 95.9 million stars in the \nred (SDSS r’) magnitude range 9 to 17. \nFinally comes the catalogue CMC15 which is the last of the series “Carlsberg Meridian Catalogue, \nLa Palma” and comprises all the observations made between March 1999 and March 2011 with the \nCarlsberg Automatic Meridian Circle in El Roque de los Muchachos Observatory on the island of La \nPalma (Spain). It contains more than 122 million stars with right ascension, declination, and \nmagnitude in the magnitude range 9 < r’ < 17 and declination range -40° < dec < +50°. For the \ncatalogue, a mean value was formed from at least two observations per star, and the catalogue \ninternal errors in astrometry are below 30 mas (milli-arcseconds) in both coordinates for stars \nbrighter than r’=13, reaching 60 mas for r’=16. The internal magnitude error is below 0.020 mag for \nstars brighter than r’=13, and about 0.090 mag for r’=16. \nThis means almost 700 times (122 million/181,000) as many positions from the CCD-\nmicrometers in 12 years as the 181,000 star positions in 14 years from the slit micrometers.  \nThe last night of observing was on 2013/09/01. The Carlsberg Meridian Telescope has been \ndecommissioned, and the Instituto de Astrofisica de Canarias (IAC) has plans of housing the \ntelescope in a museum in Santo Domingo de Garafía on La Palma, but this museum has nothing to \ndo with IAC. The MC building on the mountain will be removed and the new Liverpool instrument \nwill be located there.  \n \n2.3 San Fernando/San Juan: Real Instituto y Observatorio de la Armada en San Fernando (ROA) \ncollaborated on the La Palma instrument and operated its own instrument in San Juan, Argentina. \nIt was built by Grupp Parsons in 1948 as a twin to the one for Brorfelde and it was originally erected \nat San Fernando in 1952. \nMiguel Vallejo Carrion informed: Until 1986, it carried out numerous systematic visual \nobservation campaigns of stars and objects of the solar system. In 1986 it was subject to an \nautomation and robotization process, taking advantage of the collaboration started in 1980 with \nthe RGO and CUO. In 1988 it was equipped with a photoelectric slit micrometer identical to the \nsecond one developed for the La Palma instrument. \nWhen the automation process was finished in 1994 and after two years  testing in San Fernando, \nthe instrument was in ‘96 transferred to the Carlos Ulrrico Cesco (CUC) High Altitude Station, part \nof the Félix Aguilar Astronomical Observatory (OAFA) of the National University of San Juan \n(Argentina) thanks to a collaboration agreement between both institutions. The location is close to \nLeoncito, the American astrometric observatory. \nAt its new location, the instrument was renamed the Automatic Meridian Circle of San Fernando \n(CMASF) and was initially equipped with the slit micrometer (1997-1999). It carried out systematic \nobservations of stars and small planets resulting in the publication in 2001 of the first Hispano-\nArgentinian Meridian Catalogue HAMC1 containing 6,192 positions and magnitudes of stars south \n\n\n6 \n \nof declination +40º, 5,400 proper motions and 923 positions and magnitudes of 92 objects in the \nsolar system. \nIn 1999 a CCD camera replaced the slit micrometer and full automation was implemented, see \nMuiños et al. (1999). A segment of the sky was observed between declinations -55º and +30º, but \nonly the part south of equator was completed. This formed the Second Hispano-Argentinian \nMeridian Catalogue (HAMC2) published in 2008 containing more than 12,500,000 positions and \nmagnitudes of stars between  -30º  and  0º in declination  and magnitudes 9 < V < 16.5.  \nThe instrument was finally closed down in 2014 due to staff limitations and the fact that results \nobtained from astrometric observations by the Gaia Space Mission made it scientifically \nunprofitable to continue with ground-based observations of lower precision. \n \n2.4 USNO: The US Naval Observatory at Washington DC was a center for fundamental astrometry \nwith meridian circles for many years. Other kinds of ground-based astrometry were also pursued at \nthe USNO but are not the subject here. Plans for fundamental astrometry from space were studied \nin the 1990s in the USA, see e.g. Johnston (1995) and the overview in Høg (2014). \nThe meridian circles at USNO and the work with them for 150 years have been described by \nSchmidt & Dick (2023) where the instruments are listed in Table 1. After 1980, two meridian circles \nwere operated, the 6- and 7-inch Transit Circles, as quoted here:   \nThe Six-inch Transit Circle would become the true workhorse of fundamental \nastrometry at the USNO in the 20th century, operating from 1899-1999 in the west \ntransit building at the Massachusetts Avenue site in Washington, D.C. In that period, \n974,000 visual observations were made with this instrument, 300,000 more than the \nGreat Airy Transit Circle at Greenwich (1851-1954), perhaps more visual observations \nthan any other transit circle in history. \nThe Seven-inch Transit Circle was the only meridian circle built at the Naval \nObservatory. It was nearly indistinguishable in design from its 50-year older cousin, the \nSix-inch Transit Circle. But while the Six-inch remained a visual instrument, the Seven-\ninch pioneered electronic imaging automation. These instruments were managed for \nmost of their existence by separate USNO Divisions, yet each participated in the global \ncampaign of the 1950s-1960s known as the International Reference Stars, and in the \nUSNO Pole-to-Pole Program of 1985-1996. \nTheodore Rafferty, made the final observations on the USNO Six-inch Transit Circle \nin 1999. \n2.5 Flagstaff: In Arizona, USA, the Flagstaff astrometric telescope (FASTT) is described by Stone et \nal. (2003): \nBy the end of year 2003, the FASTT will have produced over 190,000 positions of solar \nsystem objects in a program to provide a very large and homogeneous database for each \nobject that will extend over many years and include positions accurate to ±47 to ±300 \nmas, depending on the magnitude of each observed object (3.5 < V < 17.5). \nMoreover, extensive efforts have been undertaken to improve the systematic accuracy \nof FASTT equatorial positions by applying corrections in the reductions for differential \ncolor refraction, distortions in the focal plane, and correcting for a positional error that is \ndependent on magnitude. The systematic accuracy of FASTT observations is now about \n\n\n7 \n \n±20 mas in both right ascension and declination. FASTT data have contributed very \nsignificantly to recent successful spacecraft missions and to a dramatic improvement in \nthe predictions made for occultation events. \nMy comment: The FASTT at Flagstaff was a transit telescope observing stars close to the \nmeridian. It observed with a CCD since 1989. An upgrade started in 1997 and by 2003 a CCD with \n20482 pixels covered a field of 51’x51’. The positions were obtained by reference to the Tycho-2 \nCatalogue, thus the instrument was not working as a meridian circle where positions were derived \nby accurate observation of transit times and reading of the divided circle.  \nThe FASTT continued to take observations of the Saturnian satellites until at least 2007, see \nDesmars et al. (2009). \nRecently, Valeri Makarov said that FASTT was decommissioned by 2010 after R.C. Stone had \npassed away in 2005. \n \n2.6 Mykolaiv: In Ukraine, the Axial Meridian Circle (AMC) of the Mykolaiv (formerly Nicolaev) \nAstronomical Observatory is a horizontal rotating telescope (D = 180 mm, F = 2480 mm) located in \nthe prime vertical, paired with a stationary long-focal-length autocollimator (D = 180 mm, F = 12,360 \nmm) and equipped with a CCD micrometer operating in drift-scan mode, figure 3.  \n \n \nFigure 3. The Axial Meridian Circle (AMC) of the Mykolaiv Astronomical Observatory \n – Diagram from Pinigin et al. (1995). \n \nSince 1995, the telescope has undergone a series of upgrades, including the replacement of the \nCCD receiver with a modern more sensitive one. The telescope was equipped with an Apogee Alta \nF8300 CCD camera featuring high-resolution sensors (8.3 megapixels with 5.4 μm pixels), providing \na 25 × 25 arcmin field of view and a scale of 0.45 arcsec/pixel. Astrometry is entirely derived from \nreference stars within the field. Observation campaigns with the AMC have been focused on ground-\n\n\n8 \n \nbased maintenance and extension of the Hipparcos reference system to fainter objects, see \nKovalchuk (1997, 2000). \nDetails of the AMC design are given in Pinigin et al (2001). Observations in 2008–2011 are \ncompiled in two catalogs with a total of 284557 objects by Maigurova et al. (2013) and Martynov et \nal. (2013). Stars with large proper motions were observed by Maigurova et al. (2016). \nAstrometric observations performed by the Gaia Follow-Up Network for Solar System Objects \n(Gaia-FUN-SSO) play a key role in ensuring that moving objects first detected by ESA's Gaia mission \nremain recoverable after their discovery. An observation campaign on the potentially hazardous \nasteroid (99 942) Apophis was conducted during the asteroid's latest period of visibility, from \n12/21/2012 to 5/2/2013, to test the coordination and evaluate the overall performance of the Gaia-\nFUN-SSO, see Thuillot et al (2015). \nIn 2015, observations were stopped in view of the much better results expected from the Gaia \nsatellite.  \n \n2.7 Kyiv-1: From Ukraine, Liliya Kazanzeva sent information: “Our classical meridian circle was made \nby Repsold in 1870 and installed in Kyiv (formerly Kiev) Observatory 1872 in a special pavilion. It \nworked until 1996 in visual mode. When you arrived (the present author visited the meridian circle \nin 1978) you communicated with Chernega Mykola Yakimovich and he observed with this \ninstrument for many years. Unfortunately, he has already passed away. Our observatory belongs to \nKyiv University, but our employees also observed with the axial meridian circle at the other \nobservatory in Kyiv, see Lazorenko et al. (2018) in the following section Kyiv-2.”  \n \n2.8 Kyiv-2: From Ukraine, Yaroslav S. Yatskiv sent information: The Main Astronomical Observatory \nof Kyiv, belonging to the Academy of Sciences, had an axial meridian circle. It was constructed at the \nobservatory and very similar to the one in Mykolaiv.  \n       Observations were carried out with a CCD camera in the years 2001 to 2015, see Karbovsky et \nal. (2011, 2017). They describe the results of the astrometric sky surveys with the telescope MAC \nwhich were performed in 2001-2015. They observed stars near the equator and stars in the fields \nwith radio-sources which are ICRF objects. Astrometry was entirely derived from reference stars \nwithin the field of view. \nAbout a catalog with astrometric observations of 219 828 stars in the period 2001-2003 with the \naxial MC, see Lazorenko et al. (2018). \n \n2.9 Moscow: Valerian N. Sementsov at Moscow State University sent information which is here \nabbreviated: \nTwo meridian circles were installed and used in Sternberg Astronomical Institute, \nSAI, even after 1980: \n1) Repsold's meridian circle  \n(D=148 mm, F=2000 mm, manufactured in 1847). \nIt was originally installed in the Krasnopresnensky Observatory of Moscow State \nUniversity (approximate coordinates 55.758046N, 37.567800E).  \n\n\n9 \n \nThe meridian circle was moved in 1981 to the observatory on Maidanak Mountain in \nUzbekistan (Google coordinates 38°40'19 “N 66°53'55 ”E).  In February 1993, all \nequipment at Maidanak was nationalized by the Uzbek authorities. Currently it belongs \nto the Ulugbek Astronomical Institute under the Academy of Sciences of Uzbekistan. \nGolovko et al. (1984) mentions results.  \n2) Meridian circle of GOMZ (State Optical and Mechanical Plant) is shown in the \nundated figure at APM-4 (undated). It shows the APM-4 - meridian circle with \nphotographic registration (created under the direction of V. V. Podobed and A. P. \nGulyaev) (D = 180 mm, F = 2500 mm, installed d 1959-1961 in the pavilion with \ncoordinates 55.701515N, 37.541488E).  \nResults are given by Tauber (1986). A catalogue of double stars (DS) and high-\nluminosity stars (HLS) declinations was obtained at the Moscow Observatory from \nobservations with the meridian circle GOMZ. The observations were performed with the \ndifferential method by means of attachment to FK4 stars. The mean epoch of \nobservations is 1982.70. The mean error of one observation is 0.30 arcsec. \nThe present author concludes that the two Moscow meridian circles have been used up to about \n1985, provided with visual or photographic micrometers, but no description seems to be available. \nThis brief text is sufficient for the present purpose, and it has been agreed with Oleg Malkov and \nValerian N. Sementsov. \n \n2.10 Pulkovo/Kislovodsk: In 1990, I visited the Pulkovo Observatory near Leningrad, later renamed \nSt. Petersburg, invited to talk about the newly launched Hipparcos mission. My colleagues took me \non a long trip, first to Moscow then to their observation station at Kislovodsk in the Caucasus \nMountains. The visit to Kislovodsk had far reaching consequences for astrometry because I became \nengaged in discussions with my colleagues from Pulkovo: Mark Chubey, Valeri Makarov, and \nVladimir Yershov, and soon also with Lennart Lindegren about a successor for the Hipparcos \nsatellite. The discussions led directly to the Gaia mission as I report in section 14 of Høg (2024a). \nVladimir N. Yershov has sent the following information about four astrometric instruments \nwhich were in use after 1980, two meridian circles at Pulkovo and two other types of meridian \ninstruments at Kislovodsk, and he sent the detailed illustrated paper Yershov (2025). \n \n2.11 Pulkovo: A Toepfer meridian circle was modernized with a new 200 mm objective and called \nMK-200, see Ershov et al. (1986). “It had a scanning photoelectric focal-plane micrometer as the one \ndeveloped in Brorfelde by Erik Høg. A CCD-based photoelectric circle-reading system was built which \nallowed automatic reading of four microscopes, simultaneously with the run of the scanning focal-\nplane micrometer. All output and input was on punhed tape.” \n \n\n\n10 \n \n \nFigure 4. Sukharev Horizontal Meridian Circle of Pulkovo Observatory: 1- a flat mirror; 2- a graduated circle; \n3 – a gear, 4 – an unloading system. – Photo about 1985 by the official Pulkovo photographer A.F. Sukhonos. \n \n \nFigure 5. Flat-roof housing of the Sukharev Horizontal Meridian Circle. – Photo about 1985 by the official \nPulkovo photographer A.F. Sukhonos. \nAlso at Pulkovo, a horizontal mirror meridian circle of special design by L.A. Sukharev was \ndeveloped in the 1950s and after, see figures 4 and 5. In the 1980s, after development and study of \nan electronic control system, regular observations of bright and faint stars at both coordinates were \ncarried out at the Sukharev Horizontal Meridian Circle in automatic mode, see Kirian et al. (1983). \nThe researchers obtained a catalogue of positions of the faint part of the FK5, as well as a \ndifferential catalogue of positions of reference stars located around radio sources. \n \n\n\n11 \n \n \nFigure 6. Classical Ertel-Struve vertical circle (in front) and transit instrument (behind) at the Meridian Hall of \nPulkovo Observatory (converted to an astrometry museum). – Photo from 2024 by Vladimir N. Yershov. \n \nAt the Kislovodsk Mountain Station of Pulkovo Observatory there were no meridian circles. \nInstead, two classical instruments, a vertical circle and a transit instrument (see figure 6) designed \nin XIX century by Struve and built by Ertel in Germany were installed in 1984 in two rhomb-shaped \ndomes designed previously by Yu.S. Streletsky for a Large Transit Instrument installed at the Cerro-\nCalan National Astronomical Observatory (Santiago, Chile) in the 1960s-1970s. These two \ninstruments were used for determining Right Ascensions and Declinations of Solar System bodies.  \nThe observations lasted from 1984 to 1989, and we have obtained 566 declinations of the Sun, 230 \nof Mercury, 413 of Venus, and 207 of Mars. Observations were visual, and the reductions were \ndifferential in the FK5 system.   \nFurther observations from Kislovodsk were published by Devyatkin et al. (2009). From the \nabstract: A series of daytime observations [1983 to 1999] of the Sun and major planets are obtained \nat the mountain astronomical station of the Pulkovo Observatory using the Ertel-Struve meridian \ninstruments. A series of declinations of Solar System bodies and major planets includes 4057 \npositions and that of right ascensions of Solar System bodies comprising 2057 positions. Based on \nthe joint processing of observations of the Sun, Mercury, Venus, and Mars obtained with the Ertel-\nStruve vertical circle and large transit instrument. \n \n2.12 Tokyo:  The Tokyo Photoelectric Meridian Circle was a fully automated photoelectric meridian \ncircle at the Mitaka campus of the National Astronomical Observatory of Japan  in Tokyo, Japan. It \nwas manufactured by Carl Zeiss Oberkochen, Germany and installed in Mitaka in 1982, see \nWikidedia (2024).  \nObservations were published by Yoshizawa et al. (1993a, 1993b) about 3466 stars observed in \n1989, and faint stars observed with CCD.  \n\n\n12 \n \nIn Yoshizawa et al. (1994) the results are presented from ten years of work, and the development \nof a new CCD micrometer and future observational plans are discussed. During the years 1985-93 a \ntotal of 199,275 observations of 35,300 stars were obtained with the scanning slit micrometer, \nfurthermore 3684 observations of solar system objects, including the Sun. \nYoshizawa (1995) gives positions of Pluto observed in 1994. \n \nThis message was received from Japan in December 2024:  \nDear Erik Høg-san  \nHello. \n      I am very happy to hear that you are doing well. \nTokyo PMC is not currently in use, and observations ended in 2000. It is now open to \nthe public and is playing an active role in outreach. \n By the way, after Professor Masanori Miyamoto, who made an effort to build Tokyo \nPMC, retired at the end of fiscal year 1996, Yoshizawa-san was in charge of Tokyo PMC.  I \ntook up my post at the National Astronomical Observatory in fiscal year 1999 as \nMiyamoto-san's successor professor. However, I was not involved in Tokyo PMC, but \ninstead started and focused on the study of a Japanese astrometry satellite mission. That \nis what led to the current JASMINE mission. JASMINE is moving towards realization. The \nJapanese government plans to launch JASMINE in fiscal year 2031. I appreciate your \ncontinued support. \n      I hope you have a happy new year. \nNaoteru Gouda \n \n2.13 Bordeaux and Valinhos: The meridian circles are described by Viateau (1999). \n“A first CCD 512 × 512 camera working in scan mode (declination field 14′) was mounted in 1994 \non the Bordeaux CCD meridian circle. After a testing period, this camera was installed on the \nValinhos CCD meridian circle (near Sao Paulo, Brazil) as part of a collaboration between Bordeaux \nObservatory and the Instituto Astronomico e Geofisico of Sao Paulo. A second improved CCD \n1024 × 1024 camera, with a declination field of 28′, was installed on the Bordeaux instrument in \nJune 1996. The mean internal precision of a single observation is about 0.04′′ in both coordinates \nfor 9 ≤ V ≤ 14.”  \nDaniel Egret has informed me: I am sorry, but I have been unsuccessful, so far, in my attempts \nto get a full update about the status of the instrument. \nA key point is the fact that the astronomy teams in Bordeaux have now left the historical site of \nthe observatory. In 2017, the laboratory of astrophysics moved [to the University city site] and left \nthe observatory site in Floirac. At that time, an association (Sirius) was created to counter the \nattempt by the university to sell the site. The sale project has since been abandoned but the site is \nalmost abandoned: the instruments are starting to take on water... \nTwo of the last papers I have seen, beyond the observations of pre-main sequence stars together \nwith the mexican colleagues are Ducourant et al. (2006) with proper motions of 2.6 million stars and \nArlot et al. (2008) with observations of planets and satellites. \n\n\n13 \n \nThe meridian instrument of the Bordeaux observatory continued to produce observations until \n2014.  \n \n2.14 Valinhos: This instrument is mentioned above, but we have no information about observations. \n \n2.15 Cerro Calán: The Repsold meridian circle at Cerro Calán near Santiago de Chile was used for \nobservations of major and minor planets in 1983 as reported by Carrasco & Loyola (1984). Carrasco \net al. (1987) report about modernization of the instrument. \n  \n2 Conclusion, a brief status of astrometry \nA few of the stunning results from the Gaia mission should be mentioned. The accuracy of positions \nfor 1.8 billion stars is better than 0.001 arcsec based on the first 34 months of Gaia observations \nand published in 2022, see figure 3 in Høg (2024c). This is 100 times smaller errors than for the 1500 \nFK4 stars, the most accurate catalogue until the Hipparcos results appeared in 1997. Orbits for \n155,000 minor solar system bodies have been reconstructed.  \nGaia observations ended on 15 January 2025 after more than 10 years. \nThe large drift-scans with meridian circles on La Palma and San Juan resulted in positions and \nmagnitudes for over 130 million stars. For solar system objects, 130,000 positions were obtained \nfrom La Palma, San Juan, and Flagstaff with accuracy about 0.1 arcsec. From Flagstaff is reported in \n2003 that the astrometric data “have contributed very significantly to recent successful spacecraft \nmissions and to a dramatic improvement in the predictions made for occultation events.” \nMeridian observations have been used in connection with Gaia. Results from the drift-scans \nwere used to check for discontinuities in the Gaia photometry of the first Gaia catalogue in 2016, \nbut not later, and the results were not used in connection with Gaia astrometry. Thuillot et al. (2015) \nwrite: “Astrometric observations performed by the Gaia Follow-Up Network for Solar System \nObjects (Gaia-FUN-SSO) play a key role in ensuring that moving objects first detected by ESA's Gaia \nmission remain recoverable after their discovery.” \nI guess many people who had been working a long time to improve and use ground-based \ninstruments may have had mixed feelings about Gaia. But I much hope and believe they will feel \nsatisfied that they have dedicated their efforts the best way they could to a good scientific purpose: \nastrometry, and I hope they are pleased to see the immense progress obtained by space astrometry. \nGround-based astrometry paved the way to this progress and took an active part to make it happen. \n \n3 \nAcknowledgements: I am grateful for the information and comments from Daniel Egret, \nDafydd Wyn Evans, Claus Fabricius, Naoteru Gouda, Leif Helmer, Liliya Kazanzeva, Lennart \nLindegren, Valeri V. Makarov, Oleg Malkov, Valerian N. Sementsov, Catherine Turon, Miguel \nVallejo Carrion, Yaroslav S. Yatskiv, Vladimir N. Yershov. \n \n4 \nReferences \nAPM-4 undated, meridian circle with photographic registration. \nhttps://www.astronet.ru/db/msg/1176727/mer_krug.jpg.html \n\n\n14 \n \nArlot, J.E., Dourneau, G., and Le Campion, J.F. 2008, An analysis of Bordeaux meridian transit circle \nobservations of planets and satellites (1997–2007). A&A 484, 869-877. \nhttps://www.aanda.org/articles/aa/abs/2008/24/aa9166-07/aa9166-07.html \nCarrasco, G., & Loyola, P. 1984, Observaciones de planetas y pequeños planetas realizadas en 1983, en el \ncírculo meridiano Repsold de Cerro Calán.  \nBoletín de la Asociación Argentina de Astronomía, Vol. 30, p. 225-230. \nhttps://ui.adsabs.harvard.edu/abs/1984BAAA...30..225C/abstract \nCarrasco, G., Loyola, P., Hadad, N. 1987, Automatización de las observaciones en ascensión recta, en el \nCírculo Meridiano Repsold de Cerro Calán.  Boletín de la Asociación Argentina de Astronomía, Vol. \n32, p. 289-294. https://ui.adsabs.harvard.edu/abs/1987BAAA...32..289C/abstract \nDesmars, J., Vienne, A., and Arlot, J.-L. 2009, A new catalogue of observations of the eight major satellites \nof Saturn (1874–2007).  A&A493,1183–1195. \nhttps://www.aanda.org/articles/aa/pdf/2009/03/aa10203-08.pdf \nDevyatkin, A.V., Gnevysheva, K.G., Baturina, G.D. 2009, Results of astrometrical observations of the Sun and \nmajor planets at the mountain astronomical station of the Pulkovo Observatory.  Sol Syst Res 43, \n533–542 (2009). https://doi.org/10.1134/S0038094609060082  \nDucourant, C., Le Campion, J.F., Rapaport, M., et al. 2006, The PM2000 Bordeaux proper motion catalogue. \nA&A 448, 1235-1245. A proper motion catalogue of 2 670 974 stars, covering the declination zone \n+11 to +18 deg. https://www.aanda.org/articles/aa/full/2006/12/aa3220-05/aa3220-05.html \nErshov, V. N., Pliss, V. E., Streletsky, Y. S. 1986, The Photoelectric Meridian Circle of the Pulkovo. \nProceedings of IAU Symposium No. 109 held 9-12 January 1984 in Gainesville, FL. Edited by H.K. \nEichhorn and R.J. Leacock. Dordrecht: D. Reidel Publishing Co., p. 407. \nhttps://ui.adsabs.harvard.edu/abs/1986IAUS..109..407E/abstract  \nEvans, D.W. 2014, The Carlsberg Meridian Telescope. https://research.ast.cam.ac.uk/cmt/camc.html \nGolovko, B. A., Gulyaev, A. P., Tauber, V. G., Shamaev, V. G. 1984, Results of the First Observations with a \nMeridian Circle in Mountain Conditions – Part two – Processing of right ascensions. Astronomicheskii \nTsirkulyar No.1304/JAN05, 1984, p.1. https://ui.adsabs.harvard.edu/abs/1984ATsir1304....1G   No \nabstract is given. \nHøg, E. 1993, Astrometry and Photometry of 400 million Stars Brighter than 18 mag. International \nAstronomical Union. Symposium no. 156; Kluwer Academic Publishers; Dordrecht, 37:9. \nhttps://articles.adsabs.harvard.edu/pdf/1993IAUS..156...37H  \nHøg E. 2014, Interferometry from Space: A Great Dream. In: Asian Journal of Physics Vol. 23, Nos 1 & 2 \n(2014), Special Issue on History of Physics & Astronomy, Guest Editor:  Virginia \nTrimble. http://arxiv.org/abs/1408.4668 \nHøg, E. 2024a, A review of 70 years with astrometry. Invited review for Astrophysics and Space Science \n369:23. https://rdcu.be/dzp2o  \nHøg, E. 2024b, Astrometriens udvikling og Brorfelde Observatorium. 8pp. KVANT, Tidsskrift for Fysik og \nAstronomi, bind 35, december 2024. https://zenodo.org/records/14252551 \nHøg, E. 2024c, Astrometric Accuracy of Positions. 8pp. https://arxiv.org/abs/2405.02017 \nJohnston, K. J., Seidelmann, P. K., Reasenberg, R. D., Babcock, R., Phillips, J. D. 1995, Newcomb Astrometric \nSatellite. International Astronomical Union Symposium no. 166, Kluwer Academic, Publishers, \nDordrecht, p.331. https://ui.adsabs.harvard.edu/abs/1995IAUS..166..331J/abstract \nKarbovsky, V.L., Lazorenko, P.F., Andruk. V.N., et al. 2011, Kyiv meridian axial circle with a new CCD camera. \nKinematics and Physics of Celestial Bodies, Volume 27, Issue 4, pp. 204-210. \nhttps://ui.adsabs.harvard.edu/abs/2011KPCB...27..204K/abstract \nKarbovsky, V.L., Lazorenko, P.F., et al. 2017, The programs of observations on MAC in 2001-2015 and their \nresults.  Bulletin of Taras Shevchenko National University of Kyiv, no. 55, p. 17-19. \nhttps://ui.adsabs.harvard.edu/abs/2017BTSNU..55...17K/abstract       \n\n\n15 \n \nKirian, T. R., Pinigin, G. I. 1983, First results of observations of star declinations on the Pulkovo horizontal \nmeridian circle. Astronomicheskii Zhurnal, vol. 60, July-Aug. 1983, p. 775-780 Soviet Astronomy, vol. \n27, July-Aug. 1983, p. 448-451. https://ui.adsabs.harvard.edu/abs/1983AZh....60..775K/abstract  \nKovalchuk, A., et al. 1997, The New International Celestial Reference Frame, 23rd meeting of the IAU, Joint \nDiscussion 7, 22 August 1997, Kyoto, Japan, meeting abstract id.16. \nhttps://ui.adsabs.harvard.edu/abs/1997IAUJD...7E..16K/abstract \nKovalchuk, A., et al. 2000, ISBN 2-901057-42-X, 2000, p. 146, no abstract. \nhttps://ui.adsabs.harvard.edu/abs/2000jsrs.meet..146K/abstract \nLazorenko, P.F., Babenko, Yu., Karbovsky, V.L., et al. 2018, The Kyiv Meridian Axial Circle Catalogue of stars \nin fields with extragalactic radio sources. Astronomy & Astrophysics manuscript no. 2573, 13 pp. \nhttps://arxiv.org/pdf/astro-ph/0512533 \nMaigurova, N. V., Martynov, M. V., Pinigin, G. I. 2013, Star catalogue in the fields of axial meridian circle of \nthe Nikolaev observatory. Kinematics and Physics of Celestial Bodies, Volume 29, Issue 1, pp. 44-51. \nhttps://ui.adsabs.harvard.edu/abs/2013KPCB...29...44M/abstract \nMaigurova, N. V., Martynov, M. V., Kryuchkoskiy, V. F. 2016, Results of astrometric observations of stars \nwith large proper motions using telescopes of the Research Institute of Nikolaev Astronomical \nObservatory. Kinematics and Physics of Celestial Bodies, Volume 32, Issue 6, pp. 307-312. \nhttps://ui.adsabs.harvard.edu/abs/2016KPCB...32..307M/abstract \nMartynov, M. V., Maigurova, N. V., Pinigin, G. I. 2013, Astrometric binaries with invisible components in \nfields of the axial meridian circle of the Nikolaev Observatory. Kinematics and Physics of Celestial \nBodies, Volume 29, Issue 5, pp. 254-256. \nhttps://ui.adsabs.harvard.edu/abs/2013KPCB...29..254M/abstract \nMuiños, J.L., et al. 1999, THE SAN FERNANDO AUTOMATIC MERIDIAN CIRCLE IN SAN JUAN. \nhttps://people.ast.cam.ac.uk/~dwe/AstSurv/pepe.html \nMuiños, J.L., Evans, D.W. 2014, The CMC15, the last issue of the series “Carlsberg Meridian Catalogue, La \nPalma''. Astronomische Nachrichten, Vol.335, Issue 4, p.367:4 (2014). \nhttps://ui.adsabs.harvard.edu/abs/2014AN....335..367M/abstract \nPinigin, G. I., Kovalchuk, A. N., Protsyuk, Y. I., Shulga, A. N. 2001, Automatic Axial Meridian Circle of Nicolaev \nAstronomical Observatory. Astronomische Gesellschaft Abstract Series, Vol. 18, abstract #P231. \nhttps://ui.adsabs.harvard.edu/abs/2001AGM....18.P231P/abstract  \nSchmidt, Richard E. and Dick, Steven J. 2023, « Meridian Circle Astrometry at the U. S. Naval \nObservatory », Cahiers François Viète [En ligne], III-14 | 2023, mis en ligne le 01 juin 2023, consulté \nle 16 février 2025. URL : http://journals.openedition.org/cahierscfv/4086 ; DOI : \nhttps://doi.org/10.4000/cahierscfv.4086 \nStone, R.C., Monet, D.G., Monet, A.K.B., et al. 2003, Upgrades to the Flagstaff Astrometric Scanning Transit \nTelescope: A Fully Automated Telescope for Astrometry. AJ 126 2060. \nhttps://iopscience.iop.org/article/10.1086/377622 \nTauber, V.G. 1986, The Catalogue of the Declinations of the DS and Hls Programme 513 Stars. Trudy \nGosudarstvennogo Astronomicheskogo Instituta P.K. Sternberga, Vol. 58, P. 146. \nhttps://ui.adsabs.harvard.edu/abs/1986TrSht..58..146T \nThuillot, W., Bancelin, D., Ivantsov, A., et al. 2015, The astrometric Gaia-FUN-SSO observation campaign of \n99942 Apophis. Astronomy & Astrophysics, Volume 583, id.A59, 12 pp. \nhttps://ui.adsabs.harvard.edu/abs/2015A%26A...583A..59T/abstract \nViateau, B., Requieme, Y., Le Campion, J.F., et al. 1999, The Bordeaux and Valinhos CCD meridian circles. \nAstronomy and Astrophysics Supplement Series 134(1). DOI: 10.1051/aas:1999131. \nhttps://www.researchgate.net/publication/44844082_The_Bordeaux_and_Valinhos_CCD_meridian_\ncircles \nWikipedia 2024, Tokyo Photoelectric Meridian Circle. \nhttps://en.wikipedia.org/wiki/Tokyo_Photoelectric_Meridian_Circle \nWikipedia 2025, Meridian circle. https://en.wikipedia.org/wiki/Meridian_circle \n\n\n16 \n \nYershov, V.N. 2025, The Last Meridian Circles of Pulkovo Observatory. https://arxiv.org/abs/2502.03583 \nYoshizawa, M., Suzuki, S. 1993, The Tokyo PMC catalog 89: catalog of positions of 3466 stars observed in \n1989 with Tokyo Photoelectric Meridian Circle. Publications of the National Astronomical \nObservatory of Japan, Vol. 3, p. 45-91 (1993). \nhttps://ui.adsabs.harvard.edu/abs/1993PNAOJ...3...45Y/abstract \nYoshizawa, M., Suzuki, S., Kuwabara, T., Ishizaki, H. 1993, Observations of Faint Stars Deep to 16TH \nMagnitude with CCD Meridian Circle. International Astronomical Union. Symposium no. 156; Kluwer \nAcademic Publishers; Dordrecht, p.71. \nhttps://ui.adsabs.harvard.edu/abs/1993IAUS..156...71Y/abstract \nYoshizawa, M., Miyamoto, M., Sôma, M., Kuwabara, T., Suzuki, S. 1994, Ten years of the Tokyo \nPhotoelectric Meridian Circle (Tokyo PMC): an activity report for the years from 1982 to 1993. \nhttps://ui.adsabs.harvard.edu/abs/1994PNAOJ...3..289Y/abstract \nYoshizawa, M., Soma, M., Suzuki, S. 1995, Positions of Pluto in 1994 Observed with the Tokyo CCD Meridian \nCircle. Astronomical Journal v.110, p.3050. \nhttps://ui.adsabs.harvard.edu/abs/1995AJ....110.3050Y/abstract \n \n\n\n",
  "metadata": {
    "source_file": "dataset/pdfs/arxiv_2502.21005v1.pdf",
    "total_pages": 16,
    "title": "The Last Meridian Circles",
    "authors": [
      "Erik Høg"
    ],
    "abstract": "The aim is to document in some detail the last 35 years of meridian circles,\na type of instrument with a fundamental role in astronomy for a very long time,\nand to do so while witnesses are still alive and can contribute. This is about\nfinding facts. Meridian circles provided fundamental star positions for\ncenturies. These positions were tied to a well-defined celestial coordinate\nsystem of right ascension and declination, and accurate proper motions ensured\na transformation of the positions over long periods of time. This function of\nthe meridian circles has been taken over by space astrometry and VLBI. The\nHipparcos astrometric satellite was approved by ESA in 1980 and launched to a\nsuccessful 3-year mission in 1989, and the successor, Gaia, has in 2025\ncompleted a mission of over 10 years. An account is given of the last 18\nmeridian instruments, which were active for some part of the 35 years until\n2015. This account is based on information found on the internet, and on input\nkindly supplied in correspondence with many colleagues.",
    "published_date": "2025-02-28",
    "source": "arxiv"
  }
}